[
  {
    "hadithGlobalNumber": 3501,
    "id": 3501,
    "url": "https://sunnah.com/bukhari:3501",
    "bookNumber": 61,
    "hadithNumber": 11,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"Authority of ruling will remain with Quraish, even if only two of them remained.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، قَالَ سَمِعْتُ أَبِي، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لا يَزَالُ هَذَا الأَمْرُ فِي قُرَيْشٍ، مَا بَقِيَ مِنْهُمُ اثْنَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3501In-book reference : Book 61, Hadith 11USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 705   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3502,
    "id": 3502,
    "url": "https://sunnah.com/bukhari:3502",
    "bookNumber": 61,
    "hadithNumber": 12,
    "narrator": "Narrated Jubair bin Mut`im:",
    "english": "`Uthman bin `Affan went (to the Prophet) and said, \"O Allah's Messenger (ﷺ)! You gave property to Bani Al-Muttalib and did not give us, although we and they are of the same degree of relationship to you.\" The Prophet (ﷺ) said, \"Only Bani Hashim and Bani Al Muttalib are one thing (as regards family status).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ مَشَيْتُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ،، فَقَالَ يَا رَسُولَ اللَّهِ أَعْطَيْتَ بَنِي الْمُطَّلِبِ وَتَرَكْتَنَا، وَإِنَّمَا نَحْنُ وَهُمْ مِنْكَ بِمَنْزِلَةٍ وَاحِدَةٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ شَىْءٌ وَاحِدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3502In-book reference : Book 61, Hadith 12USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 706   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3503,
    "id": 3503,
    "url": "https://sunnah.com/bukhari:3503",
    "bookNumber": 61,
    "hadithNumber": 13,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "`Abdullah bin Az-Zubair went with some women of the tribe of Bani Zuhra to `Aisha who used to treat them nicely because of their relation to Allah's Messenger (ﷺ).",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي أَبُو الأَسْوَدِ، مُحَمَّدٌ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ ذَهَبَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ مَعَ أُنَاسٍ مِنْ بَنِي زُهْرَةَ إِلَى عَائِشَةَ، وَكَانَتْ أَرَقَّ شَىْءٍ لِقَرَابَتِهِمْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3503In-book reference : Book 61, Hadith 13USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 706   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3504,
    "id": 3504,
    "url": "https://sunnah.com/bukhari:3504",
    "bookNumber": 61,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The tribe of Quraish, the Ansar, the (people of the tribe of) Julhaina, Muzaina, \nAslam, Ashja', and Ghifar are my disciples and have no protectors except Allah and His Apostle.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدٍ، ح قَالَ يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الأَعْرَجُ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُرَيْشٌ وَالأَنْصَارُ وَجُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَأَشْجَعُ وَغِفَارُ مَوَالِيَّ لَيْسَ لَهُمْ مَوْلًى، دُونَ اللَّهِ وَرَسُولِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3504In-book reference : Book 61, Hadith 14USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 707   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3505,
    "id": 3505,
    "url": "https://sunnah.com/bukhari:3505",
    "bookNumber": 61,
    "hadithNumber": 15,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "`Abdullah bin Az-Zubair was the most beloved person to `Aisha excluding the Prophet (ﷺ) and Abu Bakr, \nand he in his turn, was the most devoted to her, `Aisha used not to withhold the money given to her by \nAllah, but she used to spend it in charity. (`Abdullah) bin AzZubair said, \" `Aisha should be stopped \nfrom doing so.\" (When `Aisha heard this), she said protestingly, \"Shall I be stopped from doing so? I \nvow that I will never talk to `Abdullah bin Az-Zubair.\" On that, Ibn Az-Zubair asked some people \nfrom Quraish and particularly the two uncles of Allah's Messenger (ﷺ) to intercede with her, but she refused \n(to talk to him). Az-Zuhriyun, the uncles of the Prophet, including `Abdur-Rahman bin Al-Aswad bin \n`Abd Yaghuth and Al-Miswar bin Makhrama said to him, \"When we ask for the permission to visit \nher, enter her house along with us (without taking her leave).\" He did accordingly (and she accepted \ntheir intercession). He sent her ten slaves whom she manumitted as an expiation for (not keeping) her \nvow. `Aisha manumitted more slaves for the same purpose till she manumitted forty slaves. She said, \n\"I wish I had specified what I would have done in case of not fulfilling my vow when I made the vow, \nso that I might have done it easily.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ أَحَبَّ الْبَشَرِ إِلَى عَائِشَةَ بَعْدَ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ، وَكَانَ أَبَرَّ النَّاسِ بِهَا، وَكَانَتْ لاَ تُمْسِكُ شَيْئًا مِمَّا جَاءَهَا مِنْ رِزْقِ اللَّهِ ‏{‏إِلاَّ‏}‏ تَصَدَّقَتْ‏.‏ فَقَالَ ابْنُ الزُّبَيْرِ يَنْبَغِي أَنْ يُؤْخَذَ عَلَى يَدَيْهَا‏.‏ فَقَالَتْ أَيُؤْخَذُ عَلَى يَدَىَّ عَلَىَّ نَذْرٌ إِنْ كَلَّمْتُهُ‏.‏ فَاسْتَشْفَعَ إِلَيْهَا بِرِجَالٍ مِنْ قُرَيْشٍ، وَبِأَخْوَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً فَامْتَنَعَتْ، فَقَالَ لَهُ الزُّهْرِيُّونَ أَخْوَالُ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ وَالْمِسْوَرُ بْنُ مَخْرَمَةَ إِذَا اسْتَأْذَنَّا فَاقْتَحِمِ الْحِجَابَ‏.‏ فَفَعَلَ، فَأَرْسَلَ إِلَيْهَا بِعَشْرِ رِقَابٍ، فَأَعْتَقَتْهُمْ، ثُمَّ لَمْ تَزَلْ تُعْتِقُهُمْ حَتَّى بَلَغَتْ أَرْبَعِينَ‏.‏ فَقَالَتْ وَدِدْتُ أَنِّي جَعَلْتُ حِينَ حَلَفْتُ عَمَلاً أَعْمَلُهُ فَأَفْرُغَ مِنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3505In-book reference : Book 61, Hadith 15USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 708   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3506,
    "id": 3506,
    "url": "https://sunnah.com/bukhari:3506",
    "bookNumber": 61,
    "hadithNumber": 16,
    "narrator": "Narrated Anas:",
    "english": "`Uthman called Zaid bin Thabit, `Abdullah bin Az-Zubair, Sa`id bin Al-`As and `AbdurRahman bin \nAl-Harith bin Hisham, and then they wrote the manuscripts of the Holy Qur'an in the form of book in \nseveral copies. `Uthman said to the three Quraishi persons. \" If you differ with Zaid bin Thabit on any \npoint of the Qur'an, then write it in the language of Quraish, as the Qur'an was revealed in their \nlanguage.\" So they acted accordingly. (Sa`id bin Thabit was an Ansari and not from Quraish ).",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ، أَنَّ عُثْمَانَ، دَعَا زَيْدَ بْنَ ثَابِتٍ وَعَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَسَعِيدَ بْنَ الْعَاصِ وَعَبْدَ الرَّحْمَنِ بْنَ الْحَارِثِ بْنِ هِشَامٍ فَنَسَخُوهَا فِي الْمَصَاحِفِ، وَقَالَ عُثْمَانُ لِلرَّهْطِ الْقُرَشِيِّينَ الثَّلاَثَةِ إِذَا اخْتَلَفْتُمْ أَنْتُمْ وَزَيْدُ بْنُ ثَابِتٍ فِي شَىْءٍ مِنَ الْقُرْآنِ، فَاكْتُبُوهُ بِلِسَانِ قُرَيْشٍ، فَإِنَّمَا نَزَلَ بِلِسَانِهِمْ‏.‏ فَفَعَلُوا ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3506In-book reference : Book 61, Hadith 16USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 709   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3507,
    "id": 3507,
    "url": "https://sunnah.com/bukhari:3507",
    "bookNumber": 61,
    "hadithNumber": 17,
    "narrator": "Narrated Salama:",
    "english": "Allah's Messenger (ﷺ) passed by some people from the tribe of Aslam practicing archery. He said, \"O \nchildren of Ishmael! Throw (arrows), for your father was an archer. I am on the side of Bani so-andso,\" \nmeaning one of the two teams. The other team stopped throwing, whereupon the Prophet (ﷺ) said, \n\"What has happened to them?\" They replied, \"How shall we throw while you are with Bani so-andso?\" \nHe said, \"Throw for I am with all of you.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، حَدَّثَنَا سَلَمَةُ ـ رضى الله عنه ـ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى قَوْمٍ مِنْ أَسْلَمَ، يَتَنَاضَلُونَ بِالسُّوقِ، فَقَالَ ‏\"‏ ارْمُوا بَنِي إِسْمَاعِيلَ، فَإِنَّ أَبَاكُمْ كَانَ رَامِيًا، وَأَنَا مَعَ بَنِي فُلاَنٍ ‏\"‏‏.‏ لأَحَدِ الْفَرِيقَيْنِ، فَأَمْسَكُوا بِأَيْدِيهِمْ فَقَالَ ‏\"‏ مَا لَهُمْ ‏\"‏‏.‏ قَالُوا وَكَيْفَ نَرْمِي وَأَنْتَ مَعَ بَنِي فُلاَنٍ‏.‏ قَالَ ‏\"‏ ارْمُوا وَأَنَا مَعَكُمْ كُلِّكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3507In-book reference : Book 61, Hadith 17USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 710   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3508,
    "id": 3508,
    "url": "https://sunnah.com/bukhari:3508",
    "bookNumber": 61,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Dhar:",
    "english": "The Prophet (ﷺ) said, \"If somebody claims to be the son of any other than his real father knowingly, he \nbut disbelieves in Allah, and if somebody claims to belong to some folk to whom he does not belong, \nlet such a person take his place in the (Hell) Fire.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، قَالَ حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ، أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَيْسَ مِنْ رَجُلٍ ادَّعَى لِغَيْرِ أَبِيهِ وَهْوَ يَعْلَمُهُ إِلاَّ كَفَرَ، وَمَنِ ادَّعَى قَوْمًا لَيْسَ لَهُ فِيهِمْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3508In-book reference : Book 61, Hadith 18USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 711   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3509,
    "id": 3509,
    "url": "https://sunnah.com/bukhari:3509",
    "bookNumber": 61,
    "hadithNumber": 19,
    "narrator": "Narrated Wathila bin Al-Asqa:",
    "english": "Allah's Messenger (ﷺ) said, \"Verily, one of the worst lies is to claim falsely to be the son of someone other \nthan one's real father, or to claim to have had a dream one has not had, or to attribute to me what I \nhave not said.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا حَرِيزٌ، قَالَ حَدَّثَنِي عَبْدُ الْوَاحِدِ بْنُ عَبْدِ اللَّهِ النَّصْرِيُّ، قَالَ سَمِعْتُ وَاثِلَةَ بْنَ الأَسْقَعِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَعْظَمِ الْفِرَى أَنْ يَدَّعِيَ الرَّجُلُ إِلَى غَيْرِ أَبِيهِ، أَوْ يُرِيَ عَيْنَهُ مَا لَمْ تَرَ، أَوْ يَقُولُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مَا لَمْ يَقُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3509In-book reference : Book 61, Hadith 19USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 712   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3510,
    "id": 3510,
    "url": "https://sunnah.com/bukhari:3510",
    "bookNumber": 61,
    "hadithNumber": 20,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The delegates of `Abd-ul-Qais came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are from the \ntribe of Rabi`a and the infidels of Mudar tribe stand between us and you, so that we cannot come to \nyou except in the Sacred Months. Therefore we would like you to give us some instructions which we \nmay follow and convey to our people staying behind us.\" The Prophet (ﷺ) said, \"I order you to observe \nfour things and forbid you (to do) four things: (I order you) to believe in Allah testifying that None \nhas the right to be worshipped except Allah; to offer the prayer perfectly; to pay the Zakat; and to give \none-fifth of the war booty to Allah. And I forbid you to use Ad-Dubba, Al-Hantam, An-Naqir and Al- \nMuzaffat.\" (These are names of utensils in which alcoholic drinks were served.)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا مِنْ هَذَا الْحَىِّ مِنْ رَبِيعَةَ قَدْ حَالَتْ بَيْنَنَا وَبَيْنَكَ كُفَّارُ مُضَرَ، فَلَسْنَا نَخْلُصُ إِلَيْكَ إِلاَّ فِي كُلِّ شَهْرٍ حَرَامٍ، فَلَوْ أَمَرْتَنَا بِأَمْرٍ، نَأْخُذُهُ عَنْكَ، وَنُبَلِّغُهُ مَنْ وَرَاءَنَا‏.‏ قَالَ ‏\n\"‏ آمُرُكُمْ بِأَرْبَعٍ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ، الإِيمَانِ بِاللَّهِ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاَةِ وَإِيتَاءِ الزَّكَاةِ، وَأَنْ تُؤَدُّوا إِلَى اللَّهِ خُمْسَ مَا غَنِمْتُمْ، وَأَنْهَاكُمْ عَنِ الدُّبَّاءِ، وَالْحَنْتَمِ، وَالنَّقِيرِ، وَالْمُزَفَّتِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3510In-book reference : Book 61, Hadith 20USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 713   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3511,
    "id": 3511,
    "url": "https://sunnah.com/bukhari:3511",
    "bookNumber": 61,
    "hadithNumber": 21,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) on the pulpit saying, \"Verily, afflictions (will start) from here,\" pointing \ntowards the east, \"whence the side of the head of Satan comes out.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهْوَ عَلَى الْمِنْبَرِ ‏\n\"‏ أَلاَ إِنَّ الْفِتْنَةَ هَا هُنَا ـ يُشِيرُ إِلَى الْمَشْرِقِ ـ مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3511In-book reference : Book 61, Hadith 21USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 714   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3512,
    "id": 3512,
    "url": "https://sunnah.com/bukhari:3512",
    "bookNumber": 61,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The tribes of Quraish, Al-Ansar, Juhaina, Muzaina, Aslam, Ghifar and Ashja' are \nmy helpers, and they have no protector (i.e. Master) except Allah and His Apostle.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ قُرَيْشٌ وَالأَنْصَارُ وَجُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَغِفَارُ وَأَشْجَعُ مَوَالِيَّ، لَيْسَ لَهُمْ مَوْلًى دُونَ اللَّهِ وَرَسُولِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3512In-book reference : Book 61, Hadith 22USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 715   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3513,
    "id": 3513,
    "url": "https://sunnah.com/bukhari:3513",
    "bookNumber": 61,
    "hadithNumber": 23,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "While Allah's Messenger (ﷺ) was on the pulpit, he said, \"May Allah forgive the tribe of Ghifar! And may Allah \nsave the tribe of Aslam! The tribe of `Usaiya have disobeyed Allah and His Apostle.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ صَالِحٍ، حَدَّثَنَا نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ عَلَى الْمِنْبَرِ ‏\n\"‏ غِفَارُ غَفَرَ اللَّهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللَّهُ، وَعُصَيَّةُ عَصَتِ اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3513In-book reference : Book 61, Hadith 23USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 716   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3514,
    "id": 3514,
    "url": "https://sunnah.com/bukhari:3514",
    "bookNumber": 61,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"May Allah save the tribe of Aslam, and may Allah forgive the tribe of Ghifar!\"",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَسْلَمُ سَالَمَهَا اللَّهُ، وَغِفَارُ غَفَرَ اللَّهُ لَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3514In-book reference : Book 61, Hadith 24USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 717   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3515,
    "id": 3515,
    "url": "https://sunnah.com/bukhari:3515",
    "bookNumber": 61,
    "hadithNumber": 25,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) said, \"Do you think that the tribes of Juhaina, Muzaina, Aslam and Ghifar are better than \nthe tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa?\" A man \nsaid, \"They were unsuccessful and losers.\" The Prophet (ﷺ) added, \"(Yes), they are better than the tribes \nof Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ،‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَغِفَارُ خَيْرًا مِنْ بَنِي تَمِيمٍ وَبَنِي أَسَدٍ، وَمِنْ بَنِي عَبْدِ اللَّهِ بْنِ غَطَفَانَ وَمِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ ‏\"‏‏.‏ فَقَالَ رَجُلٌ خَابُوا وَخَسِرُوا‏.‏ فَقَالَ ‏\"‏ هُمْ خَيْرٌ مِنْ بَنِي تَمِيمٍ وَمِنْ بَنِي أَسَدٍ، وَمِنْ بَنِي عَبْدِ اللَّهِ بْنِ غَطَفَانَ، وَمِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3515In-book reference : Book 61, Hadith 25USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 718   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3516,
    "id": 3516,
    "url": "https://sunnah.com/bukhari:3516",
    "bookNumber": 61,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Bakra:",
    "english": "Al-Aqra' bin Habis said to the Prophet (ﷺ) \"Nobody gave you the pledge of allegiance but the robbers of \nthe pilgrims (i.e. those who used to rob the pilgrims) from the tribes of Aslam, Ghifar, Muzaina.\" (Ibn \nAbi Ya'qub is in doubt whether Al-Aqra' added. 'And Juhaina.') The Prophet (ﷺ) said, \"Don't you think \nthat the tribes of Aslam, Ghifar, Muzaina (and also perhaps) Juhaina are better than the tribes of Bani \nTamim, Bani Amir, Asad, and Ghatafan?\" Somebody said, \"They were unsuccessful and losers!\" The \nProphet said, \"Yes, by Him in Whose Hands my life is, they (i.e. the former) are better than they (i.e. \nthe latter).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ الأَقْرَعَ بْنَ حَابِسٍ، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّمَا بَايَعَكَ سُرَّاقُ الْحَجِيجِ مِنْ أَسْلَمَ وَغِفَارَ وَمُزَيْنَةَ ـ وَأَحْسِبُهُ وَجُهَيْنَةَ ابْنُ أَبِي يَعْقُوبَ شَكَّ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِنْ كَانَ أَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ ـ وَأَحْسِبُهُ ـ وَجُهَيْنَةُ خَيْرًا مِنْ بَنِي تَمِيمٍ وَبَنِي عَامِرٍ وَأَسَدٍ وَغَطَفَانَ، خَابُوا وَخَسِرُوا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ، إِنَّهُمْ لَخَيْرٌ مِنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3516In-book reference : Book 61, Hadith 26USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 719   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3517,
    "id": 3517,
    "url": "https://sunnah.com/bukhari:3517",
    "bookNumber": 61,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Hurairah (ra):",
    "english": "The Prophet (ﷺ) said, \"The hour will not be established unless a man from the tribe of Qahtan appears, driving the people with his stick (ruling them with violence and oppression).\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بِعَصَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3517In-book reference : Book 61, Hadith 27USC-MSA web (English) reference : Vol. 1, Book 56, Hadith 719   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3518,
    "id": 3518,
    "url": "https://sunnah.com/bukhari:3518",
    "bookNumber": 61,
    "hadithNumber": 28,
    "narrator": "Narrated Jabir:",
    "english": "We were in the company of the Prophet (ﷺ) in a Ghazwa. A large number of emigrants joined him and \namong the emigrants there was a person who used to play jokes (or play with spears); so he (jokingly) \nstroked an Ansari man on the hip. The Ans-ari got so angry that both of them called their people. The \nAnsari said, \"Help, O Ansar!\" And the emigrant said \"Help, O emigrants!\" The Prophet (ﷺ) came out and \nsaid, \"What is wrong with the people (as they are calling) this call of the period of Ignorance? \"Then \nhe said, \"What is the matter with them?\" So he was told about the stroke of the emigrant to the Ansari. \nThe Prophet (ﷺ) said, \"Stop this (i.e. appeal for help) for it is an evil call. \"Abdullah bin Ubai bin Salul (a \nhypocrite) said, \"The emigrants have called and (gathered against us); so when we return to Medina, \nsurely, the more honorable people will expel therefrom the meaner,\" Upon that `Umar said, \"O Allah's \nProphet! Shall we not kill this evil person (i.e. `Abdullah bin Ubai bin Salul) ?\" The Prophet) said, \n\"(No), lest the people should say that Muhammad used to kill his companions.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرًا ـ رضى الله عنه ـ يَقُولُ غَزَوْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَقَدْ ثَابَ مَعَهُ نَاسٌ مِنَ الْمُهَاجِرِينَ حَتَّى كَثُرُوا، وَكَانَ مِنَ الْمُهَاجِرِينَ رَجُلٌ لَعَّابٌ فَكَسَعَ أَنْصَارِيًّا، فَغَضِبَ الأَنْصَارِيُّ غَضَبًا شَدِيدًا، حَتَّى تَدَاعَوْا، وَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ دَعْوَى أَهْلِ الْجَاهِلِيَّةِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ مَا شَأْنُهُمْ ‏\"‏‏.‏ فَأُخْبِرَ بِكَسْعَةِ الْمُهَاجِرِيِّ الأَنْصَارِيَّ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعُوهَا فَإِنَّهَا خَبِيثَةٌ ‏\"‏‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ أَقَدْ تَدَاعَوْا عَلَيْنَا، لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَقَالَ عُمَرُ أَلاَ نَقْتُلُ يَا رَسُولَ اللَّهِ هَذَا الْخَبِيثَ لِعَبْدِ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَتَحَدَّثُ النَّاسُ أَنَّهُ كَانَ يَقْتُلُ أَصْحَابَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3518In-book reference : Book 61, Hadith 28USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 720   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3519,
    "id": 3519,
    "url": "https://sunnah.com/bukhari:3519",
    "bookNumber": 61,
    "hadithNumber": 29,
    "narrator": "Narrated `Abdullah (bin Mas`ud):",
    "english": "The Prophet (ﷺ) said, \"Who-ever slaps his face or tears the bosom of his dress, or calls the calls of the \nPeriod of Ignorance, is not from us.\"",
    "arabic": "حَدَّثَنِي ثَابِتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَعَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3519In-book reference : Book 61, Hadith 29USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 721   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3520,
    "id": 3520,
    "url": "https://sunnah.com/bukhari:3520",
    "bookNumber": 61,
    "hadithNumber": 30,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"`Amr bin Luhai bin Qam'a bin Khindif was the father of Khuza`a.'",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عَمْرُو بْنُ لُحَىِّ بْنِ قَمَعَةَ بْنِ خِنْدِفَ أَبُو خُزَاعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3520In-book reference : Book 61, Hadith 30USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 722   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3521,
    "id": 3521,
    "url": "https://sunnah.com/bukhari:3521",
    "bookNumber": 61,
    "hadithNumber": 31,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "Al-Bahira was an animal whose milk was spared for the idols and other dieties, and so nobody was \nallowed to milk it. As-Saiba was an animal which they (i.e infidels) used to set free in the names of \ntheir gods so that it would not be used for carrying anything. Abu Huraira said, \"The Prophet (ﷺ) said, 'I \nsaw `Amr bin 'Amir bin Luhai Al-Khuza`i dragging his intestines in the (Hell) Fire, for he was the \nfirst man who started the custom of releasing animals (for the sake of false gods).' \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ الْبَحِيرَةُ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ وَلاَ يَحْلُبُهَا أَحَدٌ مِنَ النَّاسِ، وَالسَّائِبَةُ الَّتِي كَانُوا يُسَيِّبُونَهَا لآلِهَتِهِمْ فَلاَ يُحْمَلُ عَلَيْهَا شَىْءٌ‏.‏ قَالَ وَقَالَ أَبُو هُرَيْرَةَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ عَمْرَو بْنَ عَامِرِ بْنِ لُحَىٍّ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ، وَكَانَ أَوَّلَ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3521In-book reference : Book 61, Hadith 31USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 723   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3522,
    "id": 3522,
    "url": "https://sunnah.com/bukhari:3522",
    "bookNumber": 61,
    "hadithNumber": 32,
    "narrator": "Narrated Abu Jamra:",
    "english": "Ibn `Abbas said to us, \"Shall I tell you the story of Abu Dhar's conversion to Islam?\" We said, \"Yes.\" \nHe said, \"Abu Dhar said: I was a man from the tribe of Ghifar. We heard that a man had appeared in \nMecca, claiming to be a Prophet. ! said to my brother, 'Go to that man and talk to him and bring me \nhis news.' He set out, met him and returned. I asked him, 'What is the news with you?' He said, 'By \nAllah, I saw a man enjoining what is good and forbidding what is evil.' I said to him, 'You have not \nsatisfied me with this little information.' So, I took a waterskin and a stick and proceeded towards \nMecca. Neither did I know him (i.e. the Prophet (ﷺ) ), nor did I like to ask anyone about him. \nI Kept on drinking Zam zam water and staying in the Mosque. Then `Ali passed by me and said, 'It \nseems you are a stranger?' I said, 'Yes.' He proceeded to his house and I accompanied him. Neither did \nhe ask me anything, nor did I tell him anything. Next morning I went to the Mosque to ask about the \nProphet but no-one told me anything about him. `Ali passed by me again and asked, 'Hasn't the man \nrecognized his dwelling place yet' I said, 'No.' He said, 'Come along with me.' He asked me, 'What is \nyour business? What has brought you to this town?' \nI said to him, 'If you keep my secret, I will tell you.' He said, 'I will do,' I said to him, 'We have heard \nthat a person has appeared here, claiming to be a Prophet. \nI sent my brother to speak to him and when he returned, he did not bring a satisfactory report; so I \nthought of meeting him personally.' `Ali said (to Abu Dhar), 'You have reached your goal; I am going \nto him just now, so follow me, and wherever I enter, enter after me. If I should see someone who may \ncause you trouble, I will stand near a wall pretending to mend my shoes (as a warning), and you \nshould go away then.' `Ali proceeded and I accompanied him till he entered a place, and I entered with \nhim to the Prophet (ﷺ) to whom I said, 'Present (the principles of) Islam to me.' When he did, I embraced \nIslam 'immediately. \nHe said to me, 'O Abu Dhar! Keep your conversion as a secret and return to your town; and when you \nhear of our victory, return to us. ' I said, 'By H him Who has sent you with the Truth, I will announce \nmy conversion to Islam publicly amongst them (i.e. the infidels),' Abu Dhar went to the Mosque, \nwhere some people from Quraish were present, and said, 'O folk of Quraish ! I testify that None has \nthe right to be worshipped except Allah, and I (also) testify that Muhammad is Allah's Slave and His \nApostle.' (Hearing that) the Quraishi men said, 'Get at this Sabi (i.e. Muslim) !' They got up and beat \nme nearly to death. Al `Abbas saw me and threw himself over me to protect me. He then faced them \nand said, 'Woe to you! You want to kill a man from the tribe of Ghifar, although your trade and your \ncommunications are through the territory of Ghifar?' They therefore left me. The next morning I \nreturned (to the Mosque) and said the same as I have said on the previous day. They again said, 'Get at \nthis Sabi!' I was treated in the same way as on the previous day, and again Al-Abbas found me and \nthrew himself over me to protect me and told them the same as he had said the day before.' So, that \nwas the conversion of Abu Dhar (may Allah be Merciful to him) to Islam.\"",
    "arabic": "حَدَّثَنَا زَيْدٌ ـ هُوَ ابْنُ أَخْزَمَ ـ قَالَ أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنِي مُثَنَّى بْنُ سَعِيدٍ الْقَصِيرُ، قَالَ حَدَّثَنِي أَبُو جَمْرَةَ، قَالَ لَنَا ابْنُ عَبَّاسِ أَلاَ أُخْبِرُكُمْ بِإِسْلاَمِ أَبِي ذَرٍّ، قَالَ قُلْنَا بَلَى‏.‏ قَالَ قَالَ أَبُو ذَرٍّ كُنْتُ رَجُلاً مِنْ غِفَارٍ، فَبَلَغَنَا أَنَّ رَجُلاً قَدْ خَرَجَ بِمَكَّةَ، يَزْعُمُ أَنَّهُ نَبِيٌّ، فَقُلْتُ لأَخِي انْطَلِقْ إِلَى هَذَا الرَّجُلِ كَلِّمْهُ وَأْتِنِي بِخَبَرِهِ‏.‏ فَانْطَلَقَ فَلَقِيَهُ، ثُمَّ رَجَعَ فَقُلْتُ مَا عِنْدَكَ فَقَالَ وَاللَّهِ لَقَدْ رَأَيْتُ رَجُلاً يَأْمُرُ بِالْخَيْرِ وَيَنْهَى عَنِ الشَّرِّ‏.‏ فَقُلْتُ لَهُ لَمْ تَشْفِنِي مِنَ الْخَبَرِ‏.‏ فَأَخَذْتُ جِرَابًا وَعَصًا، ثُمَّ أَقْبَلْتُ إِلَى مَكَّةَ فَجَعَلْتُ لاَ أَعْرِفُهُ، وَأَكْرَهُ أَنْ أَسْأَلَ عَنْهُ، وَأَشْرَبُ مِنْ مَاءِ زَمْزَمَ وَأَكُونُ فِي الْمَسْجِدِ‏.‏ قَالَ فَمَرَّ بِي عَلِيٌّ فَقَالَ كَأَنَّ الرَّجُلَ غَرِيبٌ‏.‏ قَالَ قُلْتُ نَعَمْ‏.‏ قَالَ فَانْطَلِقْ إِلَى الْمَنْزِلِ‏.‏ قَالَ فَانْطَلَقْتُ مَعَهُ لاَ يَسْأَلُنِي عَنْ شَىْءٍ، وَلاَ أُخْبِرُهُ، فَلَمَّا أَصْبَحْتُ غَدَوْتُ إِلَى الْمَسْجِدِ لأَسْأَلَ عَنْهُ، وَلَيْسَ أَحَدٌ يُخْبِرُنِي عَنْهُ بِشَىْءٍ‏.‏ قَالَ فَمَرَّ بِي عَلِيٌّ فَقَالَ أَمَا نَالَ لِلرَّجُلِ يَعْرِفُ مَنْزِلَهُ بَعْدُ قَالَ قُلْتُ لاَ‏.‏ قَالَ انْطَلِقْ مَعِي‏.‏ قَالَ فَقَالَ مَا أَمْرُكَ وَمَا أَقْدَمَكَ هَذِهِ الْبَلْدَةَ قَالَ قُلْتُ لَهُ إِنْ كَتَمْتَ عَلَىَّ أَخْبَرْتُكَ‏.‏ قَالَ فَإِنِّي أَفْعَلُ‏.‏ قَالَ قُلْتُ لَهُ بَلَغَنَا أَنَّهُ قَدْ خَرَجَ هَا هُنَا رَجُلٌ يَزْعُمُ أَنَّهُ نَبِيٌّ، فَأَرْسَلْتُ أَخِي لِيُكَلِّمَهُ فَرَجَعَ وَلَمْ يَشْفِنِي مِنَ الْخَبَرِ، فَأَرَدْتُ أَنْ أَلْقَاهُ‏.‏ فَقَالَ لَهُ أَمَا إِنَّكَ قَدْ رَشَدْتَ، هَذَا وَجْهِي إِلَيْهِ، فَاتَّبِعْنِي، ادْخُلْ حَيْثُ أَدْخُلُ، فَإِنِّي إِنْ رَأَيْتُ أَحَدًا أَخَافُهُ عَلَيْكَ، قُمْتُ إِلَى الْحَائِطِ، كَأَنِّي أُصْلِحُ نَعْلِي، وَامْضِ أَنْتَ، فَمَضَى وَمَضَيْتُ مَعَهُ، حَتَّى دَخَلَ وَدَخَلْتُ مَعَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ لَهُ اعْرِضْ عَلَىَّ الإِسْلاَمَ‏.‏ فَعَرَضَهُ فَأَسْلَمْتُ مَكَانِي، فَقَالَ لِي ‏\n\"‏ يَا أَبَا ذَرٍّ اكْتُمْ هَذَا الأَمْرَ، وَارْجِعْ إِلَى بَلَدِكَ، فَإِذَا بَلَغَكَ ظُهُورُنَا فَأَقْبِلْ ‏\"‏‏.‏ فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لأَصْرُخَنَّ بِهَا بَيْنَ أَظْهُرِهِمْ‏.‏ فَجَاءَ إِلَى الْمَسْجِدِ، وَقُرَيْشٌ فِيهِ فَقَالَ يَا مَعْشَرَ قُرَيْشٍ، إِنِّي أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏ فَقَالُوا قُومُوا إِلَى هَذَا الصَّابِئِ‏.‏ فَقَامُوا فَضُرِبْتُ لأَمُوتَ فَأَدْرَكَنِي الْعَبَّاسُ، فَأَكَبَّ عَلَىَّ ثُمَّ أَقْبَلَ عَلَيْهِمْ، فَقَالَ وَيْلَكُمْ تَقْتُلُونَ رَجُلاً مِنْ غِفَارَ، وَمَتْجَرُكُمْ وَمَمَرُّكُمْ عَلَى غِفَارَ‏.‏ فَأَقْلَعُوا عَنِّي، فَلَمَّا أَنْ أَصْبَحْتُ الْغَدَ رَجَعْتُ فَقُلْتُ مِثْلَ مَا قُلْتُ بِالأَمْسِ، فَقَالُوا قُومُوا إِلَى هَذَا الصَّابِئِ‏.‏ فَصُنِعَ ‏{‏بِي‏}‏ مِثْلَ مَا صُنِعَ بِالأَمْسِ وَأَدْرَكَنِي الْعَبَّاسُ فَأَكَبَّ عَلَىَّ، وَقَالَ مِثْلَ مَقَالَتِهِ بِالأَمْسِ‏.‏ قَالَ فَكَانَ هَذَا أَوَّلَ إِسْلاَمِ أَبِي ذَرٍّ رَحِمَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3522In-book reference : Book 61, Hadith 32USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 725   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3523,
    "id": 3523,
    "url": "https://sunnah.com/bukhari:3523",
    "bookNumber": 61,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Hurairah (ra):",
    "english": "The Prophet (ﷺ) said, (The people of) Aslam, Ghifar and some people of Muzaina and Juhaina or said (some people of Juhaina or Muzaina) are better with Allah or said (on the Day of resurrection) than the tribe of Asad, Tamim, Hawazin and Ghatafan.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ أَسْلَمُ وَغِفَارُ وَشَىْءٌ مِنْ مُزَيْنَةَ وَجُهَيْنَةَ ـ أَوْ قَالَ شَىْءٌ مِنْ جُهَيْنَةَ أَوْ مُزَيْنَةَ ـ خَيْرٌ عِنْدَ اللَّهِ ـ أَوْ قَالَ ـ يَوْمَ الْقِيَامَةِ مِنْ أَسَدٍ وَتَمِيمٍ وَهَوَازِنَ وَغَطَفَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3523In-book reference : Book 61, Hadith 33USC-MSA web (English) reference : Vol. 1, Book 56, Hadith 726   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3524,
    "id": 3524,
    "url": "https://sunnah.com/bukhari:3524",
    "bookNumber": 61,
    "hadithNumber": 34,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "If you wish to know about the ignorance of the Arabs, refer to Surat-al-Anam after Verse No. 130:-- \nIndeed lost are those who have killed their children From folly without knowledge and have forbidden \nthat which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray \nand were not guided.' (6.14)",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِذَا سَرَّكَ أَنْ تَعْلَمَ جَهْلَ الْعَرَبِ فَاقْرَأْ مَا فَوْقَ الثَّلاَثِينَ وَمِائَةٍ فِي سُورَةِ الأَنْعَامِ ‏{‏قَدْ خَسِرَ الَّذِينَ قَتَلُوا أَوْلاَدَهُمْ سَفَهًا بِغَيْرِ عِلْمٍ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدْ ضَلُّوا وَمَا كَانُوا مُهْتَدِينَ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3524In-book reference : Book 61, Hadith 34USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 726   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3525,
    "id": 3525,
    "url": "https://sunnah.com/bukhari:3525",
    "bookNumber": 61,
    "hadithNumber": 35,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed, the Prophet (ﷺ) started \ncalling (the 'Arab tribes), \"O Bani Fihr, O Bani `Adi\" mentioning first the various branch tribes of \nQuraish.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يُنَادِي ‏\"‏ يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ لِبُطُونِ قُرَيْشٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3525In-book reference : Book 61, Hadith 35USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3526,
    "id": 3526,
    "url": "https://sunnah.com/bukhari:3526",
    "bookNumber": 61,
    "hadithNumber": 36,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Verse:-- 'And warn your tribe of near kindred' (26.214). was revealed, \nthe Prophet (ﷺ) started calling every tribe by its name.",
    "arabic": "وَقَالَ لَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يَدْعُوهُمْ قَبَائِلَ قَبَائِلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3526In-book reference : Book 61, Hadith 36USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3527,
    "id": 3527,
    "url": "https://sunnah.com/bukhari:3527",
    "bookNumber": 61,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"O Bani `Abd Munaf! Buy yourselves from Allah; O Bani `Abdul-Muttalib! Buy \nyourselves from Allah; O mother of Az-Zubair bin Al-Awwam, the aunt of Allah's Messenger (ﷺ), and O \nFatima bint Muhammad! Buy yourselves from Allah, for I cannot defend you before Allah. You \n(both) can ask me from my property as much as you like. \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، أَخْبَرَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا بَنِي عَبْدِ مَنَافٍ، اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ، يَا بَنِي عَبْدِ الْمُطَّلِبِ اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ، يَا أُمَّ الزُّبَيْرِ بْنِ الْعَوَّامِ عَمَّةَ رَسُولِ اللَّهِ، يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ، اشْتَرِيَا أَنْفُسَكُمَا مِنَ اللَّهِ، لاَ أَمْلِكُ لَكُمَا مِنَ اللَّهِ شَيْئًا، سَلاَنِي مِنْ مَالِي مَا شِئْتُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3527In-book reference : Book 61, Hadith 37USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 728   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3528,
    "id": 3528,
    "url": "https://sunnah.com/bukhari:3528",
    "bookNumber": 61,
    "hadithNumber": 38,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) sent for the Ansar (and when they came), he asked, 'Is there any stranger amongst you?\" \nThey said, \"No except the son of our sister.\" Allah's Messenger (ﷺ) said, \"The son of the sister of some \npeople belongs to them.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم الأَنْصَارَ فَقَالَ ‏\"‏ هَلْ فِيكُمْ أَحَدٌ مِنْ غَيْرِكُمْ ‏\"‏‏.‏ قَالُوا لاَ، إِلاَّ ابْنُ أُخْتٍ لَنَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3528In-book reference : Book 61, Hadith 38USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 729   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3529,
    "id": 3529,
    "url": "https://sunnah.com/bukhari:3529",
    "bookNumber": 61,
    "hadithNumber": 39,
    "narrator": "Narrated `Aisha:",
    "english": "That during the Mina days, Abu Bakr came to her, while there where two girls with her, beating \ndrums, and the Prophet (ﷺ) was (lying) covering himself with his garment. Abu Bakr rebuked the two \ngirls, but the Prophet (ﷺ) uncovered his face and said, \"O Abu Bakr! Leave them, for these are the days of \nId (festival).\" Those days were the days of Mina-. `Aisha added, \"I was being screened by the Prophet (ﷺ) \nwhile I was watching the Ethiopians playing in the Mosque. `Umar rebuked them, but the Prophet (ﷺ) \nsaid, \"Leave them, O Bani Arfida! Play. (for) you are safe.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ، فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ، فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ، فَإِنَّهَا أَيَّامُ عِيدٍ، وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى ‏\"‏‏.‏   وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ، وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ فَزَجَرَهُمْ ‏{‏عُمَرُ‏}‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ أَمْنًا بَنِي أَرْفَدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3529, 3530In-book reference : Book 61, Hadith 39USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 730   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3530,
    "id": 3530,
    "url": "https://sunnah.com/bukhari:3530",
    "bookNumber": 61,
    "hadithNumber": 39,
    "narrator": "Narrated `Aisha:",
    "english": "That during the Mina days, Abu Bakr came to her, while there where two girls with her, beating \ndrums, and the Prophet (ﷺ) was (lying) covering himself with his garment. Abu Bakr rebuked the two \ngirls, but the Prophet (ﷺ) uncovered his face and said, \"O Abu Bakr! Leave them, for these are the days of \nId (festival).\" Those days were the days of Mina-. `Aisha added, \"I was being screened by the Prophet (ﷺ) \nwhile I was watching the Ethiopians playing in the Mosque. `Umar rebuked them, but the Prophet (ﷺ) \nsaid, \"Leave them, O Bani Arfida! Play. (for) you are safe.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ، فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ، فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ، فَإِنَّهَا أَيَّامُ عِيدٍ، وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى ‏\"‏‏.‏   وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ، وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ فَزَجَرَهُمْ ‏{‏عُمَرُ‏}‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ أَمْنًا بَنِي أَرْفَدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3529, 3530In-book reference : Book 61, Hadith 39USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 730   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3531,
    "id": 3531,
    "url": "https://sunnah.com/bukhari:3531",
    "bookNumber": 61,
    "hadithNumber": 40,
    "narrator": "Narrated `Aisha:",
    "english": "Once Hassan bin Thabit asked the permission of the Prophet (ﷺ) to lampoon (i.e. compose satirical poetry \ndefaming) the infidels. The Prophet (ﷺ) said, \"What about the fact that I have common descent with \nthem?\" Hassan replied, \"I shall take you out of them as a hair is taken out of dough.\" \nNarrated `Urwa: I started abusing Hassan in front of `Aisha, whereupon she said. \"Don't abuse him, \nfor he used to defend the Prophet (with his poetry).",
    "arabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ حَسَّانُ النَّبِيَّ صلى الله عليه وسلم فِي هِجَاءِ الْمُشْرِكِينَ، قَالَ ‏\n\"‏ كَيْفَ بِنَسَبِي ‏\"‏‏.‏ فَقَالَ حَسَّانُ لأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعَرَةُ مِنَ الْعَجِينِ‏.‏ وَعَنْ أَبِيهِ قَالَ ذَهَبْتُ أَسُبُّ حَسَّانَ عِنْدَ عَائِشَةَ فَقَالَتْ لاَ تَسُبُّهُ فَإِنَّهُ كَانَ يُنَافِحُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3531In-book reference : Book 61, Hadith 40USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 731   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3532,
    "id": 3532,
    "url": "https://sunnah.com/bukhari:3532",
    "bookNumber": 61,
    "hadithNumber": 41,
    "narrator": "Narrated Jubair bin Mut`im:",
    "english": "Allah's Messenger (ﷺ) said, \"I have five names: I am Muhammad and Ahmad; I am Al-Mahi through whom \nAllah will eliminate infidelity; I am Al-Hashir who will be the first to be resurrected, the people being \nresurrected there after; and I am also Al-`Aqib (i.e. There will be no prophet after me).",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لِي خَمْسَةُ أَسْمَاءٍ أَنَا مُحَمَّدٌ، وَأَحْمَدُ، وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِي الْكُفْرَ، وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي، وَأَنَا الْعَاقِبُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3532In-book reference : Book 61, Hadith 41USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 732   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3533,
    "id": 3533,
    "url": "https://sunnah.com/bukhari:3533",
    "bookNumber": 61,
    "hadithNumber": 42,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Doesn't it astonish you how Allah protects me from the Quraish's abusing and \ncursing? They abuse Mudhammam and curse Mudhammam while I am Muhammad (and not \nMudhammam).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ تَعْجَبُونَ كَيْفَ يَصْرِفُ اللَّهُ عَنِّي شَتْمَ قُرَيْشٍ وَلَعْنَهُمْ يَشْتِمُونَ مُذَمَّمًا وَيَلْعَنُونَ مُذَمَّمًا وَأَنَا مُحَمَّدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3533In-book reference : Book 61, Hadith 42USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 733   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3534,
    "id": 3534,
    "url": "https://sunnah.com/bukhari:3534",
    "bookNumber": 61,
    "hadithNumber": 43,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"My similitude in comparison with the other prophets is that of a man who has built \na house completely and excellently except for a place of one brick. When the people enter the house, \nthey admire its beauty and say: 'But for the place of this brick (how splendid the house will be)!\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا سَلِيمٌ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَثَلِي وَمَثَلُ الأَنْبِيَاءِ كَرَجُلٍ بَنَى دَارًا فَأَكْمَلَهَا وَأَحْسَنَهَا، إِلاَّ مَوْضِعَ لَبِنَةٍ، فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ، وَيَقُولُونَ لَوْلاَ مَوْضِعُ اللَّبِنَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3534In-book reference : Book 61, Hadith 43USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 734   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3535,
    "id": 3535,
    "url": "https://sunnah.com/bukhari:3535",
    "bookNumber": 61,
    "hadithNumber": 44,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"My similitude in comparison with the other prophets before me, is that of a man \nwho has built a house nicely and beautifully, except for a place of one brick in a corner. The people go \nabout it and wonder at its beauty, but say: 'Would that this brick be put in its place!' So I am that brick, \nand I am the last of the Prophets.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ مَثَلِي وَمَثَلَ الأَنْبِيَاءِ مِنْ قَبْلِي كَمَثَلِ رَجُلٍ بَنَى بَيْتًا فَأَحْسَنَهُ وَأَجْمَلَهُ، إِلاَّ مَوْضِعَ لَبِنَةٍ مِنْ زَاوِيَةٍ، فَجَعَلَ النَّاسُ يَطُوفُونَ بِهِ وَيَعْجَبُونَ لَهُ، وَيَقُولُونَ هَلاَّ وُضِعَتْ هَذِهِ اللَّبِنَةُ قَالَ فَأَنَا اللَّبِنَةُ، وَأَنَا خَاتِمُ النَّبِيِّينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3535In-book reference : Book 61, Hadith 44USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 735   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3536,
    "id": 3536,
    "url": "https://sunnah.com/bukhari:3536",
    "bookNumber": 61,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) died when he was sixty three years old.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم تُوُفِّيَ وَهْوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏ وَقَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3536In-book reference : Book 61, Hadith 45USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 736   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3537,
    "id": 3537,
    "url": "https://sunnah.com/bukhari:3537",
    "bookNumber": 61,
    "hadithNumber": 46,
    "narrator": "Narrated Anas:",
    "english": "While the Prophet (ﷺ) was in the market, a man called (somebody), \"O Abu-l-Qasim!' The Prophet (ﷺ) turned \nto him and said \"Name yourselves after me but do not call yourselves by my Kuniya.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي السُّوقِ فَقَالَ رَجُلٌ يَا أَبَا الْقَاسِمِ‏.‏ فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ سَمُّوا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3537In-book reference : Book 61, Hadith 46USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 737   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3538,
    "id": 3538,
    "url": "https://sunnah.com/bukhari:3538",
    "bookNumber": 61,
    "hadithNumber": 47,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) said, \"Name yourselves after me, but do not call yourselves by my Kuniya.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَسَمَّوْا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 3538In-book reference : Book 61, Hadith 47USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 738   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3539,
    "id": 3539,
    "url": "https://sunnah.com/bukhari:3539",
    "bookNumber": 61,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Huraira:",
    "english": "Abu-l-Qasim said, \"Name yourselves after me, but do not call yourselves by my Kuniya.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ سَمُّوا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 3539In-book reference : Book 61, Hadith 48USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 739   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3540,
    "id": 3540,
    "url": "https://sunnah.com/bukhari:3540",
    "bookNumber": 61,
    "hadithNumber": 49,
    "narrator": "Narrated Al-Ju'aid bin `Abdur Rahman:",
    "english": "I saw As-Sa'ib bin Yazid when he was ninety-four years old, quite strong and of straight figure. He \nsaid, \"I know that I enjoyed my hearing and seeing powers only because of the invocation of Allah's \nApostle . My aunt took me to him and said, 'O Allah's Messenger (ﷺ)! My nephew is sick; will you invoke \nAllah for him?' So he invoked (Allah) for me.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، رَأَيْتُ السَّائِبَ بْنَ يَزِيدَ ابْنَ أَرْبَعٍ وَتِسْعِينَ جَلْدًا مُعْتَدِلاً فَقَالَ قَدْ عَلِمْتُ مَا مُتِّعْتُ بِهِ سَمْعِي وَبَصَرِي إِلاَّ بِدُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم، إِنَّ خَالَتِي ذَهَبَتْ بِي إِلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي شَاكٍ فَادْعُ اللَّهَ‏.‏ قَالَ فَدَعَا لِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3540In-book reference : Book 61, Hadith 49USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 740   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3541,
    "id": 3541,
    "url": "https://sunnah.com/bukhari:3541",
    "bookNumber": 61,
    "hadithNumber": 50,
    "narrator": "Narrated As- Scab bin Yazid:",
    "english": "My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is sick\"' The Prophet (ﷺ) \npassed his hands over my head and blessed me. Then he performed ablution and I drank the remaining \nwater, and standing behind him. A saw the seal in between his shoulders.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا حَاتِمٌ، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، قَالَ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي‏.‏ وَقَعَ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، وَتَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ، ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمٍ بَيْنَ كَتِفَيْهِ‏.‏ قَالَ ابْنُ عُبَيْدِ اللَّهِ الْحُجْلَةُ مِنْ حُجَلِ الْفَرَسِ الَّذِي بَيْنَ عَيْنَيْهِ‏.‏ قَالَ إِبْرَاهِيمُ بْنُ حَمْزَةَ مِثْلَ زِرِّ الْحَجَلَةِ",
    "reference": "Reference : Sahih al-Bukhari 3541In-book reference : Book 61, Hadith 50USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 741   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3542,
    "id": 3542,
    "url": "https://sunnah.com/bukhari:3542",
    "bookNumber": 61,
    "hadithNumber": 51,
    "narrator": "Narrated `Uqba bin Al-Harith:",
    "english": "(Once) Abu Bakr offered the `Asr prayer and then went out walking and saw Al-Hasan playing with \nthe boys. He lifted him on to his shoulders and said, \" Let my parents be sacrificed for your sake! \n(You) resemble the Prophet (ﷺ) and not `Ali,\" while `Ali was smiling.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ صَلَّى أَبُو بَكْرٍ ـ رضى الله عنه ـ الْعَصْرَ، ثُمَّ خَرَجَ يَمْشِي فَرَأَى الْحَسَنَ يَلْعَبُ مَعَ الصِّبْيَانِ، فَحَمَلَهُ عَلَى عَاتِقِهِ وَقَالَ بِأَبِي شَبِيهٌ بِالنَّبِيِّ لاَ شَبِيهٌ بِعَلِيٍّ‏.‏ وَعَلِيٌّ يَضْحَكُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3542In-book reference : Book 61, Hadith 51USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 742   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3543,
    "id": 3543,
    "url": "https://sunnah.com/bukhari:3543",
    "bookNumber": 61,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "I saw the Prophet, and Al-Hasan resembled him.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَبِي جُحَيْفَةَ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ يُشْبِهُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3543In-book reference : Book 61, Hadith 52USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 743   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3544,
    "id": 3544,
    "url": "https://sunnah.com/bukhari:3544",
    "bookNumber": 61,
    "hadithNumber": 53,
    "narrator": "Narrated Isma`il bin Abi Khalid:",
    "english": "I heard Abii Juhaifa saying, \"I saw the Prophet, and Al-Hasan bin `Ali resembled him.\" I said to Abu- \nJuhaifa, \"Describe him for me.\" He said, \"He was white and his beard was black with some white hair. \nHe promised to give us 13 young she-camels, but he expired before we could get them.\"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ ـ عَلَيْهِمَا السَّلاَمُ ـ يُشْبِهُهُ قُلْتُ لأَبِي جُحَيْفَةَ صِفْهُ لِي‏.‏ قَالَ كَانَ أَبْيَضَ قَدْ شَمِطَ‏.‏ وَأَمَرَ لَنَا النَّبِيُّ صلى الله عليه وسلم بِثَلاَثَ عَشْرَةَ قَلُوصًا قَالَ فَقُبِضَ النَّبِيُّ صلى الله عليه وسلم قَبْلَ أَنْ نَقْبِضَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3544In-book reference : Book 61, Hadith 53USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 744   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3545,
    "id": 3545,
    "url": "https://sunnah.com/bukhari:3545",
    "bookNumber": 61,
    "hadithNumber": 54,
    "narrator": "Narrated Wahb Abu Juhaifa As-Sawwai:",
    "english": "I saw the Prophet (ﷺ) and saw some white hair below his lower lip above the chin.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ وَهْبٍ أَبِي جُحَيْفَةَ السُّوَائِيِّ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَرَأَيْتُ بَيَاضًا مِنْ تَحْتِ شَفَتِهِ السُّفْلَى الْعَنْفَقَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3545In-book reference : Book 61, Hadith 54USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 745   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3546,
    "id": 3546,
    "url": "https://sunnah.com/bukhari:3546",
    "bookNumber": 61,
    "hadithNumber": 55,
    "narrator": "Narrated Hariz bin `Uthman:",
    "english": "That he asked `Abdullah bin Busr (i.e. the companion of the Prophet), \"Did you see the Prophet (ﷺ) when \nhe was old?\" He said, \"He had a few white hairs between the lower lip and the chin.\"",
    "arabic": "حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ، حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ بُسْرٍ صَاحِبَ النَّبِيِّ صلى الله عليه وسلم قَالَ أَرَأَيْتَ النَّبِيَّ صلى الله عليه وسلم كَانَ شَيْخًا قَالَ كَانَ فِي عَنْفَقَتِهِ شَعَرَاتٌ بِيضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3546In-book reference : Book 61, Hadith 55USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 746   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3547,
    "id": 3547,
    "url": "https://sunnah.com/bukhari:3547",
    "bookNumber": 61,
    "hadithNumber": 56,
    "narrator": "Narrated Rabi`a bin Abi `Abdur-Rahman:",
    "english": "I heard Anas bin Malik describing the Prophet (ﷺ) saying, \"He was of medium height amongst the people, \nneither tall nor short; he had a rosy color, neither absolutely white nor deep brown; his hair was \nneither completely curly nor quite lank. Divine Inspiration was revealed to him when he was forty \nyears old. He stayed ten years in Mecca receiving the Divine Inspiration, and stayed in Medina for ten \nmore years. When he expired, he had scarcely twenty white hairs in his head and beard.\" Rabi`a said, \n\"I saw some of his hairs and it was red. When I asked about that, I was told that it turned red because \nof scent. \"",
    "arabic": "حَدَّثَنِي ابْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَصِفُ النَّبِيَّ صلى الله عليه وسلم قَالَ كَانَ رَبْعَةً مِنَ الْقَوْمِ، لَيْسَ بِالطَّوِيلِ وَلاَ بِالْقَصِيرِ، أَزْهَرَ اللَّوْنِ لَيْسَ بِأَبْيَضَ أَمْهَقَ وَلاَ آدَمَ، لَيْسَ بِجَعْدٍ قَطَطٍ وَلاَ سَبْطٍ رَجِلٍ، أُنْزِلَ عَلَيْهِ وَهْوَ ابْنُ أَرْبَعِينَ، فَلَبِثَ بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏ قَالَ رَبِيعَةُ فَرَأَيْتُ شَعَرًا مِنْ شَعَرِهِ، فَإِذَا هُوَ أَحْمَرُ فَسَأَلْتُ فَقِيلَ احْمَرَّ مِنَ الطِّيبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3547In-book reference : Book 61, Hadith 56USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 747   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3548,
    "id": 3548,
    "url": "https://sunnah.com/bukhari:3548",
    "bookNumber": 61,
    "hadithNumber": 57,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) was neither very tall nor short, neither absolutely white nor deep brown. His hair was \nneither curly nor lank. Allah sent him (as an Apostle) when he was forty years old. Afterwards he \nresided in Mecca for ten years and in Medina for ten more years. When Allah took him unto Him, \nthere was scarcely twenty white hairs in his head and beard.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ، وَلاَ بِالأَبْيَضِ الأَمْهَقِ، وَلَيْسَ بِالآدَمِ وَلَيْسَ بِالْجَعْدِ الْقَطَطِ وَلاَ بِالسَّبْطِ، بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، فَتَوَفَّاهُ اللَّهُ، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3548In-book reference : Book 61, Hadith 57USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 748   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3549,
    "id": 3549,
    "url": "https://sunnah.com/bukhari:3549",
    "bookNumber": 61,
    "hadithNumber": 58,
    "narrator": "Narrated Al-Bara:",
    "english": "Allah's Messenger (ﷺ) was the handsomest of all the people, and had the best appearance. He was neither \nvery tall nor short.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَجْهًا وَأَحْسَنَهُ خَلْقًا، لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3549In-book reference : Book 61, Hadith 58USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 749   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3550,
    "id": 3550,
    "url": "https://sunnah.com/bukhari:3550",
    "bookNumber": 61,
    "hadithNumber": 59,
    "narrator": "Narrated Qatada:",
    "english": "I asked Anas, \"Did the Prophet (ﷺ) use to dye (his) hair?\" He said, \"No, for there were only a few white \nhairs on his temples.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا هَلْ خَضَبَ النَّبِيُّ صلى الله عليه وسلم قَالَ لاَ، إِنَّمَا كَانَ شَىْءٌ فِي صُدْغَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3550In-book reference : Book 61, Hadith 59USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 750   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3551,
    "id": 3551,
    "url": "https://sunnah.com/bukhari:3551",
    "bookNumber": 61,
    "hadithNumber": 60,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) was of moderate height having broad shoulders (long) hair reaching his ear-lobes. Once I \nsaw him in a red cloak and I had never seen a more handsome than him.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم مَرْبُوعًا، بَعِيدَ مَا بَيْنَ الْمَنْكِبَيْنِ، لَهُ شَعَرٌ يَبْلُغُ شَحْمَةَ أُذُنِهِ، رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ، لَمْ أَرَ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ‏.‏ قَالَ يُوسُفُ بْنُ أَبِي إِسْحَاقَ عَنْ أَبِيهِ إِلَى مَنْكِبَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3551In-book reference : Book 61, Hadith 60USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 751   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3552,
    "id": 3552,
    "url": "https://sunnah.com/bukhari:3552",
    "bookNumber": 61,
    "hadithNumber": 61,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "Al-Bara' was asked, \"Was the face of the Prophet (as bright) as a sword?\" He said, \"No, but (as bright) \nas a moon.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ سُئِلَ الْبَرَاءُ أَكَانَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم مِثْلَ السَّيْفِ قَالَ لاَ بَلْ مِثْلَ الْقَمَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3552In-book reference : Book 61, Hadith 61USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 752   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3553,
    "id": 3553,
    "url": "https://sunnah.com/bukhari:3553",
    "bookNumber": 61,
    "hadithNumber": 62,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "Once Allah's Messenger (ﷺ) went to Al-Batha' at noon, performed the ablution and offered' a two rak`at Zuhr \nprayer and a two-rak`at `Asr prayer while a spearheaded stick was planted before him and the \npassersby were passing in front of it. (After the prayer), the people got up and held the hands of the \nProphet and passed them on their faces. I also took his hand and kept it on my face and noticed that it \nwas colder than ice, and its smell was nicer than musk.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ مَنْصُورٍ أَبُو عَلِيٍّ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ الأَعْوَرُ، بِالْمَصِّيصَةِ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْهَاجِرَةِ إِلَى الْبَطْحَاءِ فَتَوَضَّأَ ثُمَّ صَلَّى الظُّهْرَ رَكْعَتَيْنِ، وَالْعَصْرَ رَكْعَتَيْنِ، وَبَيْنَ يَدَيْهِ عَنَزَةٌ‏.‏ ‏{‏قَالَ شُعْبَةُ‏}‏ وَزَادَ فِيهِ عَوْنٌ عَنْ أَبِيهِ أَبِي جُحَيْفَةَ قَالَ كَانَ يَمُرُّ مِنْ وَرَائِهَا الْمَرْأَةُ، وَقَامَ النَّاسُ فَجَعَلُوا يَأْخُذُونَ يَدَيْهِ، فَيَمْسَحُونَ بِهَا وُجُوهَهُمْ، قَالَ فَأَخَذْتُ بِيَدِهِ، فَوَضَعْتُهَا عَلَى وَجْهِي، فَإِذَا هِيَ أَبْرَدُ مِنَ الثَّلْجِ، وَأَطْيَبُ رَائِحَةً مِنَ الْمِسْكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3553In-book reference : Book 61, Hadith 62USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 753   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3554,
    "id": 3554,
    "url": "https://sunnah.com/bukhari:3554",
    "bookNumber": 61,
    "hadithNumber": 63,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was the most generous of all the people, and he used to become more generous in \nRamadan when Gabriel met him. Gabriel used to meet him every night during Ramadan to revise the \nQur'an with him. Allah's Messenger (ﷺ) then used to be more generous than the fast wind.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَأَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ، حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ، فَيُدَارِسُهُ الْقُرْآنَ فَلَرَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3554In-book reference : Book 61, Hadith 63USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 754   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3555,
    "id": 3555,
    "url": "https://sunnah.com/bukhari:3555",
    "bookNumber": 61,
    "hadithNumber": 64,
    "narrator": "Narrated `Aisha:",
    "english": "That Allah's Messenger (ﷺ) came to her in a happy mood with his features glittering with joy, and said, \n\"Have you not heard what the Qaif has said about Zaid and Us-ama? He saw their feet and remarked. \nThese belong to each other.\" (i.e. They are father and son.)",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَيْهَا مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ، فَقَالَ ‏\n\"‏ أَلَمْ تَسْمَعِي مَا قَالَ الْمُدْلِجِيُّ لِزَيْدٍ وَأُسَامَةَ ـ وَرَأَى أَقْدَامَهُمَا ـ إِنَّ بَعْضَ هَذِهِ الأَقْدَامِ مِنْ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3555In-book reference : Book 61, Hadith 64USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 755   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3556,
    "id": 3556,
    "url": "https://sunnah.com/bukhari:3556",
    "bookNumber": 61,
    "hadithNumber": 65,
    "narrator": "Narrated `Abdullah bin Ka`b:",
    "english": "I heard Ka`b bin Malik talking after his failure to join (the Ghazwa of) Tabuk. He said, \"When I \ngreeted Allah's Messenger (ﷺ) whose face was glittering with happiness, for whenever Allah's Messenger (ﷺ) was \nhappy, his face used to glitter, as if it was a piece of the moon, and we used to recognize it (i.e. his \nhappiness) from his face.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ تَبُوكَ، قَالَ فَلَمَّا سَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يَبْرُقُ وَجْهُهُ مِنَ السُّرُورِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سُرَّ اسْتَنَارَ وَجْهُهُ، حَتَّى كَأَنَّهُ قِطْعَةُ قَمَرٍ، وَكُنَّا نَعْرِفُ ذَلِكَ مِنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3556In-book reference : Book 61, Hadith 65USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 756   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3557,
    "id": 3557,
    "url": "https://sunnah.com/bukhari:3557",
    "bookNumber": 61,
    "hadithNumber": 66,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"I have been sent (as an Apostle) in the best of all the generations of Adam's \noffspring since their Creation.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ مِنْ خَيْرِ قُرُونِ بَنِي آدَمَ قَرْنًا فَقَرْنًا، حَتَّى كُنْتُ مِنَ الْقَرْنِ الَّذِي كُنْتُ فِيهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3557In-book reference : Book 61, Hadith 66USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 757   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3558,
    "id": 3558,
    "url": "https://sunnah.com/bukhari:3558",
    "bookNumber": 61,
    "hadithNumber": 67,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) used to let his hair hang down while the infidels used to part their hair. The people of \nthe Scriptures were used to letting their hair hang down and Allah's Messenger (ﷺ) liked to follow the people \nof the Scriptures in the matters about which he was not instructed otherwise. Then Allah's Messenger (ﷺ) \nparted his hair.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْدِلُ شَعَرَهُ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ فَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ رُءُوسَهُمْ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ بِشَىْءٍ، ثُمَّ فَرَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3558In-book reference : Book 61, Hadith 67USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 758   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3559,
    "id": 3559,
    "url": "https://sunnah.com/bukhari:3559",
    "bookNumber": 61,
    "hadithNumber": 68,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "The Prophet (ﷺ) never used bad language neither a \"Fahish nor a Mutafahish. He used to say \"The best \namongst you are those who have the best manners and character.\" (See Hadith No. 56 (B) Vol. 8)",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم فَاحِشًا وَلاَ مُتَفَحِّشًا وَكَانَ يَقُولُ ‏\n\"‏ إِنَّ مِنْ خِيَارِكُمْ أَحْسَنَكُمْ أَخْلاَقًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3559In-book reference : Book 61, Hadith 68USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 759   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3560,
    "id": 3560,
    "url": "https://sunnah.com/bukhari:3560",
    "bookNumber": 61,
    "hadithNumber": 69,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) was given the choice of one of two matters, he would choose the easier of \nthe two, as long as it was not sinful to do so, but if it was sinful to do so, he would not approach it. \nAllah's Messenger (ﷺ) never took revenge (over anybody) for his own sake but (he did) only when Allah's \nLegal Bindings were outraged in which case he would take revenge for Allah's Sake.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ أَخَذَ أَيْسَرَهُمَا، مَا لَمْ يَكُنْ إِثْمًا، فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ، وَمَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ، إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمَ لِلَّهِ بِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3560In-book reference : Book 61, Hadith 69USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 760   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3561,
    "id": 3561,
    "url": "https://sunnah.com/bukhari:3561",
    "bookNumber": 61,
    "hadithNumber": 70,
    "narrator": "Narrated Anas:",
    "english": "I have never touched silk or Dibaj (i.e. thick silk) softer than the palm of the Prophet (ﷺ) nor have I smelt \na perfume nicer than the sweat of the Prophet.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَا مَسِسْتُ حَرِيرًا وَلاَ دِيبَاجًا أَلْيَنَ مِنْ كَفِّ النَّبِيِّ صلى الله عليه وسلم، وَلاَ شَمِمْتُ رِيحًا قَطُّ أَوْ عَرْفًا قَطُّ أَطْيَبَ مِنْ رِيحِ أَوْ عَرْفِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3561In-book reference : Book 61, Hadith 70USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 761   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3562,
    "id": 3562,
    "url": "https://sunnah.com/bukhari:3562",
    "bookNumber": 61,
    "hadithNumber": 71,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) was shier than a veiled virgin girl.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3562In-book reference : Book 61, Hadith 71USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 762   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3563,
    "id": 3563,
    "url": "https://sunnah.com/bukhari:3563",
    "bookNumber": 61,
    "hadithNumber": 73,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) never criticized any food (presented him), but he would eat it if he liked it; otherwise, he \nwould leave it (without expressing his dislike).",
    "arabic": "حَدَّثَنِي عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِلاَّ تَرَكَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3563In-book reference : Book 61, Hadith 73USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 764   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3564,
    "id": 3564,
    "url": "https://sunnah.com/bukhari:3564",
    "bookNumber": 61,
    "hadithNumber": 74,
    "narrator": "Narrated `Abdullah bin Malik bin Buhaina Al-Asdi:",
    "english": "When the Prophet (ﷺ) prostrated, he used to keep his arms so widely apart that we used to see his armpits. \n(The sub-narrator, Ibn Bukair said, \"The whiteness of his armpits.\")",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ الأَسْدِيِّ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا سَجَدَ فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى نَرَى إِبْطَيْهِ‏.‏ قَالَ وَقَالَ ابْنُ بُكَيْرٍ حَدَّثَنَا بَكْرٌ بَيَاضَ إِبْطَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3564In-book reference : Book 61, Hadith 74USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 765   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3565,
    "id": 3565,
    "url": "https://sunnah.com/bukhari:3565",
    "bookNumber": 61,
    "hadithNumber": 75,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) did not use to raise his hands in his invocations except in the Istisqa (i.e. invoking \nAllah for the rain) in which he used to raise his hands so high that one could see the whiteness of his \narmpits. (Note: It may be that Anas did not see the prophet (as) raising his hands but it has been \nnarrated that the Prophet (as) used to raise his hands for invocations other than Istisqa. See Hadith No. \n612 Vol. 5. and Hadith No. 807 & 808 Vol 2.)",
    "arabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يَرْفَعُ يَدَيْهِ فِي شَىْءٍ مِنْ دُعَائِهِ، إِلاَّ فِي الاِسْتِسْقَاءِ، فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ‏.‏   \nوَقَالَ أَبُو مُوسَى دَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَفَعَ يَدَيْهِ وَرَأَيْتُ بَيَاضَ إِبْطَيْهِ",
    "reference": "Reference : Sahih al-Bukhari 3565In-book reference : Book 61, Hadith 75USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 766   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3566,
    "id": 3566,
    "url": "https://sunnah.com/bukhari:3566",
    "bookNumber": 61,
    "hadithNumber": 76,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "By chance I went to the Prophet (ﷺ) at noon while he was at Al-Abtah (resting) in a tent. Bilal came out \n(of the tent) and pronounced the Adhan for the prayer, and entering again, he brought out the water \nwhich was left after Allah's Messenger (ﷺ) had performed the ablution. The people rushed to take some of \nthe water. Bilal again went in and brought out a spear-headed stick, and then Allah's Messenger (ﷺ) came \nout. As if I were now looking at the whiteness of his leg. Bilal fixed the stick and the Prophet (ﷺ) offered \na two-rak`at Zuhr prayer and a two-rak`at `Asr prayer, while women and donkeys were passing in \nfront of the Prophet (beyond the stick) .",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، قَالَ سَمِعْتُ عَوْنَ بْنَ أَبِي جُحَيْفَةَ، ذَكَرَ عَنْ أَبِيهِ، قَالَ دُفِعْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ بِالأَبْطَحِ فِي قُبَّةٍ كَانَ بِالْهَاجِرَةِ، خَرَجَ بِلاَلٌ فَنَادَى بِالصَّلاَةِ، ثُمَّ دَخَلَ فَأَخْرَجَ فَضْلَ وَضُوءِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَوَقَعَ النَّاسُ عَلَيْهِ يَأْخُذُونَ مِنْهُ، ثُمَّ دَخَلَ فَأَخْرَجَ الْعَنَزَةَ، وَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ سَاقَيْهِ فَرَكَزَ الْعَنَزَةَ، ثُمَّ صَلَّى الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ، يَمُرُّ بَيْنَ يَدَيْهِ الْحِمَارُ وَالْمَرْأَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3566In-book reference : Book 61, Hadith 76USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 767   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3567,
    "id": 3567,
    "url": "https://sunnah.com/bukhari:3567",
    "bookNumber": 61,
    "hadithNumber": 77,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to talk so clearly that if somebody wanted to count the number of his words, he \ncould do so. Narrated `Urwa bin Az-Zubair: `Aisha said (to me), \"Don't you wonder at Abu so-and-so \nwho came and sat by my dwelling and started relating the traditions of Allah's Messenger (ﷺ) intending to let \nme hear that, while I was performing an optional prayer. He left before I finished my optional prayer. \nHad I found him still there. I would have said to him, 'Allah's Messenger (ﷺ) never talked so quickly and \nvaguely as you do.' \"",
    "arabic": "حَدَّثَنِي الْحَسَنُ بْنُ صَبَّاحٍ الْبَزَّارُ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُحَدِّثُ حَدِيثًا لَوْ عَدَّهُ الْعَادُّ لأَحْصَاهُ‏.‏   وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ أَلاَ يُعْجِبُكَ أَبُو فُلاَنٍ جَاءَ فَجَلَسَ إِلَى جَانِبِ حُجْرَتِي يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم، يُسْمِعُنِي ذَلِكَ وَكُنْتُ أُسَبِّحُ فَقَامَ قَبْلَ أَنْ أَقْضِيَ سُبْحَتِي، وَلَوْ أَدْرَكْتُهُ لَرَدَدْتُ عَلَيْهِ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَكُنْ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3567, 3568In-book reference : Book 61, Hadith 77USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 768   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3568,
    "id": 3568,
    "url": "https://sunnah.com/bukhari:3568",
    "bookNumber": 61,
    "hadithNumber": 77,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to talk so clearly that if somebody wanted to count the number of his words, he \ncould do so. Narrated `Urwa bin Az-Zubair: `Aisha said (to me), \"Don't you wonder at Abu so-and-so \nwho came and sat by my dwelling and started relating the traditions of Allah's Messenger (ﷺ) intending to let \nme hear that, while I was performing an optional prayer. He left before I finished my optional prayer. \nHad I found him still there. I would have said to him, 'Allah's Messenger (ﷺ) never talked so quickly and \nvaguely as you do.' \"",
    "arabic": "حَدَّثَنِي الْحَسَنُ بْنُ صَبَّاحٍ الْبَزَّارُ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُحَدِّثُ حَدِيثًا لَوْ عَدَّهُ الْعَادُّ لأَحْصَاهُ‏.‏   وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ أَلاَ يُعْجِبُكَ أَبُو فُلاَنٍ جَاءَ فَجَلَسَ إِلَى جَانِبِ حُجْرَتِي يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم، يُسْمِعُنِي ذَلِكَ وَكُنْتُ أُسَبِّحُ فَقَامَ قَبْلَ أَنْ أَقْضِيَ سُبْحَتِي، وَلَوْ أَدْرَكْتُهُ لَرَدَدْتُ عَلَيْهِ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَكُنْ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3567, 3568In-book reference : Book 61, Hadith 77USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 768   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3569,
    "id": 3569,
    "url": "https://sunnah.com/bukhari:3569",
    "bookNumber": 61,
    "hadithNumber": 78,
    "narrator": "Narrated Abu Salama bin `Abdur-Rahman:",
    "english": "That he asked `Aisha \"How was the prayer of Allah's Messenger (ﷺ) in the month of Ramadan?\" She replied, \n\"He used not to pray more than eleven rak`at whether in Ramadan or in any other month. He used to \noffer four rak`at, let alone their beauty and length, and then four rak`at, let alone their beauty and \nlength. Afterwards he would offer three rak`at. I said, 'O Allah's Messenger (ﷺ)! Do you go to bed before \noffering the witr prayer?' He said, 'My eyes sleep, but my heart does not sleep.\"'",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ قَالَتْ مَا كَانَ يَزِيدُ فِي رَمَضَانَ وَلاَ غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، يُصَلِّي أَرْبَعَ رَكَعَاتٍ فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاَثًا فَقُلْتُ يَا رَسُولَ اللَّهِ تَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ ‏\n\"‏ تَنَامُ عَيْنِي وَلاَ يَنَامُ قَلْبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3569In-book reference : Book 61, Hadith 78USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 769   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3570,
    "id": 3570,
    "url": "https://sunnah.com/bukhari:3570",
    "bookNumber": 61,
    "hadithNumber": 79,
    "narrator": "Narrated Sharik bin `Abdullah bin Abi Namr:",
    "english": "I heard Anas bin Malik telling us about the night when the Prophet (ﷺ) was made to travel from the Ka`ba \nMosque. Three persons (i.e. angels) came to the Prophet (ﷺ) before he was divinely inspired was an \nAspostle), while he was sleeping in Al Masjid-ul-Haram. The first (of the three angels) said, \"Which \nof them is he?\" The second said, \"He is the best of them.\" That was all that happened then, and he did \nnot see them till they came at another night and he perceived their presence with his heart, for the eyes \nof the Prophet (ﷺ) were closed when he was asleep, but his heart was not asleep (not unconscious). This is \ncharacteristic of all the prophets: Their eyes sleep but their hearts do not sleep. Then Gabriel took \ncharge of the Prophet (ﷺ) and ascended along with him to the Heaven.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُنَا عَنْ لَيْلَةِ، أُسْرِيَ بِالنَّبِيِّ صلى الله عليه وسلم مِنْ مَسْجِدِ الْكَعْبَةِ جَاءَ ثَلاَثَةُ نَفَرٍ قَبْلَ أَنْ يُوحَى إِلَيْهِ، وَهُوَ نَائِمٌ فِي مَسْجِدِ الْحَرَامِ، فَقَالَ أَوَّلُهُمْ أَيُّهُمْ هُوَ فَقَالَ أَوْسَطُهُمْ هُوَ خَيْرُهُمْ وَقَالَ آخِرُهُمْ خُذُوا خَيْرَهُمْ‏.‏ فَكَانَتْ تِلْكَ، فَلَمْ يَرَهُمْ حَتَّى جَاءُوا لَيْلَةً أُخْرَى، فِيمَا يَرَى قَلْبُهُ، وَالنَّبِيُّ صلى الله عليه وسلم نَائِمَةٌ عَيْنَاهُ وَلاَ يَنَامُ قَلْبُهُ وَكَذَلِكَ الأَنْبِيَاءُ تَنَامُ أَعْيُنُهُمْ وَلاَ تَنَامُ قُلُوبُهُمْ، فَتَوَلاَّهُ جِبْرِيلُ ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3570In-book reference : Book 61, Hadith 79USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 770   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3571,
    "id": 3571,
    "url": "https://sunnah.com/bukhari:3571",
    "bookNumber": 61,
    "hadithNumber": 80,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "That they were with the Prophet (ﷺ) on a journey. They travelled the whole night, and when dawn \napproached, they took a rest and sleep overwhelmed them till the sun rose high in the sky. The first to \nget up was Abu Bakr. Allah's Messenger (ﷺ)s used not to be awakened from his sleep, but he would wake up \nby himself. `Umar woke up and then Abu Bakr sat by the side of the Prophet's head and started \nsaying: Allahu-Akbar raising his voice till the Prophet (ﷺ) woke up, (and after traveling for a while) he \ndismounted and led us in the morning prayer. A man amongst the people failed to join us in the \nprayer. When the Prophet (ﷺ) had finished the prayer, he asked (the man), \"O so-and-so! What prevented \nyou from offering the prayer with us?\" He replied, \"I am Junub,\" Alllah's Apostle ordered him to \nperform Tayammam with clean earth. \nThe man then offered the prayer. Allah's Messenger (ﷺ) ordered me and a few others to go ahead of him. We \nhad become very thirsty. While we were on our way (looking for water), we came across a lady \n(riding an animal), hanging her legs between two water-skins. We asked her, \"Where can we get \nwater?\" She replied, \"Oh ! There is no water.\" We asked, \"how far is your house from the water?\" She \nreplied, \"A distance of a day and a night travel.\" We said, \"Come on to Allah's Messenger (ﷺ), \"She asked, \n\"What is Allah's Messenger (ﷺ) ?\" So we brought her to Allah's Messenger (ﷺ) against her will, and she told him \nwhat she had told us before and added that she was the mother of orphans. So the Prophet (ﷺ) ordered that \nher two water-skins be brought and he rubbed the mouths of the water-skins. As we were thirsty, we \ndrank till we quenched our thirst and we were forty men. We also filled all our waterskins and other \nutensils with water, but we did not water the camels. The waterskin was so full that it was almost \nabout to burst. \nThe Prophet (ﷺ) then said, \"Bring what (foodstuff) you have.\" So some dates and pieces of bread were \ncollected for the lady, and when she went to her people, she said, \"I have met either the greatest \nmagician or a prophet as the people claim.\" So Allah guided the people of that village through that \nlady. She embraced Islam and they all embraced Islam.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ، سَمِعْتُ أَبَا رَجَاءٍ، قَالَ حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْنٍ، أَنَّهُمْ كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي مَسِيرٍ، فَأَدْلَجُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ وَجْهُ الصُّبْحِ عَرَّسُوا فَغَلَبَتْهُمْ أَعْيُنُهُمْ حَتَّى ارْتَفَعَتِ الشَّمْسُ، فَكَانَ أَوَّلَ مَنِ اسْتَيْقَظَ مِنْ مَنَامِهِ أَبُو بَكْرٍ، وَكَانَ لاَ يُوقَظُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَنَامِهِ حَتَّى يَسْتَيْقِظَ، فَاسْتَيْقَظَ عُمَرُ فَقَعَدَ أَبُو بَكْرٍ عِنْدَ رَأْسِهِ فَجَعَلَ يُكَبِّرُ وَيَرْفَعُ صَوْتَهُ، حَتَّى اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم فَنَزَلَ وَصَلَّى بِنَا الْغَدَاةَ، فَاعْتَزَلَ رَجُلٌ مِنَ الْقَوْمِ لَمْ يُصَلِّ مَعَنَا فَلَمَّا انْصَرَفَ قَالَ ‏\"‏ يَا فُلاَنُ مَا يَمْنَعُكَ أَنْ تُصَلِّيَ مَعَنَا ‏\"‏‏.‏ قَالَ أَصَابَتْنِي جَنَابَةٌ‏.‏ فَأَمَرَهُ أَنْ يَتَيَمَّمَ بِالصَّعِيدِ، ثُمَّ صَلَّى وَجَعَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَكُوبٍ بَيْنَ يَدَيْهِ، وَقَدْ عَطِشْنَا عَطَشًا شَدِيدًا فَبَيْنَمَا نَحْنُ نَسِيرُ إِذَا نَحْنُ بِامْرَأَةٍ سَادِلَةٍ رِجْلَيْهَا بَيْنَ مَزَادَتَيْنِ، فَقُلْنَا لَهَا أَيْنَ الْمَاءُ فَقَالَتْ إِنَّهُ لاَ مَاءَ‏.‏ فَقُلْنَا كَمْ بَيْنَ أَهْلِكِ وَبَيْنَ الْمَاءِ قَالَتْ يَوْمٌ وَلَيْلَةٌ‏.‏ فَقُلْنَا انْطَلِقِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَمَا رَسُولُ اللَّهِ فَلَمْ نُمَلِّكْهَا مِنْ أَمْرِهَا حَتَّى اسْتَقْبَلْنَا بِهَا النَّبِيَّ صلى الله عليه وسلم، فَحَدَّثَتْهُ بِمِثْلِ الَّذِي حَدَّثَتْنَا غَيْرَ أَنَّهَا حَدَّثَتْهُ أَنَّهَا مُؤْتِمَةٌ، فَأَمَرَ بِمَزَادَتَيْهَا فَمَسَحَ فِي الْعَزْلاَوَيْنِ، فَشَرِبْنَا عِطَاشًا أَرْبَعِينَ رَجُلاً حَتَّى رَوِينَا، فَمَلأْنَا كُلَّ قِرْبَةٍ مَعَنَا وَإِدَاوَةٍ، غَيْرَ أَنَّهُ لَمْ نَسْقِ بَعِيرًا وَهْىَ تَكَادُ تَنِضُّ مِنَ الْمِلْءِ ثُمَّ قَالَ ‏\"‏ هَاتُوا مَا عِنْدَكُمْ ‏\"‏‏.‏ فَجُمِعَ لَهَا مِنَ الْكِسَرِ وَالتَّمْرِ، حَتَّى أَتَتْ أَهْلَهَا قَالَتْ لَقِيتُ أَسْحَرَ النَّاسِ، أَوْ هُوَ نَبِيٌّ كَمَا زَعَمُوا، فَهَدَى اللَّهُ ذَاكَ الصِّرْمَ بِتِلْكَ الْمَرْأَةِ فَأَسْلَمَتْ وَأَسْلَمُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3571In-book reference : Book 61, Hadith 80USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 771   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3572,
    "id": 3572,
    "url": "https://sunnah.com/bukhari:3572",
    "bookNumber": 61,
    "hadithNumber": 81,
    "narrator": "Narrated Anas:",
    "english": "A bowl of water was brought to the Prophet (ﷺ) while he was at Az-Zawra. He placed his hand in it and \nthe water started flowing among his fingers. All the people performed ablution (with that water). \nQatada asked Anas, \"How many people were you?\" Anas replied, \"Three hundred or nearly three hundred.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِإِنَاءٍ وَهْوَ بِالزَّوْرَاءِ، فَوَضَعَ يَدَهُ فِي الإِنَاءِ، فَجَعَلَ الْمَاءُ يَنْبُعُ مِنْ بَيْنِ أَصَابِعِهِ، فَتَوَضَّأَ الْقَوْمُ‏.‏ قَالَ قَتَادَةُ قُلْتُ لأَنَسٍ كَمْ كُنْتُمْ قَالَ ثَلاَثَمِائَةٍ، أَوْ زُهَاءَ ثَلاَثِمِائَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3572In-book reference : Book 61, Hadith 81USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 772   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3573,
    "id": 3573,
    "url": "https://sunnah.com/bukhari:3573",
    "bookNumber": 61,
    "hadithNumber": 82,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I saw Allah's Messenger (ﷺ) at the 'time when the `Asr prayer was due. Then the people were searching for \nwater for ablution but they could not find any. Then some water was brought to Allah's Messenger (ﷺ) and he \nplaced his hand in the pot and ordered the people to perform the ablution with the water. I saw water \nflowing from underneath his fingers and the people started performing the ablution till all of them did \nit.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَانَتْ صَلاَةُ الْعَصْرِ، فَالْتُمِسَ الْوَضُوءُ فَلَمْ يَجِدُوهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَضُوءٍ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ فِي ذَلِكَ الإِنَاءِ، فَأَمَرَ النَّاسَ أَنْ يَتَوَضَّئُوا مِنْهُ، فَرَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ تَحْتِ أَصَابِعِهِ، فَتَوَضَّأَ النَّاسُ حَتَّى تَوَضَّئُوا مِنْ عِنْدِ آخِرِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3573In-book reference : Book 61, Hadith 82USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 773   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3574,
    "id": 3574,
    "url": "https://sunnah.com/bukhari:3574",
    "bookNumber": 61,
    "hadithNumber": 83,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) went out on one of his journeys with some of his companions. They went on walking till \nthe time of the prayer became due. They could not find water to perform the ablution. One of them \nwent away and brought a little amount of water in a pot. The Prophet (ﷺ) took it and performed the \nablution, and then stretched his four fingers on to the pot and said (to the people), \"Get up to perform \nthe ablution.\" They started performing the ablution till all of them did it, and they were seventy or so \npersons.",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُبَارَكٍ، حَدَّثَنَا حَزْمٌ، قَالَ سَمِعْتُ الْحَسَنَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي بَعْضِ مَخَارِجِهِ وَمَعَهُ نَاسٌ مِنْ أَصْحَابِهِ، فَانْطَلَقُوا يَسِيرُونَ، فَحَضَرَتِ الصَّلاَةُ فَلَمْ يَجِدُوا مَاءً يَتَوَضَّئُونَ، فَانْطَلَقَ رَجُلٌ مِنَ الْقَوْمِ، فَجَاءَ بِقَدَحٍ مِنْ مَاءٍ يَسِيرٍ فَأَخَذَهُ النَّبِيُّ صلى الله عليه وسلم فَتَوَضَّأَ، ثُمَّ مَدَّ أَصَابِعَهُ الأَرْبَعَ عَلَى الْقَدَحِ ثُمَّ قَالَ ‏\n\"‏ قُومُوا فَتَوَضَّئُوا ‏\"‏‏.‏ فَتَوَضَّأَ، الْقَوْمُ حَتَّى بَلَغُوا فِيمَا يُرِيدُونَ مِنَ الْوَضُوءِ، وَكَانُوا سَبْعِينَ أَوْ نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3574In-book reference : Book 61, Hadith 83USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 774   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3575,
    "id": 3575,
    "url": "https://sunnah.com/bukhari:3575",
    "bookNumber": 61,
    "hadithNumber": 84,
    "narrator": "Narrated Humaid:",
    "english": "Anas bin Malik said, \"Once the time of the prayer became due and the people whose houses were \nclose to the Mosque went to their houses to perform ablution, while the others remained (sitting there). \nA stone pot containing water was brought to the Prophet, who wanted to put his hand in it, but It was \ntoo small for him to spread his hand in it, and so he had to bring his fingers together before putting his \nhand in the pot. Then all the people performed the ablution (with that water).\" I asked Anas, \"How \nmany persons were they.\" He replied, \"There were eighty men.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ يَزِيدَ، أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ حَضَرَتِ الصَّلاَةُ فَقَامَ مَنْ كَانَ قَرِيبَ الدَّارِ مِنَ الْمَسْجِدِ يَتَوَضَّأُ، وَبَقِيَ قَوْمٌ، فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِمِخْضَبٍ مِنْ حِجَارَةٍ فِيهِ مَاءٌ، فَوَضَعَ كَفَّهُ فَصَغُرَ الْمِخْضَبُ أَنْ يَبْسُطَ فِيهِ كَفَّهُ، فَضَمَّ أَصَابِعَهُ فَوَضَعَهَا فِي الْمِخْضَبِ، فَتَوَضَّأَ الْقَوْمُ كُلُّهُمْ جَمِيعًا‏.‏ قُلْتُ كَمْ كَانُوا قَالَ ثَمَانُونَ رَجُلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3575In-book reference : Book 61, Hadith 84USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 775   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3576,
    "id": 3576,
    "url": "https://sunnah.com/bukhari:3576",
    "bookNumber": 61,
    "hadithNumber": 85,
    "narrator": "Narrated Salim bin Abi Aj-Jad:",
    "english": "Jabir bin `Abdullah said, \"The people became very thirsty on the day of Al-Hudaibiya (Treaty). A \nsmall pot containing some water was in front of the Prophet (ﷺ) and when he had finished the ablution, \nthe people rushed towards him. He asked, 'What is wrong with you?' They replied, 'We have no water \neither for performing ablution or for drinking except what is present in front of you.' So he placed his \nhand in that pot and the water started flowing among his fingers like springs. We all drank and \nperformed ablution (from it).\" I asked Jabir, \"How many were you?\" he replied, \"Even if we had been \none-hundred-thousand, it would have been sufficient for us, but we were fifteen-hundred.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا حُصَيْنٌ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ عَطِشَ النَّاسُ يَوْمَ الْحُدَيْبِيَةِ، وَالنَّبِيُّ صلى الله عليه وسلم بَيْنَ يَدَيْهِ رَكْوَةٌ فَتَوَضَّأَ فَجَهَشَ النَّاسُ نَحْوَهُ، فَقَالَ ‏\n\"‏ مَا لَكُمْ ‏\"‏‏.‏ قَالُوا لَيْسَ عِنْدَنَا مَاءٌ نَتَوَضَّأُ وَلاَ نَشْرَبُ إِلاَّ مَا بَيْنَ يَدَيْكَ، فَوَضَعَ يَدَهُ فِي الرَّكْوَةِ فَجَعَلَ الْمَاءُ يَثُورُ بَيْنَ أَصَابِعِهِ كَأَمْثَالِ الْعُيُونِ، فَشَرِبْنَا وَتَوَضَّأْنَا‏.‏ قُلْتُ كَمْ كُنْتُمْ قَالَ لَوْ كُنَّا مِائَةَ أَلْفٍ لَكَفَانَا، كُنَّا خَمْسَ عَشْرَةَ مِائَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3576In-book reference : Book 61, Hadith 85USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 776   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3577,
    "id": 3577,
    "url": "https://sunnah.com/bukhari:3577",
    "bookNumber": 61,
    "hadithNumber": 86,
    "narrator": "Narrated Al-Bara:",
    "english": "We were one-thousand-and-four-hundred persons on the day of Al-Hudaibiya (Treaty), and (at) Al- \nHudaibiya (there) was a well. We drew out its water not leaving even a single drop. The Prophet (ﷺ) sat at \nthe edge of the well and asked for some water with which he rinsed his mouth and then he threw it out \ninto the well. We stayed for a short while and then drew water from the well and quenched our thirst, \nand even our riding animals drank water to their satisfaction.",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَرْبَعَ عَشْرَةَ مِائَةً، وَالْحُدَيْبِيَةُ بِئْرٌ فَنَزَحْنَاهَا حَتَّى لَمْ نَتْرُكْ فِيهَا قَطْرَةً، فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم عَلَى شَفِيرِ الْبِئْرِ، فَدَعَا بِمَاءٍ فَمَضْمَضَ وَمَجَّ فِي الْبِئْرِ، فَمَكَثْنَا غَيْرَ بَعِيدٍ ثُمَّ اسْتَقَيْنَا حَتَّى رَوِينَا وَرَوَتْ ـ أَوْ صَدَرَتْ ـ رَكَائِبُنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3577In-book reference : Book 61, Hadith 86USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 777   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3578,
    "id": 3578,
    "url": "https://sunnah.com/bukhari:3578",
    "bookNumber": 61,
    "hadithNumber": 87,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Talha said to Um Sulaim, \"I have noticed feebleness in the voice of Allah's Messenger (ﷺ) which I \nthink, is caused by hunger. Have you got any food?\" She said, \"Yes.\" She brought out some loaves of \nbarley and took out a veil belonging to her, and wrapped the bread in part of it and put it under my \narm and wrapped part of the veil round me and sent me to Allah's Messenger (ﷺ). I went carrying it and \nfound Allah's Messenger (ﷺ) in the Mosque sitting with some people. When I stood there, Allah's Messenger (ﷺ) \nasked, \"Has Abu Talha sent you?\" I said, \"Yes\". He asked, \"With some food? I said, \"Yes\" Allah's \nApostle then said to the men around him, \"Get up!\" He set out (accompanied by them) and I went \nahead of them till I reached Abu Talha and told him (of the Prophet's visit). Abu Talha said, \"O Um \nSulaim! Allah's Messenger (ﷺ) is coming with the people and we have no food to feed them.\" She said, \n\"Allah and His Apostle know better.\" So Abu Talha went out to receive Allah's Messenger (ﷺ). Allah's \nApostle came along with Abu Talha. Allah's Messenger (ﷺ) said, \"O Um Sulaim! Bring whatever you have.\" \nShe brought the bread which Allah's Messenger (ﷺ) ordered to be broken into pieces. Um Sulaim poured on \nthem some butter from an oilskin. Then Allah's Messenger (ﷺ) recited what Allah wished him to recite, and \nthen said, \"Let ten persons come (to share the meal).\" Ten persons were admitted, ate their fill and \nwent out. Then he again said, \"Let another ten do the same.\" They were admitted, ate their fill and \nwent out. Then he again said, '\"'Let another ten persons (do the same.)\" They were admitted, ate their \nfill and went out. Then he said, \"Let another ten persons come.\" In short, all of them ate their fill, and \nthey were seventy or eighty men.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا، أَعْرِفُ فِيهِ الْجُوعَ فَهَلْ عِنْدَكِ مِنْ شَىْءٍ قَالَتْ نَعَمْ‏.‏ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخْرَجَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ دَسَّتْهُ تَحْتَ يَدِي وَلاَثَتْنِي بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ، فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ لِي رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ آرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ بِطَعَامٍ‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ فَأَخْبَرْتُهُ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ، قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، وَلَيْسَ عِنْدَنَا مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم، فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو طَلْحَةَ مَعَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ، فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَفُتَّ، وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً فَأَدَمَتْهُ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهِ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ سَبْعُونَ ـ أَوْ ثَمَانُونَ ـ رَجُلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3578In-book reference : Book 61, Hadith 87USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 778   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3579,
    "id": 3579,
    "url": "https://sunnah.com/bukhari:3579",
    "bookNumber": 61,
    "hadithNumber": 88,
    "narrator": "Narrated `Abdullah:",
    "english": "We used to consider miracles as Allah's Blessings, but you people consider them to be a warning. \nOnce we were with Allah's Messenger (ﷺ) on a journey, and we ran short of water. He said, \"Bring the water \nremaining with you.\" The people brought a utensil containing a little water. He placed his hand in it \nand said, \"Come to the blessed water, and the Blessing is from Allah.\" I saw the water flowing from \namong the fingers of Allah's Messenger (ﷺ) , and no doubt, we heard the meal glorifying Allah, when it was \nbeing eaten (by him).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا نَعُدُّ الآيَاتِ بَرَكَةً وَأَنْتُمْ تَعُدُّونَهَا تَخْوِيفًا، كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَقَلَّ الْمَاءُ فَقَالَ ‏\"‏ اطْلُبُوا فَضْلَةً مِنْ مَاءٍ ‏\"‏‏.‏ فَجَاءُوا بِإِنَاءٍ فِيهِ مَاءٌ قَلِيلٌ، فَأَدْخَلَ يَدَهُ فِي الإِنَاءِ، ثُمَّ قَالَ ‏\"‏ حَىَّ عَلَى الطَّهُورِ الْمُبَارَكِ، وَالْبَرَكَةُ مِنَ اللَّهِ ‏\"‏ فَلَقَدْ رَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ بَيْنِ أَصَابِعِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلَقَدْ كُنَّا نَسْمَعُ تَسْبِيحَ الطَّعَامِ وَهْوَ يُؤْكَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3579In-book reference : Book 61, Hadith 88USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 779   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3580,
    "id": 3580,
    "url": "https://sunnah.com/bukhari:3580",
    "bookNumber": 61,
    "hadithNumber": 89,
    "narrator": "Narrated Jabir:",
    "english": "My father had died in debt. So I came to the Prophet (ﷺ) and said, \"My father (died) leaving unpaid debts, \nand I have nothing except the yield of his date palms; and their yield for many years will not cover his \ndebts. So please come with me, so that the creditors may not misbehave with me.\" The Prophet (ﷺ) went \nround one of the heaps of dates and invoked (Allah), and then did the same with another heap and sat \non it and said, \"Measure (for them).\" He paid them their rights and what remained was as much as had \nbeen paid to them.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ حَدَّثَنِي عَامِرٌ، قَالَ حَدَّثَنِي جَابِرٌ ـ رضى الله عنه ـ أَنَّ أَبَاهُ، تُوُفِّيَ وَعَلَيْهِ دَيْنٌ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ إِنَّ أَبِي تَرَكَ عَلَيْهِ دَيْنًا وَلَيْسَ عِنْدِي إِلاَّ مَا يُخْرِجُ نَخْلُهُ، وَلاَ يَبْلُغُ مَا يُخْرِجُ سِنِينَ مَا عَلَيْهِ، فَانْطَلِقْ مَعِي لِكَىْ لاَ يُفْحِشَ عَلَىَّ الْغُرَمَاءُ‏.‏ فَمَشَى حَوْلَ بَيْدَرٍ مِنْ بَيَادِرِ التَّمْرِ فَدَعَا ثَمَّ آخَرَ، ثُمَّ جَلَسَ عَلَيْهِ فَقَالَ ‏\n\"‏ انْزِعُوهُ ‏\"‏‏.‏ فَأَوْفَاهُمُ الَّذِي لَهُمْ، وَبَقِيَ مِثْلُ مَا أَعْطَاهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3580In-book reference : Book 61, Hadith 89USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 780   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3581,
    "id": 3581,
    "url": "https://sunnah.com/bukhari:3581",
    "bookNumber": 61,
    "hadithNumber": 90,
    "narrator": "Narrated `Abdur-Rahman bin Abi Bakr:",
    "english": "The companions of Suffa were poor people. The Prophet (ﷺ) once said, \"Whoever has food enough for \ntwo persons, should take a third one (from among them), and whoever has food enough for four \npersons, should take a fifth or a sixth (or said something similar).\" Abu Bakr brought three persons \nwhile the Prophet (ﷺ) took ten. And Abu Bakr with his three family member (who were I, my father and \nmy mother) (the sub-narrator is in doubt whether `Abdur-Rahman said, \"My wife and my servant who \nwas common for both my house and Abu Bakr's house.\") Abu Bakr took his supper with the Prophet (ﷺ) \nand stayed there till he offered the `Isha' prayers. He returned and stayed till Allah's Messenger (ﷺ) took his \nsupper. \nAfter a part of the night had passed, he returned to his house. His wife said to him, \"What has detained \nyou from your guests?\" He said, \"Have you served supper to them?\" She said, \"They refused to take \nsupper until you come. They (i.e. some members of the household) presented the meal to them but \nthey refused (to eat)\" I went to hide myself and he said, \"O Ghunthar!\" He invoked Allah to cause my \nears to be cut and he rebuked me. He then said (to them): Please eat!\" and added, I will never eat the \nmeal.\" By Allah, whenever we took a handful of the meal, the meal grew from underneath more than \nthat handful till everybody ate to his satisfaction; yet the remaining food was more than the original \nmeal. Abu Bakr saw that the food was as much or more than the original amount. He called his wife, \n\"O sister of Bani Firas!\" She said, \"O pleasure of my eyes. The food has been tripled in quantity.\" \nAbu Bakr then started eating thereof and said, \"It (i.e. my oath not to eat) was because of Sa all.\" He \ntook a handful from it, and carried the rest to the Prophet. So that food was with the Prophet (ﷺ) . There \nwas a treaty between us and some people, and when the period of that treaty had elapsed, he divided \nUS into twelve groups, each being headed by a man. Allah knows how many men were under the \ncommand of each leader. Anyhow, the Prophet (ﷺ) surely sent a leader with each group. Then all of them \nate of that meal.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عُثْمَانَ، أَنَّهُ حَدَّثَهُ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّ أَصْحَابَ، الصُّفَّةِ كَانُوا أُنَاسًا فُقَرَاءَ، وَأَنَّ النَّبِيَّ ـ صلى الله عليه وسلم قَالَ مَرَّةً ‏\n\"‏ مَنْ كَانَ عِنْدَهُ طَعَامُ اثْنَيْنِ فَلْيَذْهَبْ بِثَالِثٍ، وَمَنْ كَانَ عِنْدَهُ طَعَامُ أَرْبَعَةٍ فَلْيَذْهَبْ بِخَامِسٍ أَوْ سَادِسٍ ‏\"‏‏.‏ أَوْ كَمَا قَالَ، وَأَنَّ أَبَا بَكْرٍ جَاءَ بِثَلاَثَةٍ وَانْطَلَقَ النَّبِيُّ صلى الله عليه وسلم بِعَشَرَةٍ، وَأَبُو بَكْرٍ وَثَلاَثَةً، قَالَ فَهْوَ أَنَا وَأَبِي وَأُمِّي ـ وَلاَ أَدْرِي هَلْ قَالَ امْرَأَتِي وَخَادِمِي ـ بَيْنَ بَيْتِنَا وَبَيْنَ بَيْتِ أَبِي بَكْرٍ، وَأَنَّ أَبَا بَكْرٍ تَعَشَّى عِنْدَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ لَبِثَ حَتَّى صَلَّى الْعِشَاءَ، ثُمَّ رَجَعَ فَلَبِثَ حَتَّى تَعَشَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَاءَ بَعْدَ مَا مَضَى مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ، قَالَتْ لَهُ امْرَأَتُهُ مَا حَبَسَكَ عَنْ أَضْيَافِكَ أَوْ ضَيْفِكَ‏.‏ قَالَ أَوَ عَشَّيْتِهِمْ قَالَتْ أَبَوْا حَتَّى تَجِيءَ، قَدْ عَرَضُوا عَلَيْهِمْ فَغَلَبُوهُمْ، فَذَهَبْتُ فَاخْتَبَأْتُ، فَقَالَ يَا غُنْثَرُ‏.‏ فَجَدَّعَ وَسَبَّ وَقَالَ كُلُوا وَقَالَ لاَ أَطْعَمُهُ أَبَدًا‏.‏ قَالَ وَايْمُ اللَّهِ مَا كُنَّا نَأْخُذُ مِنَ اللُّقْمَةِ إِلاَّ رَبَا مِنْ أَسْفَلِهَا أَكْثَرُ مِنْهَا حَتَّى شَبِعُوا، وَصَارَتْ أَكْثَرَ مِمَّا كَانَتْ قَبْلُ، فَنَظَرَ أَبُو بَكْرٍ فَإِذَا شَىْءٌ أَوْ أَكْثَرُ قَالَ لاِمْرَأَتِهِ يَا أُخْتَ بَنِي فِرَاسٍ‏.‏ قَالَتْ لاَ وَقُرَّةِ عَيْنِي لَهْىَ الآنَ أَكْثَرُ مِمَّا قَبْلُ بِثَلاَثِ مَرَّاتٍ‏.‏ فَأَكَلَ مِنْهَا أَبُو بَكْرٍ، وَقَالَ إِنَّمَا كَانَ الشَّيْطَانُ ـ يَعْنِي يَمِينَهُ ـ ثُمَّ أَكَلَ مِنْهَا لُقْمَةً، ثُمَّ حَمَلَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَصْبَحَتْ عِنْدَهُ‏.‏ وَكَانَ بَيْنَنَا وَبَيْنَ قَوْمٍ عَهْدٌ، فَمَضَى الأَجَلُ، فَتَفَرَّقْنَا اثْنَا عَشَرَ رَجُلاً مَعَ كُلِّ رَجُلٍ مِنْهُمْ أُنَاسٌ‏.‏ اللَّهُ أَعْلَمُ كَمْ مَعَ كُلِّ رَجُلٍ، غَيْرَ أَنَّهُ بَعَثَ مَعَهُمْ، قَالَ أَكَلُوا مِنْهَا أَجْمَعُونَ‏.‏ أَوْ كَمَا قَالَ‏.‏   \n وَغَيْرُهُ يَقُولُ فَعَرَفْنَا مِنْ الْعِرَافَةِ",
    "reference": "Reference : Sahih al-Bukhari 3581In-book reference : Book 61, Hadith 90USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 781   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3582,
    "id": 3582,
    "url": "https://sunnah.com/bukhari:3582",
    "bookNumber": 61,
    "hadithNumber": 91,
    "narrator": "Narrated Anas:",
    "english": "Once during the lifetime of Allah's Messenger (ﷺ), the people of Medina suffered from drought. So while the \nProphet was delivering a sermon on a Friday a man got up saying, \"O Allah's Messenger (ﷺ)! The horses and \nsheep have perished. Will you invoke Allah to bless us with rain?\" The Prophet (ﷺ) lifted both his hands \nand invoked. The sky at that time was as clear as glass. Suddenly a wind blew, raising clouds that \ngathered together, and it started raining heavily. We came out (of the Mosque) wading through the \nflowing water till we reached our homes. It went on raining till the next Friday, when the same man or \nsome other man stood up and said, \"O Allah's Messenger (ﷺ)! The houses have collapsed; please invoke \nAllah to withhold the rain.\" On that the Prophet (ﷺ) smiled and said, \"O Allah, (let it rain) around us and \nnot on us.\" I then looked at the clouds to see them separating forming a sort of a crown round Medina.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، وَعَنْ يُونُسَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَصَابَ أَهْلَ الْمَدِينَةِ قَحْطٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَبَيْنَا هُوَ يَخْطُبُ يَوْمَ جُمُعَةٍ إِذْ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الْكُرَاعُ، هَلَكَتِ الشَّاءُ، فَادْعُ اللَّهَ يَسْقِينَا، فَمَدَّ يَدَيْهِ وَدَعَا‏.‏ قَالَ أَنَسٌ وَإِنَّ السَّمَاءَ لَمِثْلُ الزُّجَاجَةِ فَهَاجَتْ رِيحٌ أَنْشَأَتْ سَحَابًا ثُمَّ اجْتَمَعَ، ثُمَّ أَرْسَلَتِ السَّمَاءُ عَزَالِيَهَا، فَخَرَجْنَا نَخُوضُ الْمَاءَ حَتَّى أَتَيْنَا مَنَازِلَنَا، فَلَمْ نَزَلْ نُمْطَرُ إِلَى الْجُمُعَةِ الأُخْرَى، فَقَامَ إِلَيْهِ ذَلِكَ الرَّجُلُ ـ أَوْ غَيْرُهُ ـ فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَتِ الْبُيُوتُ، فَادْعُ اللَّهَ يَحْبِسْهُ‏.‏ فَتَبَسَّمَ ثُمَّ قَالَ ‏\n\"‏ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَنَظَرْتُ إِلَى السَّحَابِ تَصَدَّعَ حَوْلَ الْمَدِينَةِ كَأَنَّهُ إِكْلِيلٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3582In-book reference : Book 61, Hadith 91USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 782   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3583,
    "id": 3583,
    "url": "https://sunnah.com/bukhari:3583",
    "bookNumber": 61,
    "hadithNumber": 92,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) used to deliver his sermons while standing beside a trunk of a datepalm. When he had the \npulpit made, he used it instead. The trunk started crying and the Prophet (ﷺ) went to it, rubbing his hand \nover it (to stop its crying).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ أَبُو غَسَّانَ، حَدَّثَنَا أَبُو حَفْصٍ ـ وَاسْمُهُ عُمَرُ بْنُ الْعَلاَءِ أَخُو أَبِي عَمْرِو بْنِ الْعَلاَءِ ـ قَالَ سَمِعْتُ نَافِعًا، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ إِلَى جِذْعٍ فَلَمَّا اتَّخَذَ الْمِنْبَرَ تَحَوَّلَ إِلَيْهِ، فَحَنَّ الْجِذْعُ فَأَتَاهُ فَمَسَحَ يَدَهُ عَلَيْهِ‏.‏   وَقَالَ عَبْدُ الْحَمِيدِ أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا مُعَاذُ بْنُ الْعَلاَءِ، عَنْ نَافِعٍ، بِهَذَا‏.‏ وَرَوَاهُ أَبُو عَاصِمٍ عَنِ ابْنِ أَبِي رَوَّادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3583In-book reference : Book 61, Hadith 92USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 783   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3584,
    "id": 3584,
    "url": "https://sunnah.com/bukhari:3584",
    "bookNumber": 61,
    "hadithNumber": 93,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) used to stand by a tree or a date-palm on Friday. Then an Ansari woman or man said. \"O \nAllah's Messenger (ﷺ)! Shall we make a pulpit for you?\" He replied, \"If you wish.\" So they made a pulpit for \nhim and when it was Friday, he proceeded towards the pulpit (for delivering the sermon). The datepalm \ncried like a child! The Prophet (ﷺ) descended (the pulpit) and embraced it while it continued \nmoaning like a child being quietened. The Prophet (ﷺ) said, \"It was crying for (missing) what it used to \nhear of religious knowledge given near to it.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ سَمِعْتُ أَبِي، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُومُ يَوْمَ الْجُمُعَةِ إِلَى شَجَرَةٍ أَوْ نَخْلَةٍ، فَقَالَتِ امْرَأَةٌ مِنَ الأَنْصَارِ ـ أَوْ رَجُلٌ ـ يَا رَسُولَ اللَّهِ أَلاَ نَجْعَلُ لَكَ مِنْبَرًا قَالَ ‏\"‏ إِنْ شِئْتُمْ ‏\"‏‏.‏ فَجَعَلُوا لَهُ مِنْبَرًا، فَلَمَّا كَانَ يَوْمُ الْجُمُعَةِ دُفِعَ إِلَى الْمِنْبَرِ، فَصَاحَتِ النَّخْلَةُ صِيَاحَ الصَّبِيِّ، ثُمَّ نَزَلَ النَّبِيُّ صلى الله عليه وسلم فَضَمَّهُ إِلَيْهِ تَئِنُّ أَنِينَ الصَّبِيِّ، الَّذِي يُسَكَّنُ، قَالَ ‏\"‏ كَانَتْ تَبْكِي عَلَى مَا كَانَتْ تَسْمَعُ مِنَ الذِّكْرِ عِنْدَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3584In-book reference : Book 61, Hadith 93USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 784   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3585,
    "id": 3585,
    "url": "https://sunnah.com/bukhari:3585",
    "bookNumber": 61,
    "hadithNumber": 94,
    "narrator": "Narrated Anas bin Malik:",
    "english": "That he heard Jabir bin `Abdullah saying, \"The roof of the Mosque was built over trunks of datepalms \nworking as pillars. When the Prophet (ﷺ) delivered a sermon, he used to stand by one of those \ntrunks till the pulpit was made for him, and he used it instead. Then we heard the trunk sending a \nsound like of a pregnant she-camel till the Prophet (ﷺ) came to it, and put his hand over it, then it became \nquiet.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ كَانَ الْمَسْجِدُ مَسْقُوفًا عَلَى جُذُوعٍ مِنْ نَخْلٍ فَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا خَطَبَ يَقُومُ إِلَى جِذْعٍ مِنْهَا، فَلَمَّا صُنِعَ لَهُ الْمِنْبَرُ، وَكَانَ عَلَيْهِ فَسَمِعْنَا لِذَلِكَ الْجِذْعِ صَوْتًا كَصَوْتِ الْعِشَارِ، حَتَّى جَاءَ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ عَلَيْهَا فَسَكَنَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3585In-book reference : Book 61, Hadith 94USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 785   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3586,
    "id": 3586,
    "url": "https://sunnah.com/bukhari:3586",
    "bookNumber": 61,
    "hadithNumber": 95,
    "narrator": "Narrated Hudhaifa:",
    "english": "Once `Umar bin Al-Khattab said, said, \"Who amongst you remembers the statement of Allah's \nApostle regarding the afflictions?\" Hudhaifa replied, \"I remember what he said exactly.\" `Umar said. \n\"Tell (us), you are really a daring man!'' Hudhaifa said, \"Allah's Messenger (ﷺ) said, 'A man's afflictions (i.e. \nwrong deeds) concerning his relation to his family, his property and his neighbors are expiated by his \nprayers, giving in charity and enjoining what is good and forbidding what is evil.' \" `Umar said, \"I \ndon't mean these afflictions but the afflictions that will be heaving up and down like waves of the \nsea.\" Hudhaifa replied, \"O chief of the believers! You need not fear those (afflictions) as there is a \nclosed door between you and them.\" `Umar asked, \"Will that door be opened or broken?\" Hudhaifa \nreplied, \"No, it will be broken.\" `Umar said, \"Then it is very likely that the door will not be closed \nagain.\" Later on the people asked Hudhaifa, \"Did `Umar know what that door meant?\" He said. \"Yes, \n`Umar knew it as everyone knows that there will be night before the tomorrow morning. I narrated to \n`Umar an authentic narration, not lies.\" We dared not ask Hudhaifa; therefore we requested Masruq \nwho asked him, \"What does the door stand for?\" He said, \"`Umar.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ،‏.‏ حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ حُذَيْفَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ أَيُّكُمْ يَحْفَظُ قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْفِتْنَةِ فَقَالَ حُذَيْفَةُ أَنَا أَحْفَظُ كَمَا قَالَ‏.‏ قَالَ هَاتِ إِنَّكَ لَجَرِيءٌ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصَّدَقَةُ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏‏.‏ قَالَ لَيْسَتْ هَذِهِ، وَلَكِنِ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ‏.‏ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لاَ بَأْسَ عَلَيْكَ مِنْهَا، إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا‏.‏ قَالَ يُفْتَحُ الْبَابُ أَوْ يُكْسَرُ قَالَ لاَ بَلْ يُكْسَرُ‏.‏ قَالَ ذَاكَ أَحْرَى أَنْ لاَ يُغْلَقَ‏.‏ قُلْنَا عَلِمَ الْبَابَ قَالَ نَعَمْ، كَمَا أَنَّ دُونَ غَدٍ اللَّيْلَةَ، إِنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالأَغَالِيطِ‏.‏ فَهِبْنَا أَنْ نَسْأَلَهُ، وَأَمَرْنَا مَسْرُوقًا، فَسَأَلَهُ فَقَالَ مَنِ الْبَابُ قَالَ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3586In-book reference : Book 61, Hadith 95USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 786   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3587,
    "id": 3587,
    "url": "https://sunnah.com/bukhari:3587",
    "bookNumber": 61,
    "hadithNumber": 96,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight a nation wearing hairy shoes, and till \nyou fight the Turks, who will have small eyes, red faces and flat noses; and their faces will be like flat \nshields. And you will find that the best people are those who hate responsibility of ruling most of all \ntill they are chosen to be the rulers. And the people are of different natures: The best in the pre-lslamic \nperiod are the best in Islam. A time will come when any of you will love to see me rather than to have \nhis family and property doubled.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَحَتَّى تُقَاتِلُوا التُّرْكَ، صِغَارَ الأَعْيُنِ، حُمْرَ الْوُجُوهِ، ذُلْفَ الأُنُوفِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏   \n\"«وَتَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الأَمْرِ، حَتَّى يَقَعَ فِيهِ، وَالنَّاسُ مَعَادِنُ، خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ.\"\n\"وَلَيَأْتِيَنَّ عَلَى أَحَدِكُمْ زَمَانٌ لأَنْ يَرَانِي أَحَبُّ إِلَيْهِ مِنْ أَنْ يَكُونَ لَهُ مِثْلُ أَهْلِهِ وَمَالِهِ.\"",
    "reference": "Reference : Sahih al-Bukhari 3587, 3588, 3589In-book reference : Book 61, Hadith 96USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 787   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3588,
    "id": 3588,
    "url": "https://sunnah.com/bukhari:3588",
    "bookNumber": 61,
    "hadithNumber": 96,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight a nation wearing hairy shoes, and till \nyou fight the Turks, who will have small eyes, red faces and flat noses; and their faces will be like flat \nshields. And you will find that the best people are those who hate responsibility of ruling most of all \ntill they are chosen to be the rulers. And the people are of different natures: The best in the pre-lslamic \nperiod are the best in Islam. A time will come when any of you will love to see me rather than to have \nhis family and property doubled.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَحَتَّى تُقَاتِلُوا التُّرْكَ، صِغَارَ الأَعْيُنِ، حُمْرَ الْوُجُوهِ، ذُلْفَ الأُنُوفِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏   \n\"«وَتَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الأَمْرِ، حَتَّى يَقَعَ فِيهِ، وَالنَّاسُ مَعَادِنُ، خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ.\"\n\"وَلَيَأْتِيَنَّ عَلَى أَحَدِكُمْ زَمَانٌ لأَنْ يَرَانِي أَحَبُّ إِلَيْهِ مِنْ أَنْ يَكُونَ لَهُ مِثْلُ أَهْلِهِ وَمَالِهِ.\"",
    "reference": "Reference : Sahih al-Bukhari 3587, 3588, 3589In-book reference : Book 61, Hadith 96USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 787   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3589,
    "id": 3589,
    "url": "https://sunnah.com/bukhari:3589",
    "bookNumber": 61,
    "hadithNumber": 96,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight a nation wearing hairy shoes, and till \nyou fight the Turks, who will have small eyes, red faces and flat noses; and their faces will be like flat \nshields. And you will find that the best people are those who hate responsibility of ruling most of all \ntill they are chosen to be the rulers. And the people are of different natures: The best in the pre-lslamic \nperiod are the best in Islam. A time will come when any of you will love to see me rather than to have \nhis family and property doubled.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَحَتَّى تُقَاتِلُوا التُّرْكَ، صِغَارَ الأَعْيُنِ، حُمْرَ الْوُجُوهِ، ذُلْفَ الأُنُوفِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏   \n\"«وَتَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الأَمْرِ، حَتَّى يَقَعَ فِيهِ، وَالنَّاسُ مَعَادِنُ، خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ.\"\n\"وَلَيَأْتِيَنَّ عَلَى أَحَدِكُمْ زَمَانٌ لأَنْ يَرَانِي أَحَبُّ إِلَيْهِ مِنْ أَنْ يَكُونَ لَهُ مِثْلُ أَهْلِهِ وَمَالِهِ.\"",
    "reference": "Reference : Sahih al-Bukhari 3587, 3588, 3589In-book reference : Book 61, Hadith 96USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 787   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3590,
    "id": 3590,
    "url": "https://sunnah.com/bukhari:3590",
    "bookNumber": 61,
    "hadithNumber": 97,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight with the Khudh and the Kirman \nfrom among the non-Arabs. They will be of red faces, flat noses and small eyes; their faces will look \nlike flat shields, and their shoes will be of hair.\"",
    "arabic": "حَدَّثَنِي يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا خُوزًا وَكَرْمَانَ مِنَ الأَعَاجِمِ، حُمْرَ الْوُجُوهِ، فُطْسَ الأُنُوفِ، صِغَارَ الأَعْيُنِ، وُجُوهُهُمُ الْمَجَانُّ الْمُطْرَقَةُ، نِعَالُهُمُ الشَّعَرُ ‏\"‏‏.‏ تَابَعَهُ غَيْرُهُ عَنْ عَبْدِ الرَّزَّاقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3590In-book reference : Book 61, Hadith 97USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 788   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3591,
    "id": 3591,
    "url": "https://sunnah.com/bukhari:3591",
    "bookNumber": 61,
    "hadithNumber": 98,
    "narrator": "Narrated Abu Huraira:",
    "english": "I enjoyed the company of Allah's Messenger (ﷺ) for three years, and during the other years of my life, never \nwas I so anxious to understand the (Prophet's) traditions as I was during those three years. I heard him \nsaying, beckoning with his hand in this way, \"Before the Hour you will fight with people who will \nhave hairy shoes and live in Al-Bazir.\" (Sufyan, the sub-narrator once said, \"And they are the people \nof Al-Bazir.\")",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ إِسْمَاعِيلُ أَخْبَرَنِي قَيْسٌ، قَالَ أَتَيْنَا أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ فَقَالَ صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ سِنِينَ لَمْ أَكُنْ فِي سِنِيَّ أَحْرَصَ عَلَى أَنْ أَعِيَ الْحَدِيثَ مِنِّي فِيهِنَّ سَمِعْتُهُ يَقُولُ وَقَالَ هَكَذَا بِيَدِهِ ‏\n\"‏ بَيْنَ يَدَىِ السَّاعَةِ تُقَاتِلُونَ قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَهُوَ هَذَا الْبَارِزُ ‏\"‏‏.‏ وَقَالَ سُفْيَانُ مَرَّةً وَهُمْ أَهْلُ الْبَازَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3591In-book reference : Book 61, Hadith 98USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 789   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3592,
    "id": 3592,
    "url": "https://sunnah.com/bukhari:3592",
    "bookNumber": 61,
    "hadithNumber": 99,
    "narrator": "Narrated `Umar bin Taghlib:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Near the Hour you will fight with people who will wear hairy shoes; \nand you will also fight people with flat faces like shields.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ بَيْنَ يَدَىِ السَّاعَةِ تُقَاتِلُونَ قَوْمًا يَنْتَعِلُونَ الشَّعَرَ، وَتُقَاتِلُونَ قَوْمًا كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3592In-book reference : Book 61, Hadith 99USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 790   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3593,
    "id": 3593,
    "url": "https://sunnah.com/bukhari:3593",
    "bookNumber": 61,
    "hadithNumber": 100,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The Jews will fight with you, and you will be given victory over them \nso that a stone will say, 'O Muslim! There is a Jew behind me; kill him!' \"",
    "arabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تُقَاتِلُكُمُ الْيَهُودُ فَتُسَلَّطُونَ عَلَيْهِمْ ثُمَّ يَقُولُ الْحَجَرُ يَا مُسْلِمُ، هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3593In-book reference : Book 61, Hadith 100USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 791   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3594,
    "id": 3594,
    "url": "https://sunnah.com/bukhari:3594",
    "bookNumber": 61,
    "hadithNumber": 101,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said, \"A time will come when the people will wage holy war, and it will be asked, 'Is \nthere any amongst you who has enjoyed the company of Allah's Messenger (ﷺ)?' They will say: 'Yes.' And \nthen victory will be bestowed upon them. They will wage holy war again, and it will be asked: 'Is \nthere any among you who has enjoyed the company of the companions of Allah's Messenger (ﷺ) ?' They will \nsay: 'Yes.' And then victory will be bestowed on them.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَغْزُونَ، فَيُقَالُ فِيكُمْ مَنْ صَحِبَ الرَّسُولَ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ عَلَيْهِمْ، ثُمَّ يَغْزُونَ فَيُقَالُ لَهُمْ هَلْ فِيكُمْ مَنْ صَحِبَ مَنْ صَحِبَ الرَّسُولَ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3594In-book reference : Book 61, Hadith 101USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 792   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3595,
    "id": 3595,
    "url": "https://sunnah.com/bukhari:3595",
    "bookNumber": 61,
    "hadithNumber": 102,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "While I was in the city of the Prophet, a man came and complained to him (the Prophet, ) of \ndestitution and poverty. Then another man came and complained of robbery (by highwaymen). The \nProphet said, \"Adi! Have you been to Al-Hira?\" I said, \"I haven't been to it, but I was informed about \nit.\" He said, \"If you should live for a long time, you will certainly see that a lady in a Howdah \ntraveling from Al-Hira will (safely reach Mecca and) perform the Tawaf of the Ka`ba, fearing none \nbut Allah.\" I said to myself, \"What will happen to the robbers of the tribe of Tai who have spread evil \nthrough out the country?\" The Prophet (ﷺ) further said. \"If you should live long, the treasures of Khosrau \nwill be opened (and taken as spoils).\" I asked, \"You mean Khosrau, son of Hurmuz?\" He said, \n\"Khosrau, son of Hurmuz; and if you should live long, you will see that one will carry a handful of \ngold or silver and go out looking for a person to accept it from him, but will find none to accept it \nfrom him. And any of you, when meeting Allah, will meet Him without needing an interpreter \nbetween him and Allah to interpret for him, and Allah will say to him: 'Didn't I send a messenger to \nteach you?' He will say: 'Yes.' Allah will say: 'Didn't I give you wealth and do you favors?' He will \nsay: 'Yes.' Then he will look to his right and see nothing but Hell, and look to his left and see nothing \nbut Hell.\" \n`Adi further said: I heard the Prophet (ﷺ) saying, \"Save yourself from the (Hell) Fire even with half a date \n(to be given in charity) and if you do not find a half date, then with a good pleasant word.\" `Adi \nadded: (later on) I saw a lady in a Howdah traveling from Al-Hira till she performed the Tawaf of the \nKa`ba, fearing none but Allah. And I was one of those who opened (conquered) the treasures of \nKhosrau, son of Hurmuz. If you should live long, you will see what the Prophet (ﷺ) Abu-l-Qasim had \nsaid: 'A person will come out with a handful. of gold...etc.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْحَكَمِ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا إِسْرَائِيلُ، أَخْبَرَنَا سَعْدٌ الطَّائِيُّ، أَخْبَرَنَا مُحِلُّ بْنُ خَلِيفَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ بَيْنَا أَنَا عِنْدَ النَّبِيِّ، صلى الله عليه وسلم إِذْ أَتَاهُ رَجُلٌ فَشَكَا إِلَيْهِ الْفَاقَةَ، ثُمَّ أَتَاهُ آخَرُ، فَشَكَا قَطْعَ السَّبِيلِ‏.‏ فَقَالَ ‏\"‏ يَا عَدِيُّ هَلْ رَأَيْتَ الْحِيرَةَ ‏\"‏‏.‏ قُلْتُ لَمْ أَرَهَا وَقَدْ أُنْبِئْتُ عَنْهَا‏.‏ قَالَ ‏\"‏ فَإِنْ طَالَتْ بِكَ حَيَاةٌ لَتَرَيَنَّ الظَّعِينَةَ تَرْتَحِلُ مِنَ الْحِيرَةِ، حَتَّى تَطُوفَ بِالْكَعْبَةِ، لاَ تَخَافُ أَحَدًا إِلاَّ اللَّهَ ‏\"‏ ـ قُلْتُ فِيمَا بَيْنِي وَبَيْنَ نَفْسِي فَأَيْنَ دُعَّارُ طَيِّئٍ الَّذِينَ قَدْ سَعَّرُوا الْبِلاَدَ ‏\"‏ وَلَئِنْ طَالَتْ بِكَ حَيَاةٌ لَتُفْتَحَنَّ كُنُوزُ كِسْرَى ‏\"‏‏.‏ قُلْتُ كِسْرَى بْنِ هُرْمُزَ قَالَ ‏\"‏ كِسْرَى بْنِ هُرْمُزَ، وَلَئِنْ طَالَتْ بِكَ حَيَاةٌ، لَتَرَيَنَّ الرَّجُلَ يُخْرِجُ مِلْءَ كَفِّهِ مِنْ ذَهَبٍ أَوْ فِضَّةٍ، يَطْلُبُ مَنْ يَقْبَلُهُ مِنْهُ، فَلاَ يَجِدُ أَحَدًا يَقْبَلُهُ مِنْهُ، وَلَيَلْقَيَنَّ اللَّهَ أَحَدُكُمْ يَوْمَ يَلْقَاهُ، وَلَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ يُتَرْجِمُ لَهُ‏.‏ فَيَقُولَنَّ أَلَمْ أَبْعَثْ إِلَيْكَ رَسُولاً فَيُبَلِّغَكَ فَيَقُولُ بَلَى‏.‏ فَيَقُولُ أَلَمْ أُعْطِكَ مَالاً وَأُفْضِلْ عَلَيْكَ فَيَقُولُ بَلَى‏.‏ فَيَنْظُرُ عَنْ يَمِينِهِ فَلاَ يَرَى إِلاَّ جَهَنَّمَ، وَيَنْظُرُ عَنْ يَسَارِهِ فَلاَ يَرَى إِلاَّ جَهَنَّمَ ‏\"‏‏.‏ قَالَ عَدِيٌّ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقَّةِ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ شِقَّةَ تَمْرَةٍ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏ قَالَ عَدِيٌّ فَرَأَيْتُ الظَّعِينَةَ تَرْتَحِلُ مِنَ الْحِيرَةِ حَتَّى تَطُوفَ بِالْكَعْبَةِ، لاَ تَخَافُ إِلاَّ اللَّهَ، وَكُنْتُ فِيمَنِ افْتَتَحَ كُنُوزَ كِسْرَى بْنِ هُرْمُزَ، وَلَئِنْ طَالَتْ بِكُمْ حَيَاةٌ لَتَرَوُنَّ مَا قَالَ النَّبِيُّ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏ يُخْرِجُ مِلْءَ كَفِّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3595In-book reference : Book 61, Hadith 102USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 793   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3596,
    "id": 3596,
    "url": "https://sunnah.com/bukhari:3596",
    "bookNumber": 61,
    "hadithNumber": 104,
    "narrator": "Narrated `Uqba bin `Amr:",
    "english": "The Prophet (ﷺ) once came out and offered the funeral prayer for the martyrs of Uhud, and proceeded to \nthe pulpit and said, \"I shall be your predecessor and a witness on you, and I am really looking at my \nsacred Fount now, and no doubt, I have been given the keys of the treasures of the world. By Allah, I \nam not afraid that you will worship others along with Allah, but I am afraid that you will envy and \nfight one another for worldly fortunes.\"",
    "arabic": "حَدَّثَنِي سَعِيدُ بْنُ شُرَحْبِيلَ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ، فَقَالَ ‏\n\"‏ إِنِّي فَرَطُكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، إِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي قَدْ أُعْطِيتُ خَزَائِنَ مَفَاتِيحِ الأَرْضِ، وَإِنِّي وَاللَّهِ مَا أَخَافُ بَعْدِي أَنْ تُشْرِكُوا، وَلَكِنْ أَخَافُ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3596In-book reference : Book 61, Hadith 104USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 795   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3597,
    "id": 3597,
    "url": "https://sunnah.com/bukhari:3597",
    "bookNumber": 61,
    "hadithNumber": 105,
    "narrator": "Narrated Usama:",
    "english": "Once the Prophet (ﷺ) stood on one of the high buildings (of Medina) and said, \"Do you see what I see? I \nsee affliction pouring among your hours like raindrops.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ ـ رضى الله عنه ـ قَالَ أَشْرَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُطُمٍ مِنَ الآطَامِ، فَقَالَ ‏\n\"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي أَرَى الْفِتَنَ تَقَعُ خِلاَلَ بُيُوتِكُمْ مَوَاقِعَ الْقَطْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3597In-book reference : Book 61, Hadith 105USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 796   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3598,
    "id": 3598,
    "url": "https://sunnah.com/bukhari:3598",
    "bookNumber": 61,
    "hadithNumber": 106,
    "narrator": "Narrated Zainab bint Jahsh:",
    "english": "That the Prophet (ﷺ) came to her in a state of fear saying, \"None has the right to be worshiped but Allah! \nWoe to the Arabs because of evil that has come near. Today a hole has been made in the wall of Gog \nand Magog as large as this.\" pointing with two of his fingers making a circle. Zainab said, \"I said, 'O \nAllah's Messenger (ﷺ)! Shall we be destroyed though amongst us there are pious people? ' He said, 'Yes, if \nevil increases.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ حَدَّثَتْهَا عَنْ زَيْنَبَ بِنْتِ جَحْشٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا فَزِعًا يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ، فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذَا ‏\"‏‏.‏ وَحَلَّقَ بِإِصْبَعِهِ وَبِالَّتِي تَلِيهَا، فَقَالَتْ زَيْنَبُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ ‏\"‏ نَعَمْ، إِذَا كَثُرَ الْخَبَثُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3598In-book reference : Book 61, Hadith 106USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 797   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3599,
    "id": 3599,
    "url": "https://sunnah.com/bukhari:3599",
    "bookNumber": 61,
    "hadithNumber": 107,
    "narrator": "Um Salama:",
    "english": "The Prophet (ﷺ) woke up and said, \"Glorified be Allah: What great (how many) \ntreasures have been sent down, and what great (how many ) afflictions have been sent down!\"",
    "arabic": "وَعَنِ الزُّهْرِيِّ، حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، أَنَّ أُمَّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ سُبْحَانَ اللَّهِ، مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ وَمَاذَا أُنْزِلَ مِنَ الْفِتَنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3599In-book reference : Book 61, Hadith 107USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 797   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3600,
    "id": 3600,
    "url": "https://sunnah.com/bukhari:3600",
    "bookNumber": 61,
    "hadithNumber": 108,
    "narrator": "Narrated Sasaa:",
    "english": "Abu Sa`id Al-Khudri said to me, \"I notice that you like sheep and you keep them; so take care of them \nand their food, for I have heard Allah's Messenger (ﷺ) saying, 'A time will come upon the people when the \nbest of a Muslim's property will be sheep, which he will take to the tops of mountains and to the \nplaces of rain-falls to run away with his religion in order to save it from afflictions.' \"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ بْنِ الْمَاجِشُونِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ لِي إِنِّي أَرَاكَ تُحِبُّ الْغَنَمَ، وَتَتَّخِذُهَا، فَأَصْلِحْهَا وَأَصْلِحْ رُعَامَهَا، فَإِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ تَكُونُ الْغَنَمُ فِيهِ خَيْرَ مَالِ الْمُسْلِمِ، يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ ـ أَوْ سَعَفَ الْجِبَالِ ـ فِي مَوَاقِعِ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3600In-book reference : Book 61, Hadith 108USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 798   (deprecated numbering scheme)"
  }
]