[
  {
    "hadithGlobalNumber": 5001,
    "id": 5001,
    "url": "https://sunnah.com/bukhari:5001",
    "bookNumber": 66,
    "hadithNumber": 23,
    "narrator": "Narrated 'Alqama:",
    "english": "While we were in the city of Hims (in Syria), Ibn Mas`ud recited Surat Yusuf. A man said to him), \"It \nwas not revealed in this way.\" Then Ibn Mas`ud said, \"I recited it in this way before Allah's Messenger (ﷺ) \nand he confirmed my recitation by saying, 'Well done!' \" Ibn Mas`ud detected the smell of wine from \nthe man's mouth, so he said to him, \"Aren't you ashamed of telling a lie about Allah's Book and (along \nwith this) you drink alcoholic liquors too?\" Then he lashed him according to the law.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنَّا بِحِمْصَ فَقَرَأَ ابْنُ مَسْعُودٍ سُورَةَ يُوسُفَ، فَقَالَ رَجُلٌ مَا هَكَذَا أُنْزِلَتْ قَالَ قَرَأْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحْسَنْتَ‏.‏ وَوَجَدَ مِنْهُ رِيحَ الْخَمْرِ فَقَالَ أَتَجْمَعُ أَنْ تُكَذِّبَ بِكِتَابِ اللَّهِ وَتَشْرَبَ الْخَمْرَ‏.‏ فَضَرَبَهُ الْحَدَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5001In-book reference : Book 66, Hadith 23USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 523   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5002,
    "id": 5002,
    "url": "https://sunnah.com/bukhari:5002",
    "bookNumber": 66,
    "hadithNumber": 24,
    "narrator": "Narrated `Abdullah (bin Mas`ud):",
    "english": "By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's \nBook but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I \nknow about whom it was revealed. And if I know that there is somebody who knows Allah's Book \nbetter than I, and he is at a place that camels can reach, I would go to him.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، قَالَ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ وَاللَّهِ الَّذِي لاَ إِلَهَ غَيْرُهُ مَا أُنْزِلَتْ سُورَةٌ مِنْ كِتَابِ اللَّهِ إِلاَّ أَنَا أَعْلَمُ أَيْنَ أُنْزِلَتْ وَلاَ أُنْزِلَتْ آيَةٌ مِنْ كِتَابِ اللَّهِ إِلاَّ أَنَا أَعْلَمُ فِيمَ أُنْزِلَتْ، وَلَوْ أَعْلَمُ أَحَدًا أَعْلَمَ مِنِّي بِكِتَابِ اللَّهِ تُبَلِّغُهُ الإِبِلُ لَرَكِبْتُ إِلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5002In-book reference : Book 66, Hadith 24USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 524   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5003,
    "id": 5003,
    "url": "https://sunnah.com/bukhari:5003",
    "bookNumber": 66,
    "hadithNumber": 25,
    "narrator": "Narrated Qatada:",
    "english": "I asked Anas bin Malik: \"Who collected the Qur'an at the time of the Prophet (ﷺ) ?\" He replied, \"Four, all \nof whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ مَنْ جَمَعَ الْقُرْآنَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَرْبَعَةٌ كُلُّهُمْ مِنَ الأَنْصَارِ أُبَىُّ بْنُ كَعْبٍ وَمُعَاذُ بْنُ جَبَلٍ، وَزَيْدُ بْنُ ثَابِتٍ، وَأَبُو زَيْدٍ‏.‏ تَابَعَهُ الْفَضْلُ عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ ثُمَامَةَ عَنْ أَنَسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5003In-book reference : Book 66, Hadith 25USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 525   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5004,
    "id": 5004,
    "url": "https://sunnah.com/bukhari:5004",
    "bookNumber": 66,
    "hadithNumber": 26,
    "narrator": "Narrated Anas bin Malik:",
    "english": "When the Prophet (ﷺ) died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin \nJabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ثَابِتٌ الْبُنَانِيُّ، وَثُمَامَةُ، عَنْ أَنَسٍ، قَالَ مَاتَ النَّبِيُّ صلى الله عليه وسلم وَلَمْ يَجْمَعِ الْقُرْآنَ غَيْرُ أَرْبَعَةٍ أَبُو الدَّرْدَاءِ وَمُعَاذُ بْنُ جَبَلٍ وَزَيْدُ بْنُ ثَابِتٍ وَأَبُو زَيْدٍ‏.‏ قَالَ وَنَحْنُ وَرِثْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5004In-book reference : Book 66, Hadith 26USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 526   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5005,
    "id": 5005,
    "url": "https://sunnah.com/bukhari:5005",
    "bookNumber": 66,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn Abbas:",
    "english": "Umar said, Ubayy was the best of us in the recitation (of the Qur'an) yet we leave some of what he recites. Ubayy says, \"I have taken it from the mouth of Allah's Messenger (ﷺ) and I will not leave it for anything.\" But Allah said \"None of Our Revelations do We abrogate or cause to be forgotten but We \nsubstitute something better or similar.\" (Quran 2:106)",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ عُمَرُ أُبَىٌّ أَقْرَؤُنَا وَإِنَّا لَنَدَعُ مِنْ لَحَنِ أُبَىٍّ، وَأُبَىٌّ يَقُولُ أَخَذْتُهُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ أَتْرُكُهُ لِشَىْءٍ قَالَ اللَّهُ تَعَالَى ‏{‏مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نَنْسَأْهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 5005In-book reference : Book 66, Hadith 27USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 527   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5006,
    "id": 5006,
    "url": "https://sunnah.com/bukhari:5006",
    "bookNumber": 66,
    "hadithNumber": 28,
    "narrator": "Narrated Abu Sa`id Al-Mu'alla:",
    "english": "While I was praying, the Prophet (ﷺ) called me but I did not respond to his call. Later I said, \"O Allah's \nApostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah \n(by obeying Him) and to His Apostle when he calls you'?\" (8.24) \nHe then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), \n'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly \nrecited Verses and the Magnificent Qur'an which was given to me.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى، قَالَ كُنْتُ أُصَلِّي فَدَعَانِي النَّبِيُّ صلى الله عليه وسلم فَلَمْ أُجِبْهُ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أُصَلِّي‏.‏ قَالَ ‏\"‏ أَلَمْ يَقُلِ اللَّهُ ‏{‏اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ‏}‏ ثُمَّ قَالَ أَلاَ أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ ‏\"‏‏.‏ فَأَخَذَ بِيَدِي فَلَمَّا أَرَدْنَا أَنْ نَخْرُجَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ لأُعَلِّمَنَّكَ أَعْظَمَ سُورَةٍ مِنَ الْقُرْآنِ‏.‏ قَالَ ‏\"‏‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5006In-book reference : Book 66, Hadith 28USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 528   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5007,
    "id": 5007,
    "url": "https://sunnah.com/bukhari:5007",
    "bookNumber": 66,
    "hadithNumber": 29,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \n\"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody \namong you who can treat him (by reciting something)?\" Then one of our men went along with her \nthough we did not think that he knew any such treatment. But he treated the chief by reciting \nsomething, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink \n(as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation \nof something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., \nAl-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet (ﷺ) so when we \nreached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had \ntaken were lawful to take or not). The Prophet (ﷺ) said, \"How did he come to know that it (Al-Fatiha) \ncould be used for treatment? Distribute your reward and assign for me one share thereof as well.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ مَعْبَدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كُنَّا فِي مَسِيرٍ لَنَا فَنَزَلْنَا فَجَاءَتْ جَارِيَةٌ فَقَالَتْ إِنَّ سَيِّدَ الْحَىِّ سَلِيمٌ، وَإِنَّ نَفَرَنَا غُيَّبٌ فَهَلْ مِنْكُمْ رَاقٍ فَقَامَ مَعَهَا رَجُلٌ مَا كُنَّا نَأْبُنُهُ بِرُقْيَةٍ فَرَقَاهُ فَبَرَأَ فَأَمَرَ لَهُ بِثَلاَثِينَ شَاةً وَسَقَانَا لَبَنًا فَلَمَّا رَجَعَ قُلْنَا لَهُ أَكُنْتَ تُحْسِنُ رُقْيَةً أَوْ كُنْتَ تَرْقِي قَالَ لاَ مَا رَقَيْتُ إِلاَّ بِأُمِّ الْكِتَابِ‏.‏ قُلْنَا لاَ تُحْدِثُوا شَيْئًا حَتَّى نَأْتِيَ ـ أَوْ نَسْأَلَ ـ النَّبِيَّ صلى الله عليه وسلم فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَكَرْنَاهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ وَمَا كَانَ يُدْرِيهِ أَنَّهَا رُقْيَةٌ اقْسِمُوا وَاضْرِبُوا لِي بِسَهْمٍ ‏\"‏‏.‏ \nوَقَالَ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا هِشَامٌ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ حَدَّثَنِي مَعْبَدُ بْنُ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ بِهَذَا",
    "reference": "Reference : Sahih al-Bukhari 5007In-book reference : Book 66, Hadith 29USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 529   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5008,
    "id": 5008,
    "url": "https://sunnah.com/bukhari:5008",
    "bookNumber": 66,
    "hadithNumber": 30,
    "narrator": "Narrated Abu Mas'ud:",
    "english": "Whoever recites two verses ... (text as in the following hadith)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ مَنْ قَرَأَ بِالآيَتَيْنِ‏.‏ ‏.‏‏.‏ ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5008In-book reference : Book 66, Hadith 30USC-MSA web (English) reference : Vol. 1, Book 61, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5009,
    "id": 5009,
    "url": "https://sunnah.com/bukhari:5009",
    "bookNumber": 66,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Mas'ud:",
    "english": "The Prophet (ﷺ) said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَرَأَ بِالآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5009In-book reference : Book 66, Hadith 31USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5010,
    "id": 5010,
    "url": "https://sunnah.com/bukhari:5010",
    "bookNumber": 66,
    "hadithNumber": 32,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing from the foodstuff. I caught him and said, \"I will take you to Allah's Messenger (ﷺ)!\" Then Abu Huraira described the whole narration and said: That person said (to me), \"(Please don't take me to Allah's Messenger (ﷺ) and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and no Satan will come near you until the morning..\" (When the Prophet (ﷺ) heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was a Satan.\"",
    "arabic": "وَقَالَ عُثْمَانُ بْنُ الْهَيْثَمِ حَدَّثَنَا عَوْفٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ وَكَّلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِحِفْظِ زَكَاةِ رَمَضَانَ فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَصَّ الْحَدِيثَ فَقَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ لَنْ يَزَالَ مَعَكَ مِنَ اللَّهِ حَافِظٌ وَلاَ يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ صَدَقَكَ وَهْوَ كَذُوبٌ ذَاكَ شَيْطَانٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5010In-book reference : Book 66, Hadith 32USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5011,
    "id": 5011,
    "url": "https://sunnah.com/bukhari:5011",
    "bookNumber": 66,
    "hadithNumber": 33,
    "narrator": "Narrated Al-Bara':",
    "english": "A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came \ndown and spread over that man, and it kept on coming closer and closer to him till his horse started \njumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him \nof that experience. The Prophet (ﷺ) said, \"That was As-Sakina (tranquility) which descended because of \n(the recitation of) the Qur'an.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَإِلَى جَانِبِهِ حِصَانٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدْنُو وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏\n\"‏ تِلْكَ السَّكِينَةُ تَنَزَّلَتْ بِالْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5011In-book reference : Book 66, Hadith 33USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 531   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5012,
    "id": 5012,
    "url": "https://sunnah.com/bukhari:5012",
    "bookNumber": 66,
    "hadithNumber": 34,
    "narrator": "Narrated Aslam:",
    "english": "Allah's Messenger (ﷺ) was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along \nwith him at night. `Umar asked him about something, but Allah's Messenger (ﷺ) did not answer him. He \nasked again, but he did not answer. He asked for the third time, but he did not answer. On that, `Umar \nsaid to himself, \"May your mother lose you! You have asked Allah's Messenger (ﷺ) three times, but he did \nnot answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was \nafraid that something might be revealed about me. After a little while I heard a call maker calling me, \nI said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's \nApostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to \nme than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O \nMuhammad), a manifest victory.' \" (Surat al-Fath) No. (48.1).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسِيرُ فِي بَعْضِ أَسْفَارِهِ وَعُمَرُ بْنُ الْخَطَّابِ يَسِيرُ مَعَهُ لَيْلاً فَسَأَلَهُ عُمَرُ عَنْ شَىْءٍ فَلَمْ يُجِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ، فَقَالَ عُمَرُ ثَكِلَتْكَ أُمُّكَ نَزَرْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ كُلَّ ذَلِكَ لاَ يُجِيبُكَ، قَالَ عُمَرُ فَحَرَّكْتُ بَعِيرِي حَتَّى كُنْتُ أَمَامَ النَّاسِ وَخَشِيتُ أَنْ يَنْزِلَ فِيَّ قُرْآنٌ فَمَا نَشِبْتُ أَنْ سَمِعْتُ صَارِخًا يَصْرُخُ ـ قَالَ ـ فَقُلْتُ لَقَدْ خَشِيتُ أَنْ يَكُونَ نَزَلَ فِيَّ قُرْآنٌ ـ قَالَ ـ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ لَقَدْ أُنْزِلَتْ عَلَىَّ اللَّيْلَةَ سُورَةٌ لَهِيَ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 5012In-book reference : Book 66, Hadith 34USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 532   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5013,
    "id": 5013,
    "url": "https://sunnah.com/bukhari:5013",
    "bookNumber": 66,
    "hadithNumber": 35,
    "narrator": "Narrated Abu Said Al-Khudri:",
    "english": "A man heard another man reciting (Surat-Al-Ikhlas) 'Say He is Allah, (the) One.' (112. 1) repeatedly. The next morning he came to Allah's Messenger (ﷺ) and informed him about it as if he thought that it was not enough to recite. On that Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, this Surah is equal to one-third of the Qur'an!\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5013In-book reference : Book 66, Hadith 35USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 533   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5014,
    "id": 5014,
    "url": "https://sunnah.com/bukhari:5014",
    "bookNumber": 66,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Said Al-Khudri:",
    "english": "My brother, Qatada bin An-Nau'man said, \"A man performed the night prayer late at night in the lifetime of the Prophet (ﷺ) and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet (ﷺ) ,~ and told him about that . (The Prophet (ﷺ) replied the same as (in Hadith 532) above.)",
    "arabic": "وَزَادَ أَبُو مَعْمَرٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَخْبَرَنِي أَخِي، قَتَادَةُ بْنُ النُّعْمَانِ أَنَّ رَجُلاً، قَامَ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم يَقْرَأُ مِنَ السَّحَرِ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ لاَ يَزِيدُ عَلَيْهَا، فَلَمَّا أَصْبَحْنَا أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5014In-book reference : Book 66, Hadith 36USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 533   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5015,
    "id": 5015,
    "url": "https://sunnah.com/bukhari:5015",
    "bookNumber": 66,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in \none night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do \nso, O Allah's Messenger (ﷺ)?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all \ncreatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا إِبْرَاهِيمُ، وَالضَّحَّاكُ الْمَشْرِقِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، رضى الله عنه قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ ثُلُثَ الْقُرْآنِ فِي لَيْلَةٍ ‏\"‏‏.‏ فَشَقَّ ذَلِكَ عَلَيْهِمْ وَقَالُوا أَيُّنَا يُطِيقُ ذَلِكَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ اللَّهُ الْوَاحِدُ الصَّمَدُ ثُلُثُ الْقُرْآنِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ مُرْسَلٌ وَعَنِ الضَّحَّاكِ الْمَشْرِقِيِّ مُسْنَدٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5015In-book reference : Book 66, Hadith 37USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 534   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5016,
    "id": 5016,
    "url": "https://sunnah.com/bukhari:5016",
    "bookNumber": 66,
    "hadithNumber": 38,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) became sick, he would recite Mu'awwidhat (Surat Al-Falaq and Surat An- \nNas) and then blow his breath over his body. When he became seriously ill, I used to recite (these two \nSuras) and rub his hands over his body hoping for its blessings.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ، فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5016In-book reference : Book 66, Hadith 38USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 535   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5017,
    "id": 5017,
    "url": "https://sunnah.com/bukhari:5017",
    "bookNumber": 66,
    "hadithNumber": 39,
    "narrator": "Narrated 'Aisha:",
    "english": "Whenever the Prophet (ﷺ) went to bed every night, he used to cup his hands together and blow over it after reciting Surat Al-Ikhlas, Surat Al-Falaq and Surat An-Nas, and then rub his hands over whatever parts of his body he was able to rub, starting with his head, face and front of his body. He used to do that three times.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُفَضَّلُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ جَمَعَ كَفَّيْهِ ثُمَّ نَفَثَ فِيهِمَا فَقَرَأَ فِيهِمَا ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ وَ‏{‏قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ‏}‏ وَ‏{‏قُلْ أَعُوذُ بِرَبِّ النَّاسِ‏}‏ ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5017In-book reference : Book 66, Hadith 39USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 536   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5018,
    "id": 5018,
    "url": "https://sunnah.com/bukhari:5018",
    "bookNumber": 66,
    "hadithNumber": 40,
    "narrator": "Narrated Usaid bin Hudair:",
    "english": "That while he was reciting Surat Al-Baqara (The Cow) at night, and his\n     horse was tied beside him, the horse was suddenly startled and \n     troubled. When he stopped reciting, the horse became quiet, and when \n     he started again, the horse was startled again. Then he stopped \n     reciting and the horse became quiet too. He started reciting again and\n     the horse was startled and troubled once again. Then he stopped \n     reciting and his son, Yahya was beside the horse. He was afraid that \n     the horse might trample on him. When he took the boy away and looked \n     towards the sky, he could not see it. The next morning he informed the\n     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn \n     Hudair replied, \"O Allah's Messenger (ﷺ)! My son, Yahya was near the horse \n     and I was afraid that it might trample on him, so I looked towards the\n     sky, and went to him. When I looked at the sky, I saw something like a\n     cloud containing what looked like lamps, so I went out in order not to\n     see it.\" The Prophet (ﷺ) said, \"Do you know what that was?\" Ibn Hudair \n     replied, \"No.\" The Prophet (ﷺ) said, \"Those were Angels who came near to \n     you for your voice and if you had kept on reciting till dawn, it would\n     have remained there till morning when people would have seen it as it \n     would not have disappeared.",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، قَالَ بَيْنَمَا هُوَ يَقْرَأُ مِنَ اللَّيْلِ سُورَةَ الْبَقَرَةِ وَفَرَسُهُ مَرْبُوطٌ عِنْدَهُ إِذْ جَالَتِ الْفَرَسُ فَسَكَتَ فَسَكَتَتْ فَقَرَأَ فَجَالَتِ الْفَرَسُ، فَسَكَتَ وَسَكَتَتِ الْفَرَسُ ثُمَّ قَرَأَ فَجَالَتِ الْفَرَسُ، فَانْصَرَفَ وَكَانَ ابْنُهُ يَحْيَى قَرِيبًا مِنْهَا فَأَشْفَقَ أَنْ تُصِيبَهُ فَلَمَّا اجْتَرَّهُ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ حَتَّى مَا يَرَاهَا فَلَمَّا أَصْبَحَ حَدَّثَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اقْرَأْ يَا ابْنَ حُضَيْرٍ اقْرَأْ يَا ابْنَ حُضَيْرٍ ‏\"‏‏.‏ قَالَ فَأَشْفَقْتُ يَا رَسُولَ اللَّهِ أَنْ تَطَأَ يَحْيَى وَكَانَ مِنْهَا قَرِيبًا فَرَفَعْتُ رَأْسِي فَانْصَرَفْتُ إِلَيْهِ فَرَفَعْتُ رَأْسِي إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَخَرَجَتْ حَتَّى لاَ أَرَاهَا‏.‏ قَالَ ‏\"‏ وَتَدْرِي مَا ذَاكَ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ تِلْكَ الْمَلاَئِكَةُ دَنَتْ لِصَوْتِكَ وَلَوْ قَرَأْتَ لأَصْبَحَتْ يَنْظُرُ النَّاسُ إِلَيْهَا لاَ تَتَوَارَى مِنْهُمْ ‏\"‏‏.‏ قَالَ ابْنُ الْهَادِ وَحَدَّثَنِي هَذَا الْحَدِيثَ عَبْدُ اللَّهِ بْنُ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5018In-book reference : Book 66, Hadith 40USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 536   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5019,
    "id": 5019,
    "url": "https://sunnah.com/bukhari:5019",
    "bookNumber": 66,
    "hadithNumber": 41,
    "narrator": "Narrated `Abdul `Aziz bin Rufai':",
    "english": "Shaddad bin Ma'qil and I entered upon Ibn `Abbas. Shaddad bin Ma'qil asked him, \"Did the Prophet (ﷺ) \nleave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between \nthe two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the \nsame question). He replied, \"The Prophet (ﷺ) did not leave except what is between the bindings (of the \nQur'an).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ دَخَلْتُ أَنَا وَشَدَّادُ بْنُ مَعْقِلٍ، عَلَى ابْنِ عَبَّاسٍ رضى الله عنهما فَقَالَ لَهُ شَدَّادُ بْنُ مَعْقِلٍ أَتَرَكَ النَّبِيُّ صلى الله عليه وسلم مِنْ شَىْءٍ قَالَ مَا تَرَكَ إِلاَّ مَا بَيْنَ الدَّفَّتَيْنِ‏.‏ قَالَ وَدَخَلْنَا عَلَى مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ فَسَأَلْنَاهُ فَقَالَ مَا تَرَكَ إِلاَّ مَا بَيْنَ الدَّفَّتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5019In-book reference : Book 66, Hadith 41USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 537   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5020,
    "id": 5020,
    "url": "https://sunnah.com/bukhari:5020",
    "bookNumber": 66,
    "hadithNumber": 42,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"The example of him (a believer) who recites the Qur'an is like that of a citron \nwhich tastes good and smells good. And he (a believer) who does not recite the Qur'an is like a date \nwhich is good in taste but has no smell. And the example of a dissolute wicked person who recites the \nQur'an is like the Raihana (sweet basil) which smells good but tastes bitter. And the example of a \ndissolute wicked person who does not recite the Qur'an is like the colocynth which tastes bitter and \nhas no smell.",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ أَبُو خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ كَالأُتْرُجَّةِ طَعْمُهَا طَيِّبٌ وَرِيحُهَا طَيِّبٌ وَالَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَالتَّمْرَةِ طَعْمُهَا طَيِّبٌ وَلاَ رِيحَ لَهَا، وَمَثَلُ الْفَاجِرِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْفَاجِرِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ طَعْمُهَا مُرٌّ وَلاَ رِيحَ لَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5020In-book reference : Book 66, Hadith 42USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 538   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5021,
    "id": 5021,
    "url": "https://sunnah.com/bukhari:5021",
    "bookNumber": 66,
    "hadithNumber": 43,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"Your life in comparison to the lifetime of the past nations is like the period \nbetween the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians \nis that of person who employed laborers and said to them, \"Who will work for me till the middle of \nthe day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the \nmiddle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then \nyou (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the \nJews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I \nwronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to \nwhom I wish.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا أَجَلُكُمْ فِي أَجَلِ مَنْ خَلاَ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ وَمَغْرِبِ الشَّمْسِ، وَمَثَلُكُمْ وَمَثَلُ الْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَعْمَلَ عُمَّالاً، فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى الْعَصْرِ فَعَمِلَتِ النَّصَارَى، ثُمَّ أَنْتُمْ تَعْمَلُونَ مِنَ الْعَصْرِ إِلَى الْمَغْرِبِ بِقِيرَاطَيْنِ قِيرَاطَيْنِ، قَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ قَالَ فَذَاكَ فَضْلِي أُوتِيهِ مَنْ شِئْتُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5021In-book reference : Book 66, Hadith 43USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 539   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5022,
    "id": 5022,
    "url": "https://sunnah.com/bukhari:5022",
    "bookNumber": 66,
    "hadithNumber": 44,
    "narrator": "Narrated Talha:",
    "english": "I asked `Abdullah bin Abi `Aufa, \"Did the Prophet (ﷺ) make a will (to appoint his successor or bequeath \nwealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they \nare ordered to do so while the Prophet (ﷺ) did not make any will?\" He said, \"He made a will wherein he \nrecommended Allah's Book.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، حَدَّثَنَا طَلْحَةُ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى أَوْصَى النَّبِيُّ صلى الله عليه وسلم فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ، أُمِرُوا بِهَا وَلَمْ يُوصِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5022In-book reference : Book 66, Hadith 44USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 540   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5023,
    "id": 5023,
    "url": "https://sunnah.com/bukhari:5023",
    "bookNumber": 66,
    "hadithNumber": 45,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a pleasant tone.\" The companion of the sub-narrator (Abu Salama) said, \"It means, reciting \nit aloud.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَمْ يَأْذَنِ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِلنَّبِيِّ صلى الله عليه وسلم يَتَغَنَّى بِالْقُرْآنِ ‏\"‏‏.‏ وَقَالَ صَاحِبٌ لَهُ يُرِيدُ يَجْهَرُ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5023In-book reference : Book 66, Hadith 45USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 541   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5024,
    "id": 5024,
    "url": "https://sunnah.com/bukhari:5024",
    "bookNumber": 66,
    "hadithNumber": 46,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) I said, \"Allah does not listen to a prophet as He listens to a prophet who recites the \nQur'an in a loud and pleasant tone.\" Sufyan said, \"This saying means: a prophet who regards the \nQur'an as something that makes him dispense with many worldly pleasures.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا أَذِنَ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِلنَّبِيِّ أَنْ يَتَغَنَّى بِالْقُرْآنِ ‏\"‏‏.‏ قَالَ سُفْيَانُ تَفْسِيرُهُ يَسْتَغْنِي بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5024In-book reference : Book 66, Hadith 46USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 542   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5025,
    "id": 5025,
    "url": "https://sunnah.com/bukhari:5025",
    "bookNumber": 66,
    "hadithNumber": 47,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Not to wish to be the like except of two men. A man whom Allah has given the \nknowledge of the Book and he recites it during the hours of the night, and a man whom Allah has \ngiven wealth, and he spends it in charity during the night and the hours of the day.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ حَسَدَ إِلاَّ عَلَى اثْنَتَيْنِ، رَجُلٌ آتَاهُ اللَّهُ الْكِتَابَ وَقَامَ بِهِ آنَاءَ اللَّيْلِ، وَرَجُلٌ أَعْطَاهُ اللَّهُ مَالاً فَهْوَ يَتَصَدَّقُ بِهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5025In-book reference : Book 66, Hadith 47USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 543   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5026,
    "id": 5026,
    "url": "https://sunnah.com/bukhari:5026",
    "bookNumber": 66,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) I said, \"Not to wish to be the like of except two men: A man whom Allah has taught \nthe Qur'an and he recites it during the hours of the night and during the hours of the day, and his \nneighbor listens to him and says, 'I wish I had been given what has been given to so-and-so, so that I \nmight do what he does; and a man whom Allah has given wealth and he spends it on what is just and \nright, whereupon an other man May say, 'I wish I had been given what so-and-so has been given, for \nthen I would do what he does.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، سَمِعْتُ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ فَهُوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ فَسَمِعَهُ جَارٌ لَهُ فَقَالَ لَيْتَنِي أُوتِيتُ مِثْلَ مَا أُوتِيَ فُلاَنٌ فَعَمِلْتُ مِثْلَ مَا يَعْمَلُ، وَرَجُلٌ آتَاهُ اللَّهُ مَالاً فَهْوَ يُهْلِكُهُ فِي الْحَقِّ فَقَالَ رَجُلٌ لَيْتَنِي أُوتِيتُ مِثْلَ مَا أُوتِيَ فُلاَنٌ فَعَمِلْتُ مِثْلَ مَا يَعْمَلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5026In-book reference : Book 66, Hadith 48USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 544   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5027,
    "id": 5027,
    "url": "https://sunnah.com/bukhari:5027",
    "bookNumber": 66,
    "hadithNumber": 49,
    "narrator": "Narrated `Uthman:",
    "english": "The Prophet (ﷺ) said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ، سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عُثْمَانَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ ‏\"‏‏.‏ قَالَ وَأَقْرَأَ أَبُو عَبْدِ الرَّحْمَنِ فِي إِمْرَةِ عُثْمَانَ حَتَّى كَانَ الْحَجَّاجُ، قَالَ وَذَاكَ الَّذِي أَقْعَدَنِي مَقْعَدِي هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5027In-book reference : Book 66, Hadith 49USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 545   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5028,
    "id": 5028,
    "url": "https://sunnah.com/bukhari:5028",
    "bookNumber": 66,
    "hadithNumber": 50,
    "narrator": "Narrated `Uthman bin `Affan:",
    "english": "The Prophet (ﷺ) said, \"The most superior among you (Muslims) are those who learn the Qur'an and teach \nit.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَفْضَلَكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5028In-book reference : Book 66, Hadith 50USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 546   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5029,
    "id": 5029,
    "url": "https://sunnah.com/bukhari:5029",
    "bookNumber": 66,
    "hadithNumber": 51,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "A lady came to the Prophet (ﷺ) and declared that she had decided to offer herself to Allah and His \nApostle. The Prophet (ﷺ) said, \"I am not in need of women.\" A man said (to the Prophet) \"Please marry \nher to me.\" The Prophet (ﷺ) said (to him), \"Give her a garment.\" The man said, \"I cannot afford it.\" The \nProphet said, \"Give her anything, even if it were an iron ring.\" The man apologized again. The \nProphet then asked him, \"What do you know by heart of the Qur'an?\" He replied, \"I know such-andsuch \nportion of the Qur'an (by heart).\" The Prophet (ﷺ) said, \"Then I marry her to you for that much of the \nQur'an which you know by heart.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ أَتَتِ النَّبِيَّ صلى الله عليه وسلم امْرَأَةٌ فَقَالَتْ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لِلَّهِ وَلِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا لِي فِي النِّسَاءِ مِنْ حَاجَةٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ زَوِّجْنِيهَا‏.‏ قَالَ ‏\"‏ أَعْطِهَا ثَوْبًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ قَالَ ‏\"‏ أَعْطِهَا وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَاعْتَلَّ لَهُ‏.‏ فَقَالَ ‏\"‏ مَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ كَذَا وَكَذَا‏.‏ قَالَ ‏\"‏ فَقَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5029In-book reference : Book 66, Hadith 51USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 547   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5030,
    "id": 5030,
    "url": "https://sunnah.com/bukhari:5030",
    "bookNumber": 66,
    "hadithNumber": 52,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "A lady came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to offer myself to \nyou.\" He raised his eyes and looked at her and then lowered his head. When the lady saw that he did \nnot make any decision, she sat down. On that, a man from his companions got up and said. \"O Allah's \nApostle! If you are not in need of this woman, then marry her to me.\" Allah's Messenger (ﷺ) said, \"Do you \nhave anything to offer her?\" He replied. \"No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said to him, \n\"Go to your family and see if you can find something.' The man went and returned, saying, \"No, by \nAllah, O Allah's Messenger (ﷺ)! I have not found anything.\" The Prophet (ﷺ) said, \"Try to find something, even \nif it is an iron ring.'' He went again and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ), not even \nan iron ring, but I have this waist sheet of mine.\" The man had no upper garment, so he intended to \ngive her, half his waist sheet. So Allah's Messenger (ﷺ) said, ''What would she do with your waist sheet? If \nyou wear it, she will have nothing of it over her body, and if she wears it, you will have nothing over \nyour body.\" So that man sat for a long period and then got up, and Allah's Messenger (ﷺ) saw him going \naway, so he ordered somebody to call him. When he came, the Prophet (ﷺ) asked him, \" How much of the \nQur'an do you know?\" He replied, \"I know such Surat and such Surat and such Surat,\" and went on \ncounting it, The Prophet (ﷺ) asked him, \"Can you recite it by heart?\" he replied, \"Yes.\" The Prophet (ﷺ) said, \n\"Go, I have married this lady to you for the amount of the Qur'an you know by heart.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ امْرَأَةً، جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ لأَهَبَ لَكَ نَفْسِي فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ إِلَيْهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَأْسَهُ، فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ، فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا وَجَدْتُ شَيْئًا‏.‏ قَالَ ‏\"‏ انْظُرْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ وَلَكِنْ هَذَا إِزَارِي ـ قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ ـ فَلَهَا نِصْفُهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى طَالَ مَجْلِسُهُ ثُمَّ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا وَسُورَةُ كَذَا عَدَّهَا قَالَ ‏\"‏ أَتَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5030In-book reference : Book 66, Hadith 52USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 548   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5031,
    "id": 5031,
    "url": "https://sunnah.com/bukhari:5031",
    "bookNumber": 66,
    "hadithNumber": 53,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"The example of the person who knows the Qur'an by heart is like the owner of \ntied camels. If he keeps them tied, he will control them, but if he releases them, they will run away.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ صَاحِبِ الإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5031In-book reference : Book 66, Hadith 53USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 549   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5032,
    "id": 5032,
    "url": "https://sunnah.com/bukhari:5032",
    "bookNumber": 66,
    "hadithNumber": 54,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"It is a bad thing that some of you say, 'I have forgotten such-and-such verse of the \nQur'an,' for indeed, he has been caused (by Allah) to forget it. So you must keep on reciting the Qur'an \nbecause it escapes from the hearts of men faster than camel do.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ بِئْسَ مَا لأَحَدِهِمْ أَنْ يَقُولَ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ نُسِّيَ، وَاسْتَذْكِرُوا الْقُرْآنَ فَإِنَّهُ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنَ النَّعَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5032In-book reference : Book 66, Hadith 54USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 550   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5033,
    "id": 5033,
    "url": "https://sunnah.com/bukhari:5033",
    "bookNumber": 66,
    "hadithNumber": 56,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"Commit yourself to the Qur'an, for by Him in whose Hand is my soul, it is surely more prone to break away than a camel in its bind.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَعَاهَدُوا الْقُرْآنَ فَوَالَّذِي نَفْسِي بِيَدِهِ لَهُوَ أَشَدُّ تَفَصِّيًا مِنَ الإِبِلِ فِي عُقُلِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5033In-book reference : Book 66, Hadith 56USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 552   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5034,
    "id": 5034,
    "url": "https://sunnah.com/bukhari:5034",
    "bookNumber": 66,
    "hadithNumber": 57,
    "narrator": "Narrated `Abdullah bin Mughaffal:",
    "english": "I saw Allah's Messenger (ﷺ) reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَبُو إِيَاسٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ وَهْوَ يَقْرَأُ عَلَى رَاحِلَتِهِ سُورَةَ الْفَتْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5034In-book reference : Book 66, Hadith 57USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 553   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5035,
    "id": 5035,
    "url": "https://sunnah.com/bukhari:5035",
    "bookNumber": 66,
    "hadithNumber": 58,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Those Suras which you people call the Mufassal, are the Muhkam. And Ibn `Abbas said, \"Allah's \nApostle died when I was a boy of ten years, and I had learnt the Muhkam (of the Qur'an).",
    "arabic": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ إِنَّ الَّذِي تَدْعُونَهُ الْمُفَصَّلَ هُوَ الْمُحْكَمُ، قَالَ وَقَالَ ابْنُ عَبَّاسٍ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا ابْنُ عَشْرِ سِنِينَ وَقَدْ قَرَأْتُ الْمُحْكَمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5035In-book reference : Book 66, Hadith 58USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 554   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5036,
    "id": 5036,
    "url": "https://sunnah.com/bukhari:5036",
    "bookNumber": 66,
    "hadithNumber": 59,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Messenger (ﷺ).\" I said to \nhim, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ جَمَعْتُ الْمُحْكَمَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ وَمَا الْمُحْكَمُ قَالَ الْمُفَصَّلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5036In-book reference : Book 66, Hadith 59USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 555   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5037,
    "id": 5037,
    "url": "https://sunnah.com/bukhari:5037",
    "bookNumber": 66,
    "hadithNumber": 60,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy \non him, as he has reminded me of such-and-such Verses of such a Surah.\"",
    "arabic": "حَدَّثَنَا رَبِيعُ بْنُ يَحْيَى، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا هِشَامٌ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يَقْرَأُ فِي الْمَسْجِدِ فَقَالَ ‏\n\"‏ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً مِنْ سُورَةِ كَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5037In-book reference : Book 66, Hadith 60USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 556   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5038,
    "id": 5038,
    "url": "https://sunnah.com/bukhari:5038",
    "bookNumber": 66,
    "hadithNumber": 62,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) heard a man reciting the Qur'an at night, and said, \"May Allah bestow His Mercy on \nhim, as he has reminded me of such-and-such Verses of such-and-such Suras, which I was caused to \nforget.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يَقْرَأُ فِي سُورَةٍ بِاللَّيْلِ فَقَالَ ‏\n\"‏ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً كُنْتُ أُنْسِيتُهَا مِنْ سُورَةِ كَذَا وَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5038In-book reference : Book 66, Hadith 62USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5039,
    "id": 5039,
    "url": "https://sunnah.com/bukhari:5039",
    "bookNumber": 66,
    "hadithNumber": 63,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Why does anyone of the people say, 'I have forgotten such-and-such Verses (of the \nQur'an)?' He, in fact, is caused (by Allah) to forget.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا لأَحَدِهِمْ يَقُولُ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ‏.‏ بَلْ هُوَ نُسِّيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5039In-book reference : Book 66, Hadith 63USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 559   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5040,
    "id": 5040,
    "url": "https://sunnah.com/bukhari:5040",
    "bookNumber": 66,
    "hadithNumber": 64,
    "narrator": "Narrated Abu Mas`ud al-Ansari:",
    "english": "The Prophet (ﷺ) said, \"If one recites the last two verses of Surat al-Baqarah at night, it is sufficient for him (for that night).\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، وَعَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَ بِهِمَا فِي لَيْلَةٍ كَفَتَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5040In-book reference : Book 66, Hadith 64USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 560   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5041,
    "id": 5041,
    "url": "https://sunnah.com/bukhari:5041",
    "bookNumber": 66,
    "hadithNumber": 65,
    "narrator": "Narrated `Umar bin Khattab:",
    "english": "I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan during the lifetime of Allah's Messenger (ﷺ), \nand I listened to his recitation and noticed that he recited it in several ways which Allah's Messenger (ﷺ) had \nnot taught me. So I was on the point of attacking him in the prayer, but I waited till he finished his \nprayer, and then I seized him by the collar and said, \"Who taught you this Surah which I have heard \nyou reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to me.\" I said, \"You are telling a lie; By Allah! \nAllah's Messenger (ﷺ) taught me (in a different way) this very Surah which I have heard you reciting.\" So I \ntook him, leading him to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I heard this person reciting \nSurat-al-Furqan in a way that you did not teach me, and you have taught me Surat-al-Furqan.\" The \nProphet said, \"O Hisham, recite!\" So he recited in the same way as I heard him recite it before. On \nthat Allah's Messenger (ﷺ) said, \"It was revealed to be recited in this way.\" Then Allah's Messenger (ﷺ) said, \n\"Recite, O `Umar!\" So I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed to \nbe recited in this way.\" Allah\" Apostle added, \"The Qur'an has been revealed to be recited in several \ndifferent ways, so recite of it that which is easier for you.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ حَدِيثِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَعَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُمَا سَمِعَا عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَمَعْتُ لِقِرَاءَتِهِ فَإِذَا هُوَ يَقْرَؤُهَا عَلَى حُرُوفٍ كَثِيرَةٍ لَمْ يُقْرِئْنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَكِدْتُ أُسَاوِرُهُ فِي الصَّلاَةِ فَانْتَظَرْتُهُ حَتَّى سَلَّمَ فَلَبَبْتُهُ فَقُلْتُ مَنْ أَقْرَأَكَ هَذِهِ السُّورَةَ الَّتِي سَمِعْتُكَ تَقْرَأُ قَالَ أَقْرَأَنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ لَهُ كَذَبْتَ فَوَاللَّهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَهُوَ أَقْرَأَنِي هَذِهِ السُّورَةَ الَّتِي سَمِعْتُكَ، فَانْطَلَقْتُ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَقُودُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى حُرُوفٍ لَمْ تُقْرِئْنِيهَا وَإِنَّكَ أَقْرَأْتَنِي سُورَةَ الْفُرْقَانِ‏.‏ فَقَالَ ‏\"‏ يَا هِشَامُ اقْرَأْهَا ‏\"‏‏.‏ فَقَرَأَهَا الْقِرَاءَةَ الَّتِي سَمِعْتُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ اقْرَأْ يَا عُمَرُ ‏\"‏‏.‏ فَقَرَأْتُهَا الَّتِي أَقْرَأَنِيهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5041In-book reference : Book 66, Hadith 65USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 561   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5042,
    "id": 5042,
    "url": "https://sunnah.com/bukhari:5042",
    "bookNumber": 66,
    "hadithNumber": 66,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) heard a reciter reciting, the Qur'an in the mosque at night. The Prophet (ﷺ) said, \"May Allah \nbestow His Mercy on him, as he has remind ed me of such-and-such Verses of such and-such Suras, \nwhich I missed!\"",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعَ النَّبِيُّ صلى الله عليه وسلم قَارِئًا يَقْرَأُ مِنَ اللَّيْلِ فِي الْمَسْجِدِ فَقَالَ ‏\n\"‏ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً، أَسْقَطْتُهَا مِنْ سُورَةِ كَذَا وَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5042In-book reference : Book 66, Hadith 66USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 562   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5043,
    "id": 5043,
    "url": "https://sunnah.com/bukhari:5043",
    "bookNumber": 66,
    "hadithNumber": 67,
    "narrator": "Narrated Abu Wail:",
    "english": "We went to `Abdullah in the morning and a man said, \"Yesterday I recited all the Mufassal Suras.\" On \nthat `Abdullah said, \"That is very quick, and we have the (Prophet's) recitation, and I remember very \nwell the recitation of those Suras which the Prophet (ﷺ) used to recite, and they were eighteen Suras from \nthe Mufassal, and two Suras from the Suras that start with Ha Mim.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ غَدَوْنَا عَلَى عَبْدِ اللَّهِ فَقَالَ رَجُلٌ قَرَأْتُ الْمُفَصَّلَ الْبَارِحَةَ‏.‏ فَقَالَ هَذًّا كَهَذِّ الشِّعْرِ، إِنَّا قَدْ سَمِعْنَا الْقِرَاءَةَ وَإِنِّي لأَحْفَظُ الْقُرَنَاءَ الَّتِي كَانَ يَقْرَأُ بِهِنَّ النَّبِيُّ صلى الله عليه وسلم ثَمَانِيَ عَشْرَةَ سُورَةً مِنَ الْمُفَصَّلِ وَسُورَتَيْنِ مِنْ آلِ حم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5043In-book reference : Book 66, Hadith 67USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 563   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5044,
    "id": 5044,
    "url": "https://sunnah.com/bukhari:5044",
    "bookNumber": 66,
    "hadithNumber": 68,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding His (Allah's) Statement:-- 'Move not your tongue concerning (the Qur'an) to make haste \ntherewith.' (75.16) And whenever Gabriel descended to Allah's Messenger (ﷺ) with the Divine Inspiration, \nAllah's Messenger (ﷺ) used to move his tongue and lips, and that used to be hard for him, and one could \neasily recognize that he was being inspired Divinely. So Allah revealed the Verse which occurs in the \nSurah starting with \"I do swear by the Day of Resurrection.' (75.1) i.e. 'Move not your tongue \nconcerning (the Qur'an) to make haste then with. It is for Us to collect it (in your mind) (O \nMuhammad) an give you the ability to recite it 'by heart.' (75.16-17) which means: It is for us to \ncollect it (in your mind) and give you the ability to recite it by heart. And when We have recited it to \nyou (O Muhammad) through Gabriel then follow you its recital. (75.18) means: 'When We reveal it \n(the Qur'an) to you, Listen to it.' for then: It is for Us to explain it and make it clear to you' (75.19) \ni.e. It is up to Us to explain it through your tongue. So, when Gabriel came to him, Allah's Messenger (ﷺ) \nwould listen to him attentively, and as soon as Gabriel left, he would recite the Revelations, as Allah \nhad promised him.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ فِي قَوْلِهِ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ جِبْرِيلُ بِالْوَحْىِ وَكَانَ مِمَّا يُحَرِّكُ بِهِ لِسَانَهُ وَشَفَتَيْهِ فَيَشْتَدُّ عَلَيْهِ وَكَانَ يُعْرَفُ مِنْهُ، فَأَنْزَلَ اللَّهُ الآيَةَ الَّتِي فِي ‏{‏لاَ أُقْسِمُ بِيَوْمِ الْقِيَامَةِ‏}‏ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ * فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ فَإِذَا أَنْزَلْنَاهُ فَاسْتَمِعْ ‏{‏ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ قَالَ إِنَّ عَلَيْنَا أَنْ نُبَيِّنَهُ بِلِسَانِكَ‏.‏ قَالَ وَكَانَ إِذَا أَتَاهُ جِبْرِيلُ أَطْرَقَ، فَإِذَا ذَهَبَ قَرَأَهُ كَمَا وَعَدَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5044In-book reference : Book 66, Hadith 68USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 564   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5045,
    "id": 5045,
    "url": "https://sunnah.com/bukhari:5045",
    "bookNumber": 66,
    "hadithNumber": 69,
    "narrator": "Narrated Qatada:",
    "english": "I asked Anas bin Malik about the recitation of the Prophet. He said, \"He used to pray long (certain \nsounds) very much.",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ الأَزْدِيُّ، حَدَّثَنَا قَتَادَةُ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قِرَاءَةِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ كَانَ يَمُدُّ مَدًّا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5045In-book reference : Book 66, Hadith 69USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 565   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5046,
    "id": 5046,
    "url": "https://sunnah.com/bukhari:5046",
    "bookNumber": 66,
    "hadithNumber": 70,
    "narrator": "Narrated Qatada:",
    "english": "Anas was asked, \"How was the recitation (of the Qur'an) of the Prophet?' He replied, \"It was \ncharacterized by the prolongation of certain sounds.\" He then recited: In the Name of Allah, the Most \nBeneficent, the Most Merciful prolonging the pronunciation of 'In the Name of Allah, 'the most \nBeneficent,' and 'the Most Merciful.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سُئِلَ أَنَسٌ كَيْفَ كَانَتْ قِرَاءَةُ النَّبِيِّ صلى الله عليه وسلم‏.‏ فَقَالَ كَانَتْ مَدًّا‏.‏ ثُمَّ قَرَأَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، يَمُدُّ بِبِسْمِ اللَّهِ، وَيَمُدُّ بِالرَّحْمَنِ، وَيَمُدُّ بِالرَّحِيمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5046In-book reference : Book 66, Hadith 70USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 566   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5047,
    "id": 5047,
    "url": "https://sunnah.com/bukhari:5047",
    "bookNumber": 66,
    "hadithNumber": 71,
    "narrator": "Narrated `Abdullah bin Mughaffal:",
    "english": "I saw the Prophet (ﷺ) reciting (Qur'an) while he was riding on his she camel or camel which was moving, \ncarrying him. He was reciting Surat Fath or part of Surat Fath very softly and in an Attractive \nvibrating tone.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو إِيَاسٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ وَهْوَ عَلَى نَاقَتِهِ ـ أَوْ جَمَلِهِ ـ وَهْىَ تَسِيرُ بِهِ وَهْوَ يَقْرَأُ سُورَةَ الْفَتْحِ أَوْ مِنْ سُورَةِ الْفَتْحِ قِرَاءَةً لَيِّنَةً يَقْرَأُ وَهْوَ يُرَجِّعُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5047In-book reference : Book 66, Hadith 71USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 567   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5048,
    "id": 5048,
    "url": "https://sunnah.com/bukhari:5048",
    "bookNumber": 66,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Musa:",
    "english": "That the Prophet (ﷺ) said to him' \"O Abu Musa! You have been given one of the mazamir (sweet melodious voices) of the family of David.'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ أَبُو بَكْرٍ، حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ، حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ لَهُ ‏\n\"‏ يَا أَبَا مُوسَى لَقَدْ أُوتِيتَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5048In-book reference : Book 66, Hadith 72USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 568   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5049,
    "id": 5049,
    "url": "https://sunnah.com/bukhari:5049",
    "bookNumber": 66,
    "hadithNumber": 73,
    "narrator": "Narrated `Abdullah:",
    "english": "That the Prophet (ﷺ) said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to \nyou while it has been revealed to you?\" He said, \"I like to hear it from others.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ الْقُرْآنَ ‏\"‏‏.‏ قُلْتُ آقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5049In-book reference : Book 66, Hadith 73USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 569   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5050,
    "id": 5050,
    "url": "https://sunnah.com/bukhari:5050",
    "bookNumber": 66,
    "hadithNumber": 74,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "The Prophet (ﷺ) said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Messenger (ﷺ) Shall I recite (the \nQur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The \nWomen), but when I recited the Verse: \n'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) \nas a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and \nbehold! His eyes were overflowing with tears",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ آقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَقَرَأْتُ سُورَةَ النِّسَاءِ حَتَّى أَتَيْتُ إِلَى هَذِهِ الآيَةِ ‏{‏فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاَءِ شَهِيدًا‏}‏ قَالَ ‏\"‏ حَسْبُكَ الآنَ ‏\"‏‏.‏ فَالْتَفَتُّ إِلَيْهِ فَإِذَا عَيْنَاهُ تَذْرِفَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5050In-book reference : Book 66, Hadith 74USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 570   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5051,
    "id": 5051,
    "url": "https://sunnah.com/bukhari:5051",
    "bookNumber": 66,
    "hadithNumber": 75,
    "narrator": "Narrated Sufyan:",
    "english": "Ibn Shubruma said, \"I wanted to see how much of the Qur'an can be enough (to recite in prayer) and I could not find a Surah containing less than three Verses, therefore I said to myself), \"One ought not to recite less than three (Quranic) Verses (in prayer).\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ لِي ابْنُ شُبْرُمَةَ نَظَرْتُ كَمْ يَكْفِي الرَّجُلَ مِنَ الْقُرْآنِ فَلَمْ أَجِدْ سُورَةً أَقَلَّ مِنْ ثَلاَثِ آيَاتٍ، فَقُلْتُ لاَ يَنْبَغِي لأَحَدٍ أَنْ يَقْرَأَ أَقَلَّ مِنْ ثَلاَثِ آيَاتٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5051In-book reference : Book 66, Hadith 75USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 571   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5052,
    "id": 5052,
    "url": "https://sunnah.com/bukhari:5052",
    "bookNumber": 66,
    "hadithNumber": 77,
    "narrator": "Narrated `Abdullah bin `Amr bin Al `As:",
    "english": "My father got me married to a lady of a noble family, and often used to ask my wife about me, and she \nused to reply, \"What a wonderful man he is! He never comes to my bed, nor has he approached me \nsince he married me.\" When this state continued for a long period, my father told the story to the \nProphet who said to my father, \"Let me meet him.\" Then I met him and he asked me, \"How do you \nfast?\" I replied, \"I fast daily,\" He asked, \"How long does it take you to finish the recitation of the \nwhole Qur'an?\" I replied, \"I finish it every night.\" On that he said, \"Fast for three days every month \nand recite the Qur'an (and finish it) in one month.\" I said, \"But I have power to do more than that.\" He \nsaid, \"Then fast for three days per week.\" I said, \"i have the power to do more than that.\" He said, \n\"Therefore, fast the most superior type of fasting, (that is, the fasting of (prophet) David who used to \nfast every alternate day; and finish the recitation of the whole Qur'an In seven days.\" I wish I had \naccepted the permission of Allah's Messenger (ﷺ) as I have become a weak old man. It is said that `Abdullah \nused to recite one-seventh of the Qur'an during the day-time to some of his family members, for he \nused to check his memorization of what he would recite at night during the daytime so that it would be \neasier for him to read at night. And whenever he wanted to gain some strength, he used to give up \nfasting for some days and count those days to fast for a similar period, for he disliked to leave those \nthings which he used to do during the lifetime of the Prophet.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ أَنْكَحَنِي أَبِي امْرَأَةً ذَاتَ حَسَبٍ فَكَانَ يَتَعَاهَدُ كَنَّتَهُ فَيَسْأَلُهَا عَنْ بَعْلِهَا فَتَقُولُ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لَمْ يَطَأْ لَنَا فِرَاشًا وَلَمْ يُفَتِّشْ لَنَا كَنَفًا مُذْ أَتَيْنَاهُ فَلَمَّا طَالَ ذَلِكَ عَلَيْهِ ذَكَرَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ الْقَنِي بِهِ ‏\"‏‏.‏ فَلَقِيتُهُ بَعْدُ فَقَالَ ‏\"‏ كَيْفَ تَصُومُ ‏\"‏‏.‏ قَالَ كُلَّ يَوْمٍ‏.‏ قَالَ ‏\"‏ وَكَيْفَ تَخْتِمُ ‏\"‏‏.‏ قَالَ كُلَّ لَيْلَةً‏.‏ قَالَ ‏\"‏ صُمْ فِي كُلِّ شَهْرٍ ثَلاَثَةً وَاقْرَإِ الْقُرْآنَ فِي كُلِّ شَهْرٍ ‏\"‏‏.‏ قَالَ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ فِي الْجُمُعَةِ ‏\"‏‏.‏ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ أَفْطِرْ يَوْمَيْنِ وَصُمْ يَوْمًا ‏\"‏‏.‏ قَالَ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ صُمْ أَفْضَلَ الصَّوْمِ صَوْمِ دَاوُدَ صِيَامَ يَوْمٍ وَإِفْطَارَ يَوْمٍ وَاقْرَأْ فِي كُلِّ سَبْعِ لَيَالٍ مَرَّةً ‏\"‏‏.‏ فَلَيْتَنِي قَبِلْتُ رُخْصَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَاكَ أَنِّي كَبِرْتُ وَضَعُفْتُ فَكَانَ يَقْرَأُ عَلَى بَعْضِ أَهْلِهِ السُّبْعَ مِنَ الْقُرْآنِ بِالنَّهَارِ وَالَّذِي يَقْرَؤُهُ يَعْرِضُهُ مِنَ النَّهَارِ لِيَكُونَ أَخَفَّ عَلَيْهِ بِاللَّيْلِ وَإِذَا أَرَادَ أَنْ يَتَقَوَّى أَفْطَرَ أَيَّامًا وَأَحْصَى وَصَامَ مِثْلَهُنَّ كَرَاهِيةَ أَنْ يَتْرُكَ شَيْئًا فَارَقَ النَّبِيَّ صلى الله عليه وسلم عَلَيْهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ بَعْضُهُمْ فِي ثَلاَثٍ وَفِي خَمْسٍ وَأَكْثَرُهُمْ عَلَى سَبْعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5052In-book reference : Book 66, Hadith 77USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 572   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5053,
    "id": 5053,
    "url": "https://sunnah.com/bukhari:5053",
    "bookNumber": 66,
    "hadithNumber": 78,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "The Prophet (ﷺ) asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
    "arabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فِي كَمْ تَقْرَأُ الْقُرْآنَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5053In-book reference : Book 66, Hadith 78USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 573   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5054,
    "id": 5054,
    "url": "https://sunnah.com/bukhari:5054",
    "bookNumber": 66,
    "hadithNumber": 79,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "Allah's Messenger (ﷺ) said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power \n(to do more than that).\" Allah's Messenger (ﷺ) said, \"Then finish the recitation of the Qur'an in seven days, \nand do not finish it in less than this period.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى بَنِي زُهْرَةَ عَنْ أَبِي سَلَمَةَ ـ قَالَ وَأَحْسِبُنِي قَالَ ـ سَمِعْتُ أَنَا مِنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَإِ الْقُرْآنَ فِي شَهْرٍ ‏\"‏‏.‏ قُلْتُ إِنِّي أَجِدُ قُوَّةً حَتَّى قَالَ ‏\"‏ فَاقْرَأْهُ فِي سَبْعٍ وَلاَ تَزِدْ عَلَى ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5054In-book reference : Book 66, Hadith 79USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 574   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5055,
    "id": 5055,
    "url": "https://sunnah.com/bukhari:5055",
    "bookNumber": 66,
    "hadithNumber": 80,
    "narrator": "Narrated `Abdullah (bin Mas`ud):",
    "english": "Allah's Messenger (ﷺ) said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa \n(The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a \nwitness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to \nme, \"Stop!\" Thereupon I saw his eyes overflowing with tears.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ يَحْيَى بَعْضُ الْحَدِيثِ عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ لِي النَّبِيُّ صلى الله عليه وسلم‏.‏ ـ حَدَّثَنَا مُسَدَّدٌ عَنْ يَحْيَى عَنْ سُفْيَانَ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ قَالَ الأَعْمَشُ وَبَعْضُ الْحَدِيثِ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ إِبْرَاهِيمَ وَعَنْ أَبِيهِ عَنْ أَبِي الضُّحَى عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قَالَ قُلْتُ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ إِنِّي أَشْتَهِي أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏ قَالَ فَقَرَأْتُ النِّسَاءَ حَتَّى إِذَا بَلَغْتُ ‏{‏فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاَءِ شَهِيدًا‏}‏‏.‏ قَالَ لِي ‏\"‏ كُفَّ ـ أَوْ أَمْسِكْ ـ ‏\"‏‏.‏ فَرَأَيْتُ عَيْنَيْهِ تَذْرِفَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5055In-book reference : Book 66, Hadith 80USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 575   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5056,
    "id": 5056,
    "url": "https://sunnah.com/bukhari:5056",
    "bookNumber": 66,
    "hadithNumber": 81,
    "narrator": "Narrated `Abdullah bin Masud:",
    "english": "The Prophet (ﷺ) said to me, \"Recite Qur'an to me.\" I said to him. \"Shall I recite (it) to you while it has \nbeen revealed to you?\" He said, \"I like to hear it from another person.\"",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قُلْتُ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5056In-book reference : Book 66, Hadith 81USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 576   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5057,
    "id": 5057,
    "url": "https://sunnah.com/bukhari:5057",
    "bookNumber": 66,
    "hadithNumber": 82,
    "narrator": "Narrated `Ali:",
    "english": "I heard the Prophet (ﷺ) saying, \"In the last days (of the world) there will appear young people with foolish \nthoughts and ideas. They will give good talks, but they will go out of Islam as an arrow goes out of its \ngame, their faith will not exceed their throats. So, wherever you find them, kill them, for there will be \na reward for their killers on the Day of Resurrection.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ خَيْثَمَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ عَلِيٌّ رضى الله عنه سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الأَسْنَانِ، سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ، يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5057In-book reference : Book 66, Hadith 82USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5058,
    "id": 5058,
    "url": "https://sunnah.com/bukhari:5058",
    "bookNumber": 66,
    "hadithNumber": 83,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"There will appear some people among you whose prayer will make \nyou look down upon yours, and whose fasting will make you look down upon yours, but they will \nrecite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of \nIslam as an arrow goes out through the game whereupon the archer would examine the arrowhead but \nsee nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see \nnothing, and finally he suspects to find something in the lower part of the arrow.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَخْرُجُ فِيكُمْ قَوْمٌ تَحْقِرُونَ صَلاَتَكُمْ مَعَ صَلاَتِهِمْ، وَصِيَامَكُمْ مَعَ صِيَامِهِمْ، وَعَمَلَكُمْ مَعَ عَمَلِهِمْ، وَيَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينَ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يَنْظُرُ فِي النَّصْلِ فَلاَ يَرَى شَيْئًا، وَيَنْظُرُ فِي الْقِدْحِ فَلاَ يَرَى شَيْئًا، وَيَنْظُرُ فِي الرِّيشِ فَلاَ يَرَى شَيْئًا، وَيَتَمَارَى فِي الْفُوقِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5058In-book reference : Book 66, Hadith 83USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5059,
    "id": 5059,
    "url": "https://sunnah.com/bukhari:5059",
    "bookNumber": 66,
    "hadithNumber": 84,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"The example of a believer who recites the Qur'an and acts on it, like a citron which \ntastes nice and smells nice. And the example of a believer who does not recite the Qur'an but acts on \nit, is like a date which tastes good but has no smell. And the example of a hypocrite who recites the \nQur'an is like a Raihana (sweet basil) which smells good but tastes bitter And the example of a \nhypocrite who does not recite the Qur'an is like a colocynth which tastes bitter and has a bad smell.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُؤْمِنُ الَّذِي يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالأُتْرُجَّةِ، طَعْمُهَا طَيِّبٌ وَرِيحُهَا طَيِّبٌ، وَالْمُؤْمِنُ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالتَّمْرَةِ، طَعْمُهَا طَيِّبٌ وَلاَ رِيحَ لَهَا، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ كَالرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَالْحَنْظَلَةِ، طَعْمُهَا مُرٌّ ـ أَوْ خَبِيثٌ ـ وَرِيحُهَا مُرٌّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5059In-book reference : Book 66, Hadith 84USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 579   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5060,
    "id": 5060,
    "url": "https://sunnah.com/bukhari:5060",
    "bookNumber": 66,
    "hadithNumber": 85,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if \nyou have any difference of opinion (as regards to its interpretation and meaning) then you should stop \nreciting it (for the time being).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ قُلُوبُكُمْ، فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5060In-book reference : Book 66, Hadith 85USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 580   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5061,
    "id": 5061,
    "url": "https://sunnah.com/bukhari:5061",
    "bookNumber": 66,
    "hadithNumber": 86,
    "narrator": "Narrated Jundub:",
    "english": "The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but \nwhen you have any difference of opinion (as regards its interpretation and meaning) then you should \nstop reciting it (for the time being)'",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ جُنْدَبٍ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏ تَابَعَهُ الْحَارِثُ بْنُ عُبَيْدٍ وَسَعِيدُ بْنُ زَيْدٍ عَنْ أَبِي عِمْرَانَ وَلَمْ يَرْفَعْهُ حَمَّادُ بْنُ سَلَمَةَ وَأَبَانُ‏.‏ وَقَالَ غُنْدَرٌ عَنْ شُعْبَةَ عَنْ أَبِي عِمْرَانَ سَمِعْتُ جُنْدَبًا قَوْلَهُ‏.‏ وَقَالَ ابْنُ عَوْنٍ عَنْ أَبِي عِمْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ عُمَرَ قَوْلَهُ، وَجُنْدَبٌ أَصَحُّ وَأَكْثَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5061In-book reference : Book 66, Hadith 86USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 581   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5062,
    "id": 5062,
    "url": "https://sunnah.com/bukhari:5062",
    "bookNumber": 66,
    "hadithNumber": 87,
    "narrator": "Narrated `Abdullah:",
    "english": "That he heard a man reciting a Quranic Verse which he had heard the Prophet (ﷺ) reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet (ﷺ) said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet (ﷺ) further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنِ النَّزَّالِ بْنِ سَبْرَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَجُلاً، يَقْرَأُ آيَةً، سَمِعَ النَّبِيَّ صلى الله عليه وسلم خِلاَفَهَا، فَأَخَذْتُ بِيَدِهِ فَانْطَلَقْتُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ كِلاَكُمَا مُحْسِنٌ فَاقْرَآ ـ أَكْبَرُ عِلْمِي قَالَ ـ فَإِنَّ مَنْ كَانَ قَبْلَكُمُ اخْتَلَفُوا فَأَهْلَكَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5062In-book reference : Book 66, Hadith 87USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5063,
    "id": 5063,
    "url": "https://sunnah.com/bukhari:5063",
    "bookNumber": 67,
    "hadithNumber": 1,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A group of three men came to the houses of the wives of the Prophet (ﷺ) asking how the Prophet (ﷺ) \nworshipped (Allah), and when they were informed about that, they considered their worship \ninsufficient and said, \"Where are we from the Prophet (ﷺ) as his past and future sins have been forgiven.\" \nThen one of them said, \"I will offer the prayer throughout the night forever.\" The other said, \"I will \nfast throughout the year and will not break my fast.\" The third said, \"I will keep away from the \nwomen and will not marry forever.\" Allah's Messenger (ﷺ) came to them and said, \"Are you the same people \nwho said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I \nfast and break my fast, I do sleep and I also marry women. So he who does not follow my tradition in \nreligion, is not from me (not one of my followers).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا حُمَيْدُ بْنُ أَبِي حُمَيْدٍ الطَّوِيلُ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ جَاءَ ثَلاَثَةُ رَهْطٍ إِلَى بُيُوتِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم يَسْأَلُونَ عَنْ عِبَادَةِ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا أُخْبِرُوا كَأَنَّهُمْ تَقَالُّوهَا فَقَالُوا وَأَيْنَ نَحْنُ مِنَ النَّبِيِّ صلى الله عليه وسلم قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ قَالَ أَحَدُهُمْ أَمَّا أَنَا فَإِنِّي أُصَلِّي اللَّيْلَ أَبَدًا‏.‏ وَقَالَ آخَرُ أَنَا أَصُومُ الدَّهْرَ وَلاَ أُفْطِرُ‏.‏ وَقَالَ آخَرُ أَنَا أَعْتَزِلُ النِّسَاءَ فَلاَ أَتَزَوَّجُ أَبَدًا‏.‏ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَنْتُمُ الَّذِينَ قُلْتُمْ كَذَا وَكَذَا أَمَا وَاللَّهِ إِنِّي لأَخْشَاكُمْ لِلَّهِ وَأَتْقَاكُمْ لَهُ، لَكِنِّي أَصُومُ وَأُفْطِرُ، وَأُصَلِّي وَأَرْقُدُ وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5063In-book reference : Book 67, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 1   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5064,
    "id": 5064,
    "url": "https://sunnah.com/bukhari:5064",
    "bookNumber": 67,
    "hadithNumber": 2,
    "narrator": "Narrated 'Urwa:",
    "english": "that he asked `Aisha about the Statement of Allah: 'If you fear that you shall not be able to deal justly \nwith the orphan girls, then marry (other) women of your choice, two or three or four; but if you fear \nthat you shall not be able to deal justly (with them), then only one, or (the captives) that your right \nhands possess. That will be nearer to prevent you from doing injustice.' (4.3) `Aisha said, \"O my \nnephew! (This Verse has been revealed in connection with) an orphan girl under the guardianship of \nher guardian who is attracted by her wealth and beauty and intends to marry her with a Mahr less than \nwhat other women of her standard deserve. So they (such guardians) have been forbidden to marry \nthem unless they do justice to them and give them their full Mahr, and they are ordered to marry other \nwomen instead of them.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، سَمِعَ حَسَّانَ بْنَ إِبْرَاهِيمَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِهِ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ فَإِنْ خِفْتُمْ أَنْ لاَ تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ذَلِكَ أَدْنَى أَنْ لاَ تَعُولُوا‏}‏‏.‏ قَالَتْ يَا ابْنَ أُخْتِي، الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا، يُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ صَدَاقِهَا، فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فَيُكْمِلُوا الصَّدَاقَ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5064In-book reference : Book 67, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 2   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5065,
    "id": 5065,
    "url": "https://sunnah.com/bukhari:5065",
    "bookNumber": 67,
    "hadithNumber": 3,
    "narrator": "Narrated 'Alqama:",
    "english": "While I was with `Abdullah, `Uthman met him at Mina and said, \"O Abu `Abdur-Rahman ! I have \nsomething to say to you.\" So both of them went aside and `Uthman said, \"O Abu `Abdur-Rah. man! \nShall we marry you to a virgin who will make you remember your past days?\" When `Abdullah felt \nthat he was not in need of that, he beckoned me (to join him) saying, \"O 'Alqama!\" Then I heard him \nsaying (in reply to `Uthman), \"As you have said that, (I tell you that) the Prophet (ﷺ) once said to us, 'O \nyoung people! Whoever among you is able to marry, should marry, and whoever is not able to marry, \nis recommended to fast, as fasting diminishes his sexual power.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ فَلَقِيَهُ عُثْمَانُ بِمِنًى فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ لِي إِلَيْكَ حَاجَةً‏.‏ فَخَلَيَا فَقَالَ عُثْمَانُ هَلْ لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فِي أَنْ نُزَوِّجَكَ بِكْرًا، تُذَكِّرُكَ مَا كُنْتَ تَعْهَدُ، فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَ لَهُ حَاجَةٌ إِلَى هَذَا أَشَارَ إِلَىَّ فَقَالَ يَا عَلْقَمَةُ، فَانْتَهَيْتُ إِلَيْهِ وَهْوَ يَقُولُ أَمَا لَئِنْ قُلْتَ ذَلِكَ لَقَدْ قَالَ لَنَا النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5065In-book reference : Book 67, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 3   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5066,
    "id": 5066,
    "url": "https://sunnah.com/bukhari:5066",
    "bookNumber": 67,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah:",
    "english": "We were with the Prophet (ﷺ) while we were young and had no wealth. So Allah's Messenger (ﷺ) said, \n\"O young people! Whoever among you can marry, should marry, because it helps him lower his gaze \nand guard his modesty (i.e. his private parts from committing illegal sexual intercourse etc.), and \nwhoever is not able to marry, should fast, as fasting diminishes his sexual power.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عُمَارَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلْتُ مَعَ عَلْقَمَةَ وَالأَسْوَدِ عَلَى عَبْدِ اللَّهِ فَقَالَ عَبْدُ اللَّهِ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم شَبَابًا لاَ نَجِدُ شَيْئًا فَقَالَ لَنَا رَسُولُ اللَّهُ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5066In-book reference : Book 67, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 4   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5067,
    "id": 5067,
    "url": "https://sunnah.com/bukhari:5067",
    "bookNumber": 67,
    "hadithNumber": 5,
    "narrator": "Narrated 'Ata:",
    "english": "We presented ourselves along with Ibn `Abbas at the funeral procession of Maimuna at a place called \nSarif. Ibn `Abbas said, \"This is the wife of the Prophet (ﷺ) so when you lift her bier, do not Jerk it or \nshake it much, but walk smoothly because the Prophet (ﷺ) had nine wives and he used to observe the \nnight turns with eight of them, and for one of them there was no night turn.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ بِسَرِفَ، فَقَالَ ابْنُ عَبَّاسٍ هَذِهِ زَوْجَةُ النَّبِيِّ صلى الله عليه وسلم فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلاَ تُزَعْزِعُوهَا وَلاَ تُزَلْزِلُوهَا وَارْفُقُوا، فَإِنَّهُ كَانَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم تِسْعٌ، كَانَ يَقْسِمُ لِثَمَانٍ وَلاَ يَقْسِمُ لِوَاحِدَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5067In-book reference : Book 67, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 5   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5068,
    "id": 5068,
    "url": "https://sunnah.com/bukhari:5068",
    "bookNumber": 67,
    "hadithNumber": 6,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to go round (have sexual relations with) all his wives in one night, and he had nine wives.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي لَيْلَةٍ وَاحِدَةٍ، وَلَهُ تِسْعُ نِسْوَةٍ‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5068In-book reference : Book 67, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 6   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5069,
    "id": 5069,
    "url": "https://sunnah.com/bukhari:5069",
    "bookNumber": 67,
    "hadithNumber": 7,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Abbas asked me, \"Are you married?\" I replied, \"No.\" He said, \"Marry, for the best person of this \n(Muslim) nation (i.e., Muhammad) of all other Muslims, had the largest number of wives.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْحَكَمِ الأَنْصَارِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ رَقَبَةَ، عَنْ طَلْحَةَ الْيَامِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ هَلْ تَزَوَّجْتَ قُلْتُ لاَ‏.‏ قَالَ فَتَزَوَّجْ فَإِنَّ خَيْرَ هَذِهِ الأُمَّةِ أَكْثَرُهَا نِسَاءً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5069In-book reference : Book 67, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 7   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5070,
    "id": 5070,
    "url": "https://sunnah.com/bukhari:5070",
    "bookNumber": 67,
    "hadithNumber": 8,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "The Prophet (ﷺ) said, \"The rewards (of deeds) are according to the intention, and everybody will get the \nreward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his \nemigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a \nwoman, then his emigration was for the thing for what he emigrated for.\" (1)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْعَمَلُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5070In-book reference : Book 67, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 8   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5071,
    "id": 5071,
    "url": "https://sunnah.com/bukhari:5071",
    "bookNumber": 67,
    "hadithNumber": 9,
    "narrator": "Narrated Ibn Masud:",
    "english": "We used to fight in the holy battles in the company of the Prophet (ﷺ) and we had no wives with us. So \nwe said, \"O Allah's Messenger (ﷺ)! Shall we get castrated?\" The Prophet (ﷺ) forbade us to do so.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي قَيْسٌ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ لَنَا نِسَاءٌ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5071In-book reference : Book 67, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 9   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5072,
    "id": 5072,
    "url": "https://sunnah.com/bukhari:5072",
    "bookNumber": 67,
    "hadithNumber": 10,
    "narrator": "Narrated Anas bin Malik:",
    "english": "`Abdur-Rahman bin `Auf came (from Mecca to Medina) and the Prophet (ﷺ) made a bond of brotherhood \nbetween him and Sa`d bin Ar-Rabi` Al-Ansari. Al-Ansari had two wives, so he suggested that `Abdur- \nRahman take half, his wives and property. `Abdur-Rahman replied, \"May Allah bless you with your \nwives and property. Kindly show me the market.\" So `Abdur-Rahman went to the market and gained \n(in bargains) some dried yoghurt and some butter. After a few days the Prophet (ﷺ) saw `Abdur-Rahman \nwith some yellow stains on his clothes and asked him, \"What is that, O `Abdur-Rahman?\" He replied, \n\"I had married an Ansari woman.\" The Prophet (ﷺ) asked, \"How much Mahr did you give her?\" He \nreplied, \"The weight of one (date) stone of gold.\" The Prophet (ﷺ) said, \"Offer a banquet, even with one \nsheep.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ حُمَيْدٍ الطَّوِيلِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ وَعِنْدَ الأَنْصَارِيِّ امْرَأَتَانِ، فَعَرَضَ عَلَيْهِ أَنْ يُنَاصِفَهُ أَهْلَهُ وَمَالَهُ فَقَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ دُلُّونِي عَلَى السُّوقِ، فَأَتَى السُّوقَ فَرَبِحَ شَيْئًا مِنْ أَقِطٍ وَشَيْئًا مِنْ سَمْنٍ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم بَعْدَ أَيَّامٍ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ فَقَالَ ‏\"‏ مَهْيَمْ يَا عَبْدَ الرَّحْمَنِ ‏\"‏‏.‏ فَقَالَ تَزَوَّجْتُ أَنْصَارِيَّةً‏.‏ قَالَ ‏\"‏ فَمَا سُقْتَ ‏\"‏‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5072In-book reference : Book 67, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 10   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5073,
    "id": 5073,
    "url": "https://sunnah.com/bukhari:5073",
    "bookNumber": 67,
    "hadithNumber": 11,
    "narrator": "Narrated Sa`d bin Abi Waqqas:",
    "english": "Allah's Messenger (ﷺ) forbade `Uthman bin Maz'un to abstain from marrying (and other pleasures) and if he \nhad allowed him, we would have gotten ourselves castrated.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ رَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ، وَلَوْ أَذِنَ لَهُ لاَخْتَصَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5073In-book reference : Book 67, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 11   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5074,
    "id": 5074,
    "url": "https://sunnah.com/bukhari:5074",
    "bookNumber": 67,
    "hadithNumber": 12,
    "narrator": "Narrated Sa`d bin Abi Waqqas:",
    "english": "The Prophet (ﷺ) prevented `Uthman bin Mazun from that (not marrying), and had he allowed him, we \nwould have got ourselves castrated.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ لَقَدْ رَدَّ ذَلِكَ ـ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ـ عَلَى عُثْمَانَ، وَلَوْ أَجَازَ لَهُ التَّبَتُّلَ لاَخْتَصَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5074In-book reference : Book 67, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 12   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5075,
    "id": 5075,
    "url": "https://sunnah.com/bukhari:5075",
    "bookNumber": 67,
    "hadithNumber": 13,
    "narrator": "Narrated 'Abdullah:",
    "english": "We used to participate in the holy battles led by Allah's Messenger (ﷺ) and \n     we had nothing (no wives) with us. So we said, \"Shall we get ourselves\n     castrated?\" He forbade us that and then allowed us to marry women with\n     a temporary contract (2) and recited to us: -- 'O you who believe ! \n     Make not unlawful the good things which Allah has made lawful for you,\n     but commit no transgression.' (5.87)",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ قَالَ عَبْدُ اللَّهِ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَيْسَ لَنَا شَىْءٌ فَقُلْنَا أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ، ثُمَّ قَرَأَ عَلَيْنَا ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلاَ تَعْتَدُوا إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5075In-book reference : Book 67, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 13   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5076,
    "id": 5076,
    "url": "https://sunnah.com/bukhari:5076",
    "bookNumber": 67,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Huraira:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! I am a young man and I am afraid that I \n     may commit illegal sexual intercourse and I cannot afford to marry.\" \n     He kept silent, and then repeated my question once again, but he kept \n     silent. I said the same (for the third time) and he remained silent. \n     Then repeated my question (for the fourth time), and only then the \n     Prophet said, \"O Abu Huraira! The pen has dried after writing what you\n     are going to confront. So (it does not matter whether you) get \n     yourself castrated or not.\"",
    "arabic": "وَقَالَ أَصْبَغُ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ شَابٌّ وَأَنَا أَخَافُ عَلَى نَفْسِي الْعَنَتَ وَلاَ أَجِدُ مَا أَتَزَوَّجُ بِهِ النِّسَاءَ، فَسَكَتَ عَنِّي، ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا هُرَيْرَةَ جَفَّ الْقَلَمُ بِمَا أَنْتَ لاَقٍ، فَاخْتَصِ عَلَى ذَلِكَ أَوْ ذَرْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5076In-book reference : Book 67, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 13   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5077,
    "id": 5077,
    "url": "https://sunnah.com/bukhari:5077",
    "bookNumber": 67,
    "hadithNumber": 15,
    "narrator": "Narrated `Aisha:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! Suppose you landed in a valley where there is a tree of which something \nhas been eaten and then you found trees of which nothing has been eaten, of which tree would you let \nyour camel graze?\" He said, \"(I will let my camel graze) of the one of which nothing has been eaten \nbefore.\" (The sub-narrator added: `Aisha meant that Allah's Messenger (ﷺ) had not married a virgin besides \nherself .)",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ نَزَلْتَ وَادِيًا وَفِيهِ شَجَرَةٌ قَدْ أُكِلَ مِنْهَا، وَوَجَدْتَ شَجَرًا لَمْ يُؤْكَلْ مِنْهَا، فِي أَيِّهَا كُنْتَ تُرْتِعُ بَعِيرَكَ قَالَ ‏\n\"‏ فِي الَّذِي لَمْ يُرْتَعْ مِنْهَا ‏\"‏‏.‏ تَعْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَتَزَوَّجْ بِكْرًا غَيْرَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5077In-book reference : Book 67, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 14   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5078,
    "id": 5078,
    "url": "https://sunnah.com/bukhari:5078",
    "bookNumber": 67,
    "hadithNumber": 16,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said (to me), \"You have been shown to me twice in (my) dreams. A man was carrying \nyou in a silken cloth and said to me, 'This is your wife.' I uncovered it; and behold, it was you. I said \nto myself, 'If this dream is from Allah, He will cause it to come true.' \"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ، إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةِ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ، فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ، فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5078In-book reference : Book 67, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 15   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5079,
    "id": 5079,
    "url": "https://sunnah.com/bukhari:5079",
    "bookNumber": 67,
    "hadithNumber": 17,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "While we were returning from a Ghazwa (Holy Battle) with the Prophet, I started driving my camel \nfast, as it was a lazy camel A rider came behind me and pricked my camel with a spear he had with \nhim, and then my camel started running as fast as the best camel you may see. Behold! The rider was \nthe Prophet (ﷺ) himself. He said, 'What makes you in such a hurry?\" I replied, I am newly married \" He \nsaid, \"Did you marry a virgin or a matron? I replied, \"A matron.\" He said, \"Why didn't you marry a \nyoung girl so that you may play with her and she with you?\" When we were about to enter (Medina), \nthe Prophet (ﷺ) said, \"Wait so that you may enter (Medina) at night so that the lady of unkempt hair may \ncomb her hair and the one whose husband has been absent may shave her pubic region.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا سَيَّارٌ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَفَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ غَزْوَةٍ فَتَعَجَّلْتُ عَلَى بَعِيرٍ لِي قَطُوفٍ، فَلَحِقَنِي رَاكِبٌ مِنْ خَلْفِي، فَنَخَسَ بَعِيرِي بِعَنَزَةٍ كَانَتْ مَعَهُ، فَانْطَلَقَ بَعِيرِي كَأَجْوَدِ مَا أَنْتَ رَاءٍ مِنَ الإِبِلِ، فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا يُعْجِلُكَ ‏\"‏‏.‏ قُلْتُ كُنْتُ حَدِيثَ عَهْدٍ بِعُرُسٍ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبٌ‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قَالَ فَلَمَّا ذَهَبْنَا لِنَدْخُلَ قَالَ ‏\"‏ أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلاً ـ أَىْ عِشَاءً ـ لِكَىْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5079In-book reference : Book 67, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 16   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5080,
    "id": 5080,
    "url": "https://sunnah.com/bukhari:5080",
    "bookNumber": 67,
    "hadithNumber": 18,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "When I got married, Allah's Messenger (ﷺ) said to me, \"What type of lady have you married?\" I replied, \"I \nhave married a matron' He said, \"Why, don't you have a liking for the virgins and for fondling them?\" \nJabir also said: Allah's Messenger (ﷺ) said, \"Why didn't you marry a young girl so that you might play with \nher and she with you?'",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَارِبٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، رضى الله عنهما يَقُولُ تَزَوَّجْتُ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَزَوَّجْتَ ‏\"‏‏.‏ فَقُلْتُ تَزَوَّجْتُ ثَيِّبًا‏.‏ فَقَالَ ‏\"‏ مَا لَكَ وَلِلْعَذَارَى وَلِعَابِهَا ‏\"‏‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمْرِو بْنِ دِينَارٍ فَقَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5080In-book reference : Book 67, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 17   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5081,
    "id": 5081,
    "url": "https://sunnah.com/bukhari:5081",
    "bookNumber": 67,
    "hadithNumber": 19,
    "narrator": "Narrated 'Urwa:",
    "english": "The Prophet (ﷺ) asked Abu Bakr for `Aisha's hand in marriage. Abu Bakr said \"But I am your brother.\" \nThe Prophet (ﷺ) said, \"You are my brother in Allah's religion and His Book, but she (Aisha) is lawful for \nme to marry.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ عَائِشَةَ إِلَى أَبِي بَكْرٍ فَقَالَ لَهُ أَبُو بَكْرٍ إِنَّمَا أَنَا أَخُوكَ، فَقَالَ ‏\n\"‏ أَنْتَ أَخِي فِي دِينِ اللَّهِ وَكِتَابِهِ وَهْىَ لِي حَلاَلٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5081In-book reference : Book 67, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 18   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5082,
    "id": 5082,
    "url": "https://sunnah.com/bukhari:5082",
    "bookNumber": 67,
    "hadithNumber": 20,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The best women are the riders of the camels and the righteous among the women \nof Quraish. They are the kindest women to their children in their childhood and the more careful \nwomen of the property of their husbands.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ صَالِحُو نِسَاءِ قُرَيْشٍ، أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5082In-book reference : Book 67, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5083,
    "id": 5083,
    "url": "https://sunnah.com/bukhari:5083",
    "bookNumber": 67,
    "hadithNumber": 21,
    "narrator": "Narrated Abu Burda's father:",
    "english": "Allah's Messenger (ﷺ) said, any man who has a slave girl whom he educates properly, teaches good manners, \nmanumits and marries her, will get a double reward And if any man of the people of the Scriptures \nbelieves in his own prophet and then believes in me too, he will (also) get a double reward And any \nslave who fulfills his duty to his master and to his Lord, will (also) get a double reward.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا صَالِحُ بْنُ صَالِحٍ الْهَمْدَانِيُّ، حَدَّثَنَا الشَّعْبِيُّ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا رَجُلٍ كَانَتْ عِنْدَهُ وَلِيدَةٌ فَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، وَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ، وَأَيُّمَا رَجُلٍ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِي فَلَهُ أَجْرَانِ، وَأَيُّمَا مَمْلُوكٍ أَدَّى حَقَّ مَوَالِيهِ وَحَقَّ رَبِّهِ فَلَهُ أَجْرَانِ ‏\"‏‏.‏ قَالَ الشَّعْبِيُّ خُذْهَا بِغَيْرِ شَىْءٍ قَدْ كَانَ الرَّجُلُ يَرْحَلُ فِيمَا دُونَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ أَبُو بَكْرٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَعْتَقَهَا ثُمَّ أَصْدَقَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5083In-book reference : Book 67, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 20   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5084,
    "id": 5084,
    "url": "https://sunnah.com/bukhari:5084",
    "bookNumber": 67,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said: Abraham did not tell lies except three. (One of them was) when Abraham passed by \na tyrant and (his wife) Sara was accompanying him (Abu Huraira then mentioned the whole narration \nand said:) (The tyrant) gave her Hajar. Sara said, \"Allah saved me from the hands of the Kafir (i.e. \ninfidel) and gave me Hajar to serve me.\" (Abu Huraira added:) That (Hajar) is your mother, O Banu \nMa'-As-Sama' (i.e., the Arabs).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ ‏{‏قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏}‏ ‏\n\"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ إِلاَّ ثَلاَثَ كَذَبَاتٍ بَيْنَمَا إِبْرَاهِيمُ مَرَّ بِجَبَّارٍ وَمَعَهُ سَارَةُ ـ فَذَكَرَ الْحَدِيثَ ـ فَأَعْطَاهَا هَاجَرَ قَالَتْ كَفَّ اللَّهُ يَدَ الْكَافِرِ وَأَخْدَمَنِي آجَرَ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5084In-book reference : Book 67, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 21   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5085,
    "id": 5085,
    "url": "https://sunnah.com/bukhari:5085",
    "bookNumber": 67,
    "hadithNumber": 23,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) stayed for three days between Khaibar and Medina, and there he consummated his \nmarriage to Safiyya bint Huyai. I invited the Muslims to the wedding banquet in which neither meat \nnor bread was offered. He ordered for leather dining-sheets to be spread, and dates, dried yoghurt and \nbutter were laid on it, and that was the Prophet's wedding banquet. The Muslims wondered, \"Is she \n(Saffiyya) considered as his wife or his slave girl?\" Then they said, \"If he orders her to veil herself, \nshe will be one of the mothers of the Believers; but if he does not order her to veil herself, she will be \na slave girl. So when the Prophet (ﷺ) proceeded from there, he spared her a space behind him (on his shecamel) \nand put a screening veil between her and the people.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلاَثًا يُبْنَى عَلَيْهِ بِصَفِيَّةَ بِنْتِ حُيَىٍّ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلاَ لَحْمٍ، أُمِرَ بِالأَنْطَاعِ فَأَلْقَى فِيهَا مِنَ التَّمْرِ وَالأَقِطِ وَالسَّمْنِ فَكَانَتْ وَلِيمَتَهُ، فَقَالَ الْمُسْلِمُونَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ أَوْ مِمَّا مَلَكَتْ يَمِينُهُ، فَقَالُوا إِنْ حَجَبَهَا فَهْىَ مِنْ أُمَّهَاتِ الْمُؤْمِنِينَ، وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ مِمَّا مَلَكَتْ يَمِينُهُ، فَلَمَّا ارْتَحَلَ وَطَّى لَهَا خَلْفَهُ وَمَدَّ الْحِجَابَ بَيْنَهَا وَبَيْنَ النَّاسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5085In-book reference : Book 67, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 22   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5086,
    "id": 5086,
    "url": "https://sunnah.com/bukhari:5086",
    "bookNumber": 67,
    "hadithNumber": 24,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) manumitted Safiyya and regarded her manumission as her Mahr.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، وَشُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ، وَجَعَلَ عِتْقَهَا صَدَاقَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5086In-book reference : Book 67, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 23   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5087,
    "id": 5087,
    "url": "https://sunnah.com/bukhari:5087",
    "bookNumber": 67,
    "hadithNumber": 25,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
    "english": "A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to give you myself in \nmarriage (without Mahr).\" Allah's Messenger (ﷺ) looked at her. He looked at her carefully and fixed his \nglance on her and then lowered his head. When the lady saw that he did not say anything, she sat \ndown. A man from his companions got up and said, \"O Allah's Messenger (ﷺ)! If you are not in need of her, \nthen marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to offer?\" The man said, \"No, by \nAllah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said (to him), \"Go to your family and see if you have \nsomething.\" The man went and returned, saying, \"No, by Allah, I have not found anything.\" Allah's \nApostle said, \"(Go again) and look for something, even if it is an iron ring.\" He went again and \nreturned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I could not find even an iron ring, but this is my \nIzar (waist sheet).\" He had no rida. He added, \"I give half of it to her.\" Allah's Messenger (ﷺ) said, \"What \nwill she do with your Izar? If you wear it, she will be naked, and if she wears it, you will be naked.\" \nSo that man sat down for a long while and then got up (to depart). When Allah's Messenger (ﷺ) saw him \ngoing, he ordered that he be called back. When he came, the Prophet (ﷺ) said, \"How much of the Qur'an \ndo you know?\" He said, \"I know such Sura and such Sura,\" counting them. The Prophet (ﷺ) said, \"Do you \nknow them by heart?\" He replied, \"Yes.\" The Prophet (ﷺ) said, \"Go, I marry her to you for that much of \nthe Qur'an which you have.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ أَهَبُ لَكَ نَفْسِي قَالَ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ وَهَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ وَلَكِنْ هَذَا إِزَارِي ـ قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ فَلَهَا نِصْفُهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا عَدَّدَهَا‏.‏ فَقَالَ ‏\"‏ تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5087In-book reference : Book 67, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 24   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5088,
    "id": 5088,
    "url": "https://sunnah.com/bukhari:5088",
    "bookNumber": 67,
    "hadithNumber": 26,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Hudhaifa bin `Utba bin Rabi`a bin `Abdi Shams who had witnessed the battle of Badr along with \nthe Prophet (ﷺ) adopted Salim as his son, to whom he married his niece, Hind bint Al-Walid bin `Utba bin \nRabi`a; and Salim was the freed slave of an Ansar woman, just as the Prophet (ﷺ) had adopted Zaid as his \nson. It was the custom in the Pre-lslamic Period that if somebody adopted a boy, the people would call \nhim the son of the adoptive father and he would be the latter's heir. But when Allah revealed the \nDivine Verses: 'Call them by (the names of) their fathers . . . your freed-slaves,' (33.5) the adopted \npersons were called by their fathers' names. The one whose father was not known, would be regarded \nas a Maula and your brother in religion. Later on Sahla bint Suhail bin `Amr Al-Quraishi Al-`Amiri-- \nand she was the wife of Abu- Hudhaifa bin `Utba--came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nWe used to consider Salim as our (adopted) son, and now Allah has revealed what you know \n(regarding adopted sons).\" The sub-narrator then mentioned the rest of the narration.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ،، وَكَانَ، مِمَّنْ شَهِدَ بَدْرًا مَعَ النَّبِيِّ صلى الله عليه وسلم تَبَنَّى سَالِمًا، وَأَنْكَحَهُ بِنْتَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهْوَ مَوْلًى لاِمْرَأَةٍ مِنَ الأَنْصَارِ، كَمَا تَبَنَّى النَّبِيُّ صلى الله عليه وسلم زَيْدًا، وَكَانَ مَنْ تَبَنَّى رَجُلاً فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوَرِثَ مِنْ مِيرَاثِهِ حَتَّى أَنْزَلَ اللَّهُ ‏{‏ادْعُوهُمْ لآبَائِهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏وَمَوَالِيكُمْ‏}‏ فَرُدُّوا إِلَى آبَائِهِمْ، فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ، فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ ـ وَهْىَ امْرَأَةُ أَبِي حُذَيْفَةَ ـ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَقَدْ أَنْزَلَ اللَّهُ فِيهِ مَا قَدْ عَلِمْتَ فَذَكَرَ الْحَدِيثَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5088In-book reference : Book 67, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 25   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5089,
    "id": 5089,
    "url": "https://sunnah.com/bukhari:5089",
    "bookNumber": 67,
    "hadithNumber": 27,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) entered upon Dubaa bint Az-Zubair and said to her, \"Do you have a desire to perform \nthe Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate \nsomething by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am \nunable to go further).\" She was the wife of Al-Miqdad bin Al-Aswad.",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا ‏\"‏ لَعَلَّكِ أَرَدْتِ الْحَجَّ ‏\"‏‏.‏ قَالَتْ وَاللَّهِ لاَ أَجِدُنِي إِلاَّ وَجِعَةً‏.‏ فَقَالَ لَهَا ‏\"‏ حُجِّي وَاشْتَرِطِي، قُولِي اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي ‏\"‏‏.‏ وَكَانَتْ تَحْتَ الْمِقْدَادِ بْنِ الأَسْوَدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5089In-book reference : Book 67, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 26   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5090,
    "id": 5090,
    "url": "https://sunnah.com/bukhari:5090",
    "bookNumber": 67,
    "hadithNumber": 28,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A woman is married for four things, i.e., her wealth, her family status, her beauty \nand her religion. So you should marry the religious woman (otherwise) you will be a losers.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَجَمَالِهَا وَلِدِينِهَا، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5090In-book reference : Book 67, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 27   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5091,
    "id": 5091,
    "url": "https://sunnah.com/bukhari:5091",
    "bookNumber": 67,
    "hadithNumber": 29,
    "narrator": "Narrated Sahl:",
    "english": "A man passed by Allah's Messenger (ﷺ) and Allah s Apostle asked (his companions) \"What do you say about \nthis (man)?\" They replied \"If he asks for a lady's hand, he ought to be given her in marriage; and if he \nintercedes (for someone) his intercessor should be accepted; and if he speaks, he should be listened \nto.\" Allah's Messenger (ﷺ) kept silent, and then a man from among the poor Muslims passed by, an Allah's \nApostle asked (them) \"What do you say about this man?\" They replied, \"If he asks for a lady's hand in \nmarriage he does not deserve to be married, and he intercedes (for someone), his intercession should \nnot be accepted; And if he speaks, he should not be listened to.' Allah's Messenger (ﷺ) said, \"This poor man \nis better than so many of the first as filling the earth.'",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ، وَإِنْ قَالَ أَنْ يُسْتَمَعَ‏.‏ قَالَ ثُمَّ سَكَتَ فَمَرَّ رَجُلٌ مِنَ فُقَرَاءِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْتَمَعَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5091In-book reference : Book 67, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 28   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5092,
    "id": 5092,
    "url": "https://sunnah.com/bukhari:5092",
    "bookNumber": 67,
    "hadithNumber": 30,
    "narrator": "Narrated 'Urwa:",
    "english": "that he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphans (4.3) She said, \"O my nephew! This Verse refers to the orphan girl who is under the \nguardianship of her guardian who likes her beauty and wealth and wishes to (marry her and) curtails \nher Mahr. Such guardians have been forbidden to marry them unless they do justice by giving them \ntheir full Mahr, and they have been ordered to marry other than them. The people asked for the verdict \nof Allah's Messenger (ﷺ) after that, so Allah revealed: 'They ask your instruction concerning the women . . . \nwhom you desire to marry.' (4.127) So Allah revealed to them that if the orphan girl had beauty and \nwealth, they desired to marry her and for her family status. They can only marry them if they give \nthem their full Mahr. And if they had no desire to marry them because of their lack of wealth and \nbeauty, they would leave them and marry other women. So, as they used to leave them, when they had \nno interest, in them, they were forbidden to marry them when they had such interest, unless they \ntreated them justly and gave them their full Mahr Apostle said, 'If at all there is evil omen, it is in the \nhorse, the woman and the house.\" a lady is to be warded off. And the Statement of Allah: 'Truly, \namong your wives and your children, there are enemies for you (i.e may stop you from the obedience \nof Allah)' (64.14)",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَنْتَقِصَ صَدَاقَهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ إِلاَّ أَنْ يُقْسِطُوا فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ، قَالَتْ وَاسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ، فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ فَأَنْزَلَ اللَّهُ لَهُمْ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا وَنَسَبِهَا فِي إِكْمَالِ الصَّدَاقِ، وَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَأَخَذُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَتْ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا وَيُعْطُوهَا حَقَّهَا الأَوْفَى فِي الصَّدَاقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5092In-book reference : Book 67, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 29   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5093,
    "id": 5093,
    "url": "https://sunnah.com/bukhari:5093",
    "bookNumber": 67,
    "hadithNumber": 31,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Evil omen is in the women, the house and the horse.'",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشُّؤْمُ فِي الْمَرْأَةِ وَالدَّارِ وَالْفَرَسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5093In-book reference : Book 67, Hadith 31USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5094,
    "id": 5094,
    "url": "https://sunnah.com/bukhari:5094",
    "bookNumber": 67,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Evil omen was mentioned before the Prophet: The Prophet (ﷺ) said, \"If there is evil omen in anything, it is \nin the house, the woman and the horse.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ الْعَسْقَلاَنِيُّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ ذَكَرُوا الشُّؤْمَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ الشُّؤْمُ فِي شَىْءٍ فَفِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5094In-book reference : Book 67, Hadith 32USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5095,
    "id": 5095,
    "url": "https://sunnah.com/bukhari:5095",
    "bookNumber": 67,
    "hadithNumber": 33,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "Allah's Messenger (ﷺ) said, \"If at all there is bad omen, it is in the horse, the woman, and the house.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالْمَسْكَنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5095In-book reference : Book 67, Hadith 33USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5096,
    "id": 5096,
    "url": "https://sunnah.com/bukhari:5096",
    "bookNumber": 67,
    "hadithNumber": 34,
    "narrator": "Narrated Usama bin Zaid:",
    "english": "The Prophet (ﷺ) said, \"After me I have not left any trial more severe to men than women.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا تَرَكْتُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5096In-book reference : Book 67, Hadith 34USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5097,
    "id": 5097,
    "url": "https://sunnah.com/bukhari:5097",
    "bookNumber": 67,
    "hadithNumber": 35,
    "narrator": "Narrated `Aisha:",
    "english": "Three principles were established because of Barira: (i) When Banra was manumitted she was given \nthe option (to remain with her slave husband or not). (ii) Allah's Messenger (ﷺ) said \"The Wala of the slave) \nis for the one who manumits (the slave). (iii) When Allah's Messenger (ﷺ) entered (the house), he saw a \ncooking pot on the fire but he was given bread and meat soup from the soup of the home. The Prophet (ﷺ) \nsaid, \"Didn't I see the cooking pot (on the fire)?\" It was said, \"That is the meat given in charity to \nBarira, and you do not eat the (things given in) charity.\" The Prophet (ﷺ) said, \"It is an object of charity \nfor Barira, and it is a present for us.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ عَتَقَتْ فَخُيِّرَتْ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبُرْمَةٌ عَلَى النَّارِ، فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ لَمْ أَرَ الْبُرْمَةَ ‏\"‏‏.‏ فَقِيلَ لَحْمٌ تُصُدِّقَ عَلَى بَرِيرَةَ، وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ قَالَ ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5097In-book reference : Book 67, Hadith 35USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5098,
    "id": 5098,
    "url": "https://sunnah.com/bukhari:5098",
    "bookNumber": 67,
    "hadithNumber": 36,
    "narrator": "Narrated Aisha\":",
    "english": "(regarding) the Verse: 'And if you fear that you shall not be able to deal justly with the orphans...' \n(4.3) It is about the orphan girl who is in the custody of a man who is her guardian, and he intends to \nmarry her because of her wealth, but he treats her badly and does not manage her property fairly and \nhonestly. Such a man should marry women of his liking other than her, two or three or four. \n'Prohibited to you (for marriage) are: ...your foster-mothers (who suckled you).' (4.23) Marriage is \nprohibited between persons having a foster suckling relationship corresponding to a blood relationship \nwhich renders marriage unlawful.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى‏}‏‏.‏ قَالَتِ الْيَتِيمَةُ تَكُونُ عِنْدَ الرَّجُلِ وَهْوَ وَلِيُّهَا، فَيَتَزَوَّجُهَا عَلَى مَالِهَا، وَيُسِيءُ صُحْبَتَهَا، وَلاَ يَعْدِلُ فِي مَالِهَا، فَلْيَتَزَوَّجْ مَا طَابَ لَهُ مِنَ النِّسَاءِ سِوَاهَا مَثْنَى وَثُلاَثَ وَرُبَاعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5098In-book reference : Book 67, Hadith 36USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5099,
    "id": 5099,
    "url": "https://sunnah.com/bukhari:5099",
    "bookNumber": 67,
    "hadithNumber": 37,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) that while Allah's Messenger (ﷺ) was with her, she heard a voice of a man asking \npermission to enter the house of Hafsa. `Aisha added: I said, \"O Allah's Messenger (ﷺ)! This man is asking \npermission to enter your house.\" The Prophet (ﷺ) said, \"I think he is so-and-so,\" naming the foster-uncle \nof Hafsa. `Aisha said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" \nThe Prophet (ﷺ) said, \"Yes, for foster suckling relations make all those things unlawful which are \nunlawful through corresponding birth (blood) relations.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عِنْدَهَا، وَأَنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ، قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أُرَاهُ فُلاَنًا ‏\"‏‏.‏ لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ‏.‏ قَالَتْ عَائِشَةُ لَوْ كَانَ فُلاَنٌ حَيًّا، لِعَمِّهَا مِنَ الرَّضَاعَةِ دَخَلَ عَلَىَّ فَقَالَ ‏\"‏ نَعَمِ الرَّضَاعَةُ تُحَرِّمُ مَا تُحَرِّمُ الْوِلاَدَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5099In-book reference : Book 67, Hadith 37USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5100,
    "id": 5100,
    "url": "https://sunnah.com/bukhari:5100",
    "bookNumber": 67,
    "hadithNumber": 38,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "It was said to the Prophet, \"Won't you marry the daughter of Hamza?\" He said, \"She is my foster niece \n(brother's daughter). \"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم أَلاَ تَزَوَّجُ ابْنَةَ حَمْزَةَ قَالَ ‏\n\"‏ إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏ وَقَالَ بِشْرُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5100In-book reference : Book 67, Hadith 38USC-MSA web (English) reference : Vol. 7, Book 62, Hadith 37   (deprecated numbering scheme)"
  }
]