[
  {
    "hadithGlobalNumber": 6503,
    "id": 6503,
    "url": "https://sunnah.com/bukhari:6503",
    "bookNumber": 81,
    "hadithNumber": 92,
    "narrator": "Narrated Sahl:",
    "english": "Allah's Messenger (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two,\" showing his two \nfingers and sticking (separating) them out.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ هَكَذَا ‏\"‏‏.‏ وَيُشِيرُ بِإِصْبَعَيْهِ فَيَمُدُّ بِهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6503In-book reference : Book 81, Hadith 92USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6504,
    "id": 6504,
    "url": "https://sunnah.com/bukhari:6504",
    "bookNumber": 81,
    "hadithNumber": 93,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ـ هُوَ الْجُعْفِيُّ ـ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَأَبِي التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6504In-book reference : Book 81, Hadith 93USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 511   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6505,
    "id": 6505,
    "url": "https://sunnah.com/bukhari:6505",
    "bookNumber": 81,
    "hadithNumber": 94,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏ يَعْنِي إِصْبَعَيْنِ‏.‏ تَابَعَهُ إِسْرَائِيلُ عَنْ أَبِي حَصِينٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6505In-book reference : Book 81, Hadith 94USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 512   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6506,
    "id": 6506,
    "url": "https://sunnah.com/bukhari:6506",
    "bookNumber": 81,
    "hadithNumber": 95,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till the sun rises from the west, and when it \nrises (from the west) and the people see it, then all of them will believe (in Allah). But that will be the \ntime when 'No good it will do to a soul to believe then. If it believed not before..\"' (6.158) \nThe Hour will be established (so suddenly) that two persons spreading a garment between them will \nnot be able to finish their bargain, nor will they be able to fold it up. The Hour will be established \nwhile a man is carrying the milk of his she-camel, but cannot drink it; and the Hour will be established \nwhen someone is not able to prepare the tank to water his livestock from it; and the Hour will be \nestablished when some of you has raised his food to his mouth but cannot eat it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا طَلَعَتْ فَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ، فَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا، لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ، أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلاَنِ ثَوْبَهُمَا بَيْنَهُمَا فَلاَ يَتَبَايَعَانِهِ وَلاَ يَطْوِيَانِهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلاَ يَطْعَمُهُ، وَلَتَقُومَنَّ السَّاعَةُ وَهْوَ يَلِيطُ حَوْضَهُ فَلاَ يَسْقِي فِيهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلاَ يَطْعَمُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6506In-book reference : Book 81, Hadith 95USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 513   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6507,
    "id": 6507,
    "url": "https://sunnah.com/bukhari:6507",
    "bookNumber": 81,
    "hadithNumber": 96,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "The Prophet (ﷺ) said, \"Who-ever loves to meet Allah, Allah (too) loves to meet him and who-ever hates to \nmeet Allah, Allah (too) hates to meet him\". `Aisha, or some of the wives of the Prophet (ﷺ) said, \"But we \ndislike death.\" He said: It is not like this, but it is meant that when the time of the death of a believer \napproaches, he receives the good news of Allah's pleasure with him and His blessings upon him, and \nso at that time nothing is dearer to him than what is in front of him. He therefore loves the meeting \nwith Allah, and Allah (too) loves the meeting with him. But when the time of the death of a \ndisbeliever approaches, he receives the evil news of Allah's torment and His Requital, whereupon \nnothing is more hateful to him than what is before him. Therefore, he hates the meeting with Allah, \nand Allah too, hates the meeting with him.\"",
    "arabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ، وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ أَوْ بَعْضُ أَزْوَاجِهِ إِنَّا لَنَكْرَهُ الْمَوْتَ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَاكَ، وَلَكِنَّ الْمُؤْمِنَ إِذَا حَضَرَهُ الْمَوْتُ بُشِّرَ بِرِضْوَانِ اللَّهِ وَكَرَامَتِهِ، فَلَيْسَ شَىْءٌ أَحَبَّ إِلَيْهِ مِمَّا أَمَامَهُ، فَأَحَبَّ لِقَاءَ اللَّهِ وَأَحَبَّ اللَّهُ لِقَاءَهُ، وَإِنَّ الْكَافِرَ إِذَا حُضِرَ بُشِّرَ بِعَذَابِ اللَّهِ وَعُقُوبَتِهِ، فَلَيْسَ شَىْءٌ أَكْرَهَ إِلَيْهِ مِمَّا أَمَامَهُ، كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏ اخْتَصَرَهُ أَبُو دَاوُدَ وَعَمْرٌو عَنْ شُعْبَةَ‏.‏ وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ سَعْدٍ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6507In-book reference : Book 81, Hadith 96USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 514   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6508,
    "id": 6508,
    "url": "https://sunnah.com/bukhari:6508",
    "bookNumber": 81,
    "hadithNumber": 97,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said: \"Whoever loves to meet  Allah, Allah loves to meet him; and whoever hates to meet Allah, Allah hates to meet him.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ، وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6508In-book reference : Book 81, Hadith 97USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 515   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6509,
    "id": 6509,
    "url": "https://sunnah.com/bukhari:6509",
    "bookNumber": 81,
    "hadithNumber": 98,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) When Allah's Messenger (ﷺ) was in good health, he used to say, \"No prophet's soul \nis ever captured unless he is shown his place in Paradise and given the option (to die or survive).\" So \nwhen the death of the Prophet (ﷺ) approached and his head was on my thigh, he became unconscious for a \nwhile and then he came to his senses and fixed his eyes on the ceiling and said, \"O Allah (with) the \nhighest companions.\" (See Qur'an 4:69). I said' \"Hence he is not going to choose us.\" And I came to \nknow that it was the application of the narration which he (the Prophet) used to narrate to us. And that \nwas the last statement of the Prophet (before his death) i.e., \"O Allah! With the highest companions.\" \n(See Qur'an 4:69)",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَعُرْوَةُ بْنُ الزُّبَيْرِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهْوَ صَحِيحٌ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُخَيَّرُ ‏\"‏‏.‏ فَلَمَّا نَزَلَ بِهِ، وَرَأْسُهُ عَلَى فَخِذِي، غُشِيَ عَلَيْهِ سَاعَةً، ثُمَّ أَفَاقَ، فَأَشْخَصَ بَصَرَهُ إِلَى السَّقْفِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏ قُلْتُ إِذًا لاَ يَخْتَارُنَا، وَعَرَفْتُ أَنَّهُ الْحَدِيثُ الَّذِي كَانَ يُحَدِّثُنَا بِهِ ـ قَالَتْ ـ فَكَانَتْ تِلْكَ آخِرَ كَلِمَةٍ تَكَلَّمَ بِهَا النَّبِيُّ صلى الله عليه وسلم قَوْلُهُ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6509In-book reference : Book 81, Hadith 98USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 516   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6510,
    "id": 6510,
    "url": "https://sunnah.com/bukhari:6510",
    "bookNumber": 81,
    "hadithNumber": 99,
    "narrator": "Narrated `Aisha:",
    "english": "There was a leather or wood container full of water in front of Allah's Messenger (ﷺ) (at the time of his \ndeath). He would put his hand into the water and rub his face with it, saying, \"None has the right to be \nworshipped but Allah! No doubt, death has its stupors.\" Then he raised his hand and started saying, \n\"(O Allah!) with the highest companions.\" (See Qur'an 4:69) (and kept on saying it) till he expired and \nhis hand dropped.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ أَبَا عَمْرٍو، ذَكْوَانَ مَوْلَى عَائِشَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ كَانَتْ تَقُولُ إِنَّ رَسُولَ اللَّهَ صلى الله عليه وسلم كَانَ بَيْنَ يَدَيْهِ رَكْوَةٌ ـ أَوْ عُلْبَةٌ فِيهَا مَاءٌ، يَشُكُّ عُمَرُ ـ فَجَعَلَ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ، فَيَمْسَحُ بِهِمَا وَجْهَهُ وَيَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، إِنَّ لِلْمَوْتِ سَكَرَاتٍ ‏\"‏‏.‏ ثُمَّ نَصَبَ يَدَهُ فَجَعَلَ يَقُولُ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ حَتَّى قُبِضَ وَمَالَتْ يَدُهُ‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ الْعُلْبَةُ مِنْ الْخَشَبِ وَالرَّكْوَةُ مِنْ الْأَدَمِ.",
    "reference": "Reference : Sahih al-Bukhari 6510In-book reference : Book 81, Hadith 99USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 517   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6511,
    "id": 6511,
    "url": "https://sunnah.com/bukhari:6511",
    "bookNumber": 81,
    "hadithNumber": 100,
    "narrator": "Narrated `Aisha:",
    "english": "Some rough bedouins used to visit the Prophet (ﷺ) and ask him, \"When will the Hour be?\" He would look \nat the youngest of all of them and say, \"If this should live till he is very old, your Hour (the death of \nthe people addressed) will take place.\" Hisham said that he meant (by the Hour), their death.",
    "arabic": "حَدَّثَنِي صَدَقَةُ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رِجَالٌ مِنَ الأَعْرَابِ جُفَاةً يَأْتُونَ النَّبِيَّ صلى الله عليه وسلم فَيَسْأَلُونَهُ مَتَى السَّاعَةُ، فَكَانَ يَنْظُرُ إِلَى أَصْغَرِهِمْ فَيَقُولُ ‏\n\"‏ إِنْ يَعِشْ هَذَا لاَ يُدْرِكْهُ الْهَرَمُ حَتَّى تَقُومَ عَلَيْكُمْ سَاعَتُكُمْ ‏\"‏‏.‏ قَالَ هِشَامٌ يَعْنِي مَوْتَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6511In-book reference : Book 81, Hadith 100USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 518   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6512,
    "id": 6512,
    "url": "https://sunnah.com/bukhari:6512",
    "bookNumber": 81,
    "hadithNumber": 101,
    "narrator": "Narrated Abu Qatada bin Rib'i Al-Ansari:",
    "english": "A funeral procession passed by Allah's Messenger (ﷺ) who said, \"Relieved or relieving?\" The people asked, \n\"O Allah's Messenger (ﷺ)! What is relieved and relieving?\" He said, \"A believer is relieved (by death) from \nthe troubles and hardships of the world and leaves for the Mercy of Allah, while (the death of) a \nwicked person relieves the people, the land, the trees, (and) the animals from him.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ الأَنْصَارِيِّ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجِنَازَةٍ فَقَالَ ‏\"‏ مُسْتَرِيحٌ، وَمُسْتَرَاحٌ مِنْهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ قَالَ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا إِلَى رَحْمَةِ اللَّهِ، وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6512In-book reference : Book 81, Hadith 101USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 519   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6513,
    "id": 6513,
    "url": "https://sunnah.com/bukhari:6513",
    "bookNumber": 81,
    "hadithNumber": 102,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) said, \"Relieved or relieving. And a believer is relieved (by death).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، حَدَّثَنِي ابْنُ كَعْبٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مُسْتَرِيحٌ، وَمُسْتَرَاحٌ مِنْهُ، الْمُؤْمِنُ يَسْتَرِيحُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6513In-book reference : Book 81, Hadith 102USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 520   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6514,
    "id": 6514,
    "url": "https://sunnah.com/bukhari:6514",
    "bookNumber": 81,
    "hadithNumber": 103,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"When carried to his grave, a dead person is followed by three, two of which \nreturn (after his burial) and one remains with him: his relative, his property, and his deeds follow him; \nrelatives and his property go back while his deeds remain with him.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهُ صلى الله عليه وسلم ‏\n\"‏ يَتْبَعُ الْمَيِّتَ ثَلاَثَةٌ، فَيَرْجِعُ اثْنَانِ وَيَبْقَى مَعَهُ وَاحِدٌ، يَتْبَعُهُ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ، فَيَرْجِعُ أَهْلُهُ وَمَالُهُ، وَيَبْقَى عَمَلُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6514In-book reference : Book 81, Hadith 103USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 521   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6515,
    "id": 6515,
    "url": "https://sunnah.com/bukhari:6515",
    "bookNumber": 81,
    "hadithNumber": 104,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"When anyone of you dies, his destination is displayed before him in the \nforenoon and in the afternoon, either in the (Hell) Fire or in Paradise, and it is said to him, \"That is \nyour place till you are resurrected and sent to it.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا مَاتَ أَحَدُكُمْ عُرِضَ عَلَيْهِ مَقْعَدُهُ غُدْوَةً وَعَشِيًّا، إِمَّا النَّارُ وَإِمَّا الْجَنَّةُ، فَيُقَالُ هَذَا مَقْعَدُكَ حَتَّى تُبْعَثَ ‏إِلَيْهِ\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6515In-book reference : Book 81, Hadith 104USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 522   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6516,
    "id": 6516,
    "url": "https://sunnah.com/bukhari:6516",
    "bookNumber": 81,
    "hadithNumber": 105,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"Do not abuse the dead, for they have reached the result of what they have done.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسُبُّوا الأَمْوَاتَ، فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6516In-book reference : Book 81, Hadith 105USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 523   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6517,
    "id": 6517,
    "url": "https://sunnah.com/bukhari:6517",
    "bookNumber": 81,
    "hadithNumber": 106,
    "narrator": "Narrated Abu Huraira:",
    "english": "Two men, a Muslim and a Jew, abused each other. The Muslim said, \"By Him Who gave superiority \nto Muhammad over all the people.\" On that, the Jew said, \"By Him Who gave superiority to Moses \nover all the people.\" The Muslim became furious at that and slapped the Jew in the face. The Jew went \nto Allah's Messenger (ﷺ) and informed him of what had happened between him and the Muslim. Allah's \nApostle said, \"Don't give me superiority over Moses, for the people will fall unconscious on the Day \nof Resurrection and I will be the first to gain consciousness, and behold ! Moses will be there holding \nthe side of Allah's Throne. I will not know whether Moses has been among those people who have \nbecome unconscious and then has regained consciousness before me, or has been among those \nexempted by Allah from falling unconscious.\"",
    "arabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَالأَعْرَجِ، أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ اسْتَبَّ رَجُلاَنِ، رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ فَقَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ‏.‏ فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ، قَالَ فَغَضِبَ الْمُسْلِمُ عِنْدَ ذَلِكَ، فَلَطَمَ وَجْهَ الْيَهُودِيِّ، فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِمَا كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ فِي أَوَّلِ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ مُوسَى فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي، أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6517In-book reference : Book 81, Hadith 106USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 524   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6518,
    "id": 6518,
    "url": "https://sunnah.com/bukhari:6518",
    "bookNumber": 81,
    "hadithNumber": 107,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The people will fall down unconscious at the time when they should fall down (i.e., \non the Day of Resurrection), and then I will be the first man to get up, and behold, Moses will be there \nholding (Allah's) Throne. I will not know whether he has been amongst those who have fallen \nunconscious.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَصْعَقُ النَّاسُ حِينَ يَصْعَقُونَ، فَأَكُونُ أَوَّلَ مَنْ قَامَ، فَإِذَا مُوسَى آخِذٌ بِالْعَرْشِ، فَمَا أَدْرِي أَكَانَ فِيمَنْ صَعِقَ ‏\"‏‏.‏ رَوَاهُ أَبُو سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6518In-book reference : Book 81, Hadith 107USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 525   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6519,
    "id": 6519,
    "url": "https://sunnah.com/bukhari:6519",
    "bookNumber": 81,
    "hadithNumber": 108,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah will take the whole earth (in His Hand) and will roll up the Heaven in His \nright Hand, and then He will say, \"I am King! Where are the kings of the earth ? \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقْبِضُ اللَّهُ الأَرْضَ، وَيَطْوِي السَّمَاءَ بِيَمِينِهِ، ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الأَرْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6519In-book reference : Book 81, Hadith 108USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 526   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6520,
    "id": 6520,
    "url": "https://sunnah.com/bukhari:6520",
    "bookNumber": 81,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said, \"The (planet of) earth will be a bread on the Day of Resurrection, and The resistible \n(Allah) will topple turn it with His Hand like anyone of you topple turns a bread with his hands while \n(preparing the bread) for a journey, and that bread will be the entertainment for the people of \nParadise.\" A man from the Jews came (to the Prophet) and said, \"May The Beneficent (Allah) bless \nyou, O Abul Qasim! Shall I tell you of the entertainment of the people of Paradise on the Day of \nResurrection?\" The Prophet (ﷺ) said, \"Yes.\" The Jew said, \"The earth will be a bread,\" as the Prophet (ﷺ) had \nsaid. Thereupon the Prophet (ﷺ) looked at us and smiled till his premolar tooth became visible. Then the \nJew further said, \"Shall I tell you of the udm (additional food taken with bread) they will have with \nthe bread?\" He added, \"That will be Balam and Nun.\" The people asked, \"What is that?\" He said, \"It \nis an ox and a fish, and seventy thousand people will eat of the caudate lobe (i.e. extra lobe) of their \nlivers.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَكُونُ الأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً، يَتَكَفَّؤُهَا الْجَبَّارُ بِيَدِهِ، كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ، نُزُلاً لأَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَأَتَى رَجُلٌ مِنَ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ يَا أَبَا الْقَاسِمِ، أَلاَ أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قَالَ تَكُونُ الأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَيْنَا، ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَالَ أَلاَ أُخْبِرُكَ بِإِدَامِهِمْ قَالَ إِدَامُهُمْ بَالاَمٌ وَنُونٌ‏.‏ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6520In-book reference : Book 81, Hadith 109USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 527   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6521,
    "id": 6521,
    "url": "https://sunnah.com/bukhari:6521",
    "bookNumber": 81,
    "hadithNumber": 110,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "I heard the Prophet (ﷺ) saying, \"The people will be gathered on the Day of Resurrection on reddish white \nland like a pure loaf of bread (made of pure fine flour).\" Sahl added: That land will have no landmarks \nfor anybody (to make use of).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ نَقِيٍّ ‏\"‏‏.‏ قَالَ سَهْلٌ أَوْ غَيْرُهُ لَيْسَ فِيهَا مَعْلَمٌ لأَحَدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6521In-book reference : Book 81, Hadith 110USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 528   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6522,
    "id": 6522,
    "url": "https://sunnah.com/bukhari:6522",
    "bookNumber": 81,
    "hadithNumber": 111,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The people will be gathered in three ways: (The first way will be of) those who \nwill wish or have a hope (for Paradise) and will have a fear (of punishment), (The second batch will \nbe those who will gather) riding two on a camel or three on a camel or ten on a camel. (The third \nbatch) the rest of the people will be urged to gather by the Fire which will accompany them at the time \nof their afternoon nap and stay with them where they will spend the night, and will be with them in the \nmorning wherever they may be then, and will be with them in the afternoon wherever they may be \nthen.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُحْشَرُ النَّاسُ عَلَى ثَلاَثِ طَرَائِقَ، رَاغِبِينَ رَاهِبِينَ وَاثْنَانِ عَلَى بَعِيرٍ، وَثَلاَثَةٌ عَلَى بَعِيرٍ، وَأَرْبَعَةٌ عَلَى بَعِيرٍ، وَعَشَرَةٌ عَلَى بَعِيرٍ وَيَحْشُرُ بَقِيَّتَهُمُ النَّارُ، تَقِيلُ مَعَهُمْ حَيْثُ قَالُوا، وَتَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا، وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا، وَتُمْسِي مَعَهُمْ حَيْثُ أَمْسَوْا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6522In-book reference : Book 81, Hadith 111USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 529   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6523,
    "id": 6523,
    "url": "https://sunnah.com/bukhari:6523",
    "bookNumber": 81,
    "hadithNumber": 112,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A man said, \"O Allah's Prophet! Will a Kafir (disbeliever) be gathered (driven prone) on his face?\" \nThe Prophet (ﷺ) said, \"Is not He Who made him walk with his legs in this world, able to make him walk \non his face on the Day of Resurrection?\" (Qatada, a sub-narrator said: Yes, (He can), by the Power of \nOur Lord!\")",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه أَنَّ رَجُلاً، قَالَ يَا نَبِيَّ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ قَالَ ‏\n\"‏ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى الرِّجْلَيْنِ فِي الدُّنْيَا قَادِرًا عَلَى أَنَّ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6523In-book reference : Book 81, Hadith 112USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6524,
    "id": 6524,
    "url": "https://sunnah.com/bukhari:6524",
    "bookNumber": 81,
    "hadithNumber": 113,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"You will meet Allah barefooted, naked, walking on feet, and uncircumcised.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، سَمِعْتُ ابْنَ عَبَّاسٍ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً مُشَاةً غُرْلاً ‏\"‏‏.‏ قَالَ سُفْيَانُ هَذَا مِمَّا نَعُدُّ أَنَّ ابْنَ عَبَّاسٍ سَمِعَهُ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6524In-book reference : Book 81, Hadith 113USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 531   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6525,
    "id": 6525,
    "url": "https://sunnah.com/bukhari:6525",
    "bookNumber": 81,
    "hadithNumber": 114,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I heard Allah's Messenger (ﷺ) while he was delivering a sermon on a pulpit, saying, \"You will meet Allah \nbarefooted, naked, and uncircumcised.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ يَقُولُ ‏\n\"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً غُرْلاً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6525In-book reference : Book 81, Hadith 114USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 532   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6526,
    "id": 6526,
    "url": "https://sunnah.com/bukhari:6526",
    "bookNumber": 81,
    "hadithNumber": 115,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) stood up among us and addressed (saying) \"You will be gathered, barefooted, naked, and \nuncircumcised (as Allah says): 'As We began the first creation, We shall repeat it..' (21.104) And the \nfirst human being to be dressed on the Day of Resurrection will be (the Prophet) Abraham Al-Khalil. \nThen will be brought some men of my followers who will be taken towards the left (i.e., to the Fire), \nand I will say: 'O Lord! My companions whereupon Allah will say: You do not know what they did \nafter you left them. I will then say as the pious slave, Jesus said, And I was witness over them while I \ndwelt amongst them..........(up to) ...the All-Wise.' (5.117-118). The narrator added: Then it will be \nsaid that those people (relegated from Islam, that is) kept on turning on their heels (deserted Islam).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَامَ فِينَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ‏}‏ الآيَةَ، وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، وَإِنَّهُ سَيُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي، فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ‏.‏ فَأَقُولُ يَا رَبِّ أُصَيْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْحَكِيمُ‏}‏ قَالَ فَيُقَالُ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6526In-book reference : Book 81, Hadith 115USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 533   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6527,
    "id": 6527,
    "url": "https://sunnah.com/bukhari:6527",
    "bookNumber": 81,
    "hadithNumber": 116,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"The people will be gathered barefooted, naked, and uncircumcised.\" I said, \"O \nAllah's Messenger (ﷺ)! Will the men and the women look at each other?\" He said, \"The situation will be too \nhard for them to pay attention to that.\"",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تُحْشَرُونَ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ الرِّجَالُ وَالنِّسَاءُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ‏.‏ فَقَالَ ‏\"‏ الأَمْرُ أَشَدُّ مِنْ أَنْ يُهِمَّهُمْ ذَاكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6527In-book reference : Book 81, Hadith 116USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 534   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6528,
    "id": 6528,
    "url": "https://sunnah.com/bukhari:6528",
    "bookNumber": 81,
    "hadithNumber": 117,
    "narrator": "Narrated `Abdullah:",
    "english": "While we were in the company of the Prophet (ﷺ) in a tent he said, ''Would it please you to be one fourth \nof the people of Paradise?\" We said, \"Yes.\" He said, \"Would It please you to be one-third of the \npeople of Paradise?\" We said, \"Yes.\" He said, \"Would it please you to be half of the people of \nParadise?\" We said, \"Yes.\" Thereupon he said, \"I hope that you will be one half of the people of \nParadise, for none will enter Paradise but a Muslim soul, and you people, in comparison to the people \nwho associate others in worship with Allah, are like a white hair on the skin of a black ox, or a black \nhair on the skin of a red ox.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي قُبَّةٍ فَقَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ تَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ، وَذَلِكَ أَنَّ الْجَنَّةَ لاَ يَدْخُلُهَا إِلاَّ نَفْسٌ مُسْلِمَةٌ، وَمَا أَنْتُمْ فِي أَهْلِ الشِّرْكِ إِلاَّ كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الأَحْمَرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6528In-book reference : Book 81, Hadith 117USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 535   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6529,
    "id": 6529,
    "url": "https://sunnah.com/bukhari:6529",
    "bookNumber": 81,
    "hadithNumber": 118,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The first man to be called on the Day of Resurrection will be Adam who will be \nshown his offspring, and it will be said to them, 'This is your father, Adam.' Adam will say \n(responding to the call), 'Labbaik and Sa`daik' Then Allah will say (to Adam), 'Take out of your \noffspring, the people of Hell.' Adam will say, 'O Lord, how many should I take out?' Allah will say, \n'Take out ninety-nine out of every hundred.\" They (the Prophet's companions) said, \"O Allah's \nApostle! If ninety-nine out of every one hundred of us are taken away, what will remain out of us?\" \nHe said, \"My followers in comparison to the other nations are like a white hair on a black ox.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَوَّلُ مَنْ يُدْعَى يَوْمَ الْقِيَامَةِ آدَمُ، فَتَرَاءَى ذُرِّيَّتُهُ فَيُقَالُ هَذَا أَبُوكُمْ آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ‏.‏ فَيَقُولُ أَخْرِجْ بَعْثَ جَهَنَّمَ مِنْ ذُرِّيَّتِكَ‏.‏ فَيَقُولُ يَا رَبِّ كَمْ أُخْرِجُ فَيَقُولُ أَخْرِجْ مِنْ كُلِّ مِائَةٍ تِسْعَةً وَتِسْعِينَ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِذَا أُخِذَ مِنَّا مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ، فَمَاذَا يَبْقَى مِنَّا قَالَ ‏\"‏ إِنَّ أُمَّتِي فِي الأُمَمِ كَالشَّعَرَةِ الْبَيْضَاءِ فِي الثَّوْرِ الأَسْوَدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6529In-book reference : Book 81, Hadith 118USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 536   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6530,
    "id": 6530,
    "url": "https://sunnah.com/bukhari:6530",
    "bookNumber": 81,
    "hadithNumber": 119,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The Prophet (ﷺ) said, \"Allah will say, 'O Adam!. Adam will reply, 'Labbaik and Sa`daik (I respond to \nYour Calls, I am obedient to Your orders), wal Khair fi Yadaik (and all the good is in Your Hands)!' \nThen Allah will say (to Adam), Bring out the people of the Fire.' Adam will say, 'What (how many) \nare the people of the Fire?' Allah will say, 'Out of every thousand (take out) nine hundred and ninety-nine \n(persons).' At that time children will become hoary-headed and every pregnant female will drop \nher load (have an abortion) and you will see the people as if they were drunk, yet not drunk; But \nAllah's punishment will be very severe.\" \nThat news distressed the companions of the Prophet (ﷺ) too much, and they said, \"O Allah's Messenger (ﷺ)! \nWho amongst us will be that man (the lucky one out of one-thousand who will be saved from the \nFire)?\" He said, \"Have the good news that one-thousand will be from Gog and Magog, and the one (to \nbe saved will be) from you.\" The Prophet (ﷺ) added, \"By Him in Whose Hand my soul is, I Hope that \nyou (Muslims) will be one third of the people of Paradise.\" On that, we glorified and praised Allah \nand said, \"Allahu Akbar.\" The Prophet (ﷺ) then said, \"By Him in Whose Hand my soul is, I hope that you \nwill be one half of the people of Paradise, as your (Muslims) example in comparison to the other \npeople (non-Muslims), is like that of a white hair on the skin of a black ox, or a round hairless spot on \nthe foreleg of a donkey.\"",
    "arabic": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ قَالَ يَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏.‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ‏.‏ فَذَاكَ حِينَ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا، وَتَرَى النَّاسَ سَكْرَى وَمَا هُمْ بِسَكْرَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏\"‏‏.‏ فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ فَقَالُوا يَا رَسُولُ اللَّهِ أَيُّنَا الرَّجُلُ قَالَ ‏\"‏ أَبْشِرُوا، فَإِنَّ مِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ وَمِنْكُمْ رَجُلٌ ـ ثُمَّ قَالَ ـ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالَ فَحَمِدْنَا اللَّهَ وَكَبَّرْنَا، ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ، إِنَّ مَثَلَكُمْ فِي الأُمَمِ كَمَثَلِ الشَّعَرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوِ الرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6530In-book reference : Book 81, Hadith 119USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 537   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6531,
    "id": 6531,
    "url": "https://sunnah.com/bukhari:6531",
    "bookNumber": 81,
    "hadithNumber": 120,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said (regarding the Verse), \"A Day when all mankind will stand before the Lord of the \nWorlds,' (that day) they will stand, drowned in their sweat up to the middle of their ears.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏{‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ قَالَ ‏\"‏ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6531In-book reference : Book 81, Hadith 120USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 538   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6532,
    "id": 6532,
    "url": "https://sunnah.com/bukhari:6532",
    "bookNumber": 81,
    "hadithNumber": 121,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The people will sweat so profusely on the Day of Resurrection that their sweat \nwill sink seventy cubits deep into the earth, and it will rise up till it reaches the people's mouths and \nears.\"",
    "arabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَعْرَقُ النَّاسُ يَوْمَ الْقِيَامَةِ حَتَّى يَذْهَبَ عَرَقُهُمْ فِي الأَرْضِ سَبْعِينَ ذِرَاعًا، وَيُلْجِمُهُمْ حَتَّى يَبْلُغَ آذَانَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6532In-book reference : Book 81, Hadith 121USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 539   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6533,
    "id": 6533,
    "url": "https://sunnah.com/bukhari:6533",
    "bookNumber": 81,
    "hadithNumber": 122,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"The cases which will be decided first (on the Day of Resurrection) will be the cases \nof blood-shedding. \"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي شَقِيقٌ، سَمِعْتُ عَبْدَ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ بِالدِّمَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6533In-book reference : Book 81, Hadith 122USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 540   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6534,
    "id": 6534,
    "url": "https://sunnah.com/bukhari:6534",
    "bookNumber": 81,
    "hadithNumber": 123,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever has wronged his brother, should ask for his pardon (before his death), \nas (in the Hereafter) there will be neither a Dinar nor a Dirham. (He should secure pardon in this life) \nbefore some of his good deeds are taken and paid to his brother, or, if he has done no good deeds, \nsome of the bad deeds of his brother are taken to be loaded on him (in the Hereafter).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَتْ عِنْدَهُ مَظْلَمَةٌ لأَخِيهِ فَلْيَتَحَلَّلْهُ مِنْهَا، فَإِنَّهُ لَيْسَ ثَمَّ دِينَارٌ وَلاَ دِرْهَمٌ مِنْ قَبْلِ أَنْ يُؤْخَذَ لأَخِيهِ مِنْ حَسَنَاتِهِ، فَإِنْ لَمْ يَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ أَخِيهِ، فَطُرِحَتْ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6534In-book reference : Book 81, Hadith 123USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 541   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6535,
    "id": 6535,
    "url": "https://sunnah.com/bukhari:6535",
    "bookNumber": 81,
    "hadithNumber": 124,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"The believers, after being saved from the (Hell) Fire, will be stopped at a bridge \nbetween Paradise and Hell and mutual retaliation will be established among them regarding wrongs \nthey have committed in the world against one another. After they are cleansed and purified (through \nthe retaliation), they will be admitted into Paradise; and by Him in Whose Hand Muhammad's soul is, \neveryone of them will know his dwelling in Paradise better than he knew his dwelling in this world.\"",
    "arabic": "حَدَّثَنِي الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏{‏وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ‏}‏ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَخْلُصُ الْمُؤْمِنُونَ مِنَ النَّارِ، فَيُحْبَسُونَ عَلَى قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ، مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا هُذِّبُوا وَنُقُّوا أُذِنَ لَهُمْ فِي دُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لأَحَدُهُمْ أَهْدَى بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6535In-book reference : Book 81, Hadith 124USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 542   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6536,
    "id": 6536,
    "url": "https://sunnah.com/bukhari:6536",
    "bookNumber": 81,
    "hadithNumber": 125,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "`Aisha said, \"The Prophet (ﷺ) said, 'Anybody whose account (record) is questioned will surely be \npunished.' I said, 'Doesn't Allah say: 'He surely will receive an easy reckoning?' (84.8) The Prophet (ﷺ) \nreplied. 'This means only the presentation of the account.\"'\nNarrated `Aisha:\n\nThe Prophet (ﷺ) said (as above, 543).",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نُوقِشَ الْحِسَابَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ قُلْتُ أَلَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏‏.‏ قَالَ ‏\"‏ ذَلِكِ الْعَرْضُ ‏\"‏‏.‏   حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ‏.‏ وَتَابَعَهُ ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ سُلَيْمٍ وَأَيُّوبُ وَصَالِحُ بْنُ رُسْتُمٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6536In-book reference : Book 81, Hadith 125USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 543   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6537,
    "id": 6537,
    "url": "https://sunnah.com/bukhari:6537",
    "bookNumber": 81,
    "hadithNumber": 126,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ), said, \"None will be called to account on the Day of Resurrection, but will be ruined.\" \nI said \"O Allah's Messenger (ﷺ)! Hasn't Allah said: 'Then as for him who will be given his record in his right \nhand, he surely will receive an easy reckoning? (84.7-8) -- Allah's Messenger (ﷺ) said, \"That (Verse) means \nonly the presentation of the accounts, but anybody whose account (record) is questioned on the Day of \nResurrection, will surely be punished.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إِلاَّ هَلَكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ قَدْ قَالَ اللَّهُ تَعَالَى ‏{‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا ذَلِكِ الْعَرْضُ، وَلَيْسَ أَحَدٌ يُنَاقَشُ الْحِسَابَ يَوْمَ الْقِيَامَةِ إِلاَّ عُذِّبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6537In-book reference : Book 81, Hadith 126USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 545   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6538,
    "id": 6538,
    "url": "https://sunnah.com/bukhari:6538",
    "bookNumber": 81,
    "hadithNumber": 127,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Prophet used to say, \"A disbeliever will be brought on the Day of Resurrection and will be \nasked. \"Suppose you had as much gold as to fill the earth, would you offer it to ransom yourself?\" He \nwill reply, \"Yes.\" Then it will be said to him, \"You were asked for something easier than that (to join \nnone in worship with Allah (i.e. to accept Islam, but you refused).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدَّثَنِي مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ يُجَاءُ بِالْكَافِرِ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيُقَالُ لَهُ قَدْ كُنْتَ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6538In-book reference : Book 81, Hadith 127USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 546   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6539,
    "id": 6539,
    "url": "https://sunnah.com/bukhari:6539",
    "bookNumber": 81,
    "hadithNumber": 128,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "The Prophet (ﷺ) said, \"There will be none among you but will be talked to by Allah on the Day of \nResurrection, without there being an interpreter between him and Him (Allah) . He will look and see \nnothing ahead of him, and then he will look (again for the second time) in front of him, and the (Hell) \nFire will confront him. So, whoever among you can save himself from the Fire, should do so even \nwith one half of a date (to give in charity).",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي الأَعْمَشُ، قَالَ حَدَّثَنِي خَيْثَمَةُ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَسَيُكَلِّمُهُ اللَّهُ يَوْمَ الْقِيَامَةِ، لَيْسَ بَيْنَ اللَّهِ وَبَيْنَهُ تُرْجُمَانٌ، ثُمَّ يَنْظُرُ فَلاَ يَرَى شَيْئًا قُدَّامَهُ، ثُمَّ يَنْظُرُ بَيْنَ يَدَيْهِ فَتَسْتَقْبِلُهُ النَّارُ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَتَّقِيَ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6539In-book reference : Book 81, Hadith 128USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 547   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6540,
    "id": 6540,
    "url": "https://sunnah.com/bukhari:6540",
    "bookNumber": 81,
    "hadithNumber": 129,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "The Prophet (ﷺ) said, \"Protect yourself from the Fire.\" He then turned his face aside (as if he were looking \nat it) and said again, \"Protect yourself from the Fire,\" and then turned his face aside (as if he were \nlooking at it), and he said so for the third time till we thought he was looking at it. He then said, \n\"Protect yourselves from the Fire, even if with one half of a date and he who hasn't got even this, \n(should do so) by (saying) a good, pleasant word.'",
    "arabic": "قَالَ الأَعْمَشُ حَدَّثَنِي عَمْرٌو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ ثَلاَثًا، حَتَّى ظَنَنَّا أَنَّهُ يَنْظُرُ إِلَيْهَا، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6540In-book reference : Book 81, Hadith 129USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 548   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6541,
    "id": 6541,
    "url": "https://sunnah.com/bukhari:6541",
    "bookNumber": 81,
    "hadithNumber": 130,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"The people were displayed in front of me and I saw one prophet passing by with a \nlarge group of his followers, and another prophet passing by with only a small group of people, and \nanother prophet passing by with only ten (persons), and another prophet passing by with only five \n(persons), and another prophet passed by alone. And then I looked and saw a large multitude of \npeople, so I asked Gabriel, \"Are these people my followers?' He said, 'No, but look towards the \nhorizon.' I looked and saw a very large multitude of people. Gabriel said. 'Those are your followers, \nand those are seventy thousand (persons) in front of them who will neither have any reckoning of their \naccounts nor will receive any punishment.' I asked, 'Why?' He said, 'For they used not to treat \nthemselves with branding (cauterization) nor with Ruqya (get oneself treated by the recitation of some \nVerses of the Qur'an) and not to see evil omen in things, and they used to put their trust (only) in their \nLord.\" On hearing that, 'Ukasha bin Mihsan got up and said (to the Prophet), \"Invoke Allah to make \nme one of them.\" The Prophet (ﷺ) said, \"O Allah, make him one of them.\" Then another man got up and \nsaid (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet (ﷺ) said, 'Ukasha has preceded \nyou.\"",
    "arabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ،‏.‏ وَحَدَّثَنِي أَسِيدُ بْنُ زَيْدٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، قَالَ كُنْتُ عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَقَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عُرِضَتْ عَلَىَّ الأُمَمُ، فَأَخَذَ النَّبِيُّ يَمُرُّ مَعَهُ الأُمَّةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ النَّفَرُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْعَشَرَةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْخَمْسَةُ، وَالنَّبِيُّ يَمُرُّ وَحْدَهُ، فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ قُلْتُ يَا جِبْرِيلُ هَؤُلاَءِ أُمَّتِي قَالَ لاَ وَلَكِنِ انْظُرْ إِلَى الأُفُقِ‏.‏ فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ‏.‏ قَالَ هَؤُلاَءِ أُمَّتُكَ، وَهَؤُلاَءِ سَبْعُونَ أَلْفًا قُدَّامَهُمْ، لاَ حِسَابَ عَلَيْهِمْ وَلاَ عَذَابَ‏.‏ قُلْتُ وَلِمَ قَالَ كَانُوا لاَ يَكْتَوُونَ، وَلاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏ فَقَامَ إِلَيْهِ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ إِلَيْهِ رَجُلٌ آخَرُ قَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ سَبَقَكَ بِهَا عُكَّاشَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6541In-book reference : Book 81, Hadith 130USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 549   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6542,
    "id": 6542,
    "url": "https://sunnah.com/bukhari:6542",
    "bookNumber": 81,
    "hadithNumber": 131,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"From my followers there will enter Paradise a crowd, seventy \nthousand in number, whose faces will glitter as the moon does when it is full.\" On hearing that, \n'Ukasha bin Mihsan Al-Asdi got up, lifting his covering sheet, and said, \"O Allah's Messenger (ﷺ)! Invoke \nAllah that He may make me one of them.\" The Prophet (ﷺ) said, \"O Allah, make him one of them.\" \nAnother man from the Ansar got up and said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of \nthem. \"The Prophet (ﷺ) said (to him), \"'Ukasha has preceded you.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ مِنْ أُمَّتِي زُمْرَةٌ هُمْ سَبْعُونَ أَلْفًا، تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏ وَقَالَ أَبُو هُرَيْرَةَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ سَبَقَكَ عُكَّاشَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6542In-book reference : Book 81, Hadith 131USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 550   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6543,
    "id": 6543,
    "url": "https://sunnah.com/bukhari:6543",
    "bookNumber": 81,
    "hadithNumber": 132,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The Prophet (ﷺ) said, \"Seventy-thousand or seven-hundred thousand of my followers (the narrator is in \ndoubt as to the correct number) will enter Paradise holding each other till the first and the last of them \nenter Paradise at the same time, and their faces will have a glitter like that of the moon at night when it \nis full.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا أَوْ سَبْعُمِائَةِ أَلْفٍ ـ شَكَّ فِي أَحَدِهِمَا ـ مُتَمَاسِكِينَ، آخِذٌ بَعْضُهُمْ بِبَعْضٍ، حَتَّى يَدْخُلَ أَوَّلُهُمْ وَآخِرُهُمُ الْجَنَّةَ، وَوُجُوهُهُمْ عَلَى ضَوْءِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6543In-book reference : Book 81, Hadith 132USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 551   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6544,
    "id": 6544,
    "url": "https://sunnah.com/bukhari:6544",
    "bookNumber": 81,
    "hadithNumber": 133,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet; said, \"The people of Paradise will enter Paradise, and the people of the (Hell) Fire will \nenter the (Hell) Fire: then a call-maker will get up (and make an announcement) among them, 'O the \npeople of the (Hell) Fire! No death anymore ! And O people of Paradise! No death (anymore) but \nEternity.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ، ثُمَّ يَقُومُ مُؤَذِّنٌ بَيْنَهُمْ يَا أَهْلَ النَّارِ لاَ مَوْتَ، وَيَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، خُلُودٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6544In-book reference : Book 81, Hadith 133USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 552   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6545,
    "id": 6545,
    "url": "https://sunnah.com/bukhari:6545",
    "bookNumber": 81,
    "hadithNumber": 134,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \" It will be said to the people of Paradise, 'O people of Paradise! Eternity (for you) \nand no death,' and to the people of the Fire, 'O people of the Fire, eternity (for you) and no death!\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يُقَالُ لأَهْلِ الْجَنَّةِ خُلُودٌ لاَ مَوْتَ‏.‏ وَلأَهْلِ النَّارِ يَا أَهْلَ النَّارِ خُلُودٌ لاَ مَوْتَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6545In-book reference : Book 81, Hadith 134USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 553   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6546,
    "id": 6546,
    "url": "https://sunnah.com/bukhari:6546",
    "bookNumber": 81,
    "hadithNumber": 135,
    "narrator": "Narrated `Imran:",
    "english": "The Prophet (ﷺ) said, \"I looked into paradise and saw that the majority of its people were the poor, and I \nlooked into the Fire and found that the majority of its people were women.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنْ أَبِي رَجَاءٍ، عَنْ عِمْرَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6546In-book reference : Book 81, Hadith 135USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 554   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6547,
    "id": 6547,
    "url": "https://sunnah.com/bukhari:6547",
    "bookNumber": 81,
    "hadithNumber": 136,
    "narrator": "Narrated Usama:",
    "english": "The Prophet (ﷺ) said, \"I stood at the gate of Paradise and saw that the majority of the people who had \nentered it were poor people, while the rich were forbidden (to enter along with the poor, because they \nwere waiting the reckoning of their accounts), but the people of the Fire had been ordered to be driven \nto the Fire. And I stood at the gate of the Fire and found that the majority of the people entering it \nwere women.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قُمْتُ عَلَى باب الْجَنَّةِ فَكَانَ عَامَّةُ مَنْ دَخَلَهَا الْمَسَاكِينَ، وَأَصْحَابُ الْجَدِّ مَحْبُوسُونَ، غَيْرَ أَنَّ أَصْحَابَ النَّارِ قَدْ أُمِرَ بِهِمْ إِلَى النَّارِ، وَقُمْتُ عَلَى باب النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6547In-book reference : Book 81, Hadith 136USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 555   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6548,
    "id": 6548,
    "url": "https://sunnah.com/bukhari:6548",
    "bookNumber": 81,
    "hadithNumber": 137,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"When the people of Paradise have entered Paradise and the people of the Fire \nhave entered the Fire, death will be brought and will be placed between the Fire and Paradise, and \nthen it will be slaughtered, and a call will be made (that), 'O people of Paradise, no more death ! O \npeople of the Fire, no more death ! ' So the people of Paradise will have happiness added to their \nprevious happiness, and the people of the Fire will have sorrow added to their previous sorrow.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، أَنَّهُ حَدَّثَهُ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ، وَأَهْلُ النَّارِ إِلَى النَّارِ، جِيءَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِي مُنَادٍ يَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، يَا أَهْلَ النَّارِ لاَ مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ‏.‏ وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلَى حُزْنِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6548In-book reference : Book 81, Hadith 137USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 556   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6549,
    "id": 6549,
    "url": "https://sunnah.com/bukhari:6549",
    "bookNumber": 81,
    "hadithNumber": 138,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah will say to the people of Paradise, 'O the people of Paradise!' They will \nsay, 'Labbaik, O our Lord, and Sa`daik!' Allah will say, 'Are you pleased?\" They will say, 'Why \nshould we not be pleased since You have given us what You have not given to anyone of Your \ncreation?' Allah will say, 'I will give you something better than that.' They will reply, 'O our Lord! \nAnd what is better than that?' Allah will say, 'I will bestow My pleasure and contentment upon you so \nthat I will never be angry with you after for-ever.' \"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ‏.‏ يَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لاَ نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ‏.‏ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالُوا يَا رَبِّ وَأَىُّ شَىْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6549In-book reference : Book 81, Hadith 138USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 557   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6550,
    "id": 6550,
    "url": "https://sunnah.com/bukhari:6550",
    "bookNumber": 81,
    "hadithNumber": 139,
    "narrator": "Narrated Anas:",
    "english": "Haritha was martyred on the day (of the battle) of Badr while he was \n     young. His mother came to the Prophet (ﷺ) saying, \"O Allah's Messenger (ﷺ)! You \n     know the relation of Haritha to me (how fond of him I was); so, if he \n     is in Paradise, I will remain patient and wish for Allah's reward, but\n     if he is not there, then you will see what I will do.\" The Prophet (ﷺ) \n     replied, \"May Allah be merciful upon you! Have you gone mad? (Do you \n     think) it is one Paradise? There are many Paradises and he is in the \n     (most superior) Paradise of Al-Firdaus.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أُصِيبَ حَارِثَةُ يَوْمَ بَدْرٍ وَهْوَ غُلاَمٌ، فَجَاءَتْ أُمُّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ مَنْزِلَةَ حَارِثَةَ مِنِّي، فَإِنْ يَكُ فِي الْجَنَّةِ أَصْبِرْ وَأَحْتَسِبْ، وَإِنْ تَكُنِ الأُخْرَى تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ ‏\n\"‏ وَيْحَكِ ـ أَوَهَبِلْتِ ـ أَوَجَنَّةٌ وَاحِدَةٌ هِيَ جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ لَفِي جَنَّةِ الْفِرْدَوْسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6550In-book reference : Book 81, Hadith 139USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6551,
    "id": 6551,
    "url": "https://sunnah.com/bukhari:6551",
    "bookNumber": 81,
    "hadithNumber": 140,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The width between the two shoulders of a Kafir \n     (disbeliever) will be equal to the distance covered by a fast rider in\n     three days.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، أَخْبَرَنَا الْفُضَيْلُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏مَا بَيْنَ مَنْكِبَىِ الْكَافِرِ مَسِيرَةُ ثَلاَثَةِ أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ‏\"‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6551In-book reference : Book 81, Hadith 140USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6552,
    "id": 6552,
    "url": "https://sunnah.com/bukhari:6552",
    "bookNumber": 81,
    "hadithNumber": 141,
    "narrator": "Narrated Sahl bin Sa'd:",
    "english": "Allah's Messenger (ﷺ) said, \"In Paradise there is a tree so big that in its \n     shade a rider may travel for one hundred years without being able to \n     cross it.\"",
    "arabic": "وَقَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ، لاَ يَقْطَعُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6552In-book reference : Book 81, Hadith 141USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 559   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6553,
    "id": 6553,
    "url": "https://sunnah.com/bukhari:6553",
    "bookNumber": 81,
    "hadithNumber": 142,
    "narrator": "Narrated Abu Sa'id:",
    "english": "The Prophet (ﷺ) said: There is a tree in Paradise (so huge) that a fast \n     (or a trained) rider may travel: for one hundred years without being \n     able to cross it.",
    "arabic": "قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ حَدَّثَنِي أَبُو سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ الْجَوَادَ الْمُضَمَّرَ السَّرِيعَ مِائَةَ عَامٍ، مَا يَقْطَعُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6553In-book reference : Book 81, Hadith 142USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 559   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6554,
    "id": 6554,
    "url": "https://sunnah.com/bukhari:6554",
    "bookNumber": 81,
    "hadithNumber": 143,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "Allah's Messenger (ﷺ) said, \"Seventy thousand or seven hundred thousand of my followers will enter \nParadise. (Abu Hazim, the sub-narrator, is not sure as to which of the two numbers is correct.) They \nwill be holding on to each other, the first will not entering the last one does, their faces like the moon \non a full moon night.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَوْ سَبْعُمِائَةِ أَلْفٍ ـ لاَ يَدْرِي أَبُو حَازِمٍ أَيُّهُمَا قَالَ ـ مُتَمَاسِكُونَ، آخِذٌ بَعْضُهُمْ بَعْضًا، لاَ يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ، وُجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6554In-book reference : Book 81, Hadith 143USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 560   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6555,
    "id": 6555,
    "url": "https://sunnah.com/bukhari:6555",
    "bookNumber": 81,
    "hadithNumber": 144,
    "narrator": "Narrated Sahl:",
    "english": "The Prophet (ﷺ) said, \"The people of Paradise will see the Ghuraf (special abodes) in Paradise as you see \na star in the sky.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ الْغُرَفَ فِي الْجَنَّةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ فِي السَّمَاءِ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6555In-book reference : Book 81, Hadith 144USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 561   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6556,
    "id": 6556,
    "url": "https://sunnah.com/bukhari:6556",
    "bookNumber": 81,
    "hadithNumber": 145,
    "narrator": "Abu Sa`id added:",
    "english": "\"As you see a glittering star remaining in the eastern horizon and \nthe western horizon.\"",
    "arabic": "قَالَ أَبِي فَحَدَّثْتُ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ أَشْهَدُ لَسَمِعْتُ أَبَا سَعِيدٍ يُحَدِّثُ وَيَزِيدُ فِيهِ ‏\n\"‏ كَمَا تَرَاءَوْنَ الْكَوْكَبَ الْغَارِبَ فِي الأُفُقِ الشَّرْقِيِّ وَالْغَرْبِيِّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6556In-book reference : Book 81, Hadith 145USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 561   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6557,
    "id": 6557,
    "url": "https://sunnah.com/bukhari:6557",
    "bookNumber": 81,
    "hadithNumber": 146,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Allah will say to the person who will have the minimum punishment in the Fire on \nthe Day of Resurrection, 'If you had things equal to whatever is on the earth, would you ransom \nyourself (from the punishment) with it?' He will reply, Yes. Allah will say, 'I asked you a much easier \nthing than this while you were in the backbone of Adam, that is, not to worship others besides Me, but \nyou refused and insisted to worship others besides Me.\"'",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقُولُ اللَّهُ تَعَالَى لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَوْ أَنَّ لَكَ مَا فِي الأَرْضِ مِنْ شَىْءٍ أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيَقُولُ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ بِي شَيْئًا فَأَبَيْتَ إِلاَّ أَنْ تُشْرِكَ بِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6557In-book reference : Book 81, Hadith 146USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 562   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6558,
    "id": 6558,
    "url": "https://sunnah.com/bukhari:6558",
    "bookNumber": 81,
    "hadithNumber": 147,
    "narrator": "Narrated Hammad from `Amr from Jabir:",
    "english": "The Prophet (ﷺ) said, \"Some people will come out of the Fire through intercession looking like The \nThaarir.\" I asked `Amr, \"What is the Thaarir?\" He said, Ad Dagh`Abis, and at that time he was \ntoothless. Hammad added: I said to `Amr bin Dinar, \"O Abu Muhammad! Did you hear Jabir bin \n`Abdullah saying, 'I heard the Prophet (ﷺ) saying: 'Some people will come out of the Fire through \nintercession?\" He said, \"Yes. \"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَخْرُجُ مِنَ النَّارِ بِالشَّفَاعَةِ كَأَنَّهُمُ الثَّعَارِيرُ ‏\"‏‏.‏ قُلْتُ مَا الثَّعَارِيرُ قَالَ الضَّغَابِيسُ‏.‏ وَكَانَ قَدْ سَقَطَ فَمُهُ فَقُلْتُ لِعَمْرِو بْنِ دِينَارٍ أَبَا مُحَمَّدٍ سَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَخْرُجُ بِالشَّفَاعَةِ مِنَ النَّارِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6558In-book reference : Book 81, Hadith 147USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 563   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6559,
    "id": 6559,
    "url": "https://sunnah.com/bukhari:6559",
    "bookNumber": 81,
    "hadithNumber": 148,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Some people will come out of the Fire after they have received a touch of the Fire, \nchanging their color, and they will enter Paradise, and the people of Paradise will name them 'Al- \nJahannamiyin' the (Hell) Fire people.\"",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بَعْدَ مَا مَسَّهُمْ مِنْهَا سَفْعٌ، فَيَدْخُلُونَ الْجَنَّةَ، فَيُسَمِّيهِمْ أَهْلُ الْجَنَّةِ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6559In-book reference : Book 81, Hadith 148USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 564   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6560,
    "id": 6560,
    "url": "https://sunnah.com/bukhari:6560",
    "bookNumber": 81,
    "hadithNumber": 149,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"When the people of Paradise have entered Paradise, and the people of the Fire \nhave entered the Fire, Allah will say. 'Take out (of the Fire) whoever has got faith equal to a mustard \nseed in his heart.' They will come out, and by that time they would have burnt and became like coal, \nand then they will be thrown into the river of Al-Hayyat (life) and they will spring up just as a seed \ngrows on the bank of a rainwater stream.\" The Prophet (ﷺ) said, \"Don't you see that the germinating seed \ncomes out yellow and twisted?\"",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ يَقُولُ اللَّهُ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ‏.‏ فَيُخْرَجُونَ قَدِ امْتُحِشُوا وَعَادُوا حُمَمًا، فَيُلْقَوْنَ فِي نَهَرِ الْحَيَاةِ، فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ ـ أَوْ قَالَ ـ حَمِيَّةِ السَّيْلِ ‏\"‏‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوْا أَنَّهَا تَنْبُتُ صَفْرَاءَ مُلْتَوِيَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6560In-book reference : Book 81, Hadith 149USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 565   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6561,
    "id": 6561,
    "url": "https://sunnah.com/bukhari:6561",
    "bookNumber": 81,
    "hadithNumber": 150,
    "narrator": "Narrated An-Nu`man:",
    "english": "I heard the Prophet (ﷺ) saying, \"The person who will have the least punishment from amongst the Hell \nFire people on the Day of Resurrection, will be a man under whose arch of the feet a smoldering \nember will be placed so that his brain will boil because of it.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، قَالَ سَمِعْتُ النُّعْمَانَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَرَجُلٌ تُوضَعُ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ يَغْلِي مِنْهَا دِمَاغُهُ‏\"‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6561In-book reference : Book 81, Hadith 150USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 566   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6562,
    "id": 6562,
    "url": "https://sunnah.com/bukhari:6562",
    "bookNumber": 81,
    "hadithNumber": 151,
    "narrator": "Narrated An-Nu`man bin Bashir:",
    "english": "I heard the Prophet (ﷺ) saying, \"The least punished person of the (Hell) Fire people on the Day of \nResurrection will be a man under whose arch of the feet two smoldering embers will be placed, \nbecause of which his brain will boil just like Al-Mirjal (copper vessel) or a Qum-qum (narrow-necked \nvessel) is boiling with water.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ عَلَى أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُ، كَمَا يَغْلِي الْمِرْجَلُ وَالْقُمْقُمُ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6562In-book reference : Book 81, Hadith 151USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 567   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6563,
    "id": 6563,
    "url": "https://sunnah.com/bukhari:6563",
    "bookNumber": 81,
    "hadithNumber": 152,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "The Prophet (ﷺ) mentioned the Fire and turned his face aside and asked for Allah's protection from it, and \nthen again he mentioned the Fire and turned his face aside and asked for Allah's protection from it and \nsaid, \"Protect yourselves from the Hell-Fire, even if with one half of a date, and he who cannot afford \nthat, then (let him do so) by (saying) a good, pleasant word.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ قَالَ ‏\n\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6563In-book reference : Book 81, Hadith 152USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 568   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6564,
    "id": 6564,
    "url": "https://sunnah.com/bukhari:6564",
    "bookNumber": 81,
    "hadithNumber": 153,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "I heard Allah's Messenger (ﷺ)s when his uncle, Abu Talib had been mentioned in his presence, saying, \"May \nbe my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a \nshallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَذُكِرَ عِنْدَهُ عَمُّهُ أَبُو طَالِبٍ فَقَالَ ‏\n\"‏ لَعَلَّهُ تَنْفَعُهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ فَيُجْعَلُ فِي ضَحْضَاحٍ مِنَ النَّارِ، يَبْلُغُ كَعْبَيْهِ، يَغْلِي مِنْهُ أُمُّ دِمَاغِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6564In-book reference : Book 81, Hadith 153USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 569   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6565,
    "id": 6565,
    "url": "https://sunnah.com/bukhari:6565",
    "bookNumber": 81,
    "hadithNumber": 154,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah will gather all the people on the Day of Resurrection and they will say, \n'Let us request someone to intercede for us with our Lord so that He may relieve us from this place of \nours.' \nThen they will go to Adam and say, 'You are the one whom Allah created with His Own Hands, and \nbreathed in you of His soul, and ordered the angels to prostrate to you; so please intercede for us with \nour Lord.' Adam will reply, 'I am not fit for this undertaking, and will remember his sin, and will say, \n'Go to Noah, the first Apostle sent by Allah' \nThey will go to him and he will say, 'I am not fit for this undertaking', and will remember his sin and \nsay, 'Go to Abraham whom Allah took as a Khalil. \nThey will go to him (and request similarly). He will reply, 'I am not fit for this undertaking,' and will \nremember his sin and say, 'Go to Moses to whom Allah spoke directly.' \nThey will go to Moses and he will say, 'I am not fit for this undertaking,' and will remember his sin \nand say, 'Go to Jesus.' \nThey will go to him, and he will say, 'I am not fit for this undertaking, go to Muhammad as Allah has \nforgiven his past and future sins.' \nThey will come to me and I will ask my Lord's permission, and when I see Him, I will fall down in \nprostration to Him, and He will leave me in that state as long as (He) Allah will, and then I will be \naddressed. 'Raise up your head (O Muhammad)! Ask, and your request will be granted, and say, and \nyour saying will be listened to; intercede, and your intercession will be accepted.' Then I will raise my \nhead, and I will glorify and praise my Lord with a saying(i.e. invocation) He will teach me, and then I \nwill intercede, Allah will fix a limit for me (i.e., certain type of people for whom I may intercede), and \nI will take them out of the (Hell) Fire and let them enter Paradise. Then I will come back (to Allah) \nand fall in prostration, and will do the same for the third and fourth times till no-one remains in the \n(Hell) Fire except those whom the Qur'an has imprisoned therein.\" (The sub-narrator, Qatada used to \nsay at that point, \"...those upon whom eternity (in Hell) has been imposed.\") (See Hadith No. 3, Vol \n6).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا عَلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ، فَاشْفَعْ لَنَا عِنْدَ رَبِّنَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ وَيَقُولُ ـ ائْتُوا نُوحًا أَوَّلَ رَسُولٍ بَعَثَهُ اللَّهُ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا إِبْرَاهِيمَ الَّذِي اتَّخَذَهُ اللَّهُ خَلِيلاً‏.‏ فَيَأْتُونَهُ، فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا مُوسَى الَّذِي كَلَّمَهُ اللَّهُ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، فَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا عِيسَى فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، ائْتُوا مُحَمَّدًا صلى الله عليه وسلم فَقَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي، فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ، ثُمَّ يُقَالُ ارْفَعْ رَأْسَكَ، سَلْ تُعْطَهْ، وَقُلْ يُسْمَعْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَرْفَعُ رَأْسِي، فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِي، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا، ثُمَّ أُخْرِجُهُمْ مِنَ النَّارِ، وَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَعُودُ فَأَقَعُ سَاجِدًا مِثْلَهُ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ حَتَّى مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ ‏\"‏‏.‏ وَكَانَ قَتَادَةُ يَقُولُ عِنْدَ هَذَا أَىْ وَجَبَ عَلَيْهِ الْخُلُودُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6565In-book reference : Book 81, Hadith 154USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 570   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6566,
    "id": 6566,
    "url": "https://sunnah.com/bukhari:6566",
    "bookNumber": 81,
    "hadithNumber": 155,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "The Prophet (ﷺ) said, \"Some people will be taken out of the Fire through the intercession of Muhammad \nthey will enter Paradise and will be called Al-Jahannamiyin (the Hell Fire people).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْحَسَنِ بْنِ ذَكْوَانَ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْن ٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ صلى الله عليه وسلم فَيَدْخُلُونَ الْجَنَّةَ، يُسَمَّوْنَ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6566In-book reference : Book 81, Hadith 155USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 571   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6567,
    "id": 6567,
    "url": "https://sunnah.com/bukhari:6567",
    "bookNumber": 81,
    "hadithNumber": 156,
    "narrator": "Narrated Anas:",
    "english": "Um (the mother of) Haritha came to Allah's Messenger (ﷺ) after Haritha had been martyred on the Day (of \nthe battle) of Badr by an arrow thrown by an unknown person. She said, \"O Allah's Messenger (ﷺ)! You \nknow the position of Haritha in my heart (i.e. how dear to me he was), so if he is in Paradise, I will not \nweep for him, or otherwise, you will see what I will do.\" The Prophet (ﷺ) said, \"Are you mad? Is there \nonly one Paradise? There are many Paradises, and he is in the highest Paradise of Firdaus.\" The \nProphet added, \"A forenoon journey or an after noon journey in Allah's Cause is better than the whole \nworld and whatever is in it; and a place equal to an arrow bow of anyone of you, or a place equal to a \nfoot in Paradise is better than the whole world and whatever is in it; and if one of the women of \nParadise looked at the earth, she would fill the whole space between them (the earth and the heaven) \nwith light, and would fill whatever is in between them, with perfume, and the veil of her face is better \nthan the whole world and whatever is in it.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ أُمَّ حَارِثَةَ، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَدْ هَلَكَ حَارِثَةُ يَوْمَ بَدْرٍ، أَصَابَهُ غَرْبُ سَهْمٍ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ مَوْقِعَ حَارِثَةَ مِنْ قَلْبِي، فَإِنْ كَانَ فِي الْجَنَّةِ لَمْ أَبْكِ عَلَيْهِ، وَإِلاَّ سَوْفَ تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ لَهَا ‏\n\"‏ هَبِلْتِ، أَجَنَّةٌ وَاحِدَةٌ هِيَ إِنَّهَا جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ فِي الْفِرْدَوْسِ الأَعْلَى ‏\"‏‏.‏ (وَقَالَ ‏:‏غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَقَابُ قَوْسِ أَحَدِكُمْ أَوْ مَوْضِعُ قَدَمٍ مِنَ الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَوْ أَنَّ امْرَأَةً مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ اطَّلَعَتْ إِلَى الأَرْضِ، لأَضَاءَتْ مَا بَيْنَهُمَا، وَلَمَلأَتْ مَا بَيْنَهُمَا رِيحًا، وَلَنَصِيفُهَا ـ يَعْنِي الْخِمَارَ ـ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا‏)‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6567, 6568In-book reference : Book 81, Hadith 156USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 572   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6568,
    "id": 6568,
    "url": "https://sunnah.com/bukhari:6568",
    "bookNumber": 81,
    "hadithNumber": 156,
    "narrator": "Narrated Anas:",
    "english": "Um (the mother of) Haritha came to Allah's Messenger (ﷺ) after Haritha had been martyred on the Day (of \nthe battle) of Badr by an arrow thrown by an unknown person. She said, \"O Allah's Messenger (ﷺ)! You \nknow the position of Haritha in my heart (i.e. how dear to me he was), so if he is in Paradise, I will not \nweep for him, or otherwise, you will see what I will do.\" The Prophet (ﷺ) said, \"Are you mad? Is there \nonly one Paradise? There are many Paradises, and he is in the highest Paradise of Firdaus.\" The \nProphet added, \"A forenoon journey or an after noon journey in Allah's Cause is better than the whole \nworld and whatever is in it; and a place equal to an arrow bow of anyone of you, or a place equal to a \nfoot in Paradise is better than the whole world and whatever is in it; and if one of the women of \nParadise looked at the earth, she would fill the whole space between them (the earth and the heaven) \nwith light, and would fill whatever is in between them, with perfume, and the veil of her face is better \nthan the whole world and whatever is in it.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ أُمَّ حَارِثَةَ، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَدْ هَلَكَ حَارِثَةُ يَوْمَ بَدْرٍ، أَصَابَهُ غَرْبُ سَهْمٍ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ مَوْقِعَ حَارِثَةَ مِنْ قَلْبِي، فَإِنْ كَانَ فِي الْجَنَّةِ لَمْ أَبْكِ عَلَيْهِ، وَإِلاَّ سَوْفَ تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ لَهَا ‏\n\"‏ هَبِلْتِ، أَجَنَّةٌ وَاحِدَةٌ هِيَ إِنَّهَا جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ فِي الْفِرْدَوْسِ الأَعْلَى ‏\"‏‏.‏ (وَقَالَ ‏:‏غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَقَابُ قَوْسِ أَحَدِكُمْ أَوْ مَوْضِعُ قَدَمٍ مِنَ الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَوْ أَنَّ امْرَأَةً مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ اطَّلَعَتْ إِلَى الأَرْضِ، لأَضَاءَتْ مَا بَيْنَهُمَا، وَلَمَلأَتْ مَا بَيْنَهُمَا رِيحًا، وَلَنَصِيفُهَا ـ يَعْنِي الْخِمَارَ ـ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا‏)‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6567, 6568In-book reference : Book 81, Hadith 156USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 572   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6569,
    "id": 6569,
    "url": "https://sunnah.com/bukhari:6569",
    "bookNumber": 81,
    "hadithNumber": 157,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"None will enter Paradise but will be shown the place he would have occupied in \nthe (Hell) Fire if he had rejected faith, so that he may be more thankful; and none will enter the (Hell) \nFire but will be shown the place he would have occupied in Paradise if he had faith, so that may be a \ncause of sorrow for him.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلُ أَحَدٌ الْجَنَّةَ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ النَّارِ، لَوْ أَسَاءَ، لِيَزْدَادَ شُكْرًا، وَلاَ يَدْخُلُ النَّارَ أَحَدٌ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ الْجَنَّةِ، لَوْ أَحْسَنَ، لِيَكُونَ عَلَيْهِ حَسْرَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6569In-book reference : Book 81, Hadith 157USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 573   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6570,
    "id": 6570,
    "url": "https://sunnah.com/bukhari:6570",
    "bookNumber": 81,
    "hadithNumber": 158,
    "narrator": "Narrated Abu Huraira:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! Who will be the luckiest person who will gain your intercession on the Day \nof Resurrection?\" The Prophet (ﷺ) said, \"O Abu Huraira! I have thought that none will ask me about this \nHadith before you, as I know your longing for the (learning of) Hadiths. The luckiest person who will \nhave my intercession on the Day of Resurrection will be the one who said, 'None has the right to be \nworshipped but Allah,' sincerely from the bottom of his heart.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ فَقَالَ ‏\n\"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ خَالِصًا مِنْ قِبَلِ نَفْسِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6570In-book reference : Book 81, Hadith 158USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 574   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6571,
    "id": 6571,
    "url": "https://sunnah.com/bukhari:6571",
    "bookNumber": 81,
    "hadithNumber": 159,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"I know the person who will be the last to come out of the (Hell) Fire, and the last to \nenter Paradise. He will be a man who will come out of the (Hell) Fire crawling, and Allah will say to \nhim, 'Go and enter Paradise.' He will go to it, but he will imagine that it had been filled, and then he \nwill return and say, 'O Lord, I have found it full.' Allah will say, 'Go and enter Paradise, and you will \nhave what equals the world and ten times as much (or, you will have as much as ten times the like of \nthe world).' On that, the man will say, 'Do you mock at me (or laugh at me) though You are the \nKing?\" I saw Allah's Messenger (ﷺ) (while saying that) smiling that his premolar teeth became visible. It is \nsaid that will be the lowest in degree amongst the people of Paradise.",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنِّي لأَعْلَمُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا، وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولاً رَجُلٌ يَخْرُجُ مِنَ النَّارِ كَبْوًا، فَيَقُولُ اللَّهُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى، فَيَرْجِعُ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى‏.‏ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ، فَإِنَّ لَكَ مِثْلَ الدُّنْيَا وَعَشَرَةَ أَمْثَالِهَا‏.‏ أَوْ إِنَّ لَكَ مِثْلَ عَشَرَةِ أَمْثَالِ الدُّنْيَا‏.‏ فَيَقُولُ تَسْخَرُ مِنِّي، أَوْ تَضْحَكُ مِنِّي وَأَنْتَ الْمَلِكُ ‏\"‏‏.‏ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ، وَكَانَ يُقَالُ ذَلِكَ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6571In-book reference : Book 81, Hadith 159USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 575   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6572,
    "id": 6572,
    "url": "https://sunnah.com/bukhari:6572",
    "bookNumber": 81,
    "hadithNumber": 160,
    "narrator": "Narrated `Abbas:",
    "english": "that he said to the Prophet (ﷺ) \"Did you benefit Abu Talib with anything?\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنِ الْعَبَّاسِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم هَلْ نَفَعْتَ أَبَا طَالِبٍ بِشَىْءٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6572In-book reference : Book 81, Hadith 160USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 576   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6573,
    "id": 6573,
    "url": "https://sunnah.com/bukhari:6573",
    "bookNumber": 81,
    "hadithNumber": 161,
    "narrator": "Narrated Abu Huraira:",
    "english": "Some people said, \"O Allah's Messenger (ﷺ)! Shall we see our Lord on the Day of Resurrection?\" He said, \n\"Do you crowd and squeeze each other on looking at the sun when it is not hidden by clouds?\" They \nreplied, \"No, Allah's Messenger (ﷺ).\" He said, \"Do you crowd and squeeze each other on looking at the \nmoon when it is full and not hidden by clouds?\" They replied, No, O Allah's Messenger (ﷺ)!\" He said, \"So \nyou will see Him (your Lord) on the Day of Resurrection similarly Allah will gather all the people and \nsay, 'Whoever used to worship anything should follow that thing. 'So, he who used to worship the sun, \nwill follow it, and he who used to worship the moon will follow it, and he who used to worship false \ndeities will follow them; and then only this nation (i.e., Muslims) will remain, including their \nhypocrites. Allah will come to them in a shape other than they know and will say, 'I am your Lord.' \nThey will say, 'We seek refuge with Allah from you. This is our place; (we will not follow you) till \nour Lord comes to us, and when our Lord comes to us, we will recognize Him. \nThen Allah will come to then in a shape they know and will say, \"I am your Lord.' They will say, '(No \ndoubt) You are our Lord,' and they will follow Him. Then a bridge will be laid over the (Hell) Fire.\" \nAllah's Messenger (ﷺ) added, \"I will be the first to cross it. And the invocation of the Apostles on that Day, \nwill be 'Allahumma Sallim, Sallim (O Allah, save us, save us!),' and over that bridge there will be \nhooks Similar to the thorns of As Sa'dan (a thorny tree). Didn't you see the thorns of As-Sa'dan?\" The \ncompanions said, \"Yes, O Allah's Messenger (ﷺ).\" He added, \"So the hooks over that bridge will be like the \nthorns of As-Sa-dan except that their greatness in size is only known to Allah. These hooks will snatch \nthe people according to their deeds. Some people will be ruined because of their evil deeds, and some \nwill be cut into pieces and fall down in Hell, but will be saved afterwards, when Allah has finished the \njudgments among His slaves, and intends to take out of the Fire whoever He wishes to take out from \namong those who used to testify that none had the right to be worshipped but Allah. \nWe will order the angels to take them out and the angels will know them by the mark of the traces of \nprostration (on their foreheads) for Allah banned the f ire to consume the traces of prostration on the \nbody of Adam's son. So they will take them out, and by then they would have burnt (as coal), and then \nwater, called Ma'ul Hayat (water of life) will be poured on them, and they will spring out like a seed \nsprings out on the bank of a rainwater stream, and there will remain one man who will be facing the \n(Hell) Fire and will say, 'O Lord! It's (Hell's) vapor has Poisoned and smoked me and its flame has \nburnt me; please turn my face away from the Fire.' He will keep on invoking Allah till Allah says, \n'Perhaps, if I give you what you want), you will ask for another thing?' The man will say, 'No, by Your \nPower, I will not ask You for anything else.' \nThen Allah will turn his face away from the Fire. The man will say after that, 'O Lord, bring me near \nthe gate of Paradise.' Allah will say (to him), 'Didn't you promise not to ask for anything else? Woe to \nyou, O son of Adam ! How treacherous you are!' The man will keep on invoking Allah till Allah will \nsay, 'But if I give you that, you may ask me for something else.' The man will say, 'No, by Your \nPower. I will not ask for anything else.' He will give Allah his covenant and promise not to ask for \nanything else after that. So Allah will bring him near to the gate of Paradise, and when he sees what is \nin it, he will remain silent as long as Allah will, and then he will say, 'O Lord! Let me enter Paradise.' \nAllah will say, 'Didn't you promise that you would not ask Me for anything other than that? Woe to \nyou, O son of Adam ! How treacherous you are!' On that, the man will say, 'O Lord! Do not make me \nthe most wretched of Your creation,' and will keep on invoking Allah till Allah will smile and when \nAllah will smile because of him, then He will allow him to enter Paradise, and when he will enter \nParadise, he will be addressed, 'Wish from so-and-so.' He will wish till all his wishes will be fulfilled, \nthen Allah will say, All this (i.e. what you have wished for) and as much again therewith are for you.' \n\" \nAbu Huraira added: That man will be the last of the people of Paradise to enter (Paradise).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدٌ، وَعَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أُنَاسٌ يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ فَقَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الشَّمْسِ، لَيْسَ دُونَهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ، لَيْسَ دُونَهُ سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ تَرَوْنَهُ يَوْمَ الْقِيَامَةِ كَذَلِكَ، يَجْمَعُ اللَّهُ النَّاسَ فَيَقُولُ مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتَّبِعْهُ، فَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الشَّمْسَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الْقَمَرَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الطَّوَاغِيتَ، وَتَبْقَى هَذِهِ الأُمَّةُ فِيهَا مُنَافِقُوهَا، فَيَأْتِيهِمُ اللَّهُ فِي غَيْرِ الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ، هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا، فَإِذَا أَتَانَا رَبُّنَا عَرَفْنَاهُ فَيَأْتِيهِمُ اللَّهُ فِي الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ أَنْتَ رَبُّنَا، فَيَتْبَعُونَهُ وَيُضْرَبُ جِسْرُ جَهَنَّمَ ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَكُونُ أَوَّلَ مَنْ يُجِيزُ، وَدُعَاءُ الرُّسُلِ يَوْمَئِذٍ اللَّهُمَّ سَلِّمْ سَلِّمْ، وَبِهِ كَلاَلِيبُ مِثْلُ شَوْكِ السَّعْدَانِ، أَمَا رَأَيْتُمْ شَوْكَ السَّعْدَانِ ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ، غَيْرَ أَنَّهَا لاَ يَعْلَمُ قَدْرَ عِظَمِهَا إِلاَّ اللَّهُ، فَتَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ، مِنْهُمُ الْمُوبَقُ، بِعَمَلِهِ وَمِنْهُمُ الْمُخَرْدَلُ، ثُمَّ يَنْجُو، حَتَّى إِذَا فَرَغَ اللَّهُ مِنَ الْقَضَاءِ بَيْنَ عِبَادِهِ، وَأَرَادَ أَنْ يُخْرِجَ مِنَ النَّارِ مَنْ أَرَادَ أَنْ يُخْرِجَ، مِمَّنْ كَانَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، أَمَرَ الْمَلاَئِكَةَ أَنْ يُخْرِجُوهُمْ، فَيَعْرِفُونَهُمْ بِعَلاَمَةِ آثَارِ السُّجُودِ، وَحَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ مِنِ ابْنِ آدَمَ أَثَرَ السُّجُودِ، فَيُخْرِجُونَهُمْ قَدِ امْتُحِشُوا، فَيُصَبُّ عَلَيْهِمْ مَاءٌ يُقَالُ لَهُ مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ فِي حَمِيلِ السَّيْلِ، وَيَبْقَى رَجُلٌ مُقْبِلٌ بِوَجْهِهِ عَلَى النَّارِ فَيَقُولُ يَا رَبِّ قَدْ قَشَبَنِي رِيحُهَا وَأَحْرَقَنِي ذَكَاؤُهَا، فَاصْرِفْ وَجْهِي عَنِ النَّارِ فَلاَ يَزَالُ يَدْعُو اللَّهَ‏.‏ فَيَقُولُ لَعَلَّكَ إِنْ أَعْطَيْتُكَ أَنْ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيَصْرِفُ وَجْهَهُ عَنِ النَّارِ، ثُمَّ يَقُولُ بَعْدَ ذَلِكَ يَا رَبِّ قَرِّبْنِي إِلَى باب الْجَنَّةِ‏.‏ فَيَقُولُ أَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلْنِي غَيْرَهُ، وَيْلَكَ ابْنَ آدَمَ مَا أَغْدَرَكَ‏.‏ فَلاَ يَزَالُ يَدْعُو‏.‏ فَيَقُولُ لَعَلِّي إِنْ أَعْطَيْتُكَ ذَلِكَ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيُعْطِي اللَّهَ مِنْ عُهُودٍ وَمَوَاثِيقَ أَنْ لاَ يَسْأَلَهُ غَيْرَهُ، فَيُقَرِّبُهُ إِلَى باب الْجَنَّةِ، فَإِذَا رَأَى مَا فِيهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ، ثُمَّ يَقُولُ رَبِّ أَدْخِلْنِي الْجَنَّةَ‏.‏ ثُمَّ يَقُولُ أَوَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلَنِي غَيْرَهُ، وَيْلَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ فَيَقُولُ يَا رَبِّ لاَ تَجْعَلْنِي أَشْقَى خَلْقِكَ‏.‏ فَلاَ يَزَالُ يَدْعُو حَتَّى يَضْحَكَ، فَإِذَا ضَحِكَ مِنْهُ أَذِنَ لَهُ بِالدُّخُولِ فِيهَا، فَإِذَا دَخَلَ فِيهَا قِيلَ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى، ثُمَّ يُقَالُ لَهُ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى حَتَّى تَنْقَطِعَ بِهِ الأَمَانِيُّ فَيَقُولُ لَهُ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَذَلِكَ الرَّجُلُ آخِرُ أَهْلِ الْجَنَّةِ دُخُولاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6573In-book reference : Book 81, Hadith 161USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6574,
    "id": 6574,
    "url": "https://sunnah.com/bukhari:6574",
    "bookNumber": 81,
    "hadithNumber": 162,
    "narrator": "Narrated 'Ata (while Abu Huraira was narrating (see previous hadith)):",
    "english": "Abu Sa`id was sitting in the company of Abu \nHuraira and he did not deny anything of his narration till he reached his saying: \"All this and as much \nagain therewith are for you.\" Then Abu Sa`id said, \"I heard Allah's Messenger (ﷺ) saying, 'This is for you \nand ten times as much.' \" Abu Huraira said, \"In my memory it is 'as much again therewith.' \"",
    "arabic": "قَالَ عَطَاءٌ وَأَبُو سَعِيدٍ الْخُدْرِيُّ جَالِسٌ مَعَ أَبِي هُرَيْرَةَ، لاَ يُغَيِّرُ عَلَيْهِ شَيْئًا مِنْ حَدِيثِهِ حَتَّى انْتَهَى إِلَى قَوْلِهِ ‏\"‏ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ هَذَا لَكَ وَعَشَرَةُ أَمْثَالِهِ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ حَفِظْتُ ‏\"‏ مِثْلُهُ مَعَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6574In-book reference : Book 81, Hadith 162USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6575,
    "id": 6575,
    "url": "https://sunnah.com/bukhari:6575",
    "bookNumber": 81,
    "hadithNumber": 163,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6575In-book reference : Book 81, Hadith 163USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6576,
    "id": 6576,
    "url": "https://sunnah.com/bukhari:6576",
    "bookNumber": 81,
    "hadithNumber": 164,
    "narrator": "`Abdullah added:",
    "english": "The Prophet (ﷺ) said, \"I \nam your predecessor at the Lake-Fount, and some of you will be brought in front of me till I will see \nthem and then they will be taken away from me and I will say, 'O Lord, my companions!' It will be \nsaid, 'You do not know what they did after you had left.'",
    "arabic": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ، وَلَيُرْفَعَنَّ رِجَالٌ مِنْكُمْ ثُمَّ لَيُخْتَلَجُنَّ دُونِي فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏\"‏.‏ تَابَعَهُ عَاصِمٌ عَنْ أَبِي وَائِلٍ‏.‏ وَقَالَ حُصَيْنٌ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6576In-book reference : Book 81, Hadith 164USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6577,
    "id": 6577,
    "url": "https://sunnah.com/bukhari:6577",
    "bookNumber": 81,
    "hadithNumber": 165,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"There will be a tank (Lake-Fount) in front of you as large as the distance between \nJarba and Adhruh (two towns in Sham).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَمَامَكُمْ حَوْضٌ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6577In-book reference : Book 81, Hadith 165USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 579   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6578,
    "id": 6578,
    "url": "https://sunnah.com/bukhari:6578",
    "bookNumber": 81,
    "hadithNumber": 166,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet (ﷺ) Muhammad). \nAbu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id \nreplied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him \n(Muhammad).",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، وَعَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ الْكَوْثَرُ الْخَيْرُ الْكَثِيرُ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏ قَالَ أَبُو بِشْرٍ قُلْتُ لِسَعِيدٍ إِنَّ أُنَاسًا يَزْعُمُونَ أَنَّهُ نَهَرٌ فِي الْجَنَّةِ‏.‏ فَقَالَ سَعِيدٌ النَّهَرُ الَّذِي فِي الْجَنَّةِ مِنَ الْخَيْرِ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6578In-book reference : Book 81, Hadith 166USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 580   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6579,
    "id": 6579,
    "url": "https://sunnah.com/bukhari:6579",
    "bookNumber": 81,
    "hadithNumber": 167,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "The Prophet (ﷺ) said, \"My Lake-Fount is (so large that it takes) a month's journey to cross it. Its water is \nwhiter than milk, and its smell is nicer than musk (a kind of Perfume), and its drinking cups are (as \nnumerous) as the (number of) stars of the sky; and whoever drinks from it, will never be thirsty.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ حَوْضِي مَسِيرَةُ شَهْرٍ، مَاؤُهُ أَبْيَضُ مِنَ اللَّبَنِ، وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ، وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ، مَنْ شَرِبَ مِنْهَا فَلاَ يَظْمَأُ أَبَدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6579In-book reference : Book 81, Hadith 167USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 581   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6580,
    "id": 6580,
    "url": "https://sunnah.com/bukhari:6580",
    "bookNumber": 81,
    "hadithNumber": 168,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"The width of my Lake-Fount is equal to the distance between Aila (a town in \nSham) and Sana' (the capital of Yemen) and it has as many (numerous) jugs as the number of stars of \nthe sky.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏(‏إِنَّ قَدْرَ حَوْضِي كَمَا بَيْنَ أَيْلَةَ وَصَنْعَاءَ مِنَ الْيَمَنِ، وَإِنَّ فِيهِ مِنَ الأَبَارِيقِ كَعَدَدِ نُجُومِ السَّمَاءِ‏)‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6580In-book reference : Book 81, Hadith 168USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6581,
    "id": 6581,
    "url": "https://sunnah.com/bukhari:6581",
    "bookNumber": 81,
    "hadithNumber": 169,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said: \"While I was walking in Paradise (on the night of Mi'raj), I saw a river, on the two \nbanks of which there were tents made of hollow pearls. I asked, \"What is this, O Gabriel?' He said, \n'That is the Kauthar which Your Lord has given to you.' Behold! Its scent or its mud was sharp \nsmelling musk!\" (The sub-narrator, Hudba is in doubt as to the correct expression. )",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَمَا أَنَا أَسِيرُ فِي الْجَنَّةِ إِذَا أَنَا بِنَهَرٍ حَافَتَاهُ قِبَابُ الدُّرِّ الْمُجَوَّفِ قُلْتُ مَا هَذَا يَا جِبْرِيلُ قَالَ هَذَا الْكَوْثَرُ الَّذِي أَعْطَاكَ رَبُّكَ‏.‏ فَإِذَا طِينُهُ ـ أَوْ طِيبُهُ ـ مِسْكٌ أَذْفَرُ ‏\"‏‏.‏ شَكَّ هُدْبَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6581In-book reference : Book 81, Hadith 169USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 583   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6582,
    "id": 6582,
    "url": "https://sunnah.com/bukhari:6582",
    "bookNumber": 81,
    "hadithNumber": 170,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Some of my companions will come to me at my Lake Fount, and after I recognize \nthem, they will then be taken away from me, whereupon I will say, 'My companions!' Then it will be \nsaid, 'You do not know what they innovated (new things) in the religion after you.\"",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَرِدَنَّ عَلَىَّ نَاسٌ مِنْ أَصْحَابِي الْحَوْضَ، حَتَّى عَرَفْتُهُمُ اخْتُلِجُوا دُونِي، فَأَقُولُ أَصْحَابِي‏.‏ فَيَقُولُ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6582In-book reference : Book 81, Hadith 170USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 584   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6583,
    "id": 6583,
    "url": "https://sunnah.com/bukhari:6583",
    "bookNumber": 81,
    "hadithNumber": 171,
    "narrator": "Narrated Abu Hazim from Sahl bin Sa`d:",
    "english": "The Prophet (ﷺ) said, \"I am your predecessor (forerunner) at the Lake-Fount, and whoever will pass by \nthere, he will drink from it and whoever will drink from it, he will never be thirsty. There will come to \nme some people whom I will recognize, and they will recognize me, but a barrier will be placed \nbetween me and them.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ، مَنْ مَرَّ عَلَىَّ شَرِبَ، وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا، لَيَرِدَنَّ عَلَىَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي، ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6583In-book reference : Book 81, Hadith 171USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6584,
    "id": 6584,
    "url": "https://sunnah.com/bukhari:6584",
    "bookNumber": 81,
    "hadithNumber": 172,
    "narrator": "Abu Hazim added:",
    "english": "An-Nu`man bin Abi `Aiyash, on hearing me, said. \"Did \nyou hear this from Sahl?\" I said, \"Yes.\" He said, \" I bear witness that I heard Abu Sa`id Al-Khudri \nsaying the same, adding that the Prophet (ﷺ) said: 'I will say: They are of me (i.e. my followers). It will be \nsaid, 'You do not know what they innovated (new things) in the religion after you left'. I will say, 'Far \nremoved, far removed (from mercy), those who changed (their religion) after me.\"",
    "arabic": "قَالَ أَبُو حَازِمٍ فَسَمِعَنِي النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ، فَقَالَ هَكَذَا سَمِعْتَ مِنْ، سَهْلٍ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ وَهْوَ يَزِيدُ فِيهَا ‏\n\"‏ فَأَقُولُ إِنَّهُمْ مِنِّي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ غَيَّرَ بَعْدِي ‏\"‏‏.‏ وَقَالَ ابْنُ عَبَّاسٍ سُحْقًا بُعْدًا، يُقَالُ سَحِيقٌ بَعِيدٌ، وَأَسْحَقَهُ أَبْعَدَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6584In-book reference : Book 81, Hadith 172USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6585,
    "id": 6585,
    "url": "https://sunnah.com/bukhari:6585",
    "bookNumber": 81,
    "hadithNumber": 173,
    "narrator": "Abu Huraira \nnarrated that the Prophet (ﷺ) said:",
    "english": "\"On the Day of Resurrection a group of companions will come to me, \nbut will be driven away from the Lake-Fount, and I will say, 'O Lord (those are) my companions!' It \nwill be said, 'You have no knowledge as to what they innovated after you left; they turned apostate as \nrenegades (reverted from Islam).",
    "arabic": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ الْحَبَطِيُّ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرِدُ عَلَىَّ يَوْمَ الْقِيَامَةِ رَهْطٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنِ الْحَوْضِ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6585In-book reference : Book 81, Hadith 173USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6586,
    "id": 6586,
    "url": "https://sunnah.com/bukhari:6586",
    "bookNumber": 81,
    "hadithNumber": 174,
    "narrator": "Narrated Ibn Al-Musaiyab:",
    "english": "The companions of the Prophet (ﷺ) said, \"Some men from my companions will come to my Lake-Fount \nand they will be driven away from it, and I will say, 'O Lord, my companions!' It will be said, 'You \nhave no knowledge of what they innovated after you left: they turned apostate as renegades (reverted \nfrom Islam).",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يُحَدِّثُ عَنْ أَصْحَابِ النَّبِيِّ، صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرِدُ عَلَى الْحَوْضِ رِجَالٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنْهُ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم فَيُجْلَوْنَ‏.‏ وَقَالَ عُقَيْلٌ فَيُحَلَّئُونَ‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6586In-book reference : Book 81, Hadith 174USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 586   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6587,
    "id": 6587,
    "url": "https://sunnah.com/bukhari:6587",
    "bookNumber": 81,
    "hadithNumber": 175,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"While I was sleeping, a group (of my followers were brought close to me), and \nwhen I recognized them, a man (an angel) came out from amongst (us) me and them, he said (to \nthem), 'Come along.' I asked, 'Where?' He said, 'To the (Hell) Fire, by Allah' I asked, 'what is wrong \nwith them' He said, 'They turned apostate as renegades after you left.' Then behold! (Another) group \n(of my followers) were brought close to me, and when I recognized them, a man (an angel) came out \nfrom (me and them) he said (to them); Come along.' I asked, \"Where?' He said, 'To the (Hell) Fire, by \nAllah.' I asked, What is wrong with them?' He said, 'They turned apostate as renegades after you left. \nSo I did not see anyone of them escaping except a few who were like camels without a shepherd.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَا أَنَا قَائِمٌ إِذَا زُمْرَةٌ، حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ فَقُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ وَمَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ ثُمَّ إِذَا زُمْرَةٌ حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ قُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ مَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ فَلاَ أُرَاهُ يَخْلُصُ مِنْهُمْ إِلاَّ مِثْلُ هَمَلِ النَّعَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6587In-book reference : Book 81, Hadith 175USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 587   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6588,
    "id": 6588,
    "url": "https://sunnah.com/bukhari:6588",
    "bookNumber": 81,
    "hadithNumber": 176,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from amongst the gardens of \nParadise, and my pulpit is over my Lake-Fount.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6588In-book reference : Book 81, Hadith 176USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 588   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6589,
    "id": 6589,
    "url": "https://sunnah.com/bukhari:6589",
    "bookNumber": 81,
    "hadithNumber": 177,
    "narrator": "Narrated Jundab:",
    "english": "I heard the Prophet, saying, \"I am your predecessor at the Lake-Fount. (Al-Kauthar) .",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْمَلِكَ، قَالَ سَمِعْتُ جُنْدَبًا، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6589In-book reference : Book 81, Hadith 177USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 589   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6590,
    "id": 6590,
    "url": "https://sunnah.com/bukhari:6590",
    "bookNumber": 81,
    "hadithNumber": 178,
    "narrator": "Narrated `Uqba bin 'Amir:",
    "english": "Once the Prophet (ﷺ) went out and offered the funeral prayers for the martyrs of Uhud, and then went to \nthe pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking \nat my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been \ngiven to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I \nam afraid that you will strive and struggle against each other over these treasures of the world.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ عَلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6590In-book reference : Book 81, Hadith 178USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 590   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6591,
    "id": 6591,
    "url": "https://sunnah.com/bukhari:6591",
    "bookNumber": 81,
    "hadithNumber": 179,
    "narrator": "Narrated Haritha bin Wahb:",
    "english": "I heard the Prophet (ﷺ) mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) \nis equal to the distance between Medina and Sana' (capital of Yemen).\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرَ الْحَوْضَ فَقَالَ ‏\n\"‏ كَمَا بَيْنَ الْمَدِينَةِ وَصَنْعَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6591In-book reference : Book 81, Hadith 179USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6592,
    "id": 6592,
    "url": "https://sunnah.com/bukhari:6592",
    "bookNumber": 81,
    "hadithNumber": 180,
    "narrator": "",
    "english": "Haritha said that he heard the \nProphet saying that his Lake-Fount would be as large as the distance between Sana' and Medina. Al- \nMustaurid said to Haritha, \"Didn't you hear him talking about the vessels?\" He said, \"No.\" Al- \nMustaurid said, \"The vessels are seen in it as (numberless as) the stars.\"",
    "arabic": "وَزَادَ ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ حَارِثَةَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَوْلَهُ حَوْضُهُ مَا بَيْنَ صَنْعَاءَ وَالْمَدِينَةِ‏.‏ فَقَالَ لَهُ الْمُسْتَوْرِدُ أَلَمْ تَسْمَعْهُ قَالَ الأَوَانِي‏.‏ قَالَ لاَ‏.‏ قَالَ الْمُسْتَوْرِدُ تُرَى فِيهِ الآنِيَةُ مِثْلَ الْكَوَاكِبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6592In-book reference : Book 81, Hadith 180USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6593,
    "id": 6593,
    "url": "https://sunnah.com/bukhari:6593",
    "bookNumber": 81,
    "hadithNumber": 181,
    "narrator": "Narrated Asma 'bint Abu Bakr:",
    "english": "The Prophet (ﷺ) said, \"I will be standing at the Lake-Fount so that I will see whom among you will come \nto me; and some people will be taken away from me, and I will say, 'O Lord, (they are) from me and \nfrom my followers.' Then it will be said, 'Did you notice what they did after you? By Allah, they kept \non turning on their heels (turned as renegades).' \" The sub-narrator, Ibn Abi Mulaika said, \"O Allah, \nwe seek refuge with You from turning on our heels, or being put to trial in our religion.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، عَنْ نَافِعِ بْنِ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي عَلَى الْحَوْضِ حَتَّى أَنْظُرُ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ، وَسَيُؤْخَذُ نَاسٌ دُونِي فَأَقُولُ يَا رَبِّ مِنِّي وَمِنْ أُمَّتِي‏.‏ فَيُقَالُ هَلْ شَعَرْتَ مَا عَمِلُوا بَعْدَكَ وَاللَّهِ مَا بَرِحُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ ‏\"‏‏.‏ فَكَانَ ابْنُ أَبِي مُلَيْكَةَ يَقُولُ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ نُفْتَنَ عَنْ دِينِنَا‏.‏ ‏{‏أَعْقَابِكُمْ تَنْكِصُونَ‏}‏ تَرْجِعُونَ عَلَى الْعَقِبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6593In-book reference : Book 81, Hadith 181USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 592   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6594,
    "id": 6594,
    "url": "https://sunnah.com/bukhari:6594",
    "bookNumber": 82,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ), the truthful and truly-inspired, said, \"Each one of you collected in the womb of his \nmother for forty days, and then turns into a clot for an equal period (of forty days) and turns into a \npiece of flesh for a similar period (of forty days) and then Allah sends an angel and orders him to \nwrite four things, i.e., his provision, his age, and whether he will be of the wretched or the blessed (in \nthe Hereafter). Then the soul is breathed into him. And by Allah, a person among you (or a man) may \ndo deeds of the people of the Fire till there is only a cubit or an arm-breadth distance between him and \nthe Fire, but then that writing (which Allah has ordered the angel to write) precedes, and he does the \ndeeds of the people of Paradise and enters it; and a man may do the deeds of the people of Paradise till \nthere is only a cubit or two between him and Paradise, and then that writing precedes and he does the \ndeeds of the people of the Fire and enters it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنِي سُلَيْمَانُ الأَعْمَشُ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ مَلَكًا فَيُؤْمَرُ بِأَرْبَعٍ بِرِزْقِهِ، وَأَجَلِهِ، وَشَقِيٌّ، أَوْ سَعِيدٌ، فَوَاللَّهِ إِنَّ أَحَدَكُمْ ـ أَوِ الرَّجُلَ ـ يَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا غَيْرُ بَاعٍ أَوْ ذِرَاعٍ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، فَيَدْخُلُهَا، وَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا غَيْرُ ذِرَاعٍ أَوْ ذِرَاعَيْنِ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، فَيَدْخُلُهَا ‏\"‏‏.‏ قَالَ آدَمُ إِلاَّ ذِرَاعٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6594In-book reference : Book 82, Hadith 1USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 593   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6595,
    "id": 6595,
    "url": "https://sunnah.com/bukhari:6595",
    "bookNumber": 82,
    "hadithNumber": 2,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Allah puts an angel in charge of the uterus and the angel says, 'O Lord, (it is) \nsemen! O Lord, (it is now ) a clot! O Lord, (it is now) a piece of flesh.' And then, if Allah wishes to \ncomplete its creation, the angel asks, 'O Lord, (will it be) a male or a female? A wretched (an evil \ndoer) or a blessed (doer of good)? How much will his provisions be? What will his age be?' So all that \nis written while the creature is still in the mother's womb.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَكَّلَ اللَّهُ بِالرَّحِمِ مَلَكًا فَيَقُولُ أَىْ رَبِّ نُطْفَةٌ، أَىْ رَبِّ عَلَقَةٌ، أَىْ رَبِّ مُضْغَةٌ‏.‏ فَإِذَا أَرَادَ اللَّهُ أَنْ يَقْضِيَ خَلْقَهَا قَالَ أَىْ رَبِّ ذَكَرٌ أَمْ أُنْثَى أَشَقِيٌّ أَمْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6595In-book reference : Book 82, Hadith 2USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 594   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6596,
    "id": 6596,
    "url": "https://sunnah.com/bukhari:6596",
    "bookNumber": 82,
    "hadithNumber": 3,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "A man said, \"O Allah's Messenger (ﷺ)! Can the people of Paradise be known (differentiated) from the people \nof the Fire; The Prophet (ﷺ) replied, \"Yes.\" The man said, \"Why do people (try to) do (good) deeds?\" The \nProphet said, \"Everyone will do the deeds for which he has been created to do or he will do those \ndeeds which will be made easy for him to do.\" (i.e. everybody will find easy to do such deeds as will \nlead him to his destined place for which he has been created).",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا يَزِيدُ الرِّشْكُ، قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيُعْرَفُ أَهْلُ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَلِمَ يَعْمَلُ الْعَامِلُونَ قَالَ ‏\"‏كُلٌّ يَعْمَلُ لِمَا خُلِقَ لَهُ ـ أَوْ لِمَا يُسِّرَ لَهُ‏\"‏ ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6596In-book reference : Book 82, Hadith 3USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 595   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6597,
    "id": 6597,
    "url": "https://sunnah.com/bukhari:6597",
    "bookNumber": 82,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) ; was asked about the offspring of the pagans. He said, \"Allah knows what they would \nhave done (were they to live).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏\n\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6597In-book reference : Book 82, Hadith 4USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6598,
    "id": 6598,
    "url": "https://sunnah.com/bukhari:6598",
    "bookNumber": 82,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) was asked about the offspring of the pagans. He said, \n     \"Allah knows what they would have done (were they to live).\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ وَأَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ ‏{‏اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 6598In-book reference : Book 82, Hadith 5USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6599,
    "id": 6599,
    "url": "https://sunnah.com/bukhari:6599",
    "bookNumber": 82,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"No child is born but has \n     the Islamic Faith, but its parents turn it into a Jew or a Christian. \n     It is as you help the animals give birth. Do you find among their \n     offspring a mutilated one before you mutilate them yourself?\" The \n     people said, \"O Allah's Messenger (ﷺ)! What do you think about those (of \n     them) who die young?\" The Prophet (ﷺ) said, \"Allah knows what they would \n     have done (were they to live).\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ، كَمَا تُنْتِجُونَ الْبَهِيمَةَ، هَلْ تَجِدُونَ فِيهَا مِنْ جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ وَهْوَ صَغِيرٌ قَالَ ‏{‏اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 6599, 6600In-book reference : Book 82, Hadith 6USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6600,
    "id": 6600,
    "url": "https://sunnah.com/bukhari:6600",
    "bookNumber": 82,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"No child is born but has \n     the Islamic Faith, but its parents turn it into a Jew or a Christian. \n     It is as you help the animals give birth. Do you find among their \n     offspring a mutilated one before you mutilate them yourself?\" The \n     people said, \"O Allah's Messenger (ﷺ)! What do you think about those (of \n     them) who die young?\" The Prophet (ﷺ) said, \"Allah knows what they would \n     have done (were they to live).\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ، كَمَا تُنْتِجُونَ الْبَهِيمَةَ، هَلْ تَجِدُونَ فِيهَا مِنْ جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ وَهْوَ صَغِيرٌ قَالَ ‏{‏اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 6599, 6600In-book reference : Book 82, Hadith 6USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6601,
    "id": 6601,
    "url": "https://sunnah.com/bukhari:6601",
    "bookNumber": 82,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"No woman should ask for the divorce of her sister (Muslim) so as to take her \nplace, but she should marry the man (without compelling him to divorce his other wife), for she will \nhave nothing but what Allah has written for her.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا، وَلْتَنْكِحْ، فَإِنَّ لَهَا مَا قُدِّرَ لَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6601In-book reference : Book 82, Hadith 7USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6602,
    "id": 6602,
    "url": "https://sunnah.com/bukhari:6602",
    "bookNumber": 82,
    "hadithNumber": 8,
    "narrator": "Narrated Usama:",
    "english": "Once while I was with the Prophet (ﷺ) and Sa`d, Ubai bin Ka`b and Mu`adh were also sitting with him, \nthere came to him a messenger from one of his daughters, telling him that her child was on the verge \nof death. The Prophet (ﷺ) told the messenger to tell her, \"It is for Allah what He takes, and it is for Allah \nwhat He gives, and everything has its fixed time (limit). So (she should) be patient and look for \nAllah's reward.\"",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ جَاءَهُ رَسُولُ إِحْدَى بَنَاتِهِ وَعِنْدَهُ سَعْدٌ وَأُبَىُّ بْنُ كَعْبٍ وَمُعَاذٌ أَنَّ ابْنَهَا يَجُودُ بِنَفْسِهِ‏.‏ فَبَعَثَ إِلَيْهَا ‏\n\"‏ لِلَّهِ مَا أَخَذَ، وَلِلَّهِ مَا أَعْطَى، كُلٌّ بِأَجَلٍ، فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6602In-book reference : Book 82, Hadith 8USC-MSA web (English) reference : Vol. 8, Book 77, Hadith 599   (deprecated numbering scheme)"
  }
]