[
  {
    "hadithGlobalNumber": 1201,
    "id": 1201,
    "url": "https://sunnah.com/bukhari:1201",
    "bookNumber": 21,
    "hadithNumber": 5,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The Prophet (ﷺ) went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time \nof the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet (ﷺ) is detained. Will you lead \nthe people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and \nAbu Bakr led the prayer. In the meantime the Prophet (ﷺ) came crossing the rows (of the praying people) \ntill he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither \nduring the prayer but when the people clapped too much, he looked back and saw the Prophet (ﷺ) in the \n(first) row. The Prophet (ﷺ) waved him to remain at his place, but Abu Bakr raised both his hands and \nsent praises to Allah and then retreated and the Prophet (ﷺ) went forward and led the prayer. (See Hadith \nNo. 295 & 296)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ، وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ أَبَا بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ حُبِسَ النَّبِيُّ صلى الله عليه وسلم فَتَؤُمُّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتُمْ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، فَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَصَلَّى، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا حَتَّى قَامَ فِي الصَّفِّ الأَوَّلِ، فَأَخَذَ النَّاسُ بِالتَّصْفِيحِ‏.‏ قَالَ سَهْلٌ هَلْ تَدْرُونَ مَا التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرُوا الْتَفَتَ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فِي الصَّفِّ، فَأَشَارَ إِلَيْهِ مَكَانَكَ‏.‏ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ وَتَقَدَّمَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1201In-book reference : Book 21, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1202,
    "id": 1202,
    "url": "https://sunnah.com/bukhari:1202",
    "bookNumber": 21,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "We used to say the greeting, name and greet each other in the prayer. Allah's Messenger (ﷺ) heard it and \nsaid:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- \nl-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha \nilla-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah \nand all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's \nmercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I \ntestify that none has the right to be worshipped but Allah and that Muhammad is His slave and \nApostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) \nworshipper of Allah, whether he be in the Heaven or on the Earth . \"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عِيسَى، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَقُولُ التَّحِيَّةُ فِي الصَّلاَةِ وَنُسَمِّي، وَيُسَلِّمُ بَعْضُنَا عَلَى بَعْضٍ، فَسَمِعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، فَإِنَّكُمْ إِذَا فَعَلْتُمْ ذَلِكَ فَقَدْ سَلَّمْتُمْ عَلَى كُلِّ عَبْدٍ لِلَّهِ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1202In-book reference : Book 21, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 294   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1203,
    "id": 1203,
    "url": "https://sunnah.com/bukhari:1203",
    "bookNumber": 21,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.\" (If something \nhappens in the prayer, the men can invite the attention of the Imam by saying \"Sub Han Allah\". And \nwomen, by clapping their hands).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1203In-book reference : Book 21, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 295   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1204,
    "id": 1204,
    "url": "https://sunnah.com/bukhari:1204",
    "bookNumber": 21,
    "hadithNumber": 8,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The Prophet (ﷺ) said, \"The saying 'Sub Han Allah' is for men and clapping is for women.",
    "arabic": "حَدَّثَنَا يَحْيَى، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيحُ لِلنِّسَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1204In-book reference : Book 21, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1205,
    "id": 1205,
    "url": "https://sunnah.com/bukhari:1205",
    "bookNumber": 21,
    "hadithNumber": 9,
    "narrator": "Narrated Anas bin Malik:",
    "english": "While Abu Bakr was leading the people in the morning prayer on a \n     Monday, the Prophet (ﷺ) came towards them suddenly having lifted the \n     curtain of 'Aisha's house, and looked at them as they were standing in\n     rows and smiled. Abu Bakr tried to come back thinking that Allah's \n     Apostle wanted to come out for the prayer. The attention of the \n     Muslims was diverted from the prayer because they were delighted to \n     see the Prophet. The Prophet (ﷺ) waved his hand to them to complete their \n     prayer, then he went back into the room and let down the curtain. The \n     Prophet expired on that very day.",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ يُونُسُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ الْمُسْلِمِينَ، بَيْنَا هُمْ فِي الْفَجْرِ يَوْمَ الاِثْنَيْنِ، وَأَبُو بَكْرٍ ـ رضى الله عنه ـ يُصَلِّي بِهِمْ فَفَجَأَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ ـ رضى الله عنها ـ فَنَظَرَ إِلَيْهِمْ، وَهُمْ صُفُوفٌ، فَتَبَسَّمَ يَضْحَكُ، فَنَكَصَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى عَقِبَيْهِ، وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُرِيدُ أَنْ يَخْرُجَ إِلَى الصَّلاَةِ، وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ فَرَحًا بِالنَّبِيِّ صلى الله عليه وسلم حِينَ رَأَوْهُ، فَأَشَارَ بِيَدِهِ أَنْ أَتِمُّوا، ثُمَّ دَخَلَ الْحُجْرَةَ وَأَرْخَى السِّتْرَ، وَتُوُفِّيَ ذَلِكَ الْيَوْمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1205In-book reference : Book 21, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1206,
    "id": 1206,
    "url": "https://sunnah.com/bukhari:1206",
    "bookNumber": 21,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"A woman called her son while he was in his \n     hermitage and said, 'O Juraij' He said, 'O Allah, my mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij!' He said again, 'O Allah ! My mother (is \n     calling me) and (I am offering) my prayer (what shall I do)?' She \n     again said, 'O Juraij' He again said, 'O Allah! My mother (is calling \n     me) and (I am offering) my prayer. (What shall I do?)' She said, 'O \n     Allah! Do not let Juraij die till he sees the faces of prostitutes.' A\n     shepherdess used to come by his hermitage for grazing her sheep and \n     she gave birth to a child. She was asked whose child that was, and she\n     replied that it was from Juraij and that he had come out from his \n     hermitage. Juraij said, 'Where is that woman who claims that her child\n     is from me?' (When she was brought to him along with the child), \n     Juraij asked the child, 'O Babus, who is your father?' The child \n     replied, 'The shepherd.' \" (See Hadith No 662. Vol 3).",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَادَتِ امْرَأَةٌ ابْنَهَا، وَهْوَ فِي صَوْمَعَةٍ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتِ اللَّهُمَّ لاَ يَمُوتُ جُرَيْجٌ حَتَّى يَنْظُرَ فِي وَجْهِ الْمَيَامِيسِ‏.‏ وَكَانَتْ تَأْوِي إِلَى صَوْمَعَتِهِ رَاعِيَةٌ تَرْعَى الْغَنَمَ فَوَلَدَتْ فَقِيلَ لَهَا مِمَّنْ هَذَا الْوَلَدُ قَالَتْ مِنْ جُرَيْجٍ نَزَلَ مِنْ صَوْمَعَتِهِ‏.‏ قَالَ جُرَيْجٌ أَيْنَ هَذِهِ الَّتِي تَزْعُمُ أَنَّ وَلَدَهَا لِي قَالَ يَا بَابُوسُ مَنْ أَبُوكَ قَالَ رَاعِي الْغَنَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1206In-book reference : Book 21, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1207,
    "id": 1207,
    "url": "https://sunnah.com/bukhari:1207",
    "bookNumber": 21,
    "hadithNumber": 11,
    "narrator": "Narrated Mu'aiqib:",
    "english": "The Prophet (ﷺ) talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then \ndo it once.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ حَدَّثَنِي مُعَيْقِيبٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ قَالَ ‏\n\"‏ إِنْ كُنْتَ فَاعِلاً فَوَاحِدَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1207In-book reference : Book 21, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 298   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1208,
    "id": 1208,
    "url": "https://sunnah.com/bukhari:1208",
    "bookNumber": 21,
    "hadithNumber": 12,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We used to pray with the Prophet (ﷺ) in scorching heat, and if someone of us could not put his face on the \nearth (because of the heat) then he would spread his clothes and prostrate over them.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا غَالِبٌ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي شِدَّةِ الْحَرِّ، فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ وَجْهَهُ مِنَ الأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1208In-book reference : Book 21, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 299   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1209,
    "id": 1209,
    "url": "https://sunnah.com/bukhari:1209",
    "bookNumber": 21,
    "hadithNumber": 13,
    "narrator": "Narrated Aisha:",
    "english": "I used to stretch my legs towards the Qibla of the Prophet (ﷺ) while he was praying; whenever he \nprostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch \nmy legs.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَمُدُّ رِجْلِي فِي قِبْلَةِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُصَلِّي، فَإِذَا سَجَدَ غَمَزَنِي فَرَفَعْتُهَا، فَإِذَا قَامَ مَدَدْتُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1209In-book reference : Book 21, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 300   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1210,
    "id": 1210,
    "url": "https://sunnah.com/bukhari:1210",
    "bookNumber": 21,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) once offered the prayer and said, \"Satan came in front of me and tried to interrupt my \nprayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him \nto one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the \nstatement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any \nother after me.' Then Allah made him (Satan) return with his head down (humiliated).\"",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى صَلاَةً قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ عَرَضَ لِي، فَشَدَّ عَلَىَّ لِيَقْطَعَ الصَّلاَةَ عَلَىَّ، فَأَمْكَنَنِي اللَّهُ مِنْهُ، فَذَعَتُّهُ، وَلَقَدْ هَمَمْتُ أَنْ أُوثِقَهُ إِلَى سَارِيَةٍ حَتَّى تُصْبِحُوا فَتَنْظُرُوا إِلَيْهِ فَذَكَرْتُ قَوْلَ سُلَيْمَانَ ـ عَلَيْهِ السَّلاَمُ ـ رَبِّ هَبْ لِي مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِي‏.‏ فَرَدَّهُ اللَّهُ خَاسِيًا ‏\"‏‏.‏ ثُمَّ قَالَ النَّضْرُ بْنُ شُمَيْلٍ فَذَعَتُّهُ بِالذَّالِ أَىْ خَنَقْتُهُ وَفَدَعَّتُّهُ مِنْ قَوْلِ اللَّهِ ‏{‏يَوْمَ يُدَعُّونَ‏}‏ أَىْ يُدْفَعُونَ وَالصَّوَابُ، فَدَعَتُّهُ إِلاَّ أَنَّهُ كَذَا قَالَ بِتَشْدِيدِ الْعَيْنِ وَالتَّاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1210In-book reference : Book 21, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 301   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1211,
    "id": 1211,
    "url": "https://sunnah.com/bukhari:1211",
    "bookNumber": 21,
    "hadithNumber": 15,
    "narrator": "Narrated Al-Azraq bin Qais:",
    "english": "We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was \npraying and the reins of his animal were in his hands and the animal was struggling and he was \nfollowing the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from \nthe Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his \nprayer, he said, \"I heard your remark. No doubt, I participated with Allah's Messenger (ﷺ) in six or seven or \neight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return \nto its stable, as it would cause me much trouble. \"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَزْرَقُ بْنُ قَيْسٍ، قَالَ كُنَّا بِالأَهْوَازِ نُقَاتِلُ الْحَرُورِيَّةَ، فَبَيْنَا أَنَا عَلَى جُرُفِ نَهَرٍ إِذَا رَجُلٌ يُصَلِّي، وَإِذَا لِجَامُ دَابَّتِهِ بِيَدِهِ فَجَعَلَتِ الدَّابَّةُ تُنَازِعُهُ، وَجَعَلَ يَتْبَعُهَا ـ قَالَ شُعْبَةُ ـ هُوَ أَبُو بَرْزَةَ الأَسْلَمِيُّ ـ فَجَعَلَ رَجُلٌ مِنَ الْخَوَارِجِ يَقُولُ اللَّهُمَّ افْعَلْ بِهَذَا الشَّيْخِ‏.‏ فَلَمَّا انْصَرَفَ الشَّيْخُ قَالَ إِنِّي سَمِعْتُ قَوْلَكُمْ، وَإِنِّي غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ غَزَوَاتٍ أَوْ سَبْعَ غَزَوَاتٍ وَثَمَانِيًا، وَشَهِدْتُ تَيْسِيرَهُ، وَإِنِّي أَنْ كُنْتُ أَنْ أُرَاجِعَ مَعَ دَابَّتِي أَحَبُّ إِلَىَّ مِنْ أَنْ أَدَعَهَا تَرْجِعُ إِلَى مَأْلَفِهَا فَيَشُقَّ عَلَىَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1211In-book reference : Book 21, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 302   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1212,
    "id": 1212,
    "url": "https://sunnah.com/bukhari:1212",
    "bookNumber": 21,
    "hadithNumber": 16,
    "narrator": "Narrated `Aisha:",
    "english": "Once the sun eclipsed and Allah's Messenger (ﷺ) stood up for the prayer and recited a very long Sura and \nwhen bowed for a long while and then raised his head and started reciting another Sura. Then he \nbowed, and after finishing, he prostrated and did the same in the second rak`a and then said, \"These \n(lunar and solar eclipses) are two of the signs of Allah and if you see them, pray till the eclipse is over. \nNo doubt, while standing at this place I saw everything promised to me by Allah and I saw (Paradise) \nand I wanted to pluck a bunch (of grapes) therefrom, at the time when you saw me stepping forward. \nNo doubt, I saw Hell with its different parts destroying each other when you saw me retreating and in \nit I saw `Amr bin Luhai who started the tradition of freeing animals (set them free) in the name of \nidols.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَ سُورَةً طَوِيلَةً، ثُمَّ رَكَعَ فَأَطَالَ، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ اسْتَفْتَحَ بِسُورَةٍ أُخْرَى، ثُمَّ رَكَعَ حَتَّى قَضَاهَا وَسَجَدَ، ثُمَّ فَعَلَ ذَلِكَ فِي الثَّانِيَةِ، ثُمَّ قَالَ ‏\n\"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَصَلُّوا حَتَّى يُفْرَجَ عَنْكُمْ، لَقَدْ رَأَيْتُ فِي مَقَامِي هَذَا كُلَّ شَىْءٍ وُعِدْتُهُ، حَتَّى لَقَدْ رَأَيْتُنِي أُرِيدُ أَنْ آخُذَ قِطْفًا مِنَ الْجَنَّةِ حِينَ رَأَيْتُمُونِي جَعَلْتُ أَتَقَدَّمُ، وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ، وَرَأَيْتُ فِيهَا عَمْرَو بْنَ لُحَىٍّ وَهُوَ الَّذِي سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1212In-book reference : Book 21, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 303   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1213,
    "id": 1213,
    "url": "https://sunnah.com/bukhari:1213",
    "bookNumber": 21,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) saw some sputum on the wall facing the Qibla of the mosque and became furious with \nthe people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he \nshould not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum \nwith his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he \nshould spit to his left.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ، فَتَغَيَّظَ عَلَى أَهْلِ الْمَسْجِدِ وَقَالَ ‏\n\"‏ إِنَّ اللَّهَ قِبَلَ أَحَدِكُمْ، فَإِذَا كَانَ فِي صَلاَتِهِ، فَلاَ يَبْزُقَنَّ ـ أَوْ قَالَ ـ لاَ يَتَنَخَّمَنَّ ‏\"‏‏.‏ ثُمَّ نَزَلَ فَحَتَّهَا بِيَدِهِ‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا بَزَقَ أَحَدُكُمْ فَلْيَبْزُقْ عَلَى يَسَارِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1213In-book reference : Book 21, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 304   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1214,
    "id": 1214,
    "url": "https://sunnah.com/bukhari:1214",
    "bookNumber": 21,
    "hadithNumber": 18,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so \nhe should neither spit in front of him nor on his right side but to his left side under his left foot.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ فِي الصَّلاَةِ فَإِنَّهُ يُنَاجِي رَبَّهُ، فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ شِمَالِهِ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1214In-book reference : Book 21, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 305   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1215,
    "id": 1215,
    "url": "https://sunnah.com/bukhari:1215",
    "bookNumber": 21,
    "hadithNumber": 19,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The people used to offer the prayer with the Prophet (ﷺ) with their waist-sheets tied round their necks \nbecause of the shortness of the sheets and the women were ordered not to lift their heads till the men \nhad sat straight.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّاسُ يُصَلُّونَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهُمْ عَاقِدُو أُزْرِهِمْ مِنَ الصِّغَرِ عَلَى رِقَابِهِمْ، فَقِيلَ لِلنِّسَاءِ ‏\n\"‏ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1215In-book reference : Book 21, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 306   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1216,
    "id": 1216,
    "url": "https://sunnah.com/bukhari:1216",
    "bookNumber": 21,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah:",
    "english": "I used to greet the Prophet (ﷺ) while he was in prayer and he would return my greeting, but when we \nreturned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the \ngreeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي الصَّلاَةِ فَيَرُدُّ عَلَىَّ، فَلَمَّا رَجَعْنَا سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ وَقَالَ ‏\n\"‏ إِنَّ فِي الصَّلاَةِ شُغْلاً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1216In-book reference : Book 21, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 307   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1217,
    "id": 1217,
    "url": "https://sunnah.com/bukhari:1217",
    "bookNumber": 21,
    "hadithNumber": 21,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) sent me for some job and when I had finished it I returned and came to the Prophet (ﷺ) \nand greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I \nsaid to myself,, 'Perhaps Allah's Messenger (ﷺ) is angry because I did not come quickly, then again I greeted \nhim but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he \nreturned the greeting and said, \"The thing which prevented me from returning the greeting was that I \nwas praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا كَثِيرُ بْنُ شِنْظِيرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ لَهُ فَانْطَلَقْتُ، ثُمَّ رَجَعْتُ وَقَدْ قَضَيْتُهَا، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ، فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي مَا اللَّهُ أَعْلَمُ بِهِ فَقُلْتُ فِي نَفْسِي لَعَلَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ عَلَىَّ أَنِّي أَبْطَأْتُ عَلَيْهِ، ثُمَّ سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي أَشَدُّ مِنَ الْمَرَّةِ الأُولَى، ثُمَّ سَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَىَّ فَقَالَ ‏\n\"‏ إِنَّمَا مَنَعَنِي أَنْ أَرُدَّ عَلَيْكَ أَنِّي كُنْتُ أُصَلِّي ‏\"‏‏.‏ وَكَانَ عَلَى رَاحِلَتِهِ مُتَوَجِّهًا إِلَى غَيْرِ الْقِبْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1217In-book reference : Book 21, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 308   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1218,
    "id": 1218,
    "url": "https://sunnah.com/bukhari:1218",
    "bookNumber": 21,
    "hadithNumber": 22,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's \nApostle and so he went to them along with some of his companions to affect a reconciliation. Allah's \nApostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \n\"O Abu Bakr! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the \npeople in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu \nBakr went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing \nthrough the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would \nnever look hither and thither during the prayer but when the people clapped much he looked back and \nsaw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr raised both his hands, praised \nAllah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the \nprayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you \nstart clapping when something happened to you in the prayer? Clapping is for women. Whenever one \nis confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the \nProphet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I \nbeckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the \nprayer in the presence of Allah's Messenger (ﷺ).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ بِقُبَاءٍ كَانَ بَيْنَهُمْ شَىْءٌ، فَخَرَجَ يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مِنْ أَصْحَابِهِ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ يَا أَبَا بَكْرٍ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ، فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ، وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا، حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيحِ‏.‏ قَالَ سَهْلٌ التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ قَالَ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ، يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَهُ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ بِالتَّصْفِيحِ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ، مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1218In-book reference : Book 21, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 309   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1219,
    "id": 1219,
    "url": "https://sunnah.com/bukhari:1219",
    "bookNumber": 21,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Huraira:",
    "english": "It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira \nfrom the Prophet.)",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نُهِيَ عَنِ الْخَصْرِ، فِي الصَّلاَةِ‏.‏ وَقَالَ هِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1219In-book reference : Book 21, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 310   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1220,
    "id": 1220,
    "url": "https://sunnah.com/bukhari:1220",
    "bookNumber": 21,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Huraira:",
    "english": "It was forbidden to pray with the hands over one's hips.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ نُهِيَ أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1220In-book reference : Book 21, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 311   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1221,
    "id": 1221,
    "url": "https://sunnah.com/bukhari:1221",
    "bookNumber": 21,
    "hadithNumber": 25,
    "narrator": "Narrated `Uqba bin Al-Harith:",
    "english": "I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly \nand went to some of his wives and then came out. He noticed the signs of astonishment on the faces of \nthe people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of \ngold was Lying in my house and I disliked that it should remain with us throughout the night, and so I \nhave ordered it to be distributed.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا عُمَرُ ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا سَلَّمَ قَامَ سَرِيعًا دَخَلَ عَلَى بَعْضِ نِسَائِهِ، ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَجُّبِهِمْ لِسُرْعَتِهِ فَقَالَ ‏\n\"‏ ذَكَرْتُ وَأَنَا فِي الصَّلاَةِ تِبْرًا عِنْدَنَا، فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1221In-book reference : Book 21, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 312   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1222,
    "id": 1222,
    "url": "https://sunnah.com/bukhari:1222",
    "bookNumber": 21,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels \npassing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; \nand when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes \nback and continues reminding the praying person of things that he used not to remember when not in \nprayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of \nyou has such a thing (forgetting the number of rak`at he has prayed) he should perform two \nprostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أُذِّنَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ التَّأْذِينَ، فَإِذَا سَكَتَ الْمُؤَذِّنُ أَقْبَلَ، فَإِذَا ثُوِّبَ أَدْبَرَ فَإِذَا سَكَتَ أَقْبَلَ، فَلاَ يَزَالُ بِالْمَرْءِ يَقُولُ لَهُ اذْكُرْ مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى لاَ يَدْرِي كَمْ صَلَّى ‏\"‏‏.‏ قَالَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ إِذَا فَعَلَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ‏.‏ وَسَمِعَهُ أَبُو سَلَمَةَ مِنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1222In-book reference : Book 21, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 313   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1223,
    "id": 1223,
    "url": "https://sunnah.com/bukhari:1223",
    "bookNumber": 21,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Huraira:",
    "english": "People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of \nthe Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" \nHe said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I \nknow. He recited such and such Sura.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ النَّاسُ أَكْثَرَ أَبُو هُرَيْرَةَ، فَلَقِيتُ رَجُلاً فَقُلْتُ بِمَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَارِحَةَ فِي الْعَتَمَةِ فَقَالَ لاَ أَدْرِي‏.‏ فَقُلْتُ لَمْ تَشْهَدْهَا قَالَ بَلَى‏.‏ قُلْتُ لَكِنْ أَنَا أَدْرِي، قَرَأَ سُورَةَ كَذَا وَكَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1223In-book reference : Book 21, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 314   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1224,
    "id": 1224,
    "url": "https://sunnah.com/bukhari:1224",
    "bookNumber": 22,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin Buhaina:",
    "english": "Allah's Messenger (ﷺ) once led us in a prayer and offered two rak`at and got up (for the third rak`a) without \nsitting (after the second rak`a). The people also got up with him, and when he was about to finish his \nprayer, we waited for him to finish the prayer with Taslim but he said Takbir before Taslim and \nperformed two prostrations while sitting and then finished the prayer with Taslim.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ مِنْ بَعْضِ الصَّلَوَاتِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ، فَقَامَ النَّاسُ مَعَهُ، فَلَمَّا قَضَى صَلاَتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ قَبْلَ التَّسْلِيمِ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ سَلَّمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1224In-book reference : Book 22, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 315   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1225,
    "id": 1225,
    "url": "https://sunnah.com/bukhari:1225",
    "bookNumber": 22,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah bin Buhaina:",
    "english": "Allah's Messenger (ﷺ) got up after the second rak`a of the Zuhr prayer without sitting in between (the second \nand the third rak`at). When he finished the prayer he performed two prostrations (of Sahu) and then \nfinished the prayer with Taslim.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ مِنِ اثْنَتَيْنِ مِنَ الظُّهْرِ لَمْ يَجْلِسْ بَيْنَهُمَا، فَلَمَّا قَضَى صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ بَعْدَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1225In-book reference : Book 22, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 316   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1226,
    "id": 1226,
    "url": "https://sunnah.com/bukhari:1226",
    "bookNumber": 22,
    "hadithNumber": 3,
    "narrator": "Narrated' `Abdullah:",
    "english": "Once Allah's Messenger (ﷺ) offered five rak`at in the Zuhr prayer, and somebody asked him whether there \nwas some increase in the prayer. Allah's Messenger (ﷺ) said, \"What is that?\" He said, \"You have offered five \nrak`at.\" So Allah's Messenger (ﷺ) performed two prostrations of Sahu after Taslim.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلاَةِ فَقَالَ ‏\n\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ صَلَّيْتَ خَمْسًا‏.‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1226In-book reference : Book 22, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 317   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1227,
    "id": 1227,
    "url": "https://sunnah.com/bukhari:1227",
    "bookNumber": 22,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to \nhim, \"O Allah's Messenger (ﷺ)! Has the prayer been reduced?\" The Prophet (ﷺ) asked his companions in the \naffirmative. So Allah's Messenger (ﷺ) I offered two more rak`at and then performed two prostrations (of \nSahu). Sa`d said, \"I saw that 'Urwa bin Az-Zubair had offered two rak`at in the Maghrib prayer and \nfinished it with Taslim. He then talked (and when he was informed about it) he completed the rest of \nhis prayer and performed two prostrations, and said, 'The Prophet (ﷺ) prayed like this.' \"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ أَوِ الْعَصْرَ فَسَلَّمَ، فَقَالَ لَهُ ذُو الْيَدَيْنِ الصَّلاَةُ يَا رَسُولَ اللَّهَ أَنَقَصَتْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\n\"‏ أَحَقٌّ مَا يَقُولُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَجَدَ سَجْدَتَيْنِ‏.‏ قَالَ سَعْدٌ وَرَأَيْتُ عُرْوَةَ بْنَ الزُّبَيْرِ صَلَّى مِنَ الْمَغْرِبِ رَكْعَتَيْنِ فَسَلَّمَ وَتَكَلَّمَ ثُمَّ صَلَّى مَا بَقِيَ وَسَجَدَ سَجْدَتَيْنِ وَقَالَ هَكَذَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1227In-book reference : Book 22, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 318   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1228,
    "id": 1228,
    "url": "https://sunnah.com/bukhari:1228",
    "bookNumber": 22,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira.:",
    "english": "Once Allah's Messenger (ﷺ) offered two rak`at and finished his prayer. So Dhul-Yadain asked him, \"Has the \nprayer been reduced or have you forgotten?\" Allah's Messenger (ﷺ) said, \"Has Dhul-Yadain spoken the \ntruth?\" The people replied in the affirmative. Then Allah's Messenger (ﷺ) stood up and offered the remaining \ntwo rak`at and performed Taslim, and then said Takbir and performed two prostrations like his usual \nprostrations, or a bit longer, and then got up.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنِ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقُصِرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَالَ النَّاسُ نَعَمْ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى اثْنَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1228In-book reference : Book 22, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 319   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1229,
    "id": 1229,
    "url": "https://sunnah.com/bukhari:1229",
    "bookNumber": 22,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) offered one of the evening prayers (the sub-narrator Muhammad said, \"I think that it was \nmost probably the `Asr prayer\") and he finished it after offering two rak`at only. He then stood near a \nprice of wood in front of the Mosque and put his hand over it. Abu Bakr and `Umar were amongst \nthose who were present, but they dared not talk to him about that (because of excessive respect for \nhim), and those who were in a hurry went out. They said, \"Has the prayer been reduced?\" A man who \nwas called Dhul-Yadain by the Prophet (ﷺ) said (to the Prophet), \"Has the prayer been reduced or have \nyou forgotten?\" He said, \"Neither have I forgotten, nor has the prayer been reduced.\" He said, \n\"Certainly you have forgotten.\" So the Prophet (ﷺ) offered two more rak`at and performed Taslim and \nthen said Takbir and performed a prostration of Sahu like his ordinary prostration or a bit longer and \nthen raised his head and said Takbir and then put his head down and performed a prostration like his \nordinary prostration or a bit longer, and then raised his head and said Takbir.",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم إِحْدَى صَلاَتَىِ الْعَشِيِّ ـ قَالَ مُحَمَّدٌ وَأَكْثَرُ ظَنِّي الْعَصْرَ ـ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ قَامَ إِلَى خَشَبَةٍ فِي مُقَدَّمِ الْمَسْجِدِ فَوَضَعَ يَدَهُ عَلَيْهَا وَفِيهِمْ أَبُو بَكْرٍ وَعُمَرُ ـ رضى الله عنهما ـ فَهَابَا أَنْ يُكَلِّمَاهُ وَخَرَجَ سَرَعَانُ النَّاسِ فَقَالُوا أَقَصُرَتِ الصَّلاَةُ وَرَجُلٌ يَدْعُوهُ النَّبِيُّ صلى الله عليه وسلم ذُو الْيَدَيْنِ فَقَالَ أَنَسِيتَ أَمْ قَصُرَتْ فَقَالَ ‏\n\"‏ لَمْ أَنْسَ وَلَمْ تُقْصَرْ ‏\"‏‏.‏ قَالَ بَلَى قَدْ نَسِيتَ‏.‏ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ فَكَبَّرَ، ثُمَّ وَضَعَ رَأْسَهُ فَكَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1229In-book reference : Book 22, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 321   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1230,
    "id": 1230,
    "url": "https://sunnah.com/bukhari:1230",
    "bookNumber": 22,
    "hadithNumber": 8,
    "narrator": "Narrated `Abdullah bin Buhaina Al-Asdi:",
    "english": "(the ally of Bani `Abdul Muttalib) Allah's Messenger (ﷺ) stood up for the Zuhr prayer and he should have sat \n(after the second rak`a but he stood up for the third rak`a without sitting for Tashah-hud) and when he \nfinished the prayer he performed two prostrations and said Takbir on each prostration while sitting, \nbefore ending (the prayer) with Taslim; and the people too performed the two prostrations with him \ninstead of the sitting he forgot.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ الأَسْدِيِّ، حَلِيفِ بَنِي عَبْدِ الْمُطَّلِبِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِي صَلاَةِ الظُّهْرِ وَعَلَيْهِ جُلُوسٌ، فَلَمَّا أَتَمَّ صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ فَكَبَّرَ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ، وَسَجَدَهُمَا النَّاسُ مَعَهُ مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ‏.‏ تَابَعَهُ ابْنُ جُرَيْجٍ عَنِ ابْنِ شِهَابٍ فِي التَّكْبِيرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1230In-book reference : Book 22, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 322   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1231,
    "id": 1231,
    "url": "https://sunnah.com/bukhari:1231",
    "bookNumber": 22,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When the call for prayer is made, Satan takes to his heels passing wind so that \nhe may not hear the Adhan and when the call is finished he comes back, and when the Iqama is \npronounced, Satan again takes to his heels, and when the Iqama is finished he comes back again and \ntries to interfere with the person and his thoughts and say, \"Remember this and that (which he has not \nthought of before the prayer)\", till the praying person forgets how much he has prayed. If anyone of \nyou does not remember whether he has offered three or four rak`at then he should perform two \nprostrations of Sahu while sitting.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ الدَّسْتَوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا نُودِيَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ وَلَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ الأَذَانَ، فَإِذَا قُضِيَ الأَذَانُ أَقْبَلَ، فَإِذَا ثُوِّبَ بِهَا أَدْبَرَ فَإِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطِرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ يَقُولُ اذْكُرْ كَذَا وَكَذَا مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَمْ صَلَّى، فَإِذَا لَمْ يَدْرِ أَحَدُكُمْ كَمْ صَلَّى ثَلاَثًا أَوْ أَرْبَعًا فَلْيَسْجُدْ سَجْدَتَيْنِ وَهْوَ جَالِسٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1231In-book reference : Book 22, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 323   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1232,
    "id": 1232,
    "url": "https://sunnah.com/bukhari:1232",
    "bookNumber": 22,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When anyone of you stands for the prayers, Satan comes and puts him in doubts \ntill he forgets how many rak`at he has prayed. So if this happens to anyone of you, he should perform \ntwo prostrations of Sahu while sitting.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ حَتَّى لاَ يَدْرِيَ كَمْ صَلَّى، فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1232In-book reference : Book 22, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 324   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1233,
    "id": 1233,
    "url": "https://sunnah.com/bukhari:1233",
    "bookNumber": 22,
    "hadithNumber": 11,
    "narrator": "Narrated Kuraib:",
    "english": "I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They \ntold me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr \nprayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the \nProphet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to \nbeat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \n\"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They \nthen told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama \nreplied, \"I heard the Prophet (ﷺ) forbidding them. Later I saw him offering them immediately after he \nprayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the \ntribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand \nbeside him and tell him that Um Salama says to you, \"O Allah's Messenger (ﷺ)! I have heard you forbidding \nthe offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves \nhis hand then wait for him.' The slave girl did that. The Prophet (ﷺ) beckoned her with his hand and she \nwaited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have \nasked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to \nme and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that \nI have just prayed) are for those (missed) ones.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، أَنَّ ابْنَ عَبَّاسٍ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ ـ رضى الله عنهم ـ أَرْسَلُوهُ إِلَى عَائِشَةَ ـ رضى الله عنها ـ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلاَمَ مِنَّا جَمِيعًا وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ صَلاَةِ الْعَصْرِ وَقُلْ لَهَا إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْهَا‏.‏ وَقَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ النَّاسَ مَعَ عُمَرَ بْنِ الْخَطَّابِ عَنْهُمَا‏.‏ فَقَالَ كُرَيْبٌ فَدَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَبَلَّغْتُهَا مَا أَرْسَلُونِي‏.‏ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ‏.‏ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ ـ رضى الله عنها ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَنْهَى عَنْهَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا حِينَ صَلَّى الْعَصْرَ، ثُمَّ دَخَلَ عَلَىَّ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنَ الأَنْصَارِ فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ قُولِي لَهُ تَقُولُ لَكَ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ سَمِعْتُكَ تَنْهَى عَنْ هَاتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا‏.‏ فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ‏.‏ فَفَعَلَتِ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَإِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1233In-book reference : Book 22, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 325   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1234,
    "id": 1234,
    "url": "https://sunnah.com/bukhari:1234",
    "bookNumber": 22,
    "hadithNumber": 12,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
    "english": "The news about the differences amongst the people of Bani `Amr bin `Auf reached Allah's Messenger (ﷺ) \nand so he went to them along with some of his companions to effect a reconciliation between them. \nAllah's Messenger (ﷺ) was delayed there, and the time of the prayer was due. Bilal went to Abu Bakr and \nsaid to him, \"Allah's Messenger (ﷺ) has been delayed (there) and the time of prayer is due. So will you lead \nthe people in prayer?\" Abu Bakr said, \"Yes, if you wish.\" Bilal pronounced the Iqama and Abu Bakr, \nwent forward and said Takbir for the people. In the meantime Allah's Messenger (ﷺ) came crossing the rows \n(of the praying people) and stood in the (first) row and the people started clapping. Abu Bakr, would \nnever glance sideways in his prayer but when the people clapped much he looked back and (ﷺ) \nAllah's Messenger (ﷺ) . Allah's Messenger (ﷺ) beckoned him to carry on the prayer. Abu Bakr raised his hands and \nthanked Allah, and retreated till he reached the (first) row. Allah's Messenger (ﷺ) went forward and led the \npeople in the prayer. When he completed the prayer he faced the people and said, \"O people! Why did \nyou start clapping when something unusual happened to you in the prayer? Clapping is only for \nwomen. So whoever amongst you comes across something in the prayer should say, 'Subhan-Allah' \nfor there is none who will not turn round on hearing him saying Subhan-Allah. O Abu Bakr! What \nprevented you from leading the people in the prayer when I beckoned you to do so?\" Abu Bakr \nreplied, \"How dare the son of Abu Quhafa lead the prayer in the presence of Allah's Messenger (ﷺ) ?\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَلَغَهُ أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ كَانَ بَيْنَهُمْ شَىْءٌ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مَعَهُ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ يَا أَبَا بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيقِ، وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَيْهِ فَحَمِدَ اللَّهَ وَرَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، فَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ فِي التَّصْفِيقِ، إِنَّمَا التَّصْفِيقُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ‏.‏ فَإِنَّهُ لاَ يَسْمَعُهُ أَحَدٌ حِينَ يَقُولُ سُبْحَانَ اللَّهِ إِلاَّ الْتَفَتَ، يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1234In-book reference : Book 22, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 326   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1235,
    "id": 1235,
    "url": "https://sunnah.com/bukhari:1235",
    "bookNumber": 22,
    "hadithNumber": 13,
    "narrator": "Narrated Asma':",
    "english": "I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \n\"What is the matter with the people?\" She beckoned with her head towards the sky. \nI said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنَا الثَّوْرِيُّ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَهِيَ تُصَلِّي قَائِمَةً وَالنَّاسُ قِيَامٌ فَقُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ‏.‏ فَقُلْتُ آيَةٌ‏.‏ فَقَالَتْ بِرَأْسِهَا أَىْ نَعَمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1235In-book reference : Book 22, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 327   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1236,
    "id": 1236,
    "url": "https://sunnah.com/bukhari:1236",
    "bookNumber": 22,
    "hadithNumber": 14,
    "narrator": "Narrated `Aisha the wife of the Prophet:",
    "english": "Allah's Messenger (ﷺ) during his illness prayed in his house sitting, whereas some people followed him \nstanding, but the Prophet (ﷺ) beckoned them to sit down. On completion of the prayer he said, \"The Imam \nis to be followed. So, bow when he bows, and raise your head when he raises his head.\" (See Hadith \nNo. 657 Vol 1 for taking the verdict).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِهِ وَهُوَ شَاكٍ جَالِسًا، وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1236In-book reference : Book 22, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 328   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1237,
    "id": 1237,
    "url": "https://sunnah.com/bukhari:1237",
    "bookNumber": 23,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Dhar:",
    "english": "Allah's Messenger (ﷺ) said, \"Someone came to me from my Lord and gave me the news (or good tidings) \nthat if any of my followers dies worshipping none (in any way) along with Allah, he will enter \nParadise.\" I asked, \"Even if he committed illegal sexual intercourse (adultery) and theft?\" He replied, \n\"Even if he committed illegal sexual intercourse (adultery) and theft.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَانِي آتٍ مِنْ رَبِّي فَأَخْبَرَنِي ـ أَوْ قَالَ بَشَّرَنِي ـ أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1237In-book reference : Book 23, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 329   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1238,
    "id": 1238,
    "url": "https://sunnah.com/bukhari:1238",
    "bookNumber": 23,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"Anyone who dies worshipping others along with Allah will definitely enter the \nFire.\" I said, \"Anyone who dies worshipping none along with Allah will definitely enter Paradise.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أَنَا مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1238In-book reference : Book 23, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 330   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1239,
    "id": 1239,
    "url": "https://sunnah.com/bukhari:1239",
    "bookNumber": 23,
    "hadithNumber": 3,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do other seven. He ordered us: \nto follow the funeral procession. to visit the sick, to accept invitations, to help the oppressed, to fulfill \nthe oaths, to return the greeting and to reply to the sneezer: (saying, \"May Allah be merciful on you,\" \nprovided the sneezer says, \"All the praises are for Allah,\"). He forbade us to use silver utensils and \ndishes and to wear golden rings, silk (clothes), Dibaj (pure silk cloth), Qissi and Istabraq (two kinds of \nsilk cloths).",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَائِزِ، وَعِيَادَةِ الْمَرِيضِ، وَإِجَابَةِ الدَّاعِي، وَنَصْرِ الْمَظْلُومِ، وَإِبْرَارِ الْقَسَمِ، وَرَدِّ السَّلاَمِ، وَتَشْمِيتِ الْعَاطِسِ‏.‏ وَنَهَانَا عَنْ آنِيَةِ الْفِضَّةِ، وَخَاتَمِ الذَّهَبِ، وَالْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1239In-book reference : Book 23, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 331   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1240,
    "id": 1240,
    "url": "https://sunnah.com/bukhari:1240",
    "bookNumber": 23,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The rights of a Muslim on the Muslims are five: to respond to the salaam, visiting the sick, to follow the funeral processions, to accept an invitation, and to reply to those who sneeze. (see Hadith 1239)",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، عَنِ الأَوْزَاعِيِّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ رَدُّ السَّلاَمِ، وَعِيَادَةُ الْمَرِيضِ، وَاتِّبَاعُ الْجَنَائِزِ، وَإِجَابَةُ الدَّعْوَةِ، وَتَشْمِيتُ الْعَاطِسِ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ‏.‏ وَرَوَاهُ سَلاَمَةُ عَنْ عُقَيْلٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1240In-book reference : Book 23, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 332   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1241,
    "id": 1241,
    "url": "https://sunnah.com/bukhari:1241",
    "bookNumber": 23,
    "hadithNumber": 5,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Bakr came riding his horse from his dwelling place in As-Sunh. He got down from it, entered the \nMosque and did not speak with anybody till he came to me and went direct to the Prophet, who was \ncovered with a marked blanket. Abu Bakr uncovered his face. He knelt down and kissed him and then \nstarted weeping and said, \"My father and my mother be sacrificed for you, O Allah's Prophet! Allah \nwill not combine two deaths on you. You have died the death which was written for you.\" \nNarrated Abu Salama from Ibn `Abbas : Abu Bakr came out and `Umar , was addressing the people, \nand Abu Bakr told him to sit down but `Umar refused. Abu Bakr again told him to sit down but `Umar \nagain refused. Then Abu Bakr recited the Tashah-hud (i.e. none has the right to be worshipped but \nAllah and Muhammad is Allah's Messenger (ﷺ)) and the people attended to Abu Bakr and left `Umar. Abu \nBakr said, \"Amma ba'du, whoever amongst you worshipped Muhammad, then Muhammad is dead, \nbut whoever worshipped Allah, Allah is alive and will never die. Allah said: 'Muhammad is no more \nthan an Apostle and indeed (many) Apostles have passed away before him ..(up to the) grateful.' \" \n(3.144) (The narrator added, \"By Allah, it was as if the people never knew that Allah had revealed this \nverse before till Abu Bakr recited it and then whoever heard it, started reciting it.\")",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ قَالَتْ أَقْبَلَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى فَرَسِهِ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ، فَلَمْ يُكَلِّمِ النَّاسَ، حَتَّى نَزَلَ فَدَخَلَ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَتَيَمَّمَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُسَجًّى بِبُرْدِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ، ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ ثُمَّ بَكَى فَقَالَ بِأَبِي أَنْتَ يَا نَبِيَّ اللَّهِ، لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ أَبُو سَلَمَةَ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ خَرَجَ وَعُمَرُ ـ رضى الله عنه ـ يُكَلِّمُ النَّاسَ‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى، فَتَشَهَّدَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَمَالَ إِلَيْهِ النَّاسُ، وَتَرَكُوا عُمَرَ فَقَالَ أَمَّا بَعْدُ، فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا صلى الله عليه وسلم قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ تَعَالَى ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَكُونُوا يَعْلَمُونَ أَنَّ اللَّهَ أَنْزَلَ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ ـ رضى الله عنه ـ فَتَلَقَّاهَا مِنْهُ النَّاسُ، فَمَا يُسْمَعُ بَشَرٌ إِلاَّ يَتْلُوهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1241, 1242In-book reference : Book 23, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 333   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1242,
    "id": 1242,
    "url": "https://sunnah.com/bukhari:1242",
    "bookNumber": 23,
    "hadithNumber": 5,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Bakr came riding his horse from his dwelling place in As-Sunh. He got down from it, entered the \nMosque and did not speak with anybody till he came to me and went direct to the Prophet, who was \ncovered with a marked blanket. Abu Bakr uncovered his face. He knelt down and kissed him and then \nstarted weeping and said, \"My father and my mother be sacrificed for you, O Allah's Prophet! Allah \nwill not combine two deaths on you. You have died the death which was written for you.\" \nNarrated Abu Salama from Ibn `Abbas : Abu Bakr came out and `Umar , was addressing the people, \nand Abu Bakr told him to sit down but `Umar refused. Abu Bakr again told him to sit down but `Umar \nagain refused. Then Abu Bakr recited the Tashah-hud (i.e. none has the right to be worshipped but \nAllah and Muhammad is Allah's Messenger (ﷺ)) and the people attended to Abu Bakr and left `Umar. Abu \nBakr said, \"Amma ba'du, whoever amongst you worshipped Muhammad, then Muhammad is dead, \nbut whoever worshipped Allah, Allah is alive and will never die. Allah said: 'Muhammad is no more \nthan an Apostle and indeed (many) Apostles have passed away before him ..(up to the) grateful.' \" \n(3.144) (The narrator added, \"By Allah, it was as if the people never knew that Allah had revealed this \nverse before till Abu Bakr recited it and then whoever heard it, started reciting it.\")",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ قَالَتْ أَقْبَلَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى فَرَسِهِ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ، فَلَمْ يُكَلِّمِ النَّاسَ، حَتَّى نَزَلَ فَدَخَلَ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَتَيَمَّمَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُسَجًّى بِبُرْدِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ، ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ ثُمَّ بَكَى فَقَالَ بِأَبِي أَنْتَ يَا نَبِيَّ اللَّهِ، لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ أَبُو سَلَمَةَ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ خَرَجَ وَعُمَرُ ـ رضى الله عنه ـ يُكَلِّمُ النَّاسَ‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى، فَتَشَهَّدَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَمَالَ إِلَيْهِ النَّاسُ، وَتَرَكُوا عُمَرَ فَقَالَ أَمَّا بَعْدُ، فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا صلى الله عليه وسلم قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ تَعَالَى ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَكُونُوا يَعْلَمُونَ أَنَّ اللَّهَ أَنْزَلَ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ ـ رضى الله عنه ـ فَتَلَقَّاهَا مِنْهُ النَّاسُ، فَمَا يُسْمَعُ بَشَرٌ إِلاَّ يَتْلُوهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1241, 1242In-book reference : Book 23, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 333   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1243,
    "id": 1243,
    "url": "https://sunnah.com/bukhari:1243",
    "bookNumber": 23,
    "hadithNumber": 6,
    "narrator": "Narrated Kharija bin Zaid bin Thabit:",
    "english": "Um Al-`Ala', an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) said to me, \"The \nemigrants were distributed amongst us by drawing lots and we got in our share `Uthman bin Maz'un. \nWe made him stay with us in our house. Then he suffered from a disease which proved fatal when he \ndied and was given a bath and was shrouded in his clothes, Allah's Messenger (ﷺ) came I said, 'May Allah be \nmerciful to you, O Abu As-Sa'ib! I testify that Allah has honored you'. The Prophet (ﷺ) said, 'How do you \nknow that Allah has honored him?' I replied, 'O Allah's Messenger (ﷺ)! Let my father be sacrificed for you! \nOn whom else shall Allah bestow His honor?' The Prophet (ﷺ) said, 'No doubt, death came to him. By \nAllah, I too wish him good, but by Allah, I do not know what Allah will do with me though I am \nAllah's Messenger (ﷺ). ' By Allah, I never attested the piety of anyone after that.\"\n\nAl-Laith also narrated as above.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَنَّ أُمَّ الْعَلاَءِ ـ امْرَأَةً مِنَ الأَنْصَارِ ـ بَايَعَتِ النَّبِيَّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهُ اقْتُسِمَ الْمُهَاجِرُونَ قُرْعَةً فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ، فَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا، فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ، فَلَمَّا تُوُفِّيَ وَغُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ، دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ قَدْ أَكْرَمَهُ ‏\"‏‏.‏ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ فَمَنْ يُكْرِمُهُ اللَّهُ فَقَالَ ‏\"‏ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ، وَاللَّهِ إِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَاللَّهِ مَا أَدْرِي ـ وَأَنَا رَسُولُ اللَّهِ ـ مَا يُفْعَلُ بِي ‏\"‏‏.‏ قَالَتْ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ أَبَدًا‏.‏   \nحَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، مِثْلَهُ‏.‏ وَقَالَ نَافِعُ بْنُ يَزِيدَ عَنْ عُقَيْلٍ، مَا يُفْعَلُ بِهِ وَتَابَعَهُ شُعَيْبٌ وَعَمْرُو بْنُ دِينَارٍ وَمَعْمَرٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1243In-book reference : Book 23, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 334   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1244,
    "id": 1244,
    "url": "https://sunnah.com/bukhari:1244",
    "bookNumber": 23,
    "hadithNumber": 7,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to \ndo so but the Prophet (ﷺ) did not forbid me. Then my aunt Fatima began weeping and the Prophet (ﷺ) said, \"It \nis all the same whether you weep or not. The angels were shading him continuously with their wings \ntill you shifted him (from the field). \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا قُتِلَ أَبِي جَعَلْتُ أَكْشِفُ الثَّوْبَ عَنْ وَجْهِهِ أَبْكِي، وَيَنْهَوْنِي عَنْهُ وَالنَّبِيُّ صلى الله عليه وسلم لاَ يَنْهَانِي، فَجَعَلَتْ عَمَّتِي فَاطِمَةُ تَبْكِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ تَبْكِينَ أَوْ لاَ تَبْكِينَ، مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رَفَعْتُمُوهُ ‏\"‏‏.‏ تَابَعَهُ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ الْمُنْكَدِرِ سَمِعَ جَابِرًا ـ رضى الله عنه ـ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1244In-book reference : Book 23, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 336   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1245,
    "id": 1245,
    "url": "https://sunnah.com/bukhari:1245",
    "bookNumber": 23,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) informed (the people) about the death of An-Najashi on the very day he died. He went \ntowards the Musalla (praying place) and the people stood behind him in rows. He said four Takbirs \n(i.e. offered the Funeral prayer).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ، خَرَجَ إِلَى الْمُصَلَّى، فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1245In-book reference : Book 23, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 337   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1246,
    "id": 1246,
    "url": "https://sunnah.com/bukhari:1246",
    "bookNumber": 23,
    "hadithNumber": 9,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Zaid took over the flag and was martyred. Then it was taken by Jafar who was \nmartyred as well. Then `Abdullah bin Rawaha took the flag but he too was martyred and at that time \nthe eyes of Allah's Messenger (ﷺ) were full of tears. Then Khalid bin Al-Walid took the flag without being \nnominated as a chief (before hand) and was blessed with victory.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا عَبْدُ اللَّهِ بْنُ رَوَاحَةَ فَأُصِيبَ ـ وَإِنَّ عَيْنَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَتَذْرِفَانِ ـ ثُمَّ أَخَذَهَا خَالِدُ بْنُ الْوَلِيدِ مِنْ غَيْرِ إِمْرَةٍ فَفُتِحَ لَهُ ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 1246In-book reference : Book 23, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 338   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1247,
    "id": 1247,
    "url": "https://sunnah.com/bukhari:1247",
    "bookNumber": 23,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Abbas.:",
    "english": "A person died and Allah's Messenger (ﷺ) used to visit him. He died at night and (the people) buried him at \nnight. In the morning they informed the Prophet (about his death). He said, \"What prevented you from \ninforming me?\" They replied, \"It was night and it was a dark night and so we disliked to trouble you.\" \nThe Prophet (ﷺ) went to his grave and offered the (funeral) prayer.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَاتَ إِنْسَانٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُهُ فَمَاتَ بِاللَّيْلِ فَدَفَنُوهُ لَيْلاً، فَلَمَّا أَصْبَحَ أَخْبَرُوهُ فَقَالَ ‏\n\"‏ مَا مَنَعَكُمْ أَنْ تُعْلِمُونِي ‏\"‏‏.‏ قَالُوا كَانَ اللَّيْلُ فَكَرِهْنَا ـ وَكَانَتْ ظُلْمَةٌ ـ أَنْ نَشُقَّ عَلَيْكَ‏.‏ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1247In-book reference : Book 23, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 339   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1248,
    "id": 1248,
    "url": "https://sunnah.com/bukhari:1248",
    "bookNumber": 23,
    "hadithNumber": 11,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"A Muslim whose three children die before the age of puberty will be granted \nParadise by Allah due to his mercy for them.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا مِنَ النَّاسِ مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلاَثٌ لَمْ يَبْلُغُوا الْحِنْثَ، إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1248In-book reference : Book 23, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 340   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1249,
    "id": 1249,
    "url": "https://sunnah.com/bukhari:1249",
    "bookNumber": 23,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The women requested the Prophet, \"Please fix a day for us.\" So the Prophet (ﷺ) preached to them and \nsaid, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing \nthat, a woman asked, \"If two died?\" The Prophet (ﷺ) replied, \"Even two (would screen her from the (Hell) \nFire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ، رضى الله عنه أَنَّ النِّسَاءَ، قُلْنَ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ لَنَا يَوْمًا‏.‏ فَوَعَظَهُنَّ، وَقَالَ ‏\"‏ أَيُّمَا امْرَأَةٍ مَاتَ لَهَا ثَلاَثَةٌ مِنَ الْوَلَدِ كَانُوا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاثْنَانِ‏.‏ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏   وَقَالَ شَرِيكٌ عَنِ ابْنِ الأَصْبَهَانِيِّ، حَدَّثَنِي أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَبُو هُرَيْرَةَ ‏\"‏ لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1249, 1250In-book reference : Book 23, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 341   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1250,
    "id": 1250,
    "url": "https://sunnah.com/bukhari:1250",
    "bookNumber": 23,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The women requested the Prophet, \"Please fix a day for us.\" So the Prophet (ﷺ) preached to them and \nsaid, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing \nthat, a woman asked, \"If two died?\" The Prophet (ﷺ) replied, \"Even two (would screen her from the (Hell) \nFire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ، رضى الله عنه أَنَّ النِّسَاءَ، قُلْنَ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ لَنَا يَوْمًا‏.‏ فَوَعَظَهُنَّ، وَقَالَ ‏\"‏ أَيُّمَا امْرَأَةٍ مَاتَ لَهَا ثَلاَثَةٌ مِنَ الْوَلَدِ كَانُوا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاثْنَانِ‏.‏ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏   وَقَالَ شَرِيكٌ عَنِ ابْنِ الأَصْبَهَانِيِّ، حَدَّثَنِي أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَبُو هُرَيْرَةَ ‏\"‏ لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1249, 1250In-book reference : Book 23, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 341   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1251,
    "id": 1251,
    "url": "https://sunnah.com/bukhari:1251",
    "bookNumber": 23,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"No Muslim whose three children died will go to the Fire except for Allah's oath \n(i.e. everyone has to pass over the bridge above the lake of fire).\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لِمُسْلِمٍ ثَلاَثَةٌ مِنَ الْوَلَدِ، فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏وَإِنْ مِنْكُمْ إِلاَّ وَارِدُهَا‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1251In-book reference : Book 23, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 342   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1252,
    "id": 1252,
    "url": "https://sunnah.com/bukhari:1252",
    "bookNumber": 23,
    "hadithNumber": 14,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) passed by a woman who was sitting and weeping beside a grave and said to her, \"Fear \nAllah and be patient.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ عِنْدَ قَبْرٍ وَهِيَ تَبْكِي فَقَالَ ‏\n\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1252In-book reference : Book 23, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 343   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1253,
    "id": 1253,
    "url": "https://sunnah.com/bukhari:1253",
    "bookNumber": 23,
    "hadithNumber": 15,
    "narrator": "Narrated Um 'Atiyya al-Ansariya:",
    "english": "Allah's Messenger (ﷺ) came to us when his daughter died and said, \"Wash her thrice or five times or more, if \nyou see it necessary, with water and Sidr and then apply camphor or some camphor at the end; and \nwhen you finish, notify me.\" So when we finished it, we informed him and he gave us his waist-sheet \nand told us to shroud the dead body in it.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مَنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ تَعْنِي إِزَارَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1253In-book reference : Book 23, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 344   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1254,
    "id": 1254,
    "url": "https://sunnah.com/bukhari:1254",
    "bookNumber": 23,
    "hadithNumber": 16,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "Allah's Messenger (ﷺ) came to us and we were giving a bath to his (dead) daughter and said, \"Wash her \nthree, five or more times with water and Sidr and sprinkle camphor on her at the end; and when you \nfinish, notify me.\" So when we finished, we informed him and he gave us his waist-sheet and told us \nto shroud her in it. Aiyub said that Hafsa narrated to him a narration similar to that of Muhammad in \nwhich it was said that the bath was to be given for an odd number of times, and the numbers 3, 5 or 7 \nwere mentioned. It was also said that they were to start with the right side and with the parts which \nwere washed in ablution, and that Um 'Atiyya also mentioned, \"We combed her hair and divided them \nin three braids.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ فَقَالَ أَيُّوبُ وَحَدَّثَتْنِي حَفْصَةُ بِمِثْلِ حَدِيثِ مُحَمَّدٍ وَكَانَ فِي حَدِيثِ حَفْصَةَ ‏\"‏ اغْسِلْنَهَا وِتْرًا ‏\"‏‏.‏ وَكَانَ فِيهِ ‏:‏ ‏\"‏ ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّهُ قَالَ ‏\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّ أُمَّ عَطِيَّةَ قَالَتْ وَمَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1254In-book reference : Book 23, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 345   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1255,
    "id": 1255,
    "url": "https://sunnah.com/bukhari:1255",
    "bookNumber": 23,
    "hadithNumber": 17,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "Allah's Messenger (ﷺ) , concerning his (dead) daughter's bath, said, \"Start with the right side, and the parts \nwhich are washed in ablution.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَسْلِ ابْنَتِهِ ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1255In-book reference : Book 23, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 346   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1256,
    "id": 1256,
    "url": "https://sunnah.com/bukhari:1256",
    "bookNumber": 23,
    "hadithNumber": 18,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "When we washed the deceased daughter of the Prophet, he said to us, while we were washing her, \n\"Start the bath from the right side and from the parts which are washed in ablution.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا غَسَّلْنَا بِنْتَ النَّبِيِّ صلى الله عليه وسلم قَالَ لَنَا وَنَحْنُ نَغْسِلُهَا ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1256In-book reference : Book 23, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 347   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1257,
    "id": 1257,
    "url": "https://sunnah.com/bukhari:1257",
    "bookNumber": 23,
    "hadithNumber": 19,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "The daughter of the Prophet (ﷺ) expired, and he said to us, \"Wash her three or five times, or more if you \nsee it necessary, and when you finish, notify me.\" So, (when we finished) we informed him and he \nunfastened his waist-sheet and told us to shroud her in it.",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَمَّادٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ بِنْتُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَنَا ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَنَزَعَ مِنْ حِقْوِهِ إِزَارَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1257In-book reference : Book 23, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 348   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1258,
    "id": 1258,
    "url": "https://sunnah.com/bukhari:1258",
    "bookNumber": 23,
    "hadithNumber": 20,
    "narrator": "Narrated Muhammad:",
    "english": "Um 'Atiyya said, \"One of the daughters of the Prophet (ﷺ) died and he came out and said, 'Wash her three \nor five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or \nsome camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we \ninformed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another \nnarration) added, \"The Prophet (ﷺ) said, 'Wash her three, five or seven times or more, if you think it \nnecessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
    "arabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ، فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏   وَعَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنهما ـ بِنَحْوِهِ وَقَالَتْ إِنَّهُ قَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ قَالَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1258, 1259In-book reference : Book 23, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 349   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1259,
    "id": 1259,
    "url": "https://sunnah.com/bukhari:1259",
    "bookNumber": 23,
    "hadithNumber": 20,
    "narrator": "Narrated Muhammad:",
    "english": "Um 'Atiyya said, \"One of the daughters of the Prophet (ﷺ) died and he came out and said, 'Wash her three \nor five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or \nsome camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we \ninformed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another \nnarration) added, \"The Prophet (ﷺ) said, 'Wash her three, five or seven times or more, if you think it \nnecessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
    "arabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ، فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏   وَعَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنهما ـ بِنَحْوِهِ وَقَالَتْ إِنَّهُ قَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ قَالَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1258, 1259In-book reference : Book 23, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 349   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1260,
    "id": 1260,
    "url": "https://sunnah.com/bukhari:1260",
    "bookNumber": 23,
    "hadithNumber": 21,
    "narrator": "Narrated Hafsa bint Seereen:",
    "english": "Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Messenger (ﷺ) in three braids. \nThey first undid her hair, washed and then entwined it in three braids.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَيُّوبُ وَسَمِعْتُ حَفْصَةَ بِنْتَ سِيرِينَ، قَالَتْ حَدَّثَتْنَا أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ أَنَّهُنَّ جَعَلْنَ رَأْسَ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ قُرُونٍ نَقَضْنَهُ ثُمَّ غَسَلْنَهُ ثُمَّ جَعَلْنَهُ ثَلاَثَةَ قُرُونٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1260In-book reference : Book 23, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 350   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1261,
    "id": 1261,
    "url": "https://sunnah.com/bukhari:1261",
    "bookNumber": 23,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn Seereen:",
    "english": "Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) ) came to Basra to \nvisit her son, but she could not find him. She narrated to us, \"The Prophet (ﷺ) came to us while we were \ngiving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it \nnecessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um \n'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud \nher in it and did not say more than that.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَنَّ أَيُّوبَ، أَخْبَرَهُ قَالَ سَمِعْتُ ابْنَ سِيرِينَ، يَقُولُ جَاءَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ امْرَأَةٌ مِنَ الأَنْصَارِ مِنَ اللاَّتِي بَايَعْنَ، قَدِمَتِ الْبِصْرَةَ، تُبَادِرُ ابْنًا لَهَا فَلَمْ تُدْرِكْهُ ـ فَحَدَّثَتْنَا قَالَتْ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا أَلْقَى إِلَيْنَا حَقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ وَلَمْ يَزِدْ عَلَى ذَلِكَ، وَلاَ أَدْرِي أَىُّ بَنَاتِهِ‏.‏ وَزَعَمَ أَنَّ الإِشْعَارَ الْفُفْنَهَا فِيهِ، وَكَذَلِكَ كَانَ ابْنُ سِيرِينَ يَأْمُرُ بِالْمَرْأَةِ أَنْ تُشْعَرَ وَلاَ تُؤْزَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1261In-book reference : Book 23, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 351   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1262,
    "id": 1262,
    "url": "https://sunnah.com/bukhari:1262",
    "bookNumber": 23,
    "hadithNumber": 23,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "We entwined the hair of the dead daughter of the Prophet (ﷺ) into three braids. Waki said that Sufyan \nsaid, \"One braid was entwined in front and the other two were entwined on the sides of the head.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أُمِّ الْهُذَيْلِ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ ضَفَرْنَا شَعَرَ بِنْتِ النَّبِيِّ صلى الله عليه وسلم‏.‏ تَعْنِي ثَلاَثَةَ قُرُونٍ‏.‏ وَقَالَ وَكِيعٌ قَالَ سُفْيَانُ نَاصِيَتَهَا وَقَرْنَيْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1262In-book reference : Book 23, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 352   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1263,
    "id": 1263,
    "url": "https://sunnah.com/bukhari:1263",
    "bookNumber": 23,
    "hadithNumber": 24,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "One of the daughters of the Prophet (ﷺ) expired and he came to us and said, \"Wash her with Sidr (water) \nfor odd number of times, i.e. three, five or more, if you think it necessary, and in the last, put camphor \nor (some camphor on her), and when you finish, notify me.\" So when we finished we informed him. \nHe gave his waist-sheet to us (to shroud her). We entwined the hair (of the deceased girl) in three \nbraids and made them fall at her back.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، قَالَ حَدَّثَتْنَا حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَأَتَانَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اغْسِلْنَهَا بِالسِّدْرِ وِتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ، فَضَفَرْنَا شَعَرَهَا ثَلاَثَةَ قُرُونٍ وَأَلْقَيْنَاهَا خَلْفَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1263In-book reference : Book 23, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 353   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1264,
    "id": 1264,
    "url": "https://sunnah.com/bukhari:1264",
    "bookNumber": 23,
    "hadithNumber": 25,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) was shrouded in three Yemenite white Suhuliya (pieces of cloth) of cotton, and in \nthem there was neither a shirt nor a turban.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ يَمَانِيَةٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ، لَيْسَ فِيهِنَّ قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1264In-book reference : Book 23, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 354   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1265,
    "id": 1265,
    "url": "https://sunnah.com/bukhari:1265",
    "bookNumber": 23,
    "hadithNumber": 26,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck \n(and died). The Prophet (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, \nand neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection \nsaying, 'Labbaik,' (i.e. like a pilgrim).\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ بِعَرَفَةَ إِذْ وَقَعَ عَنْ رَاحِلَتِهِ فَوَقَصَتْهُ ـ أَوْ قَالَ فَأَوْقَصَتْهُ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1265In-book reference : Book 23, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 355   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1266,
    "id": 1266,
    "url": "https://sunnah.com/bukhari:1266",
    "bookNumber": 23,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "While a man was at `Arafat (for Hajj) with Allah's Messenger (ﷺ) the fell down from his Mount and broke \nhis neck (and died). So Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in two \npieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be saying 'Labbaik.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَةَ إِذْ وَقَعَ مِنْ رَاحِلَتِهِ فَأَقْصَعَتْهُ ـ أَوْ قَالَ فَأَقْعَصَتْهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1266In-book reference : Book 23, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 356   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1267,
    "id": 1267,
    "url": "https://sunnah.com/bukhari:1267",
    "bookNumber": 23,
    "hadithNumber": 28,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man was killed by his camel while we were with the Prophet (ﷺ) and he was a Muhrim. So the Prophet (ﷺ) \nsaid, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him \nnor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying \n'Labbaik' . \"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ أَنَّ رَجُلاً، وَقَصَهُ بَعِيرُهُ، وَنَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُمِسُّوهُ طِيبًا، وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1267In-book reference : Book 23, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 357   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1268,
    "id": 1268,
    "url": "https://sunnah.com/bukhari:1268",
    "bookNumber": 23,
    "hadithNumber": 29,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man fell from his Mount and died while he was with the Prophet (ﷺ) at `Arafat. The Prophet (ﷺ) said, \n\"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor \ncover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، وَأَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ كَانَ رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ فَوَقَعَ عَنْ رَاحِلَتِهِ ـ قَالَ أَيُّوبُ فَوَقَصَتْهُ، وَقَالَ عَمْرٌو فَأَقْصَعَتْهُ ـ فَمَاتَ فَقَالَ ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ ـ قَالَ أَيُّوبُ يُلَبِّي، وَقَالَ عَمْرٌو ـ مُلَبِّيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1268In-book reference : Book 23, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 358   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1269,
    "id": 1269,
    "url": "https://sunnah.com/bukhari:1269",
    "bookNumber": 23,
    "hadithNumber": 30,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When `Abdullah bin Ubai (the chief of hypocrites) died, his son came to the Prophet (ﷺ) and said, \"O \nAllah's Messenger (ﷺ)! Please give me your shirt to shroud him in it, offer his funeral prayer and ask for \nAllah's forgiveness for him.\" So Allah's Messenger (ﷺ) (p.b.u.h) gave his shirt to him and said, \"Inform me \n(When the funeral is ready) so that I may offer the funeral prayer.\" So, he informed him and when the \nProphet intended to offer the funeral prayer, `Umar took hold of his hand and said, \"Has Allah not \nforbidden you to offer the funeral prayer for the hypocrites? The Prophet (ﷺ) said, \"I have been given the \nchoice for Allah says: '(It does not avail) Whether you (O Muhammad) ask forgiveness for them \n(hypocrites), or do not ask for forgiveness for them. Even though you ask for their forgiveness seventy \ntimes, Allah will not forgive them. (9.80)\" So the Prophet (ﷺ) offered the funeral prayer and on that the \nrevelation came: \"And never (O Muhammad) pray (funeral prayer) for any of them (i.e. hypocrites) \nthat dies.\" (9. 84)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عَبْدَ، اللَّهِ بْنَ أُبَىٍّ لَمَّا تُوُفِّيَ جَاءَ ابْنُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ النَّبِيُّ صلى الله عليه وسلم قَمِيصَهُ فَقَالَ ‏\"‏ آذِنِّي أُصَلِّي عَلَيْهِ ‏\"‏‏.‏ فَآذَنَهُ، فَلَمَّا أَرَادَ أَنْ يُصَلِّيَ عَلَيْهِ جَذَبَهُ عُمَرُ ـ رضى الله عنه ـ فَقَالَ أَلَيْسَ اللَّهُ نَهَاكَ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏\"‏ أَنَا بَيْنَ خِيرَتَيْنِ قَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏ ‏\"‏‏.‏ فَصَلَّى عَلَيْهِ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 1269In-book reference : Book 23, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 359   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1270,
    "id": 1270,
    "url": "https://sunnah.com/bukhari:1270",
    "bookNumber": 23,
    "hadithNumber": 31,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was \nbrought out and then the Prophet (ﷺ) put his saliva over the body and clothed it in his shirt.",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا ـ رضى الله عنه ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا دُفِنَ فَأَخْرَجَهُ، فَنَفَثَ فِيهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1270In-book reference : Book 23, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 360   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1271,
    "id": 1271,
    "url": "https://sunnah.com/bukhari:1271",
    "bookNumber": 23,
    "hadithNumber": 32,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) was shrouded in three pieces of cloth which were made of Suhul (a type of cotton), and \nneither a shirt nor a turban were used.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُفِّنَ النَّبِيُّ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابِ سَحُولَ كُرْسُفٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1271In-book reference : Book 23, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 361   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1272,
    "id": 1272,
    "url": "https://sunnah.com/bukhari:1272",
    "bookNumber": 23,
    "hadithNumber": 33,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) was shrouded in three pieces of cloth and neither a shirt nor a turban were used.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1272In-book reference : Book 23, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 362   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1273,
    "id": 1273,
    "url": "https://sunnah.com/bukhari:1273",
    "bookNumber": 23,
    "hadithNumber": 34,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) was shrouded in three pieces of cloth which were made of white Suhul and neither a \nshirt nor a turban were used.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1273In-book reference : Book 23, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 363   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1274,
    "id": 1274,
    "url": "https://sunnah.com/bukhari:1274",
    "bookNumber": 23,
    "hadithNumber": 35,
    "narrator": "Narrated Sa`d from his father:",
    "english": "Once the meal of `Abdur-Rahman bin `Auf was brought in front of him, and he said, \"Mus`ab bin \n`Umair was martyred and he was better than I, and he had nothing except his Burd (a black square \nnarrow dress) to be shrouded in. Hamza or another person was martyred and he was also better than I \nand he had nothing to be shrouded in except his Burd. No doubt, I fear that the rewards of my deeds \nmight have been given early in this world.\" Then he started weeping.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ سَعْدٍ، عَنْ أَبِيهِ، قَالَ أُتِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ يَوْمًا بِطَعَامِهِ فَقَالَ قُتِلَ مُصْعَبُ بْنُ عُمَيْرٍ ـ وَكَانَ خَيْرًا مِنِّي ـ فَلَمْ يُوجَدْ لَهُ مَا يُكَفَّنُ فِيهِ إِلاَّ بُرْدَةٌ، وَقُتِلَ حَمْزَةُ أَوْ رَجُلٌ آخَرُ خَيْرٌ مِنِّي فَلَمْ يُوجَدْ لَهُ مَا يُكَفَّنُ فِيهِ إِلاَّ بُرْدَةٌ، لَقَدْ خَشِيتُ أَنْ يَكُونَ قَدْ عُجِّلَتْ لَنَا طَيِّبَاتُنَا فِي حَيَاتِنَا الدُّنْيَا، ثُمَّ جَعَلَ يَبْكِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1274In-book reference : Book 23, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 364   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1275,
    "id": 1275,
    "url": "https://sunnah.com/bukhari:1275",
    "bookNumber": 23,
    "hadithNumber": 36,
    "narrator": "Narrated Ibrahim:",
    "english": "Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin \n`Umar was martyred and he was better than I and was shrouded in his Burd and when his head was \ncovered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza \nwas martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a \nsimilar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this \nworld.\" Then he started weeping and left his food.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، إِبْرَاهِيمَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ ـ رضى الله عنه ـ أُتِيَ بِطَعَامٍ وَكَانَ صَائِمًا فَقَالَ قُتِلَ مُصْعَبُ بْنُ عُمَيْرٍ وَهُوَ خَيْرٌ مِنِّي، كُفِّنَ فِي بُرْدَةٍ، إِنْ غُطِّيَ رَأْسُهُ بَدَتْ رِجْلاَهُ، وَإِنْ غُطِّيَ رِجْلاَهُ بَدَا رَأْسُهُ ـ وَأُرَاهُ قَالَ ـ وَقُتِلَ حَمْزَةُ وَهُوَ خَيْرٌ مِنِّي، ثُمَّ بُسِطَ لَنَا مِنَ الدُّنْيَا مَا بُسِطَ ـ أَوْ قَالَ أُعْطِينَا مِنَ الدُّنْيَا مَا أُعْطِينَا ـ وَقَدْ خَشِينَا أَنْ تَكُونَ حَسَنَاتُنَا عُجِّلَتْ لَنَا، ثُمَّ جَعَلَ يَبْكِي حَتَّى تَرَكَ الطَّعَامَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1275In-book reference : Book 23, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 365   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1276,
    "id": 1276,
    "url": "https://sunnah.com/bukhari:1276",
    "bookNumber": 23,
    "hadithNumber": 37,
    "narrator": "Narrated Khabbab:",
    "english": "We emigrated with the Prophet (p.b.u.h) in Allah's cause, and so our reward was then surely \nincumbent on Allah. Some of us died and they did not take anything from their rewards in this world, \nand amongst them was Mustab bin `Umar; and the others were those who got their rewards. Mustab \nbin `Umar was martyred on the day of the Battle of Uhud and we could get nothing except his Burd to \nshroud him in. And when we covered his head his feet became bare and vice versa. So the Prophet (ﷺ) \nordered us to cover his head only and to put idhkhir (a kind of shrub) over his feet.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا خَبَّابٌ ـ رضى الله عنه ـ قَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَلْتَمِسُ وَجْهَ اللَّهِ، فَوَقَعَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَاتَ لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَا‏.‏ قُتِلَ يَوْمَ أُحُدٍ، فَلَمْ نَجِدْ مَا نُكَفِّنُهُ إِلاَّ بُرْدَةً إِذَا غَطَّيْنَا بِهَا رَأْسَهُ خَرَجَتْ رِجْلاَهُ، وَإِذَا غَطَّيْنَا رِجْلَيْهِ خَرَجَ رَأْسُهُ، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُغَطِّيَ رَأْسَهُ، وَأَنْ نَجْعَلَ عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1276In-book reference : Book 23, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 366   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1277,
    "id": 1277,
    "url": "https://sunnah.com/bukhari:1277",
    "bookNumber": 23,
    "hadithNumber": 38,
    "narrator": "Narrated Sahl:",
    "english": "A woman brought a woven Burda (sheet) having edging (border) to the Prophet, Then Sahl asked \nthem whether they knew what is Burda, they said that Burda is a cloak and Sahl confirmed their reply. \nThen the woman said, \"I have woven it with my own hands and I have brought it so that you may \nwear it.\" The Prophet (ﷺ) accepted it, and at that time he was in need of it. So he came out wearing it as \nhis waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people \nsaid, \"You have not done the right thing as the Prophet (ﷺ) is in need of it and you have asked for it when \nyou know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked \nfor it to wear it but to make it my shroud.\" Later it was his shroud.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ أَنَّ امْرَأَةً، جَاءَتِ النَّبِيَّ صلى الله عليه وسلم بِبُرْدَةٍ مَنْسُوجَةٍ فِيهَا حَاشِيَتُهَا ـ أَتَدْرُونَ مَا الْبُرْدَةُ قَالُوا الشَّمْلَةُ‏.‏ قَالَ نَعَمْ‏.‏ قَالَتْ نَسَجْتُهَا بِيَدِي، فَجِئْتُ لأَكْسُوَكَهَا‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَخَرَجَ إِلَيْنَا وَإِنَّهَا إِزَارُهُ، فَحَسَّنَهَا فُلاَنٌ فَقَالَ اكْسُنِيهَا، مَا أَحْسَنَهَا‏.‏ قَالَ الْقَوْمُ مَا أَحْسَنْتَ، لَبِسَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، ثُمَّ سَأَلْتَهُ وَعَلِمْتَ أَنَّهُ لاَ يَرُدُّ‏.‏ قَالَ إِنِّي وَاللَّهِ مَا سَأَلْتُهُ لأَلْبَسَهَا إِنَّمَا سَأَلْتُهُ لِتَكُونَ كَفَنِي‏.‏ قَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1277In-book reference : Book 23, Hadith 38USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 367   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1278,
    "id": 1278,
    "url": "https://sunnah.com/bukhari:1278",
    "bookNumber": 23,
    "hadithNumber": 39,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "We were forbidden to accompany funeral processions but not strictly.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أُمِّ الْهُذَيْلِ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ، وَلَمْ يُعْزَمْ عَلَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1278In-book reference : Book 23, Hadith 39USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 368   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1279,
    "id": 1279,
    "url": "https://sunnah.com/bukhari:1279",
    "bookNumber": 23,
    "hadithNumber": 40,
    "narrator": "Narrated Muhammad bin Seereen:",
    "english": "One of the sons of Um 'Atiyya died, and when it was the third day she asked for a yellow perfume and \nput it over her body, and said, \"We were forbidden to mourn for more than three days except for our \nhusbands.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ تُوُفِّيَ ابْنٌ لأُمِّ عَطِيَّةَ ـ رضى الله عنها ـ فَلَمَّا كَانَ الْيَوْمُ الثَّالِثُ دَعَتْ بِصُفْرَةٍ، فَتَمَسَّحَتْ بِهِ وَقَالَتْ نُهِينَا أَنْ نُحِدَّ أَكْثَرَ مِنْ ثَلاَثٍ إِلاَّ بِزَوْجٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1279In-book reference : Book 23, Hadith 40USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 369   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1280,
    "id": 1280,
    "url": "https://sunnah.com/bukhari:1280",
    "bookNumber": 23,
    "hadithNumber": 41,
    "narrator": "Narrated Zainab bint Abi Salama:",
    "english": "When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked \nfor a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been \nin need of this, had I not heard the Prophet (ﷺ) saying: \"It is not legal for a woman who believes in Allah \nand the Last Day to mourn for more than three days for any dead person except her husband, for \nwhom she should mourn for four months and ten days.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، قَالَتْ لَمَّا جَاءَ نَعْىُ أَبِي سُفْيَانَ مِنَ الشَّأْمِ دَعَتْ أُمُّ حَبِيبَةَ ـ رضى الله عنها ـ بِصُفْرَةٍ فِي الْيَوْمِ الثَّالِثِ، فَمَسَحَتْ عَارِضَيْهَا وَذِرَاعَيْهَا وَقَالَتْ إِنِّي كُنْتُ عَنْ هَذَا لَغَنِيَّةً، لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ، فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1280In-book reference : Book 23, Hadith 41USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 370   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1281,
    "id": 1281,
    "url": "https://sunnah.com/bukhari:1281",
    "bookNumber": 23,
    "hadithNumber": 42,
    "narrator": "Narrated Zainab bint Abi Salama:",
    "english": "I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a \nwoman who believes in Allah and the Last Day to mourn for any dead person for more than three days \nexcept for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to \nZainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am \nnot in need of scent but I heard Allah's Messenger (ﷺ) saying, 'It is not legal for a woman who believes in \nAllah and the Last Day to mourn for more than three days for any dead person except her husband, \n(for whom she should mourn) for four months and ten days.' \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَخْبَرَتْهُ قَالَتْ، دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏   ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ ثُمَّ قَالَتْ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1281, 1282In-book reference : Book 23, Hadith 42USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 371   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1282,
    "id": 1282,
    "url": "https://sunnah.com/bukhari:1282",
    "bookNumber": 23,
    "hadithNumber": 42,
    "narrator": "Narrated Zainab bint Abi Salama:",
    "english": "I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a \nwoman who believes in Allah and the Last Day to mourn for any dead person for more than three days \nexcept for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to \nZainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am \nnot in need of scent but I heard Allah's Messenger (ﷺ) saying, 'It is not legal for a woman who believes in \nAllah and the Last Day to mourn for more than three days for any dead person except her husband, \n(for whom she should mourn) for four months and ten days.' \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَخْبَرَتْهُ قَالَتْ، دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏   ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ ثُمَّ قَالَتْ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1281, 1282In-book reference : Book 23, Hadith 42USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 371   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1283,
    "id": 1283,
    "url": "https://sunnah.com/bukhari:1283",
    "bookNumber": 23,
    "hadithNumber": 43,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) passed by a woman who was weeping beside a grave. He told her to fear Allah and be \npatient. She said to him, \"Go away, for you have not been afflicted with a calamity like mine.\" And \nshe did not recognize him. Then she was informed that he was the Prophet (ﷺ) . so she went to the house \nof the Prophet (ﷺ) and there she did not find any guard. Then she said to him, \"I did not recognize you.\" \nHe said, \"Verily, the patience is at the first stroke of a calamity.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ تَبْكِي عِنْدَ قَبْرٍ فَقَالَ ‏\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏ قَالَتْ إِلَيْكَ عَنِّي، فَإِنَّكَ لَمْ تُصَبْ بِمُصِيبَتِي، وَلَمْ تَعْرِفْهُ‏.‏ فَقِيلَ لَهَا إِنَّهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَأَتَتْ باب النَّبِيِّ صلى الله عليه وسلم فَلَمْ تَجِدْ عِنْدَهُ بَوَّابِينَ فَقَالَتْ لَمْ أَعْرِفْكَ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1283In-book reference : Book 23, Hadith 43USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 372   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1284,
    "id": 1284,
    "url": "https://sunnah.com/bukhari:1284",
    "bookNumber": 23,
    "hadithNumber": 44,
    "narrator": "Narrated Usama bin Zaid:",
    "english": "The daughter of the Prophet (p.b.u.h) sent (a messenger) to the Prophet (ﷺ) requesting him to come as her \nchild was dying (or was gasping), but the Prophet (ﷺ) returned the messenger and told him to convey his \ngreeting to her and say: \"Whatever Allah takes is for Him and whatever He gives, is for Him, and \neverything with Him has a limited fixed term (in this world) and so she should be patient and hope for \nAllah's reward.\" She again sent for him, swearing that he should come. The Prophet (ﷺ) got up, and so did \nSa`d bin 'Ubada, Mu`adh bin Jabal, Ubai bin Ka`b, Zaid bin Thabit and some other men. The child \nwas brought to Allah's Messenger (ﷺ) while his breath was disturbed in his chest (the sub-narrator thinks that \nUsama added: ) as if it was a leather water-skin. On that the eyes of the Prophet (p.b.u.h) started \nshedding tears. Sa`d said, \"O Allah's Messenger (ﷺ)! What is this?\" He replied, \"It is mercy which Allah has \nlodged in the hearts of His slaves, and Allah is merciful only to those of His slaves who are merciful \n(to others).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، وَمُحَمَّدٌ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ ـ رضى الله عنهما ـ قَالَ أَرْسَلَتِ ابْنَةُ النَّبِيِّ صلى الله عليه وسلم إِلَيْهِ إِنَّ ابْنًا لِي قُبِضَ فَائْتِنَا‏.‏ فَأَرْسَلَ يُقْرِئُ السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلٌّ عِنْدَهُ بِأَجَلٍ مُسَمًّى، فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏‏.‏ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَيَأْتِيَنَّهَا، فَقَامَ وَمَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَأُبَىُّ بْنُ كَعْبٍ وَزَيْدُ بْنُ ثَابِتٍ وَرِجَالٌ، فَرُفِعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الصَّبِيُّ وَنَفْسُهُ تَتَقَعْقَعُ ـ قَالَ حَسِبْتُهُ أَنَّهُ قَالَ ـ كَأَنَّهَا شَنٌّ‏.‏ فَفَاضَتْ عَيْنَاهُ‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ مَا هَذَا فَقَالَ ‏\"‏ هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ، وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1284In-book reference : Book 23, Hadith 44USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 373   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1285,
    "id": 1285,
    "url": "https://sunnah.com/bukhari:1285",
    "bookNumber": 23,
    "hadithNumber": 45,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We were (in the funeral procession) of one of the daughters of the Prophet (ﷺ) and he was sitting by the \nside of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not \nhave sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the \nProphet told him to get down in the grave. And so he got down in her grave.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ شَهِدْنَا بِنْتًا لِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ عَلَى الْقَبْرِ ـ قَالَ فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ قَالَ ـ فَقَالَ ‏\"‏ هَلْ مِنْكُمْ رَجُلٌ لَمْ يُقَارِفِ اللَّيْلَةَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَنَا‏.‏ قَالَ ‏\"‏ فَانْزِلْ ‏\"‏‏.‏ قَالَ فَنَزَلَ فِي قَبْرِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1285In-book reference : Book 23, Hadith 45USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 374   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1286,
    "id": 1286,
    "url": "https://sunnah.com/bukhari:1286",
    "bookNumber": 23,
    "hadithNumber": 46,
    "narrator": "Narrated `Abdullah bin 'Ubaidullah bin Abi Mulaika:",
    "english": "One of the daughters of `Uthman died at Mecca. We went to attend her funeral procession. Ibn `Umar \nand Ibn `Abbas were also present. I sat in between them (or said, I sat beside one of them. Then a man \ncame and sat beside me.) `Abdullah bin `Umar said to `Amr bin `Uthman, \"Will you not prohibit \ncrying as Allah's Messenger (ﷺ) has said, 'The dead person is tortured by the crying of his relatives.?\" Ibn \n`Abbas said, \"`Umar used to say so.\" Then he added narrating, \"I accompanied `Umar on a journey \nfrom Mecca till we reached Al-Baida. There he saw some travelers in the shade of a Samura (A kind \nof forest tree). He said (to me), \"Go and see who those travelers are.\" So I went and saw that one of \nthem was Suhaib. I told this to `Umar who then asked me to call him. So I went back to Suhaib and \nsaid to him, \"Depart and follow the chief of the faithful believers.\" Later, when `Umar was stabbed, \nSuhaib came in weeping and saying, \"O my brother, O my friend!\" (on this `Umar said to him, \"O \nSuhaib! Are you weeping for me while the Prophet (ﷺ) said, \"The dead person is punished by some of the \nweeping of his relatives?\" Ibn `Abbas added, \"When `Umar died I told all this to Aisha and she said, \n'May Allah be merciful to `Umar. By Allah, Allah's Messenger (ﷺ) did not say that a believer is punished by \nthe weeping of his relatives. But he said, Allah increases the punishment of a non-believer because of \nthe weeping of his relatives.\" Aisha further added, \"The Qur'an is sufficient for you (to clear up this \npoint) as Allah has stated: 'No burdened soul will bear another's burden.' \" (35.18). Ibn `Abbas then \nsaid, \"Only Allah makes one laugh or cry.\" Ibn `Umar did not say anything after that.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَتِ ابْنَةٌ لِعُثْمَانَ ـ رضى الله عنه ـ بِمَكَّةَ وَجِئْنَا لِنَشْهَدَهَا، وَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ وَإِنِّي لَجَالِسٌ بَيْنَهُمَا ـ أَوْ قَالَ جَلَسْتُ إِلَى أَحَدِهِمَا‏.‏ ثُمَّ جَاءَ الآخَرُ، فَجَلَسَ إِلَى جَنْبِي فَقَالَ عَبْدُ اللَّهِ بْنُ عَمَرَ ـ رضى الله عنهما ـ لِعَمْرِو بْنِ عُثْمَانَ أَلاَ تَنْهَى عَنِ الْبُكَاءِ، فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   فَقَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ كَانَ عُمَرُ ـ رضى الله عنه ـ يَقُولُ بَعْضَ ذَلِكَ، ثُمَّ حَدَّثَ قَالَ صَدَرْتُ مَعَ عُمَرَ ـ رضى الله عنه ـ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ، إِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ سَمُرَةٍ فَقَالَ اذْهَبْ، فَانْظُرْ مَنْ هَؤُلاَءِ الرَّكْبُ قَالَ فَنَظَرْتُ فَإِذَا صُهَيْبٌ، فَأَخْبَرْتُهُ فَقَالَ ادْعُهُ لِي‏.‏ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ‏.‏ فَلَمَّا أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يَبْكِي يَقُولُ وَاأَخَاهُ، وَاصَاحِبَاهُ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ يَا صُهَيْبُ أَتَبْكِي عَلَىَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما فَلَمَّا مَاتَ عُمَرُ ـ رضى الله عنه ـ ذَكَرْتُ ذَلِكَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ رَحِمَ اللَّهُ عُمَرَ، وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّ اللَّهَ لَيُعَذِّبُ الْمُؤْمِنَ بِبُكَاءِ أَهْلِهِ عَلَيْهِ‏.‏ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏ وَقَالَتْ حَسْبُكُمُ الْقُرْآنُ ‏{‏وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ عِنْدَ ذَلِكَ وَاللَّهُ هُوَ أَضْحَكَ وَأَبْكَى‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَاللَّهِ مَا قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1286, 1287, 1288In-book reference : Book 23, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 375   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1287,
    "id": 1287,
    "url": "https://sunnah.com/bukhari:1287",
    "bookNumber": 23,
    "hadithNumber": 46,
    "narrator": "Narrated `Abdullah bin 'Ubaidullah bin Abi Mulaika:",
    "english": "One of the daughters of `Uthman died at Mecca. We went to attend her funeral procession. Ibn `Umar \nand Ibn `Abbas were also present. I sat in between them (or said, I sat beside one of them. Then a man \ncame and sat beside me.) `Abdullah bin `Umar said to `Amr bin `Uthman, \"Will you not prohibit \ncrying as Allah's Messenger (ﷺ) has said, 'The dead person is tortured by the crying of his relatives.?\" Ibn \n`Abbas said, \"`Umar used to say so.\" Then he added narrating, \"I accompanied `Umar on a journey \nfrom Mecca till we reached Al-Baida. There he saw some travelers in the shade of a Samura (A kind \nof forest tree). He said (to me), \"Go and see who those travelers are.\" So I went and saw that one of \nthem was Suhaib. I told this to `Umar who then asked me to call him. So I went back to Suhaib and \nsaid to him, \"Depart and follow the chief of the faithful believers.\" Later, when `Umar was stabbed, \nSuhaib came in weeping and saying, \"O my brother, O my friend!\" (on this `Umar said to him, \"O \nSuhaib! Are you weeping for me while the Prophet (ﷺ) said, \"The dead person is punished by some of the \nweeping of his relatives?\" Ibn `Abbas added, \"When `Umar died I told all this to Aisha and she said, \n'May Allah be merciful to `Umar. By Allah, Allah's Messenger (ﷺ) did not say that a believer is punished by \nthe weeping of his relatives. But he said, Allah increases the punishment of a non-believer because of \nthe weeping of his relatives.\" Aisha further added, \"The Qur'an is sufficient for you (to clear up this \npoint) as Allah has stated: 'No burdened soul will bear another's burden.' \" (35.18). Ibn `Abbas then \nsaid, \"Only Allah makes one laugh or cry.\" Ibn `Umar did not say anything after that.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَتِ ابْنَةٌ لِعُثْمَانَ ـ رضى الله عنه ـ بِمَكَّةَ وَجِئْنَا لِنَشْهَدَهَا، وَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ وَإِنِّي لَجَالِسٌ بَيْنَهُمَا ـ أَوْ قَالَ جَلَسْتُ إِلَى أَحَدِهِمَا‏.‏ ثُمَّ جَاءَ الآخَرُ، فَجَلَسَ إِلَى جَنْبِي فَقَالَ عَبْدُ اللَّهِ بْنُ عَمَرَ ـ رضى الله عنهما ـ لِعَمْرِو بْنِ عُثْمَانَ أَلاَ تَنْهَى عَنِ الْبُكَاءِ، فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   فَقَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ كَانَ عُمَرُ ـ رضى الله عنه ـ يَقُولُ بَعْضَ ذَلِكَ، ثُمَّ حَدَّثَ قَالَ صَدَرْتُ مَعَ عُمَرَ ـ رضى الله عنه ـ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ، إِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ سَمُرَةٍ فَقَالَ اذْهَبْ، فَانْظُرْ مَنْ هَؤُلاَءِ الرَّكْبُ قَالَ فَنَظَرْتُ فَإِذَا صُهَيْبٌ، فَأَخْبَرْتُهُ فَقَالَ ادْعُهُ لِي‏.‏ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ‏.‏ فَلَمَّا أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يَبْكِي يَقُولُ وَاأَخَاهُ، وَاصَاحِبَاهُ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ يَا صُهَيْبُ أَتَبْكِي عَلَىَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما فَلَمَّا مَاتَ عُمَرُ ـ رضى الله عنه ـ ذَكَرْتُ ذَلِكَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ رَحِمَ اللَّهُ عُمَرَ، وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّ اللَّهَ لَيُعَذِّبُ الْمُؤْمِنَ بِبُكَاءِ أَهْلِهِ عَلَيْهِ‏.‏ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏ وَقَالَتْ حَسْبُكُمُ الْقُرْآنُ ‏{‏وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ عِنْدَ ذَلِكَ وَاللَّهُ هُوَ أَضْحَكَ وَأَبْكَى‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَاللَّهِ مَا قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1286, 1287, 1288In-book reference : Book 23, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 375   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1288,
    "id": 1288,
    "url": "https://sunnah.com/bukhari:1288",
    "bookNumber": 23,
    "hadithNumber": 46,
    "narrator": "Narrated `Abdullah bin 'Ubaidullah bin Abi Mulaika:",
    "english": "One of the daughters of `Uthman died at Mecca. We went to attend her funeral procession. Ibn `Umar \nand Ibn `Abbas were also present. I sat in between them (or said, I sat beside one of them. Then a man \ncame and sat beside me.) `Abdullah bin `Umar said to `Amr bin `Uthman, \"Will you not prohibit \ncrying as Allah's Messenger (ﷺ) has said, 'The dead person is tortured by the crying of his relatives.?\" Ibn \n`Abbas said, \"`Umar used to say so.\" Then he added narrating, \"I accompanied `Umar on a journey \nfrom Mecca till we reached Al-Baida. There he saw some travelers in the shade of a Samura (A kind \nof forest tree). He said (to me), \"Go and see who those travelers are.\" So I went and saw that one of \nthem was Suhaib. I told this to `Umar who then asked me to call him. So I went back to Suhaib and \nsaid to him, \"Depart and follow the chief of the faithful believers.\" Later, when `Umar was stabbed, \nSuhaib came in weeping and saying, \"O my brother, O my friend!\" (on this `Umar said to him, \"O \nSuhaib! Are you weeping for me while the Prophet (ﷺ) said, \"The dead person is punished by some of the \nweeping of his relatives?\" Ibn `Abbas added, \"When `Umar died I told all this to Aisha and she said, \n'May Allah be merciful to `Umar. By Allah, Allah's Messenger (ﷺ) did not say that a believer is punished by \nthe weeping of his relatives. But he said, Allah increases the punishment of a non-believer because of \nthe weeping of his relatives.\" Aisha further added, \"The Qur'an is sufficient for you (to clear up this \npoint) as Allah has stated: 'No burdened soul will bear another's burden.' \" (35.18). Ibn `Abbas then \nsaid, \"Only Allah makes one laugh or cry.\" Ibn `Umar did not say anything after that.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَتِ ابْنَةٌ لِعُثْمَانَ ـ رضى الله عنه ـ بِمَكَّةَ وَجِئْنَا لِنَشْهَدَهَا، وَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ وَإِنِّي لَجَالِسٌ بَيْنَهُمَا ـ أَوْ قَالَ جَلَسْتُ إِلَى أَحَدِهِمَا‏.‏ ثُمَّ جَاءَ الآخَرُ، فَجَلَسَ إِلَى جَنْبِي فَقَالَ عَبْدُ اللَّهِ بْنُ عَمَرَ ـ رضى الله عنهما ـ لِعَمْرِو بْنِ عُثْمَانَ أَلاَ تَنْهَى عَنِ الْبُكَاءِ، فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   فَقَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ كَانَ عُمَرُ ـ رضى الله عنه ـ يَقُولُ بَعْضَ ذَلِكَ، ثُمَّ حَدَّثَ قَالَ صَدَرْتُ مَعَ عُمَرَ ـ رضى الله عنه ـ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ، إِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ سَمُرَةٍ فَقَالَ اذْهَبْ، فَانْظُرْ مَنْ هَؤُلاَءِ الرَّكْبُ قَالَ فَنَظَرْتُ فَإِذَا صُهَيْبٌ، فَأَخْبَرْتُهُ فَقَالَ ادْعُهُ لِي‏.‏ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ‏.‏ فَلَمَّا أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يَبْكِي يَقُولُ وَاأَخَاهُ، وَاصَاحِبَاهُ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ يَا صُهَيْبُ أَتَبْكِي عَلَىَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما فَلَمَّا مَاتَ عُمَرُ ـ رضى الله عنه ـ ذَكَرْتُ ذَلِكَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ رَحِمَ اللَّهُ عُمَرَ، وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّ اللَّهَ لَيُعَذِّبُ الْمُؤْمِنَ بِبُكَاءِ أَهْلِهِ عَلَيْهِ‏.‏ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏ وَقَالَتْ حَسْبُكُمُ الْقُرْآنُ ‏{‏وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ عِنْدَ ذَلِكَ وَاللَّهُ هُوَ أَضْحَكَ وَأَبْكَى‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَاللَّهِ مَا قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1286, 1287, 1288In-book reference : Book 23, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 375   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1289,
    "id": 1289,
    "url": "https://sunnah.com/bukhari:1289",
    "bookNumber": 23,
    "hadithNumber": 47,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Once Allah's Messenger (ﷺ) passed by (the grave of) a Jewess whose relatives were \nweeping over her. He said, \"They are weeping over her and she is being tortured in her grave.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى يَهُودِيَّةٍ يَبْكِي عَلَيْهَا أَهْلُهَا فَقَالَ ‏\n\"‏ إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا، وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1289In-book reference : Book 23, Hadith 47USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 376   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1290,
    "id": 1290,
    "url": "https://sunnah.com/bukhari:1290",
    "bookNumber": 23,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Burda:",
    "english": "That his father said, \"When `Umar was stabbed, Suhaib started crying: O my brother! `Umar said, \n'Don't you know that the Prophet (ﷺ) said: The deceased is tortured for the weeping of the living'?\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ خَلِيلٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، حَدَّثَنَا أَبُو إِسْحَاقَ ـ وَهْوَ الشَّيْبَانِيُّ ـ عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ لَمَّا أُصِيبَ عُمَرُ ـ رضى الله عنه ـ جَعَلَ صُهَيْبٌ يَقُولُ وَاأَخَاهُ‏.‏ فَقَالَ عُمَرُ أَمَا عَلِمْتَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1290In-book reference : Book 23, Hadith 48USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 377   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1291,
    "id": 1291,
    "url": "https://sunnah.com/bukhari:1291",
    "bookNumber": 23,
    "hadithNumber": 49,
    "narrator": "Narrated Al-Mughira:",
    "english": "I heard the Prophet (ﷺ) saying, \"Ascribing false things to me is not like ascribing false things to anyone \nelse. Whosoever tells a lie against me intentionally then surely let him occupy his seat in Hell-Fire.\" I \nheard the Prophet (ﷺ) saying, \"The deceased who is wailed over is tortured for that wailing.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنِ الْمُغِيرَةِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ كَذِبًا عَلَىَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ، مَنْ كَذَبَ عَلَىَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ نِيحَ عَلَيْهِ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1291In-book reference : Book 23, Hadith 49USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 378   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1292,
    "id": 1292,
    "url": "https://sunnah.com/bukhari:1292",
    "bookNumber": 23,
    "hadithNumber": 50,
    "narrator": "Narrated Ibn 'Umar from his father:",
    "english": "The Prophet (ﷺ) said, \"The deceased is tortured in his grave for the \n     wailing done over him.\" \n\n\n\n\n\n\n     Narrated Shu'ba:\n\n\n     The deceased is tortured for the wailing of the living ones over him .",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنْ أَبِيهِ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الأَعْلَى حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ حَدَّثَنَا قَتَادَةُ‏.‏ وَقَالَ آدَمُ عَنْ شُعْبَةَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ الْحَىِّ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1292In-book reference : Book 23, Hadith 50USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 379   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1293,
    "id": 1293,
    "url": "https://sunnah.com/bukhari:1293",
    "bookNumber": 23,
    "hadithNumber": 51,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the day of the Battle of Uhud, my father was brought and he had been mutilated (in battle) and was placed \nin front of Allah's Messenger (ﷺ) and a sheet was over him. I went intending to uncover my father but my \npeople forbade me; again I wanted to uncover him but my people forbade me. Allah's Messenger (ﷺ) gave \nhis order and he was shifted away. At that time he heard the voice of a crying woman and asked, \n\"Who is this?\" They said, \"It is the daughter or the sister of `Amr.\" He said, \"Why does she weep? (or \nlet her stop weeping), for the angels had been shading him with their wings till he (i.e. the body of the \nmartyr) was shifted away.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ جِيءَ بِأَبِي يَوْمَ أُحُدٍ، قَدْ مُثِّلَ بِهِ حَتَّى وُضِعَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ سُجِّيَ ثَوْبًا فَذَهَبْتُ أُرِيدُ أَنْ أَكْشِفَ عَنْهُ فَنَهَانِي قَوْمِي، ثُمَّ ذَهَبْتُ أَكْشِفُ عَنْهُ فَنَهَانِي قَوْمِي، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُفِعَ فَسَمِعَ صَوْتَ صَائِحَةٍ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقَالُوا ابْنَةُ عَمْرٍو أَوْ أُخْتُ عَمْرٍو‏.‏ قَالَ ‏\"‏ فَلِمَ تَبْكِي أَوْ لاَ تَبْكِي فَمَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رُفِعَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1293In-book reference : Book 23, Hadith 51USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 381   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1294,
    "id": 1294,
    "url": "https://sunnah.com/bukhari:1294",
    "bookNumber": 23,
    "hadithNumber": 52,
    "narrator": "Narrated `Abdullah:",
    "english": "the Prophet (ﷺ) said, \"He who slaps his cheeks, tears his clothes and follows the ways and traditions of the \nDays of Ignorance is not one of us.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا زُبَيْدٌ الْيَامِيُّ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنَّا مَنْ لَطَمَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1294In-book reference : Book 23, Hadith 52USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 382   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1295,
    "id": 1295,
    "url": "https://sunnah.com/bukhari:1295",
    "bookNumber": 23,
    "hadithNumber": 53,
    "narrator": "Narrated 'Amir bin Sa`d bin Abi Waqqas:",
    "english": "That his father said, \"In the year of the last Hajj of the Prophet (ﷺ) I became seriously ill and the Prophet (ﷺ) \nused to visit me inquiring about my health. I told him, 'I am reduced to this state because of illness and \nI am wealthy and have no inheritors except a daughter, (In this narration the name of 'Amir bin Sa`d is \nmentioned and in fact it is a mistake; the narrator is `Aisha bint Sa`d bin Abi Waqqas). Should I give \ntwo-thirds of my property in charity?' He said, 'No.' I asked, 'Half?' He said, 'No.' then he added, 'Onethird, \nand even one-third is much. You'd better leave your inheritors wealthy rather than leaving them \npoor, begging others. You will get a reward for whatever you spend for Allah's sake, even for what \nyou put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left alone after my companions \nhave gone?' He said, 'If you are left behind, whatever good deeds you will do will upgrade you and \nraise you high. And perhaps you will have a long life so that some people will be benefited by you \nwhile others will be harmed by you. O Allah! Complete the emigration of my companions and do not \nturn them renegades.' But Allah's Messenger (ﷺ) felt sorry for poor Sa`d bin Khaula as he died in Mecca.\" \n(but Sa`d bin Abi Waqqas lived long after the Prophet (p.b.u.h).)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي عَامَ حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ اشْتَدَّ بِي فَقُلْتُ إِنِّي قَدْ بَلَغَ بِي مِنَ الْوَجَعِ وَأَنَا ذُو مَالٍ، وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ بِالشَّطْرِ فَقَالَ ‏\"‏ لاَ ‏\"‏ ثُمَّ قَالَ ‏\"‏ الثُّلُثُ وَالثُّلْثُ كَبِيرٌ ـ أَوْ كَثِيرٌ ـ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ بِهَا، حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً صَالِحًا إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، ثُمَّ لَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ، يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1295In-book reference : Book 23, Hadith 53USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 383   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1296,
    "id": 1296,
    "url": "https://sunnah.com/bukhari:1296",
    "bookNumber": 23,
    "hadithNumber": 54,
    "narrator": "Narrated Abu Burda bin Abi Musa:",
    "english": "Abu Musa got seriously ill, fainted and could not reply to his wife while he was lying with his head in her lap. When he came to his senses, he said, \"I am innocent of those, of whom Allah's Messenger (ﷺ) was innocent. Allah's Messenger (ﷺ) is innocent of a woman who cries aloud (or slaps her face) who shaves her head and who tear off her clothes (on the falling of a calamity)",
    "arabic": "وَقَالَ الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرٍ، أَنَّ الْقَاسِمَ بْنَ مُخَيْمِرَةَ، حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ وَجِعَ أَبُو مُوسَى وَجَعًا فَغُشِيَ عَلَيْهِ، وَرَأْسُهُ فِي حَجْرِ امْرَأَةٍ مِنْ أَهْلِهِ، فَلَمْ يَسْتَطِعْ أَنْ يَرُدَّ عَلَيْهَا شَيْئًا، فَلَمَّا أَفَاقَ قَالَ أَنَا بَرِيءٌ مِمَّنْ بَرِئَ مِنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَرِئَ مِنَ الصَّالِقَةِ وَالْحَالِقَةِ وَالشَّاقَّةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1296In-book reference : Book 23, Hadith 54USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 383   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1297,
    "id": 1297,
    "url": "https://sunnah.com/bukhari:1297",
    "bookNumber": 23,
    "hadithNumber": 55,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"He who slaps the cheeks, tears the clothes and follows the tradition of the Days of \nIgnorance is not from us.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1297In-book reference : Book 23, Hadith 55USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 384   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1298,
    "id": 1298,
    "url": "https://sunnah.com/bukhari:1298",
    "bookNumber": 23,
    "hadithNumber": 56,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"He who slaps the cheeks, tears the clothes and follows the traditions of the Days of \nIgnorance is not from us.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1298In-book reference : Book 23, Hadith 56USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 385   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1299,
    "id": 1299,
    "url": "https://sunnah.com/bukhari:1299",
    "bookNumber": 23,
    "hadithNumber": 57,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) got the news of the death of Ibn Haritha, Ja`far and Ibn Rawaha he sat down and \nlooked sad and I was looking at him through the chink of the door. A man came and told him about \nthe crying of the women of Ja`far. The Prophet (ﷺ) ordered him to forbid them. The man went and came \nback saying that he had told them but they did not listen to him. The Prophet (p.b.u.h) said, \"Forbid \nthem.\" So again he went and came back for the third time and said, \"O Allah's Messenger (ﷺ)! By Allah, they \ndid not listen to us at all.\" (`Aisha added): Allah's Messenger (ﷺ) ordered him to go and put dust in their \nmouths. I said, (to that man) \"May Allah stick your nose in the dust (i.e. humiliate you)! You could \nneither (persuade the women to) fulfill the order of Allah's Messenger (ﷺ) nor did you relieve Allah's Messenger (ﷺ) \nfrom fatigue. \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى، قَالَ أَخْبَرَتْنِي عَمْرَةُ، قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا جَاءَ النَّبِيَّ صلى الله عليه وسلم قَتْلُ ابْنِ حَارِثَةَ وَجَعْفَرٍ وَابْنِ رَوَاحَةَ جَلَسَ يُعْرَفُ فِيهِ الْحُزْنُ، وَأَنَا أَنْظُرُ مِنْ صَائِرِ الْبَابِ ـ شَقِّ الْبَابِ ـ فَأَتَاهُ رَجُلٌ، فَقَالَ إِنَّ نِسَاءَ جَعْفَرٍ، وَذَكَرَ بُكَاءَهُنَّ، فَأَمَرَهُ أَنْ يَنْهَاهُنَّ، فَذَهَبَ ثُمَّ أَتَاهُ الثَّانِيَةَ، لَمْ يُطِعْنَهُ فَقَالَ انْهَهُنَّ‏.‏ فَأَتَاهُ الثَّالِثَةَ قَالَ وَاللَّهِ غَلَبْنَنَا يَا رَسُولَ اللَّهِ فَزَعَمَتْ أَنَّهُ قَالَ ‏\n\"‏ فَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ ‏\"‏‏.‏ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَكَ، لَمْ تَفْعَلْ مَا أَمَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ تَتْرُكْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْعَنَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1299In-book reference : Book 23, Hadith 57USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 386   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1300,
    "id": 1300,
    "url": "https://sunnah.com/bukhari:1300",
    "bookNumber": 23,
    "hadithNumber": 58,
    "narrator": "Narrated Anas:",
    "english": "When the reciters of Qur'an were martyred, Allah's Messenger (ﷺ) recited Qunut for one month and I never \nsaw him (i.e. Allah's Messenger (ﷺ)) so sad as he was on that day.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا حِينَ قُتِلَ الْقُرَّاءُ، فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حَزِنَ حُزْنًا قَطُّ أَشَدَّ مِنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1300In-book reference : Book 23, Hadith 58USC-MSA web (English) reference : Vol. 2, Book 23, Hadith 387   (deprecated numbering scheme)"
  }
]