[
  {
    "hadithGlobalNumber": 1801,
    "id": 1801,
    "url": "https://sunnah.com/bukhari:1801",
    "bookNumber": 26,
    "hadithNumber": 26,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَطْرُقَ أَهْلَهُ لَيْلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1801In-book reference : Book 26, Hadith 26USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 27   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1802,
    "id": 1802,
    "url": "https://sunnah.com/bukhari:1802",
    "bookNumber": 26,
    "hadithNumber": 27,
    "narrator": "Narrated Humaid:",
    "english": "Anas said, \"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of \nMedina, would make his she-camel proceed faster; and if it were another animal, even then he used to \nmake it proceed faster.\" \nNarrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina.\n\n\nNarrated Anas:\n\nAs above, but mentioned \"the walls of Medina\" instead of \"the high places of Medina.\" Al-Harith bin `Umar agrees with Anas.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَدِمَ مِنْ سَفَرٍ، فَأَبْصَرَ دَرَجَاتِ الْمَدِينَةِ أَوْضَعَ نَاقَتَهُ، وَإِنْ كَانَتْ دَابَّةً حَرَّكَهَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ زَادَ الْحَارِثُ بْنُ عُمَيْرٍ عَنْ حُمَيْدٍ حَرَّكَهَا مِنْ حُبِّهَا‏.‏ \nحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ جُدُرَاتٍ‏.‏ تَابَعَهُ الْحَارِثُ بْنُ عُمَيْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1802In-book reference : Book 26, Hadith 27USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 28   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1803,
    "id": 1803,
    "url": "https://sunnah.com/bukhari:1803",
    "bookNumber": 26,
    "hadithNumber": 28,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from \nHajj never entered their houses through the proper doors but from behind. One of the Ansar came and \nentered through the door and he was taunted for it. Therefore, the following was revealed: -- \n\"It is not righteousness That you enter the houses from the back, But the righteous man is He who \nfears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through \nthe proper doors.\" (2.189)",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ نَزَلَتْ هَذِهِ الآيَةُ فِينَا، كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَجَاءُوا لَمْ يَدْخُلُوا مِنْ قِبَلِ أَبْوَابِ بُيُوتِهِمْ، وَلَكِنْ مِنْ ظُهُورِهَا، فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ، فَدَخَلَ مِنْ قِبَلِ بَابِهِ، فَكَأَنَّهُ عُيِّرَ بِذَلِكَ، فَنَزَلَتْ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1803In-book reference : Book 26, Hadith 28USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1804,
    "id": 1804,
    "url": "https://sunnah.com/bukhari:1804",
    "bookNumber": 26,
    "hadithNumber": 29,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping \nproperly. So, when one's needs are fulfilled, one should return quickly to one's family.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ، فَإِذَا قَضَى نَهْمَتَهُ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1804In-book reference : Book 26, Hadith 29USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1805,
    "id": 1805,
    "url": "https://sunnah.com/bukhari:1805",
    "bookNumber": 26,
    "hadithNumber": 30,
    "narrator": "Narrated Zaid bin Aslam from his father:",
    "english": "I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was \nseriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered \nthe Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten \nwhen traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and \nthe `Isha prayers together).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ بِطَرِيقِ مَكَّةَ، فَبَلَغَهُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ شِدَّةُ وَجَعٍ فَأَسْرَعَ السَّيْرَ، حَتَّى كَانَ بَعْدَ غُرُوبِ الشَّفَقِ نَزَلَ، فَصَلَّى الْمَغْرِبَ وَالْعَتَمَةَ، جَمَعَ بَيْنَهُمَا، ثُمَّ قَالَ إِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ أَخَّرَ الْمَغْرِبَ، وَجَمَعَ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1805In-book reference : Book 26, Hadith 30USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1806,
    "id": 1806,
    "url": "https://sunnah.com/bukhari:1806",
    "bookNumber": 27,
    "hadithNumber": 1,
    "narrator": "Narrated Nafi`:",
    "english": "When `Abdullah bin `Umar set out for Mecca intending to perform Umra, at the time of afflictions, he \nsaid, \"If I should be prevented from reaching the Ka`ba, then I would do the same as Allah's Messenger (ﷺ) \ndid, so I assume the lhram for Umra as Allah's Messenger (ﷺ) assumed the Ihram for Umra in the year of \nHudaibiya.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ حِينَ خَرَجَ إِلَى مَكَّةَ مُعْتَمِرًا فِي الْفِتْنَةِ قَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْتُ كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَهَلَّ بِعُمْرَةٍ، مِنْ أَجْلِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1806In-book reference : Book 27, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1807,
    "id": 1807,
    "url": "https://sunnah.com/bukhari:1807",
    "bookNumber": 27,
    "hadithNumber": 2,
    "narrator": "Narrated Nafi`:",
    "english": "That Ubaidullah bin `Abdullah and Salim bin `Abdullah informed him that they told Ibn `Umar when \nIbn Az-Zubair was attacked by the army, saying \"There is no harm for you if you did not perform Hajj \nthis year. We are afraid that you may be prevented from reaching the Ka`ba.\" Ibn `Umar said \"We set \nout with Allah's Messenger (ﷺ) and the non-believers of Quraish prevented us from reaching the Ka`ba, and \nso the Prophet (ﷺ) slaughtered his Hadi and got his head shaved.\" Ibn `Umar added, \"I make you \nwitnesses that I have made `Umra obligatory for me. And, Allah willing, I will go and then if the way \nto Ka`ba is clear, I will perform the Tawaf, but if I am prevented from going to the Ka`ba then I will \ndo the same as the Prophet (ﷺ) did while I was in his company.\" Ibn `Umar then assumed Ihram for Umra \nfrom Dhul-Hulaifa and proceeded for a while and said, \"The conditions of `Umra and Hajj are similar \nand I make you witnesses that I have made `Umra and Hajj obligatory for myself.\" So, he did not \nfinish the Ihram till the day of Nahr (slaughtering) came, and he slaughtered his Hadi. He used to say, \n\"I will not finish the Ihram till I perform the Tawaf, one Tawaf on the day of entering Mecca (i.e. of \nSafa and Marwa for both `Umra and Hajj).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَاهُ أَنَّهُمَا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ لَيَالِيَ نَزَلَ الْجَيْشُ بِابْنِ الزُّبَيْرِ فَقَالاَ لاَ يَضُرُّكَ أَنْ لاَ تَحُجَّ الْعَامَ، وَإِنَّا نَخَافُ أَنْ يُحَالَ بَيْنَكَ وَبَيْنَ الْبَيْتِ‏.‏ فَقَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ النَّبِيُّ صلى الله عليه وسلم هَدْيَهُ، وَحَلَقَ رَأْسَهُ، وَأُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْعُمْرَةَ، إِنْ شَاءَ اللَّهُ أَنْطَلِقُ، فَإِنْ خُلِّيَ بَيْنِي وَبَيْنَ الْبَيْتِ طُفْتُ، وَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَعَهُ‏.‏ فَأَهَلَّ بِالْعُمْرَةِ مِنْ ذِي الْحُلَيْفَةِ، ثُمَّ سَارَ سَاعَةً، ثُمَّ قَالَ ‏\n\"‏ إِنَّمَا شَأْنُهُمَا وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَتِي ‏\"‏‏.‏ فَلَمْ يَحِلَّ مِنْهُمَا حَتَّى حَلَّ يَوْمَ النَّحْرِ، وَأَهْدَى، وَكَانَ يَقُولُ لاَ يَحِلُّ حَتَّى يَطُوفَ طَوَافًا وَاحِدًا يَوْمَ يَدْخُلُ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1807In-book reference : Book 27, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1808,
    "id": 1808,
    "url": "https://sunnah.com/bukhari:1808",
    "bookNumber": 27,
    "hadithNumber": 3,
    "narrator": "Narrated Nafi`:",
    "english": "Some of the sons of `Abdullah told him (i.e. `Abdullah) if he had stayed (and not performed Hajj that \nyear).",
    "arabic": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ بَعْضَ بَنِي عَبْدِ اللَّهِ، قَالَ لَهُ لَوْ أَقَمْتَ‏.‏ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1808In-book reference : Book 27, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1809,
    "id": 1809,
    "url": "https://sunnah.com/bukhari:1809",
    "bookNumber": 27,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) was prevented from performing (`Umra) Therefore, he shaved his head and had sexual \nrelations with his wives and slaughtered his Hadi and performed Umra in the following year.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، قَالَ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ أُحْصِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَلَقَ رَأْسَهُ وَجَامَعَ نِسَاءَهُ، وَنَحَرَ هَدْيَهُ، حَتَّى اعْتَمَرَ عَامًا قَابِلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1809In-book reference : Book 27, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1810,
    "id": 1810,
    "url": "https://sunnah.com/bukhari:1810",
    "bookNumber": 27,
    "hadithNumber": 5,
    "narrator": "Narrated Salim:",
    "english": "(Abdullah) bin `Umar used to say, \"Is not (the following of) the tradition of Allah's Messenger (ﷺ) sufficient \nfor you? If anyone of you is prevented from performing Hajj, he should perform the Tawaf of the \nKa`ba and between As-Safa and Al-Marwa and then finish the Ihram and everything will become \nlegal for him which was illegal for him (during the state of Ihram) and he can perform Hajj in a \nfollowing year and he should slaughter a Hadi or fast in case he cannot afford the Hadi.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ أَلَيْسَ حَسْبُكُمْ سُنَّةَ رَسُولِ اللَّهِ صلى الله عليه وسلم، إِنْ حُبِسَ أَحَدُكُمْ عَنِ الْحَجِّ طَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلَّ مِنْ كُلِّ شَىْءٍ، حَتَّى يَحُجَّ عَامًا قَابِلاً، فَيُهْدِي أَوْ يَصُومُ، إِنْ لَمْ يَجِدْ هَدْيًا‏.‏ وَعَنْ عَبْدِ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ، نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1810In-book reference : Book 27, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 37   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1811,
    "id": 1811,
    "url": "https://sunnah.com/bukhari:1811",
    "bookNumber": 27,
    "hadithNumber": 6,
    "narrator": "Narrated Al-Miswar:",
    "english": "Allah's Messenger (ﷺ) slaughtered (the Hadi) before he had his head shaved and then he ordered his \nCompanions to do the same.",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنِ الْمِسْوَرِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَحَرَ قَبْلَ أَنْ يَحْلِقَ، وَأَمَرَ أَصْحَابَهُ بِذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1811In-book reference : Book 27, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 38   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1812,
    "id": 1812,
    "url": "https://sunnah.com/bukhari:1812",
    "bookNumber": 27,
    "hadithNumber": 7,
    "narrator": "Narrated Nafi`:",
    "english": "That `Abdullah and Salim said to `Abdullah bin `Umar, \"(You should not go for Hajj this year).\" \n`Abdullah bin `Umar replied, \"We set out with the Prophet (to Mecca for performing `Umra) and the \ninfidels of Quraish prevented us from reaching the Ka`ba. Allah's Messenger (ﷺ) slaughtered his Budn \n(camels for sacrifice) and got his head shaved.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا أَبُو بَدْرٍ، شُجَاعُ بْنُ الْوَلِيدِ عَنْ عُمَرَ بْنِ مُحَمَّدٍ الْعُمَرِيِّ، قَالَ وَحَدَّثَ نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، وَسَالِمًا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ فَقَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مُعْتَمِرِينَ، فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بُدْنَهُ، وَحَلَقَ رَأْسَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1812In-book reference : Book 27, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 39   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1813,
    "id": 1813,
    "url": "https://sunnah.com/bukhari:1813",
    "bookNumber": 27,
    "hadithNumber": 8,
    "narrator": "Narrated Nafi`:",
    "english": "When `Abdullah bin `Umar set out for Mecca with the intentions performing `Umra in the period of \nafflictions, he said, \"If I should be prevented from reaching the Ka`ba, then I would do the same as we \ndid while in the company of Allah's Messenger (ﷺ) .\" So, he assumed the Ihram for `Umra since the Prophet (ﷺ) \nhad assumed the Ihram for `Umra in the year of Al-Hudaibiya. Then `Abdullah bin `Umar thought \nabout it and said, \"The conditions for both Hajj and `Umra are similar.\" He then turned towards his \ncompanions and said, \"The conditions of both Hajj and `Umra are similar and I make you witnesses \nthat I have made the performance of Hajj obligatory for myself along with `Umra.\" He then performed \none Tawaf (between As-Safa and Al-Marwa) for both of them (i.e. Hajj and (`Umra) and considered \nthat to be sufficient for him and offered a Hadi.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ حِينَ خَرَجَ إِلَى مَكَّةَ مُعْتَمِرًا فِي الْفِتْنَةِ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَهَلَّ بِعُمْرَةٍ، مِنْ أَجْلِ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ، ثُمَّ إِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ نَظَرَ فِي أَمْرِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ‏.‏ فَالْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ، ثُمَّ طَافَ لَهُمَا طَوَافًا وَاحِدًا، وَرَأَى أَنَّ ذَلِكَ مُجْزِيًا عَنْهُ، وَأَهْدَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1813In-book reference : Book 27, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1814,
    "id": 1814,
    "url": "https://sunnah.com/bukhari:1814",
    "bookNumber": 27,
    "hadithNumber": 9,
    "narrator": "Narrated `Abdur-Rahman bin Abu Layla:",
    "english": "Ka`b bin 'Ujra said that Allah's Messenger (ﷺ) said to him (Ka`b), \"Perhaps your lice have troubled you?\" \nKa`b replied, \"Yes! O Allah's Messenger (ﷺ).\" Allah's Messenger (ﷺ) said, \"Have your head shaved and then either \nfast three days or feed six poor persons or slaughter one sheep as a sacrifice.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لَعَلَّكَ آذَاكَ هَوَامُّكَ ‏\"‏‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْلِقْ رَأْسَكَ وَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، أَوِ انْسُكْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1814In-book reference : Book 27, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1815,
    "id": 1815,
    "url": "https://sunnah.com/bukhari:1815",
    "bookNumber": 27,
    "hadithNumber": 10,
    "narrator": "Narrated Ka`b bin `Umra:",
    "english": "Allah's Messenger (ﷺ) stood beside me at Al-Hudaibiya and the lice were falling from my head in great \nnumber. He asked me, \"Have your lice troubled you?\" I replied in the affirmative. He ordered me to \nget my head shaved. Ka`b added, \"This Holy Verse:--'And if any of you is ill, or has ailment in his \nscalp (2.196), etc. was revealed regarding me. \"The Prophet (ﷺ) then ordered me either to fast three days, \nor to feed six poor persons with one Faraq (three Sas) (of dates), or to slaughter a sheep, etc. \n(sacrifice) whatever was available.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفٌ، قَالَ حَدَّثَنِي مُجَاهِدٌ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، أَنَّ كَعْبَ بْنَ عُجْرَةَ، حَدَّثَهُ قَالَ وَقَفَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ، وَرَأْسِي يَتَهَافَتُ قَمْلاً فَقَالَ ‏\"‏ يُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاحْلِقْ رَأْسَكَ ـ أَوْ قَالَ ـ احْلِقْ ‏\"‏‏.‏ قَالَ فِيَّ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ‏}‏ إِلَى آخِرِهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ تَصَدَّقْ بِفَرَقٍ بَيْنَ سِتَّةٍ، أَوِ انْسُكْ بِمَا تَيَسَّرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1815In-book reference : Book 27, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1816,
    "id": 1816,
    "url": "https://sunnah.com/bukhari:1816",
    "bookNumber": 27,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdullah bin Ma'qal:",
    "english": "I sat with Ka`b bin 'Ujra and asked him about the Fidya. He replied, \"This revelation was revealed \nconcerning my case especially, but it is also for you in general. I was carried to Allah's Messenger (ﷺ) and \nthe lice were falling in great number on my face. The Prophet (ﷺ) said, \"I have never thought that your \nailment (or struggle) has reached to such an extent as I see. Can you afford a sheep?\" I replied in the \nnegative. He then said, \"Fast for three days, or feed six poor persons each with half a Sa of food.\" (1 \nSa = 3 Kilograms approx.)",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبِهَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ، قَالَ جَلَسْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ فَسَأَلْتُهُ عَنِ الْفِدْيَةِ، فَقَالَ نَزَلَتْ فِيَّ خَاصَّةً، وَهْىَ لَكُمْ عَامَّةً، حُمِلْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ مَا كُنْتُ أُرَى الْوَجَعَ بَلَغَ بِكَ مَا أَرَى أَوْ مَا كُنْتُ أُرَى الْجَهْدَ بَلَغَ بِكَ مَا أَرَى، تَجِدُ شَاةً ‏\"‏‏.‏ فَقُلْتُ لاَ‏.‏ فَقَالَ ‏\"‏ فَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، لِكُلِّ مِسْكِينٍ نِصْفَ صَاعٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1816In-book reference : Book 27, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 43   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1817,
    "id": 1817,
    "url": "https://sunnah.com/bukhari:1817",
    "bookNumber": 27,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdur-Rahman bin Abu Layla:",
    "english": "(Reporting the speech of Ka`b bin Umra) Allah's Messenger (ﷺ) saw him (i.e. Ka`b) while the lice were \nfalling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, \nhe ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not \npermitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of \nAl-Fidya. Allah's Messenger (ﷺ) ordered him to feed six poor persons with one Faraq of food or to slaughter \none sheep (as a sacrifice) or to fast for three days.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَآهُ وَأَنَّهُ يَسْقُطُ عَلَى وَجْهِهِ فَقَالَ ‏\n\"‏ أَيُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَهُ أَنْ يَحْلِقَ وَهُوَ بِالْحُدَيْبِيَةِ، وَلَمْ يَتَبَيَّنْ لَهُمْ أَنَّهُمْ يَحِلُّونَ بِهَا، وَهُمْ عَلَى طَمَعٍ أَنْ يَدْخُلُوا مَكَّةَ، فَأَنْزَلَ اللَّهُ الْفِدْيَةَ، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُطْعِمَ فَرَقًا بَيْنَ سِتَّةٍ، أَوْ يُهْدِيَ شَاةً، أَوْ يَصُومَ ثَلاَثَةَ أَيَّامٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1817In-book reference : Book 27, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1818,
    "id": 1818,
    "url": "https://sunnah.com/bukhari:1818",
    "bookNumber": 27,
    "hadithNumber": 13,
    "narrator": "Narrated Ka'b bin 'Ujra (ra):",
    "english": "Allah's Messenger (ﷺ) saw him (i.e. Ka'b) while the lice were falling on his face.",
    "arabic": "وَعَنْ مُحَمَّدِ بْنِ يُوسُفَ، حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَآهُ، وَقَمْلُهُ يَسْقُطُ عَلَى وَجْهِهِ‏.‏ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1818In-book reference : Book 27, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1819,
    "id": 1819,
    "url": "https://sunnah.com/bukhari:1819",
    "bookNumber": 27,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever performs Hajj to this House (Ka`ba) and does not approach his wife \nfor sexual relations nor commits sins (while performing Hajj), he will come out as sinless as a newlyborn \nchild. (Just delivered by his mother).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَجَّ هَذَا الْبَيْتَ، فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ، رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1819In-book reference : Book 27, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1820,
    "id": 1820,
    "url": "https://sunnah.com/bukhari:1820",
    "bookNumber": 27,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Whoever performs Hajj to this Ka`ba and does not approach his wife for sexual \nrelations nor commit sins (while performing Hajj), he will come out as sinless as a newborn child, \n(just delivered by his mother).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَجَّ هَذَا الْبَيْتَ، فَلَمْ يَرْفُثْ، وَلَمْ يَفْسُقْ، رَجَعَ كَيَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1820In-book reference : Book 27, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 28, Hadith 46   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1821,
    "id": 1821,
    "url": "https://sunnah.com/bukhari:1821",
    "bookNumber": 28,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin Abu Qatada:",
    "english": "My father set out (for Mecca) in the year of Al-Hudaibiya, and his companions assumed Ihram, but he \ndid not. At that time the Prophet (ﷺ) was informed that an enemy wanted to attack him, so the Prophet (ﷺ) \nproceeded onwards. While my father was among his companions, some of them laughed among \nthemselves. (My father said), \"I looked up and saw an onager. I attacked, stabbed and caught it. I then \nsought my companions' help but they refused to help me. (Later) we all ate its meat. We were afraid \nthat we might be left behind (separated) from the Prophet (ﷺ) so I went in search of the Prophet (ﷺ) and made \nmy horse to run at a galloping speed at times and let it go slow at an ordinary speed at other times till I \nmet a man from the tribe of Bani Ghifar at midnight. I asked him, \"Where did you leave the Prophet (ﷺ) \n?\" He replied, \"I left him at Ta'hun and he had the intention of having the midday rest at As-Suqya. I \nfollowed the trace and joined the Prophet (ﷺ) and said, 'O Allah's Messenger (ﷺ)! Your people (companions) \nsend you their compliments, and (ask for) Allah's Blessings upon you. They are afraid lest they may \nbe left behind; so please wait for them.' I added, 'O Allah's Messenger (ﷺ)! I hunted an onager and some of \nits meat is with me. The Prophet (ﷺ) told the people to eat it though all of them were in the state of \nIhram.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، قَالَ انْطَلَقَ أَبِي عَامَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ، وَلَمْ يُحْرِمْ، وَحُدِّثَ النَّبِيُّ صلى الله عليه وسلم أَنَّ عَدُوًّا يَغْزُوهُ، فَانْطَلَقَ النَّبِيُّ صلى الله عليه وسلم، فَبَيْنَمَا أَنَا مَعَ أَصْحَابِهِ يَضْحَكُ بَعْضُهُمْ إِلَى بَعْضٍ، فَنَظَرْتُ فَإِذَا أَنَا بِحِمَارِ وَحْشٍ، فَحَمَلْتُ عَلَيْهِ، فَطَعَنْتُهُ، فَأَثْبَتُّهُ، وَاسْتَعَنْتُ بِهِمْ، فَأَبَوْا أَنْ يُعِينُونِي، فَأَكَلْنَا مِنْ لَحْمِهِ، وَخَشِينَا أَنْ نُقْتَطَعَ، فَطَلَبْتُ النَّبِيَّ صلى الله عليه وسلم أَرْفَعُ فَرَسِي شَأْوًا، وَأَسِيرُ شَأْوًا، فَلَقِيتُ رَجُلاً مِنْ بَنِي غِفَارٍ فِي جَوْفِ اللَّيْلِ قُلْتُ أَيْنَ تَرَكْتَ النَّبِيَّ صلى الله عليه وسلم قَالَ تَرَكْتُهُ بِتَعْهِنَ، وَهُوَ قَائِلٌ السُّقْيَا‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَهْلَكَ يَقْرَءُونَ عَلَيْكَ السَّلاَمَ وَرَحْمَةَ اللَّهِ، إِنَّهُمْ قَدْ خَشُوا أَنْ يُقْتَطَعُوا دُونَكَ، فَانْتَظِرْهُمْ قُلْتُ يَا رَسُولَ اللَّهِ أَصَبْتُ حِمَارَ وَحْشٍ، وَعِنْدِي مِنْهُ فَاضِلَةٌ‏.‏ فَقَالَ لِلْقَوْمِ ‏\n\"‏ كُلُوا ‏\"‏ وَهُمْ مُحْرِمُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1821In-book reference : Book 28, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1822,
    "id": 1822,
    "url": "https://sunnah.com/bukhari:1822",
    "bookNumber": 28,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah bin Abu Qatada:",
    "english": "That his father said \"We proceeded with the Prophet (ﷺ) in the year of Al-Hudaibiya and his companions \nassumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on \ntowards them. My companions saw an onager and some of them started laughing among themselves. I \nlooked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my \ncompanions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I \nfollowed Allah's Messenger (ﷺ) lest we should be left behind. At times I urged my horse to run at a galloping \nspeed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani \nGhifar at midnight. I asked him where he had left Allah's Messenger (ﷺ) . The man replied that he had left \nthe Prophet (ﷺ) at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. \nSo, I followed Allah's Messenger (ﷺ) till I reached him and said, \"O Allah's Messenger (ﷺ)! I have been sent by my \ncompanions who send you their greetings and compliments and ask for Allah's Mercy and Blessings \nupon you. They were afraid lest the enemy might intervene between you and them; so please wait for \nthem.\" So he did. Then I said, \"O Allah's Messenger (ﷺ)! We have hunted an onager and have some of it (i.e. \nits meat) left over.\" Allah's Messenger (ﷺ) told his companions to eat the meat although all of them were in a \nstate of Ihram.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَاهُ، حَدَّثَهُ قَالَ انْطَلَقْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ، وَلَمْ أُحْرِمْ، فَأُنْبِئْنَا بِعَدُوٍّ بِغَيْقَةَ فَتَوَجَّهْنَا نَحْوَهُمْ، فَبَصُرَ أَصْحَابِي بِحِمَارِ وَحْشٍ، فَجَعَلَ بَعْضُهُمْ يَضْحَكُ إِلَى بَعْضٍ، فَنَظَرْتُ فَرَأَيْتُهُ فَحَمَلْتُ عَلَيْهِ الْفَرَسَ، فَطَعَنْتُهُ، فَأَثْبَتُّهُ، فَاسْتَعَنْتُهُمْ، فَأَبَوْا أَنْ يُعِينُونِي، فَأَكَلْنَا مِنْهُ، ثُمَّ لَحِقْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَخَشِينَا أَنْ نُقْتَطَعَ، أَرْفَعُ فَرَسِي شَأْوًا، وَأَسِيرُ عَلَيْهِ شَأْوًا، فَلَقِيتُ رَجُلاً مِنْ بَنِي غِفَارٍ فِي جَوْفِ اللَّيْلِ فَقُلْتُ أَيْنَ تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ تَرَكْتُهُ بِتَعْهِنَ وَهُوَ قَائِلٌ السُّقْيَا‏.‏ فَلَحِقْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ أَصْحَابَكَ أَرْسَلُوا يَقْرَءُونَ عَلَيْكَ السَّلاَمَ وَرَحْمَةَ اللَّهِ وَبَرَكَاتِهِ، وَإِنَّهُمْ قَدْ خَشُوا أَنْ يَقْتَطِعَهُمُ الْعُدُوُّ دُونَكَ، فَانْظُرْهُمْ، فَفَعَلَ فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّا اصَّدْنَا حِمَارَ وَحْشٍ، وَإِنَّ عِنْدَنَا فَاضِلَةً‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِهِ ‏\n\"‏ كُلُوا ‏\"‏‏.‏ وَهُمْ مُحْرِمُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1822In-book reference : Book 28, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1823,
    "id": 1823,
    "url": "https://sunnah.com/bukhari:1823",
    "bookNumber": 28,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Qatada:",
    "english": "We were in the company of the Prophet (ﷺ) at a place called Al-Qaha (which is at a distance of three \nstages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in \nthe company of the Prophet (ﷺ) at a place called Al-Qaha and some of us had assumed Ihram while the \nothers had not. I noticed that some of my companions were watching something, so I looked up and \nsaw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked \nthem to pick it up for me) but they said, \"We will not help you by any means as we are in a state of \nIhram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and \nslaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \n\"Do not eat it.\" So, I went to the Prophet (ﷺ) who was ahead of us and asked him about it, He replied, \"Eat \nit as it is Halal (i.e. it is legal to eat it).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ، عَنْ أَبِي مُحَمَّدٍ، نَافِعٍ مَوْلَى أَبِي قَتَادَةَ سَمِعَ أَبَا قَتَادَةَ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالْقَاحَةِ مِنَ الْمَدِينَةِ عَلَى ثَلاَثٍ ح‏.‏ وَحَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ عَنْ أَبِي مُحَمَّدٍ عَنْ أَبِي قَتَادَةَ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالْقَاحَةِ، وَمِنَّا الْمُحْرِمُ، وَمِنَّا غَيْرُ الْمُحْرِمِ، فَرَأَيْتُ أَصْحَابِي يَتَرَاءَوْنَ شَيْئًا فَنَظَرْتُ، فَإِذَا حِمَارُ وَحْشٍ ـ يَعْنِي وَقَعَ سَوْطُهُ ـ فَقَالُوا لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ، إِنَّا مُحْرِمُونَ‏.‏ فَتَنَاوَلْتُهُ فَأَخَذْتُهُ، ثُمَّ أَتَيْتُ الْحِمَارَ مِنْ وَرَاءِ أَكَمَةٍ، فَعَقَرْتُهُ، فَأَتَيْتُ بِهِ أَصْحَابِي، فَقَالَ بَعْضُهُمْ كُلُوا‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَأْكُلُوا‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ أَمَامَنَا، فَسَأَلْتُهُ فَقَالَ ‏\n\"‏ كُلُوهُ حَلاَلٌ ‏\"‏‏.‏ قَالَ لَنَا عَمْرٌو اذْهَبُوا إِلَى صَالِحٍ فَسَلُوهُ عَنْ هَذَا وَغَيْرِهِ، وَقَدِمَ عَلَيْنَا هَا هُنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1823In-book reference : Book 28, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1824,
    "id": 1824,
    "url": "https://sunnah.com/bukhari:1824",
    "bookNumber": 28,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah bin Abu Qatada:",
    "english": "That his father had told him that Allah's Messenger (ﷺ) set out for Hajj and so did his companions. He sent a \nbatch of his companions by another route and Abu Qatada was one of them. The Prophet (ﷺ) said to them, \n\"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and \nwhen they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his \ncompanions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. \nThey got down and ate some of its meat and said to each other: \"How do we eat the meat of \nthe game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and \nwhen they met Allah's Messenger (ﷺ) they asked, saying, \"O Allah's Messenger (ﷺ)! We assumed Ihram with the \nexception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a \nshe-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How \ndo we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The \nProphet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the \nnegative. He said, \"Then eat what is left of its meat.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عُثْمَانُ ـ هُوَ ابْنُ مَوْهَبٍ ـ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ حَاجًّا، فَخَرَجُوا مَعَهُ فَصَرَفَ طَائِفَةً مِنْهُمْ، فِيهِمْ أَبُو قَتَادَةَ فَقَالَ خُذُوا سَاحِلَ الْبَحْرِ حَتَّى نَلْتَقِيَ‏.‏ فَأَخَذُوا سَاحِلَ الْبَحْرِ، فَلَمَّا انْصَرَفُوا أَحْرَمُوا كُلُّهُمْ إِلاَّ أَبُو قَتَادَةَ لَمْ يُحْرِمْ، فَبَيْنَمَا هُمْ يَسِيرُونَ إِذْ رَأَوْا حُمُرَ وَحْشٍ، فَحَمَلَ أَبُو قَتَادَةَ عَلَى الْحُمُرِ، فَعَقَرَ مِنْهَا أَتَانًا، فَنَزَلُوا فَأَكَلُوا مِنْ لَحْمِهَا، وَقَالُوا أَنَأْكُلُ لَحْمَ صَيْدٍ وَنَحْنُ مُحْرِمُونَ فَحَمَلْنَا مَا بَقِيَ مِنْ لَحْمِ الأَتَانِ، فَلَمَّا أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالُوا يَا رَسُولَ اللَّهِ، إِنَّا كُنَّا أَحْرَمْنَا وَقَدْ كَانَ أَبُو قَتَادَةَ لَمْ يُحْرِمْ، فَرَأَيْنَا حُمُرَ وَحْشٍ فَحَمَلَ عَلَيْهَا أَبُو قَتَادَةَ، فَعَقَرَ مِنْهَا أَتَانًا، فَنَزَلْنَا فَأَكَلْنَا مِنْ لَحْمِهَا ثُمَّ قُلْنَا أَنَأْكُلُ لَحْمَ صَيْدٍ وَنَحْنُ مُحْرِمُونَ فَحَمَلْنَا مَا بَقِيَ مِنْ لَحْمِهَا‏.‏ قَالَ ‏\"‏ مِنْكُمْ أَحَدٌ أَمَرَهُ أَنْ يَحْمِلَ عَلَيْهَا، أَوْ أَشَارَ إِلَيْهَا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَكُلُوا مَا بَقِيَ مِنْ لَحْمِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1824In-book reference : Book 28, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1825,
    "id": 1825,
    "url": "https://sunnah.com/bukhari:1825",
    "bookNumber": 28,
    "hadithNumber": 5,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Messenger (ﷺ) while he \nwas at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of \ndisappointment on his (As-Sab's) face, the Prophet (ﷺ) said to him, \"I have only returned it because I am \nMuhrim.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ اللَّيْثِيِّ، أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِمَارًا وَحْشِيًّا، وَهْوَ بِالأَبْوَاءِ أَوْ بِوَدَّانَ فَرَدَّهُ عَلَيْهِ، فَلَمَّا رَأَى مَا فِي وَجْهِهِ قَالَ ‏\n\"‏ إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلاَّ أَنَّا حُرُمٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1825In-book reference : Book 28, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 51   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1826,
    "id": 1826,
    "url": "https://sunnah.com/bukhari:1826",
    "bookNumber": 28,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"It is not sinful of a Muhrim to kill five kinds of animals.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ لَيْسَ عَلَى الْمُحْرِمِ فِي قَتْلِهِنَّ جُنَاحٌ ‏\"‏‏.‏ وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1826In-book reference : Book 28, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 52   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1827,
    "id": 1827,
    "url": "https://sunnah.com/bukhari:1827",
    "bookNumber": 28,
    "hadithNumber": 7,
    "narrator": "One of the wives of the Prophet (ﷺ) narrated:",
    "english": "The Prophet (ﷺ) said, \"A Muhrim can kill (five kinds of animals.)\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ حَدَّثَتْنِي إِحْدَى، نِسْوَةِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ يَقْتُلُ الْمُحْرِمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1827In-book reference : Book 28, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 53   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1828,
    "id": 1828,
    "url": "https://sunnah.com/bukhari:1828",
    "bookNumber": 28,
    "hadithNumber": 8,
    "narrator": "Narrated Hafsa:",
    "english": "Allah's Messenger (ﷺ) said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the \nkite, the mouse, the scorpion and the rabid dog.\"",
    "arabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ قَالَتْ حَفْصَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ لاَ حَرَجَ عَلَى مَنْ قَتَلَهُنَّ الْغُرَابُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْعَقْرَبُ وَالْكَلْبُ الْعَقُورُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1828In-book reference : Book 28, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 54   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1829,
    "id": 1829,
    "url": "https://sunnah.com/bukhari:1829",
    "bookNumber": 28,
    "hadithNumber": 9,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). \nThese are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ كُلُّهُنَّ فَاسِقٌ، يَقْتُلُهُنَّ فِي الْحَرَمِ الْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1829In-book reference : Book 28, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1830,
    "id": 1830,
    "url": "https://sunnah.com/bukhari:1830",
    "bookNumber": 28,
    "hadithNumber": 10,
    "narrator": "Narrated `Abdullah:",
    "english": "While we were in the company of the Prophet (ﷺ) in a cave at Mina, when Surat-wal-Mursalat were \nrevealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. \nSuddenly a snake sprang at us and the Prophet (ﷺ) said (ordered us): \"Kill it.\" We ran to kill it but it \nescaped quickly. The Prophet (ﷺ) said, \"It has escaped your evil and you too have escaped its evil.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَارٍ بِمِنًى، إِذْ نَزَلَ عَلَيْهِ ‏{‏وَالْمُرْسَلاَتِ‏}‏ وَإِنَّهُ لَيَتْلُوهَا، وَإِنِّي لأَتَلَقَّاهَا مِنْ فِيهِ، وَإِنَّ فَاهُ لَرَطْبٌ بِهَا، إِذْ وَثَبَتْ عَلَيْنَا حَيَّةٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْتُلُوهَا ‏\"‏‏.‏ فَابْتَدَرْنَاهَا، فَذَهَبَتْ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وُقِيَتْ شَرَّكُمْ كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1830In-book reference : Book 28, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 56   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1831,
    "id": 1831,
    "url": "https://sunnah.com/bukhari:1831",
    "bookNumber": 28,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha the wife of the Prophet:",
    "english": "Allah's Messenger (ﷺ) called the salamander a bad animal, but I did not hear him ordering it to be killed.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِلْوَزَغِ ‏\n\"‏ فُوَيْسِقٌ ‏\"‏‏.‏ وَلَمْ أَسْمَعْهُ أَمَرَ بِقَتْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1831In-book reference : Book 28, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 57   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1832,
    "id": 1832,
    "url": "https://sunnah.com/bukhari:1832",
    "bookNumber": 28,
    "hadithNumber": 12,
    "narrator": "Narrated Sa`id bin Abu Sa`id Al-Maqburi:",
    "english": "Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to \nMecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Messenger (ﷺ) said \non the day following the Conquest of Mecca. My ears heard that and my heart understood it \nthoroughly and I saw with my own eyes the Prophet (ﷺ) when he, after Glorifying and Praising Allah, \nstarted saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah \nand the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells \n(argues) that fighting in it is permissible on the basis that Allah's Messenger (ﷺ) did fight in Mecca, say to \nhim, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on \nthat day (of the conquest) and today its sanctity is valid as it was before. So, those who are present \nshould inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr \nreply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not \ngive protection to a sinner, a murderer or a thief.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ، وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْغَدِ مِنْ يَوْمِ الْفَتْحِ، فَسَمِعَتْهُ أُذُنَاىَ، وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَاىَ حِينَ تَكَلَّمَ بِهِ، إِنَّهُ حَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\n\"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ، فَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا وَلاَ يَعْضُدَ بِهَا شَجَرَةً، فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُولُوا لَهُ إِنَّ اللَّهَ أَذِنَ لِرَسُولِهِ صلى الله عليه وسلم وَلَمْ يَأْذَنْ لَكُمْ، وَإِنَّمَا أَذِنَ لِي سَاعَةً مِنْ نَهَارٍ، وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ لَكَ عَمْرٌو قَالَ أَنَا أَعْلَمُ بِذَلِكَ مِنْكَ يَا أَبَا شُرَيْحٍ، إِنَّ الْحَرَمَ لاَ يُعِيذُ عَاصِيًا، وَلاَ فَارًّا بِدَمٍ، وَلاَ فَارًّا بِخَرْبَةٍ‏.‏ خَرْبَةٌ بَلِيَّةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1832In-book reference : Book 28, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 58   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1833,
    "id": 1833,
    "url": "https://sunnah.com/bukhari:1833",
    "bookNumber": 28,
    "hadithNumber": 13,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "\"The Prophet (ﷺ) said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will \ncontinue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a \nfew hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its \ngame, or to pick up its luqata (fallen things) except by a person who would announce that (what he has \nfound) publicly.' Al-`Abbas said, 'O Allah's Messenger (ﷺ)! Except Al-Idhkhir (a kind of grass) (for it is \nused) by our goldsmiths and for our graves.' The Prophet (ﷺ) then said, 'Except Al-Idhkhir.' \" `Ikrima said, \n'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to \noccupy its place.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ، فَلَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي، وَإِنَّمَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، لاَ يُخْتَلَى خَلاَهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ يُنَفَّرُ صَيْدُهَا، وَلاَ تُلْتَقَطُ لُقَطَتُهَا إِلاَّ لِمُعَرِّفٍ ‏\"‏‏.‏ وَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ‏.‏ إِلاَّ الإِذْخِرَ لِصَاغَتِنَا وَقُبُورِنَا‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ وَعَنْ خَالِدٍ عَنْ عِكْرِمَةَ قَالَ هَلْ تَدْرِي مَا لاَ يُنَفَّرُ صَيْدُهَا هُوَ أَنْ يُنَحِّيَهُ مِنَ الظِّلِّ، يَنْزِلُ مَكَانَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1833In-book reference : Book 28, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1834,
    "id": 1834,
    "url": "https://sunnah.com/bukhari:1834",
    "bookNumber": 28,
    "hadithNumber": 14,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "On the day of the conquest of Mecca, the Prophet (ﷺ) said, \"There is no more emigration (from Mecca) \nbut Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No \ndoubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth \nand will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting \nwas not permissible in it for anyone before me, and even for me it was allowed only for a portion of a \nday. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be \nuprooted and its game should not be chased; and its luqata (fallen things) should not be picked up \nexcept by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" \nAl-`Abbas said, \"O Allah's Messenger (ﷺ)! Except Al-Idhkhir, (for it is used by their blacksmiths and for \ntheir domestic purposes).\" So, the Prophet (ﷺ) said, \"Except Al-Idhkhir.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ افْتَتَحَ مَكَّةَ ‏\"‏ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا، فَإِنَّ هَذَا بَلَدٌ حَرَّمَ اللَّهُ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، وَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، وَإِنَّهُ لَمْ يَحِلَّ الْقِتَالُ فِيهِ لأَحَدٍ قَبْلِي، وَلَمْ يَحِلَّ لِي إِلاَّ سَاعَةً مِنْ نَهَارٍ، فَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، لاَ يُعْضَدُ شَوْكُهُ، وَلاَ يُنَفَّرُ صَيْدُهُ، وَلاَ يَلْتَقِطُ لُقَطَتَهُ إِلاَّ مَنْ عَرَّفَهَا، وَلاَ يُخْتَلَى خَلاَهَا ‏\"‏‏.‏ قَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ‏.‏ إِلاَّ الإِذْخِرَ، فَإِنَّهُ لِقَيْنِهِمْ وَلِبُيُوتِهِمْ‏.‏ قَالَ قَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1834In-book reference : Book 28, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 60   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1835,
    "id": 1835,
    "url": "https://sunnah.com/bukhari:1835",
    "bookNumber": 28,
    "hadithNumber": 15,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) was cupped while he was in a state of Ihram.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عَمْرٌو أَوَّلُ شَىْءٍ سَمِعْتُ عَطَاءً، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ مُحْرِمٌ‏.‏ ثُمَّ سَمِعْتُهُ يَقُولُ حَدَّثَنِي طَاوُسٌ عَنِ ابْنِ عَبَّاسٍ فَقُلْتُ لَعَلَّهُ سَمِعَهُ مِنْهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1835In-book reference : Book 28, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 61   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1836,
    "id": 1836,
    "url": "https://sunnah.com/bukhari:1836",
    "bookNumber": 28,
    "hadithNumber": 16,
    "narrator": "Narrated Ibn Buhaina:",
    "english": "The Prophet, while in the state of Ihram, was cupped at the middle of his head at Liha-Jamal.",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنِ ابْنِ بُحَيْنَةَ ـ رضى الله عنه ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ بِلَحْىِ جَمَلٍ فِي وَسَطِ رَأْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1836In-book reference : Book 28, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 62   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1837,
    "id": 1837,
    "url": "https://sunnah.com/bukhari:1837",
    "bookNumber": 28,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage \nwere held).",
    "arabic": "حَدَّثَنَا أَبُو الْمُغِيرَةِ عَبْدُ الْقُدُّوسِ بْنُ الْحَجَّاجِ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1837In-book reference : Book 28, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 63   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1838,
    "id": 1838,
    "url": "https://sunnah.com/bukhari:1838",
    "bookNumber": 28,
    "hadithNumber": 18,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "A person stood up and asked, \"O Allah's: Apostle! What clothes may be worn in the state of Ihram?\" \nThe Prophet (ﷺ) replied, \"Do not wear a shirt or trousers, or any headgear (e.g. a turban), or a hooded \ncloak; but if somebody has no shoes he can wear leather stockings provided they are cut short off the \nankles, and also, do not wear anything perfumed with Wars or saffron, and the Muhrima (a woman in \nthe state of Ihram) should not cover her face, or wear gloves.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا نَافِعٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَاذَا تَأْمُرُنَا أَنْ نَلْبَسَ مِنَ الثِّيَابِ فِي الإِحْرَامِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَلْبَسُوا الْقَمِيصَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْعَمَائِمَ، وَلاَ الْبَرَانِسَ إِلاَّ أَنْ يَكُونَ أَحَدٌ لَيْسَتْ لَهُ نَعْلاَنِ، فَلْيَلْبَسِ الْخُفَّيْنِ، وَلْيَقْطَعْ أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا شَيْئًا مَسَّهُ زَعْفَرَانٌ، وَلاَ الْوَرْسُ، وَلاَ تَنْتَقِبِ الْمَرْأَةُ الْمُحْرِمَةُ وَلاَ تَلْبَسِ الْقُفَّازَيْنِ ‏\"‏‏.‏ تَابَعَهُ مُوسَى بْنُ عُقْبَةَ وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ وَجُوَيْرِيَةُ وَابْنُ إِسْحَاقَ فِي النِّقَابِ وَالْقُفَّازَيْنِ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ وَلاَ وَرْسٌ وَكَانَ يَقُولُ لاَ تَتَنَقَّبِ الْمُحْرِمَةُ، وَلاَ تَلْبَسِ الْقُفَّازَيْنِ‏.‏ وَقَالَ مَالِكٌ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ لاَ تَتَنَقَّبِ الْمُحْرِمَةُ‏.‏ وَتَابَعَهُ لَيْثُ بْنُ أَبِي سُلَيْمٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1838In-book reference : Book 28, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 64   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1839,
    "id": 1839,
    "url": "https://sunnah.com/bukhari:1839",
    "bookNumber": 28,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man was crushed to death by his she-camel and was brought to Allah's Messenger (ﷺ) who said, \"Give him \na bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will \nbe resurrected reciting Talbiya.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ وَقَصَتْ بِرَجُلٍ مُحْرِمٍ نَاقَتُهُ، فَقَتَلَتْهُ، فَأُتِيَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اغْسِلُوهُ، وَكَفِّنُوهُ، وَلاَ تُغَطُّوا رَأْسَهُ، وَلاَ تُقَرِّبُوهُ طِيبًا، فَإِنَّهُ يُبْعَثُ يُهِلُّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1839In-book reference : Book 28, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 65   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1840,
    "id": 1840,
    "url": "https://sunnah.com/bukhari:1840",
    "bookNumber": 28,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah bin Hunain:",
    "english": "`Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a \nMuhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin \n`Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of \nthe well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I \nam `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Messenger (ﷺ) \nused to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of \ncloth and lowered it till his head appeared before me, and then told somebody to pour water on his \nhead. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing \nthem from back to front and from front to back and said, \"I saw the Prophet (ﷺ) doing like this.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ الْعَبَّاسِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، اخْتَلَفَا بِالأَبْوَاءِ، فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ‏.‏ وَقَالَ الْمِسْوَرُ لاَ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ‏.‏ فَأَرْسَلَنِي عَبْدُ اللَّهِ بْنُ الْعَبَّاسِ إِلَى أَبِي أَيُّوبَ الأَنْصَارِيِّ، فَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ، وَهُوَ يُسْتَرُ بِثَوْبٍ، فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا عَبْدُ اللَّهِ بْنُ حُنَيْنٍ، أَرْسَلَنِي إِلَيْكَ عَبْدُ اللَّهِ بْنُ الْعَبَّاسِ، أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْسِلُ رَأْسَهُ، وَهُوَ مُحْرِمٌ، فَوَضَعَ أَبُو أَيُّوبَ يَدَهُ عَلَى الثَّوْبِ، فَطَأْطَأَهُ حَتَّى بَدَا لِي رَأْسُهُ ثُمَّ قَالَ لإِنْسَانٍ يَصُبُّ عَلَيْهِ اصْبُبْ‏.‏ فَصَبَّ عَلَى رَأْسِهِ، ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ وَقَالَ هَكَذَا رَأَيْتُهُ صلى الله عليه وسلم يَفْعَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1840In-book reference : Book 28, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1841,
    "id": 1841,
    "url": "https://sunnah.com/bukhari:1841",
    "bookNumber": 28,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I heard the Prophet (ﷺ) delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he \ncould wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below \nthe ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he \ncould wear trousers.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، سَمِعْتُ جَابِرَ بْنَ زَيْدٍ، سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ بِعَرَفَاتٍ ‏\n\"‏ مَنْ لَمْ يَجِدِ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ، وَمَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ ‏\"‏‏.‏ لِلْمُحْرِمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1841In-book reference : Book 28, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1842,
    "id": 1842,
    "url": "https://sunnah.com/bukhari:1842",
    "bookNumber": 28,
    "hadithNumber": 22,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) was asked what sort of clothes a Muhrim should wear. He replied, \"He should not \nwear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if \nslippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should \ncut them so that they reach below the ankles.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ ‏\n\"‏ لاَ يَلْبَسِ الْقَمِيصَ، وَلاَ الْعَمَائِمَ، وَلاَ السَّرَاوِيلاَتِ، وَلاَ الْبُرْنُسَ، وَلاَ ثَوْبًا مَسَّهُ زَعْفَرَانٌ وَلاَ وَرْسٌ، وَإِنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ، وَلْيَقْطَعْهُمَا حَتَّى يَكُونَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1842In-book reference : Book 28, Hadith 22USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 68   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1843,
    "id": 1843,
    "url": "https://sunnah.com/bukhari:1843",
    "bookNumber": 28,
    "hadithNumber": 23,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, \nand whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم بِعَرَفَاتٍ فَقَالَ ‏\n\"‏ مَنْ لَمْ يَجِدِ الإِزَارَ فَلْيَلْبَسِ السَّرَاوِيلَ، وَمَنْ لَمْ يَجِدِ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1843In-book reference : Book 28, Hadith 23USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1844,
    "id": 1844,
    "url": "https://sunnah.com/bukhari:1844",
    "bookNumber": 28,
    "hadithNumber": 24,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca \nrefused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca \nany arms but sheathed.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ يَدْخُلُ مَكَّةَ، حَتَّى قَاضَاهُمْ لاَ يُدْخِلُ مَكَّةَ سِلاَحًا إِلاَّ فِي الْقِرَابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1844In-book reference : Book 28, Hadith 24USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1845,
    "id": 1845,
    "url": "https://sunnah.com/bukhari:1845",
    "bookNumber": 28,
    "hadithNumber": 25,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, \nand Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit \nare for those people and also for those who come through these Mawaqit (from places other than the \nabove-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these \nMawaqit can assume Ihram from the place where they start; even the people of Mecca can assume \nIhram from Mecca.",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم وَقَّتَ لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ، هُنَّ لَهُنَّ وَلِكُلِّ آتٍ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِمْ مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ، فَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ، حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1845In-book reference : Book 28, Hadith 25USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 71   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1846,
    "id": 1846,
    "url": "https://sunnah.com/bukhari:1846",
    "bookNumber": 28,
    "hadithNumber": 26,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) entered Mecca in the year of its Conquest wearing an Arabian helmet on his head and \nwhen the Prophet (ﷺ) took it off, a person came and said, \"Ibn Khatal is holding the covering of the Ka`ba \n(taking refuge in the Ka`ba).\" The Prophet (ﷺ) said, \"Kill him.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ، وَعَلَى رَأْسِهِ الْمِغْفَرُ، فَلَمَّا نَزَعَهُ جَاءَ رَجُلٌ، فَقَالَ إِنَّ ابْنَ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ‏.‏ فَقَالَ ‏\n\"‏ اقْتُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1846In-book reference : Book 28, Hadith 26USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1847,
    "id": 1847,
    "url": "https://sunnah.com/bukhari:1847",
    "bookNumber": 28,
    "hadithNumber": 27,
    "narrator": "Narrated Ya'li:",
    "english": "While I was with Allah's Messenger (ﷺ) there came to him a man wearing a cloak having a trace of yellowish \nperfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet (ﷺ) at the \ntime when he is inspired divinely?\" So, it happened that he was inspired (then) and when the \ninspiration was over the Prophet (ﷺ) said (to that man), \"Do in your `Umra the same as you do in your \nHajj.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ يَعْلَى، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَاهُ رَجُلٌ عَلَيْهِ جُبَّةٌ فِيهِ أَثَرُ صُفْرَةٍ أَوْ نَحْوُهُ، وَكَانَ عُمَرُ يَقُولُ لِي تُحِبُّ إِذَا نَزَلَ عَلَيْهِ الْوَحْىُ أَنْ تَرَاهُ فَنَزَلَ عَلَيْهِ ثُمَّ سُرِّيَ عَنْهُ فَقَالَ ‏\n\"‏ اصْنَعْ فِي عُمْرَتِكَ مَا تَصْنَعُ فِي حَجِّكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1847In-book reference : Book 28, Hadith 27USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1848,
    "id": 1848,
    "url": "https://sunnah.com/bukhari:1848",
    "bookNumber": 28,
    "hadithNumber": 28,
    "narrator": "",
    "english": "A man bit the hand of another man but in that process the latter broke one incisor tooth of the former, and the Prophet (ﷺ) forgave the latter.",
    "arabic": "وَعَضَّ رَجُلٌ يَدَ رَجُلٍ ـ يَعْنِي فَانْتَزَعَ ثَنِيَّتَهُ ـ فَأَبْطَلَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1848In-book reference : Book 28, Hadith 28USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1849,
    "id": 1849,
    "url": "https://sunnah.com/bukhari:1849",
    "bookNumber": 28,
    "hadithNumber": 29,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَيْنَا رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ إِذْ وَقَعَ عَنْ رَاحِلَتِهِ، فَوَقَصَتْهُ ـ أَوْ قَالَ فَأَقْعَصَتْهُ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ ـ أَوْ قَالَ ثَوْبَيْهِ ـ وَلاَ تُحَنِّطُوهُ، وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ يُلَبِّي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1849In-book reference : Book 28, Hadith 29USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 74   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1850,
    "id": 1850,
    "url": "https://sunnah.com/bukhari:1850",
    "bookNumber": 28,
    "hadithNumber": 30,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَيْنَا رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ إِذْ وَقَعَ عَنْ رَاحِلَتِهِ فَوَقَصَتْهُ ـ أَوْ قَالَ فَأَوْقَصَتْهُ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تَمَسُّوهُ طِيبًا، وَلاَ تُخَمِّرُوا رَأْسَهُ، وَلاَ تُحَنِّطُوهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1850In-book reference : Book 28, Hadith 30USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 75   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1851,
    "id": 1851,
    "url": "https://sunnah.com/bukhari:1851",
    "bookNumber": 28,
    "hadithNumber": 31,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man was in the company of the Prophet (ﷺ) and his she-camel crushed his neck while he was in a state \nof Ihram and he died Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in his two \ngarments; neither perfume him nor cover his head, for he will be resurrected on the Day of \nResurrection, reciting Talbiya.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَوَقَصَتْهُ نَاقَتُهُ، وَهُوَ مُحْرِمٌ، فَمَاتَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْهِ، وَلاَ تَمَسُّوهُ بِطِيبٍ، وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1851In-book reference : Book 28, Hadith 31USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 76   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1852,
    "id": 1852,
    "url": "https://sunnah.com/bukhari:1852",
    "bookNumber": 28,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A woman from the tribe of Juhaina came to the Prophet (ﷺ) and said, \"My mother had vowed to perform \nHajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet (ﷺ) \nreplied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or \nnot? So, pay Allah's debt as He has more right to be paid.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً، مِنْ جُهَيْنَةَ جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنَّ أُمِّي نَذَرَتْ أَنْ تَحُجَّ، فَلَمْ تَحُجَّ حَتَّى مَاتَتْ أَفَأَحُجُّ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ‏.‏ حُجِّي عَنْهَا، أَرَأَيْتِ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ أَكُنْتِ قَاضِيَةً اقْضُوا اللَّهَ، فَاللَّهُ أَحَقُّ بِالْوَفَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1852In-book reference : Book 28, Hadith 32USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 77   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1853,
    "id": 1853,
    "url": "https://sunnah.com/bukhari:1853",
    "bookNumber": 28,
    "hadithNumber": 33,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet (ﷺ) ) and said, \n\"O Allah's Messenger (ﷺ)! My father has come under Allah's obligation of performing Hajj but he is a very \nold man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his \nbehalf?\" The Prophet (ﷺ) replied in the affirmative.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ ـ رضى الله عنهم ـ أَنَّ امْرَأَةً، ح‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1853In-book reference : Book 28, Hadith 33USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1854,
    "id": 1854,
    "url": "https://sunnah.com/bukhari:1854",
    "bookNumber": 28,
    "hadithNumber": 34,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Al-Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al-Fadl \nstarted looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She \nsaid, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and \ncannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet (ﷺ) replied in the \naffirmative. That happened during Hajjat-al-Wada` of the Prophet (ﷺ) .",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ جَاءَتِ امْرَأَةٌ مِنْ خَثْعَمَ، عَامَ حَجَّةِ الْوَدَاعِ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ فَهَلْ يَقْضِي عَنْهُ أَنْ أَحُجَّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1854In-book reference : Book 28, Hadith 34USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 79   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1855,
    "id": 1855,
    "url": "https://sunnah.com/bukhari:1855",
    "bookNumber": 28,
    "hadithNumber": 35,
    "narrator": "Narrated 'Abdullah bin 'Abbas (ra):",
    "english": "Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْفَضْلُ رَدِيفَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَتِ امْرَأَةٌ مِنْ خَثْعَمٍ، فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا، وَتَنْظُرُ إِلَيْهِ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ، فَقَالَتْ إِنَّ فَرِيضَةَ اللَّهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَثْبُتُ عَلَى الرَّاحِلَةِ، أَفَأَحُجُّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1855In-book reference : Book 28, Hadith 35USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1856,
    "id": 1856,
    "url": "https://sunnah.com/bukhari:1856",
    "bookNumber": 28,
    "hadithNumber": 36,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ بَعَثَنِي ـ أَوْ قَدَّمَنِي ـ النَّبِيُّ صلى الله عليه وسلم فِي الثَّقَلِ مِنْ جَمْعٍ بِلَيْلٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1856In-book reference : Book 28, Hadith 36USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1857,
    "id": 1857,
    "url": "https://sunnah.com/bukhari:1857",
    "bookNumber": 28,
    "hadithNumber": 37,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was \npraying at Mina. I passed in front of a part of the first row and then dismounted from it, and the \nanimal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that \nhappened in Mina during the Prophet's Hajjat-al-Wada`.)",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَقْبَلْتُ وَقَدْ نَاهَزْتُ الْحُلُمَ، أَسِيرُ عَلَى أَتَانٍ لِي، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يُصَلِّي بِمِنًى، حَتَّى سِرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ الأَوَّلِ، ثُمَّ نَزَلْتُ عَنْهَا فَرَتَعَتْ، فَصَفَفْتُ مَعَ النَّاسِ وَرَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ يُونُسُ عَنِ ابْنِ شِهَابٍ بِمِنًى فِي حَجَّةِ الْوَدَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1857In-book reference : Book 28, Hadith 37USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1858,
    "id": 1858,
    "url": "https://sunnah.com/bukhari:1858",
    "bookNumber": 28,
    "hadithNumber": 38,
    "narrator": "Narrated As-Sa'ib bin Yazid:",
    "english": "(While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a \nseven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يُونُسَ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ حُجَّ بِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا ابْنُ سَبْعِ سِنِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1858In-book reference : Book 28, Hadith 38USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 82   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1859,
    "id": 1859,
    "url": "https://sunnah.com/bukhari:1859",
    "bookNumber": 28,
    "hadithNumber": 39,
    "narrator": "Narrated Al-Ju'aid bin `Abdur-Rahman:",
    "english": "I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while \ncarried) with the belongings of the Prophet.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا الْقَاسِمُ بْنُ مَالِكٍ، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَقُولُ لِلسَّائِبِ بْنِ يَزِيدَ، وَكَانَ قَدْ حُجَّ بِهِ فِي ثَقَلِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1859In-book reference : Book 28, Hadith 39USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 83   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1860,
    "id": 1860,
    "url": "https://sunnah.com/bukhari:1860",
    "bookNumber": 28,
    "hadithNumber": 40,
    "narrator": "",
    "english": "Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.",
    "arabic": "وَقَالَ لِي أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَذِنَ عُمَرُ ـ رضى الله عنه ـ لأَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فِي آخِرِ حَجَّةٍ حَجَّهَا، فَبَعَثَ مَعَهُنَّ عُثْمَانَ بْنَ عَفَّانَ وَعَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1860In-book reference : Book 28, Hadith 40USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1861,
    "id": 1861,
    "url": "https://sunnah.com/bukhari:1861",
    "bookNumber": 28,
    "hadithNumber": 41,
    "narrator": "Narrated Aisha (mother of the faithful believers):",
    "english": "I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He \nreplied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" \n`Aisha added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي عَمْرَةَ، قَالَ حَدَّثَتْنَا عَائِشَةُ بِنْتُ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلاَ نَغْزُوا وَنُجَاهِدُ مَعَكُمْ فَقَالَ ‏\n\"‏ لَكُنَّ أَحْسَنُ الْجِهَادِ وَأَجْمَلُهُ الْحَجُّ، حَجٌّ مَبْرُورٌ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ فَلاَ أَدَعُ الْحَجَّ بَعْدَ إِذْ سَمِعْتُ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1861In-book reference : Book 28, Hadith 41USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1862,
    "id": 1862,
    "url": "https://sunnah.com/bukhari:1862",
    "bookNumber": 28,
    "hadithNumber": 42,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with \nwhom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit \nher except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to \ngo to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go \nalong with her (to Hajj).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُسَافِرِ الْمَرْأَةُ إِلاَّ مَعَ ذِي مَحْرَمٍ، وَلاَ يَدْخُلُ عَلَيْهَا رَجُلٌ إِلاَّ وَمَعَهَا مَحْرَمٌ ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَخْرُجَ فِي جَيْشِ كَذَا وَكَذَا، وَامْرَأَتِي تُرِيدُ الْحَجَّ‏.‏ فَقَالَ ‏\"‏ اخْرُجْ مَعَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1862In-book reference : Book 28, Hadith 42USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 85   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1863,
    "id": 1863,
    "url": "https://sunnah.com/bukhari:1863",
    "bookNumber": 28,
    "hadithNumber": 43,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid \nyou to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he \nperformed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said \n(to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in \nreward).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا رَجَعَ النَّبِيُّ صلى الله عليه وسلم مِنْ حَجَّتِهِ قَالَ لأُمِّ سِنَانٍ الأَنْصَارِيَّةِ ‏\"‏ مَا مَنَعَكِ مِنَ الْحَجِّ ‏\"‏‏.‏ قَالَتْ أَبُو فُلاَنٍ ـ تَعْنِي زَوْجَهَا ـ كَانَ لَهُ نَاضِحَانِ، حَجَّ عَلَى أَحَدِهِمَا، وَالآخَرُ يَسْقِي أَرْضًا لَنَا‏.‏ قَالَ ‏\"‏ فَإِنَّ عُمْرَةً فِي رَمَضَانَ تَقْضِي حَجَّةً مَعِي ‏\"‏‏.‏ رَوَاهُ ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ سَمِعْتُ ابْنَ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1863In-book reference : Book 28, Hadith 43USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 86   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1864,
    "id": 1864,
    "url": "https://sunnah.com/bukhari:1864",
    "bookNumber": 28,
    "hadithNumber": 44,
    "narrator": "Narrated Qaza'a the slave of Ziyad:",
    "english": "Abu Sa`id who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from \nAllah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. \nThey are: \n-1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. \n-2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. \n-3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the \nmorning prayer till the sun rises. \n-4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in \nMedina), and Masjid-al-Aqsa (in Jerusalem).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ قَزَعَةَ، مَوْلَى زِيَادٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ ـ وَقَدْ غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ ـ غَزْوَةً ـ قَالَ أَرْبَعٌ سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ قَالَ يُحَدِّثُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم ـ فَأَعْجَبْنَنِي وَآنَقْنَنِي ‏\n\"‏ أَنْ لاَ تُسَافِرَ امْرَأَةٌ مَسِيرَةَ يَوْمَيْنِ لَيْسَ مَعَهَا زَوْجُهَا أَوْ ذُو مَحْرَمٍ، وَلاَ صَوْمَ يَوْمَيْنِ الْفِطْرِ وَالأَضْحَى، وَلاَ صَلاَةَ بَعْدَ صَلاَتَيْنِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ، وَبَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ، وَلاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ، وَمَسْجِدِي، وَمَسْجِدِ الأَقْصَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1864In-book reference : Book 28, Hadith 44USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 87   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1865,
    "id": 1865,
    "url": "https://sunnah.com/bukhari:1865",
    "bookNumber": 28,
    "hadithNumber": 45,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people \ninformed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old \nman's torturing himself,\" and ordered him to ride.",
    "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، قَالَ حَدَّثَنِي ثَابِتٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى شَيْخًا يُهَادَى بَيْنَ ابْنَيْهِ قَالَ ‏\"‏ مَا بَالُ هَذَا ‏\"‏‏.‏ قَالُوا نَذَرَ أَنْ يَمْشِيَ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ لَغَنِيٌّ ‏\"‏‏.‏ وَأَمَرَهُ أَنْ يَرْكَبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1865In-book reference : Book 28, Hadith 45USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 88   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1866,
    "id": 1866,
    "url": "https://sunnah.com/bukhari:1866",
    "bookNumber": 28,
    "hadithNumber": 46,
    "narrator": "Narrated `Uqba bin 'Amir:",
    "english": "My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about \nit. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\"\nNarrated Abul-Khair from `Uqba as above.:",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ، أَخْبَرَهُ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ، إِلَى بَيْتِ اللَّهِ، وَأَمَرَتْنِي أَنْ أَسْتَفْتِيَ لَهَا النَّبِيَّ صلى الله عليه وسلم فَاسْتَفْتَيْتُهُ، فَقَالَ عَلَيْهِ السَّلاَمُ ‏\n\"‏ لِتَمْشِ وَلْتَرْكَبْ ‏\"‏‏.‏ قَالَ وَكَانَ أَبُو الْخَيْرِ لاَ يُفَارِقُ عُقْبَةَ‏.‏\nقَالَ أَبُو عَبْد اللَّهِ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَزِيدَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ فَذَكَرَ الْحَدِيثَ",
    "reference": "Reference : Sahih al-Bukhari 1866In-book reference : Book 28, Hadith 46USC-MSA web (English) reference : Vol. 3, Book 29, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1867,
    "id": 1867,
    "url": "https://sunnah.com/bukhari:1867",
    "bookNumber": 29,
    "hadithNumber": 1,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no \nheresy should be innovated nor any sin should be committed in it, and whoever innovates in it an \nheresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the \npeople.\" (See Hadith No. 409, Vol 9).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ أَبُو عَبْدِ الرَّحْمَنِ الأَحْوَلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَدِينَةُ حَرَمٌ، مِنْ كَذَا إِلَى كَذَا، لاَ يُقْطَعُ شَجَرُهَا، وَلاَ يُحْدَثُ فِيهَا حَدَثٌ، مَنْ أَحْدَثَ حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1867In-book reference : Book 29, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 91   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1868,
    "id": 1868,
    "url": "https://sunnah.com/bukhari:1868",
    "bookNumber": 29,
    "hadithNumber": 2,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to \nme the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished \nfor a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the \npagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms \nwere fixed in the direction of the Qibla of the mosque.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ فَأَمَرَ بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏\n\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي ‏\"‏‏.‏ فَقَالُوا لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏ فَأَمَرَ بِقُبُورِ الْمُشْرِكِينَ، فَنُبِشَتْ، ثُمَّ بِالْخِرَبِ فَسُوِّيَتْ، وَبِالنَّخْلِ فَقُطِعَ، فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1868In-book reference : Book 29, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 92   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1869,
    "id": 1869,
    "url": "https://sunnah.com/bukhari:1869",
    "bookNumber": 29,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) \nwent to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" \nbut looking around, he added, \"No, you are inside the sanctuary.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ حُرِّمَ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ عَلَى لِسَانِي ‏\"‏‏.‏ قَالَ وَأَتَى النَّبِيُّ صلى الله عليه وسلم بَنِي حَارِثَةَ فَقَالَ ‏\"‏ أَرَاكُمْ يَا بَنِي حَارِثَةَ قَدْ خَرَجْتُمْ مِنَ الْحَرَمِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ، فَقَالَ ‏\"‏ بَلْ أَنْتُمْ فِيهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1869In-book reference : Book 29, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 93   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1870,
    "id": 1870,
    "url": "https://sunnah.com/bukhari:1870",
    "bookNumber": 29,
    "hadithNumber": 4,
    "narrator": "Narrated `Ali:",
    "english": "We have nothing except the Book of Allah and this written paper from the Prophet (wherein is \nwritten:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever \ninnovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the \ncurse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of \nworship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured \n(respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of \nAllah, the angels, and all the people, and none of his compulsory or optional good deeds of worship \nwill be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters \nwithout their permission incurs the curse of Allah, the angels, and all the people, and none of his \ncompulsory or optional good deeds of worship will be accepted.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ مَا عِنْدَنَا شَىْءٌ إِلاَّ كِتَابُ اللَّهِ، وَهَذِهِ الصَّحِيفَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ الْمَدِينَةُ حَرَمٌ، مَا بَيْنَ عَائِرٍ إِلَى كَذَا، مَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏ وَقَالَ ‏\"‏ ذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1870In-book reference : Book 29, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 94   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1871,
    "id": 1871,
    "url": "https://sunnah.com/bukhari:1871",
    "bookNumber": 29,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns \nand is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the \nimpurities of iron.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏\n\"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ‏.‏ وَهْىَ الْمَدِينَةُ، تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1871In-book reference : Book 29, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1872,
    "id": 1872,
    "url": "https://sunnah.com/bukhari:1872",
    "bookNumber": 29,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Humaid:",
    "english": "We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is \nTabah.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِي حُمَيْدٍ ـ رضى الله عنه ـ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ تَبُوكَ حَتَّى أَشْرَفْنَا عَلَى الْمَدِينَةِ فَقَالَ ‏\n\"‏ هَذِهِ طَابَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1872In-book reference : Book 29, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 96   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1873,
    "id": 1873,
    "url": "https://sunnah.com/bukhari:1873",
    "bookNumber": 29,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a \nsanctuary between its two mountains.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَا، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1873In-book reference : Book 29, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1874,
    "id": 1874,
    "url": "https://sunnah.com/bukhari:1874",
    "bookNumber": 29,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, \nand none except the wild birds and the beasts of prey will live in it, and the last persons who will die \nwill be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but \nwill find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on \ntheir faces dead.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَتْرُكُونَ الْمَدِينَةَ عَلَى خَيْرِ مَا كَانَتْ، لاَ يَغْشَاهَا إِلاَّ الْعَوَافِ ـ يُرِيدُ عَوَافِيَ السِّبَاعِ وَالطَّيْرِ ـ وَآخِرُ مَنْ يُحْشَرُ رَاعِيَانِ مِنْ مُزَيْنَةَ، يُرِيدَانِ الْمَدِينَةَ يَنْعِقَانِ بِغَنَمِهِمَا، فَيَجِدَانِهَا وَحْشًا، حَتَّى إِذَا بَلَغَا ثَنِيَّةَ الْوَدَاعِ خَرَّا عَلَى وُجُوهِهِمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1874In-book reference : Book 29, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1875,
    "id": 1875,
    "url": "https://sunnah.com/bukhari:1875",
    "bookNumber": 29,
    "hadithNumber": 9,
    "narrator": "Narrated Sufyan b. Abu Zuhair:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from \nMedina) and will urge their families, and those who will obey them to migrate (to Yemen) although \nMedina will be better for them; if they but knew. Sham will also be conquered and some people will \nmigrate (from Medina) and will urge their families and those who will obey them, to migrate (to \nSham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some \npeople will migrate (from Medina) and will urge their families and those who will obey them to \nmigrate (to 'Iraq) although Medina will be better for them; if they but knew.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يُبِسُّونَ، فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الشَّأْمُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الْعِرَاقُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ‏.‏ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1875In-book reference : Book 29, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 99   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1876,
    "id": 1876,
    "url": "https://sunnah.com/bukhari:1876",
    "bookNumber": 29,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back \nto its hole (when in danger).",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1876In-book reference : Book 29, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 100   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1877,
    "id": 1877,
    "url": "https://sunnah.com/bukhari:1877",
    "bookNumber": 29,
    "hadithNumber": 11,
    "narrator": "Narrated Sa`d:",
    "english": "I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved \n(destroyed) like the salt is dissolved in water.\"",
    "arabic": "حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، أَخْبَرَنَا الْفَضْلُ، عَنْ جُعَيْدٍ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ سَعْدًا ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَكِيدُ أَهْلَ الْمَدِينَةِ أَحَدٌ إِلاَّ انْمَاعَ كَمَا يَنْمَاعُ الْمِلْحُ فِي الْمَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1877In-book reference : Book 29, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 101   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1878,
    "id": 1878,
    "url": "https://sunnah.com/bukhari:1878",
    "bookNumber": 29,
    "hadithNumber": 12,
    "narrator": "Narrated Usama:",
    "english": "Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the \nhigh buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where \nafflictions will take place among your houses (and these afflictions will be) as numerous as the spots \nwhere raindrops fall.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، سَمِعْتُ أُسَامَةَ ـ رضى الله عنه ـ قَالَ أَشْرَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ ‏\n\"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي لأَرَى مَوَاقِعَ الْفِتَنِ خِلاَلَ بُيُوتِكُمْ كَمَوَاقِعِ الْقَطْرِ ‏\"‏‏.‏ تَابَعَهُ مَعْمَرٌ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1878In-book reference : Book 29, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 102   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1879,
    "id": 1879,
    "url": "https://sunnah.com/bukhari:1879",
    "bookNumber": 29,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate guarding them.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ، لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ، عَلَى كُلِّ باب مَلَكَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1879In-book reference : Book 29, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1880,
    "id": 1880,
    "url": "https://sunnah.com/bukhari:1880",
    "bookNumber": 29,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague \nnor Ad-Dajjal will be able to enter it.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏\n\"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ، لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1880In-book reference : Book 29, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 104   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1881,
    "id": 1881,
    "url": "https://sunnah.com/bukhari:1881",
    "bookNumber": 29,
    "hadithNumber": 15,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, \nand there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in \nrows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three \nearthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو، حَدَّثَنَا إِسْحَاقُ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ مِنْ بَلَدٍ إِلاَّ سَيَطَؤُهُ الدَّجَّالُ، إِلاَّ مَكَّةَ وَالْمَدِينَةَ، لَيْسَ لَهُ مِنْ نِقَابِهَا نَقْبٌ إِلاَّ عَلَيْهِ الْمَلاَئِكَةُ صَافِّينَ، يَحْرُسُونَهَا، ثُمَّ تَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلاَثَ رَجَفَاتٍ، فَيُخْرِجُ اللَّهُ كُلَّ كَافِرٍ وَمُنَافِقٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1881In-book reference : Book 29, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1882,
    "id": 1882,
    "url": "https://sunnah.com/bukhari:1882",
    "bookNumber": 29,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, \nwas his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of \nMedina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or \none of the best men will come up to him and say, 'I testify that you are the same Dajjal whose \ndescription was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man \nand bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will \nkill that man and bring him back to life. That man will say, 'Now I know your reality better than \nbefore.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثًا طَوِيلاً عَنِ الدَّجَّالِ، فَكَانَ فِيمَا حَدَّثَنَا بِهِ أَنْ قَالَ ‏\n\"‏ يَأْتِي الدَّجَّالُ ـ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ ـ بَعْضَ السِّبَاخِ الَّتِي بِالْمَدِينَةِ، فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ، هُوَ خَيْرُ النَّاسِ ـ أَوْ مِنْ خَيْرِ النَّاسِ ـ فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ، الَّذِي حَدَّثَنَا عَنْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَهُ، فَيَقُولُ الدَّجَّالُ أَرَأَيْتَ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ، هَلْ تَشُكُّونَ فِي الأَمْرِ فَيَقُولُونَ لاَ‏.‏ فَيَقْتُلُهُ، ثُمَّ يُحْيِيهِ فَيَقُولُ حِينَ يُحْيِيهِ وَاللَّهِ مَا كُنْتُ قَطُّ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ، فَيَقُولُ الدَّجَّالُ أَقْتُلُهُ فَلاَ أُسَلَّطُ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1882In-book reference : Book 29, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 106   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1883,
    "id": 1883,
    "url": "https://sunnah.com/bukhari:1883",
    "bookNumber": 29,
    "hadithNumber": 17,
    "narrator": "Narrated Jabir:",
    "english": "A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he \ncame with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of \nemigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a \nfurnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ جَاءَ أَعْرَابِيٌّ النَّبِيَّ صلى الله عليه وسلم فَبَايَعَهُ عَلَى الإِسْلاَمِ، فَجَاءَ مِنَ الْغَدِ مَحْمُومًا، فَقَالَ أَقِلْنِي، فَأَبَى ثَلاَثَ مِرَارٍ، فَقَالَ ‏\n\"‏ الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طَيِّبُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1883In-book reference : Book 29, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1884,
    "id": 1884,
    "url": "https://sunnah.com/bukhari:1884",
    "bookNumber": 29,
    "hadithNumber": 18,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned \n(home). A party of the believers remarked that they would kill those (hypocrites) who had returned, \nbut another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then \nwhat is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) \nThe Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ سَمِعْتُ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ يَقُولُ لَمَّا خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى أُحُدٍ رَجَعَ نَاسٌ مِنْ أَصْحَابِهِ فَقَالَتْ فِرْقَةٌ نَقْتُلُهُمْ‏.‏ وَقَالَتْ فِرْقَةٌ لاَ نَقْتُلُهُمْ‏.‏ فَنَزَلَتْ ‏{‏فَمَا لَكُمْ فِي الْمُنَافِقِينِ فِئَتَيْنِ‏}‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا تَنْفِي الرِّجَالَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1884In-book reference : Book 29, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 108   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1885,
    "id": 1885,
    "url": "https://sunnah.com/bukhari:1885",
    "bookNumber": 29,
    "hadithNumber": 19,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعْفَىْ مَا جَعَلْتَ بِمَكَّةَ مِنَ الْبَرَكَةِ ‏\"‏‏.‏ تَابَعَهُ عُثْمَانُ بْنُ عُمَرَ عَنْ يُونُسَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1885In-book reference : Book 29, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 109   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1886,
    "id": 1886,
    "url": "https://sunnah.com/bukhari:1886",
    "bookNumber": 29,
    "hadithNumber": 20,
    "narrator": "Narrated Anas:",
    "english": "Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his \nMount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love \nfor Medina.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ، فَنَظَرَ إِلَى جُدُرَاتِ الْمَدِينَةِ أَوْضَعَ رَاحِلَتَهُ، وَإِنْ كَانَ عَلَى دَابَّةٍ، حَرَّكَهَا مِنْ حُبِّهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1886In-book reference : Book 29, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 110   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1887,
    "id": 1887,
    "url": "https://sunnah.com/bukhari:1887",
    "bookNumber": 29,
    "hadithNumber": 21,
    "narrator": "Narrated Anas:",
    "english": "(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) \ndisliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will \nbe rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old \nplaces.",
    "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَرَادَ بَنُو سَلِمَةَ أَنْ يَتَحَوَّلُوا، إِلَى قُرْبِ الْمَسْجِدِ، فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُعْرَى الْمَدِينَةُ، وَقَالَ ‏\n\"‏ يَا بَنِي سَلِمَةَ‏.‏ أَلاَ تَحْتَسِبُونَ آثَارَكُمْ ‏\"‏‏.‏ فَأَقَامُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1887In-book reference : Book 29, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 111   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1888,
    "id": 1888,
    "url": "https://sunnah.com/bukhari:1888",
    "bookNumber": 29,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, \nand my pulpit is on my Lake Fount (Al-Kauthar).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1888In-book reference : Book 29, Hadith 22USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1889,
    "id": 1889,
    "url": "https://sunnah.com/bukhari:1889",
    "bookNumber": 29,
    "hadithNumber": 23,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got \nworse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is \nnearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that \nI could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling \ngrass). Would that one day I could Drink the water of the Majanna, and Would that (The two \nmountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin \nRabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of \nepidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even \nmore than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and \nmake the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When \nwe reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of \nMedina) used to flow with impure colored water.",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ، فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ الْحُمَّى يَرْفَعُ عَقِيرَتَهُ يَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ اللَّهُمَّ الْعَنْ شَيْبَةَ بْنَ رَبِيعَةَ، وَعُتْبَةَ بْنَ رَبِيعَةَ، وَأُمَيَّةَ بْنَ خَلَفٍ، كَمَا أَخْرَجُونَا مِنْ أَرْضِنَا إِلَى أَرْضِ الْوَبَاءِ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا، وَفِي مُدِّنَا، وَصَحِّحْهَا لَنَا وَانْقُلْ حُمَّاهَا إِلَى الْجُحْفَةِ ‏\"‏‏.‏ قَالَتْ وَقَدِمْنَا الْمَدِينَةَ، وَهْىَ أَوْبَأُ أَرْضِ اللَّهِ‏.‏ قَالَتْ فَكَانَ بُطْحَانُ يَجْرِي نَجْلاً‏.‏ تَعْنِي مَاءً آجِنًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1889In-book reference : Book 29, Hadith 23USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 113   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1890,
    "id": 1890,
    "url": "https://sunnah.com/bukhari:1890",
    "bookNumber": 29,
    "hadithNumber": 24,
    "narrator": "Narrated Zaid bin Aslam from his father:",
    "english": "`Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your \nApostle.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ اللَّهُمَّ ارْزُقْنِي شَهَادَةً فِي سَبِيلِكَ، وَاجْعَلْ مَوْتِي فِي بَلَدِ رَسُولِكَ صلى الله عليه وسلم‏.‏ وَقَالَ ابْنُ زُرَيْعٍ عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أُمِّهِ، عَنْ حَفْصَةَ بِنْتِ عُمَرَ ـ رضى الله عنهما ـ قَالَتْ سَمِعْتُ عُمَرَ، نَحْوَهُ‏.‏ وَقَالَ هِشَامٌ عَنْ زَيْدٍ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، سَمِعْتُ عُمَرَ، رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1890In-book reference : Book 29, Hadith 24USC-MSA web (English) reference : Vol. 3, Book 30, Hadith 114   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1891,
    "id": 1891,
    "url": "https://sunnah.com/bukhari:1891",
    "bookNumber": 30,
    "hadithNumber": 1,
    "narrator": "Narrated Talha bin 'Ubaidullah:",
    "english": "A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Inform me what \nAllah has made compulsory for me as regards the prayers.\" He replied: \"You have to offer perfectly \nthe five compulsory prayers in a day and night (24 hours), unless you want to pray Nawafil.\" The \nbedouin further asked, \"Inform me what Allah has made compulsory for me as regards fasting.\" He \nreplied, \"You have to fast during the whole month of Ramadan, unless you want to fast more as \nNawafil.\" The bedouin further asked, \"Tell me how much Zakat Allah has enjoined on me.\" Thus, \nAllah's Messenger (ﷺ) informed him about all the rules (i.e. fundamentals) of Islam. The bedouin then said, \n\"By Him Who has honored you, I will neither perform any Nawafil nor will I decrease what Allah has \nenjoined on me. Allah's Messenger (ﷺ) said, \"If he is saying the truth, he will succeed (or he will be granted \nParadise).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّ أَعْرَابِيًّا، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثَائِرَ الرَّأْسِ فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَاذَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصَّلاَةِ فَقَالَ ‏\"‏ الصَّلَوَاتِ الْخَمْسَ، إِلاَّ أَنْ تَطَّوَّعَ شَيْئًا ‏\"‏‏.‏ فَقَالَ أَخْبِرْنِي مَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصِّيَامِ فَقَالَ ‏\"‏ شَهْرَ رَمَضَانَ، إِلاَّ أَنْ تَطَّوَّعَ شَيْئًا ‏\"‏‏.‏ فَقَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الزَّكَاةِ فَقَالَ فَأَخْبَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم شَرَائِعَ الإِسْلاَمِ‏.‏ قَالَ وَالَّذِي أَكْرَمَكَ لاَ أَتَطَوَّعُ شَيْئًا، وَلاَ أَنْقُصُ مِمَّا فَرَضَ اللَّهُ عَلَىَّ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ، أَوْ دَخَلَ الْجَنَّةَ إِنْ صَدَقَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1891In-book reference : Book 30, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 115   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1892,
    "id": 1892,
    "url": "https://sunnah.com/bukhari:1892",
    "bookNumber": 30,
    "hadithNumber": 2,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) observed the fast on the 10th of Muharram ('Ashura), and ordered (Muslims) to fast on \nthat day, but when the fasting of the month of Ramadan was prescribed, the fasting of the 'Ashura' was \nabandoned. `Abdullah did not use to fast on that day unless it coincided with his routine fasting by \nchance.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَامَ النَّبِيُّ صلى الله عليه وسلم عَاشُورَاءَ، وَأَمَرَ بِصِيَامِهِ‏.‏ فَلَمَّا فُرِضَ رَمَضَانُ تُرِكَ‏.‏ وَكَانَ عَبْدُ اللَّهِ لاَ يَصُومُهُ، إِلاَّ أَنْ يُوَافِقَ صَوْمَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1892In-book reference : Book 30, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 116   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1893,
    "id": 1893,
    "url": "https://sunnah.com/bukhari:1893",
    "bookNumber": 30,
    "hadithNumber": 3,
    "narrator": "Narrated `Aisha:",
    "english": "(The tribe of) Quraish used to fast on the day of Ashura' in the Pre-Islamic period, and then Allah's \nApostle ordered (Muslims) to fast on it till the fasting in the month of Ramadan was prescribed; \nwhereupon the Prophet (ﷺ) said, \"He who wants to fast (on 'Ashura') may fast, and he who does not want \nto fast may not fast.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ عِرَاكَ بْنَ مَالِكٍ، حَدَّثَهُ أَنَّ عُرْوَةَ أَخْبَرَهُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ قُرَيْشًا، كَانَتْ تَصُومُ يَوْمَ عَاشُورَاءَ فِي الْجَاهِلِيَّةِ، ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصِيَامِهِ حَتَّى فُرِضَ رَمَضَانُ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ شَاءَ فَلْيَصُمْهُ، وَمَنْ شَاءَ أَفْطَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1893In-book reference : Book 30, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 117   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1894,
    "id": 1894,
    "url": "https://sunnah.com/bukhari:1894",
    "bookNumber": 30,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Fasting is a shield (or a screen or a shelter). So, the person observing fasting \nshould avoid sexual relation with his wife and should not behave foolishly and impudently, and if \nsomebody fights with him or abuses him, he should tell him twice, 'I am fasting.\" The Prophet (ﷺ) added, \n\"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is \nbetter in the sight of Allah than the smell of musk. (Allah says about the fasting person), 'He has left \nhis food, drink and desires for My sake. The fast is for Me. So I will reward (the fasting person) for it \nand the reward of good deeds is multiplied ten times.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الصِّيَامُ جُنَّةٌ، فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ، وَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ‏.‏ مَرَّتَيْنِ، وَالَّذِي نَفْسِي بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ تَعَالَى مِنْ رِيحِ الْمِسْكِ، يَتْرُكُ طَعَامَهُ وَشَرَابَهُ وَشَهْوَتَهُ مِنْ أَجْلِي، الصِّيَامُ لِي، وَأَنَا أَجْزِي بِهِ، وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1894In-book reference : Book 30, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 118   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1895,
    "id": 1895,
    "url": "https://sunnah.com/bukhari:1895",
    "bookNumber": 30,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Wail from Hudhaifa:",
    "english": "`Umar asked the people, \"Who remembers the narration of the Prophet (ﷺ) about the affliction?\" Hudhaifa \nsaid, \"I heard the Prophet (ﷺ) saying, 'The affliction of a person in his property, family and neighbors is \nexpiated by his prayers, fasting, and giving in charity.\" `Umar said, \"I do not ask about that, but I ask \nabout those afflictions which will spread like the waves of the sea.\" Hudhaifa replied, \"There is a \nclosed gate in front of those afflictions.\" `Umar asked, \"Will that gate be opened or broken?\" He \nreplied, \"It will be broken.\" `Umar said, \"Then the gate will not be closed again till the Day of \nResurrection.\" We said to Masruq, \"Would you ask Hudhaifa whether `Umar knew what that gate \nsymbolized?\" He asked him and he replied \"He (`Umar) knew it as one knows that there will be night \nbefore tomorrow, morning.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا جَامِعٌ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ مَنْ يَحْفَظُ حَدِيثًا عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْفِتْنَةِ قَالَ حُذَيْفَةُ أَنَا سَمِعْتُهُ يَقُولُ ‏\n\"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصِّيَامُ وَالصَّدَقَةُ ‏\"‏‏.‏ قَالَ لَيْسَ أَسْأَلُ عَنْ ذِهِ، إِنَّمَا أَسْأَلُ عَنِ الَّتِي تَمُوجُ كَمَا يَمُوجُ الْبَحْرُ‏.‏ قَالَ وَإِنَّ دُونَ ذَلِكَ بَابًا مُغْلَقًا‏.‏ قَالَ فَيُفْتَحُ أَوْ يُكْسَرُ قَالَ يُكْسَرُ‏.‏ قَالَ ذَاكَ أَجْدَرُ أَنْ لاَ يُغْلَقَ إِلَى يَوْمِ الْقِيَامَةِ‏.‏ فَقُلْنَا لِمَسْرُوقٍ سَلْهُ أَكَانَ عُمَرُ يَعْلَمُ مَنِ الْبَابُ فَسَأَلَهُ فَقَالَ نَعَمْ، كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ اللَّيْلَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1895In-book reference : Book 30, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 119   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1896,
    "id": 1896,
    "url": "https://sunnah.com/bukhari:1896",
    "bookNumber": 30,
    "hadithNumber": 6,
    "narrator": "Narrated Sahl:",
    "english": "The Prophet (ﷺ) said, \"There is a gate in Paradise called Ar-Raiyan, and those who observe fasts will enter \nthrough it on the Day of Resurrection and none except them will enter through it. It will be said, \n'Where are those who used to observe fasts?' They will get up, and none except them will enter \nthrough it. After their entry the gate will be closed and nobody will enter through it.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ بَابًا يُقَالُ لَهُ الرَّيَّانُ، يَدْخُلُ مِنْهُ الصَّائِمُونَ يَوْمَ الْقِيَامَةِ، لاَ يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ يُقَالُ أَيْنَ الصَّائِمُونَ فَيَقُومُونَ، لاَ يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ، فَإِذَا دَخَلُوا أُغْلِقَ، فَلَمْ يَدْخُلْ مِنْهُ أَحَدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1896In-book reference : Book 30, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 120   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1897,
    "id": 1897,
    "url": "https://sunnah.com/bukhari:1897",
    "bookNumber": 30,
    "hadithNumber": 7,
    "narrator": "'Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, \nwill be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' \nSo, whoever was amongst the people who used to offer their prayers, will be called from the gate of \nthe prayer; and whoever was amongst the people who used to participate in Jihad, will be called from \nthe gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the \ngate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the \ngate of charity.\" Abu Bakr said, \"Let my parents be sacrificed for you, O Allah's Messenger (ﷺ)! No distress \nor need will befall him who will be called from those gates. Will there be any one who will be called \nfrom all these gates?\" The Prophet (ﷺ) replied, \"Yes, and I hope you will be one of them.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ مِنْ أَبْوَابِ الْجَنَّةِ يَا عَبْدَ اللَّهِ، هَذَا خَيْرٌ‏.‏ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ باب الصَّلاَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ باب الْجِهَادِ، وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ باب الرَّيَّانِ، وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ باب الصَّدَقَةِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ، مَا عَلَى مَنْ دُعِيَ مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ، فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الأَبْوَابِ كُلِّهَا قَالَ ‏\"‏ نَعَمْ‏.‏ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1897In-book reference : Book 30, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 121   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1898,
    "id": 1898,
    "url": "https://sunnah.com/bukhari:1898",
    "bookNumber": 30,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When Ramadan begins, the gates of Paradise are opened.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا جَاءَ رَمَضَانُ فُتِحَتْ أَبْوَابُ الْجَنَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1898In-book reference : Book 30, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1899,
    "id": 1899,
    "url": "https://sunnah.com/bukhari:1899",
    "bookNumber": 30,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When the month of Ramadan starts, the gates of the heaven are opened and the \ngates of Hell are closed and the devils are chained.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي أَنَسٍ، مَوْلَى التَّيْمِيِّينَ أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ السَّمَاءِ، وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ، وَسُلْسِلَتِ الشَّيَاطِينُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1899In-book reference : Book 30, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 123   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1900,
    "id": 1900,
    "url": "https://sunnah.com/bukhari:1900",
    "bookNumber": 30,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"When you see the crescent (of the month of Ramadan), start fasting, \nand when you see the crescent (of the month of Shawwal), stop fasting; and if the sky is overcast (and \nyou can't see it) then regard the month of Ramadan as of 30 days.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا رَأَيْتُمُوهُ فَصُومُوا، وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا، فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ‏\"‏‏.‏ وَقَالَ غَيْرُهُ عَنِ اللَّيْثِ حَدَّثَنِي عُقَيْلٌ وَيُونُسُ لِهِلاَلِ رَمَضَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1900In-book reference : Book 30, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 124   (deprecated numbering scheme)"
  }
]