[
  {
    "hadithGlobalNumber": 701,
    "id": 701,
    "url": "https://sunnah.com/bukhari:701",
    "bookNumber": 10,
    "hadithNumber": 96,
    "narrator": "Narrated `Amr:",
    "english": "Jabir bin `Abdullah said, \"Mu`adh bin Jabal used to pray with the Prophet (ﷺ) and then go to lead his \npeople in prayer Once he led the `Isha' prayer and recited Surat \"Al-Baqara.\" Somebody left the \nprayer and Mu`adh criticized him. The news reached the Prophet (ﷺ) and he said to Mu`adh, 'You are \nputting the people to trial,' and repeated it thrice (or said something similar) and ordered him to recite \ntwo medium Suras of Mufassal.\" (`Amr said that he had forgotten the names of those Suras).",
    "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كَانَ مُعَاذُ بْنُ جَبَلٍ يُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَرْجِعُ فَيَؤُمُّ قَوْمَهُ، فَصَلَّى الْعِشَاءَ فَقَرَأَ بِالْبَقَرَةِ، فَانْصَرَفَ الرَّجُلُ، فَكَأَنَّ مُعَاذًا تَنَاوَلَ مِنْهُ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ فَتَّانٌ فَتَّانٌ فَتَّانٌ ‏\"‏ ثَلاَثَ مِرَارٍ أَوْ قَالَ ‏\"‏ فَاتِنًا فَاتِنًا فَاتِنٌ ‏\"‏ وَأَمَرَهُ بِسُورَتَيْنِ مِنْ أَوْسَطِ الْمُفَصَّلِ‏.‏ قَالَ عَمْرٌو لاَ أَحْفَظُهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 701In-book reference : Book 10, Hadith 96USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 669   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 702,
    "id": 702,
    "url": "https://sunnah.com/bukhari:702",
    "bookNumber": 10,
    "hadithNumber": 97,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "A man came and said, \"O Allah's Messenger (ﷺ)! By Allah, I keep away from the morning prayer only \nbecause So and so prolongs the prayer when he leads us in it.\" The narrator said, \"I never saw Allah's \nApostle more furious in giving advice than he was at that time. He then said, \"Some of you make \npeople dislike good deeds (the prayer). So whoever among you leads the people in prayer should \nshorten it because among them are the weak, the old and the needy.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ سَمِعْتُ قَيْسًا، قَالَ أَخْبَرَنِي أَبُو مَسْعُودٍ، أَنَّ رَجُلاً، قَالَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنِّي لأَتَأَخَّرُ عَنْ صَلاَةِ الْغَدَاةِ مِنْ أَجْلِ فُلاَنٍ مِمَّا يُطِيلُ بِنَا‏.‏ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي مَوْعِظَةٍ أَشَدَّ غَضَبًا مِنْهُ يَوْمَئِذٍ ثُمَّ قَالَ ‏\n\"‏ إِنَّ مِنْكُمْ مُنَفِّرِينَ، فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيَتَجَوَّزْ، فَإِنَّ فِيهِمُ الضَّعِيفَ وَالْكَبِيرَ وَذَا الْحَاجَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 702In-book reference : Book 10, Hadith 97USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 670   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 703,
    "id": 703,
    "url": "https://sunnah.com/bukhari:703",
    "bookNumber": 10,
    "hadithNumber": 98,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If anyone of you leads the people in the prayer, he should shorten it for amongst \nthem are the weak, the sick and the old; and if anyone among your prays alone then he may prolong \n(the prayer) as much as he wishes. \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا صَلَّى أَحَدُكُمْ لِلنَّاسِ فَلْيُخَفِّفْ، فَإِنَّ مِنْهُمُ الضَّعِيفَ وَالسَّقِيمَ وَالْكَبِيرَ، وَإِذَا صَلَّى أَحَدُكُمْ لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 703In-book reference : Book 10, Hadith 98USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 671   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 704,
    "id": 704,
    "url": "https://sunnah.com/bukhari:704",
    "bookNumber": 10,
    "hadithNumber": 99,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "A man came and said, \"O Allah's Messenger (ﷺ)! I keep away from the morning prayer because so-and-so \n(Imam) prolongs it too much.\" Allah's Messenger (ﷺ) became furious and I had never seen him more furious \nthan he was on that day. The Prophet (ﷺ) said, \"O people! Some of you make others dislike the prayer, so \nwhoever becomes an Imam he should shorten the prayer, as behind him are the weak, the old and the \nneedy.''",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لأَتَأَخَّرُ عَنِ الصَّلاَةِ فِي الْفَجْرِ مِمَّا يُطِيلُ بِنَا فُلاَنٌ فِيهَا‏.‏ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا رَأَيْتُهُ غَضِبَ فِي مَوْضِعٍ كَانَ أَشَدَّ غَضَبًا مِنْهُ يَوْمَئِذٍ ثُمَّ قَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ مُنَفِّرِينَ، فَمَنْ أَمَّ النَّاسَ فَلْيَتَجَوَّزْ، فَإِنَّ خَلْفَهُ الضَّعِيفَ وَالْكَبِيرَ وَذَا الْحَاجَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 704In-book reference : Book 10, Hadith 99USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 672   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 705,
    "id": 705,
    "url": "https://sunnah.com/bukhari:705",
    "bookNumber": 10,
    "hadithNumber": 100,
    "narrator": "Narrated Jabir bin `Abdullah Al-Ansari:",
    "english": "Once a man was driving two Nadihas (camels used for agricultural purposes) and night had fallen. He \nfound Mu`adh praying so he made his camel kneel and joined Mu`adh in the prayer. The latter recited \nSurat 'Al-Baqara\" or Surat \"An-Nisa\", (so) the man left the prayer and went away. When he came to \nknow that Mu`adh had criticized him, he went to the Prophet, and complained against Mu`adh. The \nProphet said thrice, \"O Mu`adh ! Are you putting the people to trial?\" It would have been better if you \nhad recited \"Sabbih Isma Rabbika-l-A`la (87)\", Wash-shamsi wa duhaha (91)\", or \"Wal-laili idha \nyaghsha (92)\", for the old, the weak and the needy pray behind you.\" Jabir said that Mu`adh recited \nSura Al-Baqara in the `Isha' prayer.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا مُحَارِبُ بْنُ دِثَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ أَقْبَلَ رَجُلٌ بِنَاضِحَيْنِ وَقَدْ جَنَحَ اللَّيْلُ، فَوَافَقَ مُعَاذًا يُصَلِّي، فَتَرَكَ نَاضِحَهُ وَأَقْبَلَ إِلَى مُعَاذٍ، فَقَرَأَ بِسُورَةِ الْبَقَرَةِ أَوِ النِّسَاءِ، فَانْطَلَقَ الرَّجُلُ، وَبَلَغَهُ أَنَّ مُعَاذًا نَالَ مِنْهُ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَشَكَا إِلَيْهِ مُعَاذًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا مُعَاذُ أَفَتَّانٌ أَنْتَ ـ أَوْ فَاتِنٌ ثَلاَثَ مِرَارٍ ـ فَلَوْلاَ صَلَّيْتَ بِسَبِّحِ اسْمَ رَبِّكَ، وَالشَّمْسِ وَضُحَاهَا، وَاللَّيْلِ إِذَا يَغْشَى، فَإِنَّهُ يُصَلِّي وَرَاءَكَ الْكَبِيرُ وَالضَّعِيفُ وَذُو الْحَاجَةِ ‏\"‏‏.‏ أَحْسِبُ هَذَا فِي الْحَدِيثِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَتَابَعَهُ سَعِيدُ بْنُ مَسْرُوقٍ وَمِسْعَرٌ وَالشَّيْبَانِيُّ‏.‏ قَالَ عَمْرٌو وَعُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ وَأَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَرَأَ مُعَاذٌ فِي الْعِشَاءِ بِالْبَقَرَةِ‏.‏ وَتَابَعَهُ الأَعْمَشُ عَنْ مُحَارِبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 705In-book reference : Book 10, Hadith 100USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 673   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 706,
    "id": 706,
    "url": "https://sunnah.com/bukhari:706",
    "bookNumber": 10,
    "hadithNumber": 101,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to pray a short prayer (in congregation) but used to offer it in a perfect manner.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُوجِزُ الصَّلاَةَ وَيُكْمِلُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 706In-book reference : Book 10, Hadith 101USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 674   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 707,
    "id": 707,
    "url": "https://sunnah.com/bukhari:707",
    "bookNumber": 10,
    "hadithNumber": 102,
    "narrator": "Narrated `Abdullah bin 'Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) said, 'When I stand for prayer, I intend to prolong it but on hearing the \ncries of a child, I cut it short, as I dislike to trouble the child's mother.' \"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنِّي لأَقُومُ فِي الصَّلاَةِ أُرِيدُ أَنْ أُطَوِّلَ فِيهَا، فَأَسْمَعُ بُكَاءَ الصَّبِيِّ، فَأَتَجَوَّزُ فِي صَلاَتِي كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ ‏\"‏‏.‏ تَابَعَهُ بِشْرُ بْنُ بَكْرٍ وَابْنُ الْمُبَارَكِ وَبَقِيَّةُ عَنِ الأَوْزَاعِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 707In-book reference : Book 10, Hadith 102USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 675   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 708,
    "id": 708,
    "url": "https://sunnah.com/bukhari:708",
    "bookNumber": 10,
    "hadithNumber": 103,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I never prayed behind any Imam a prayer lighter and more perfect than that behind the Prophet (ﷺ) and he \nused to cut short the prayer whenever he heard the cries of a child lest he should put the child's mother \nto trial.",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ مَا صَلَّيْتُ وَرَاءَ إِمَامٍ قَطُّ أَخَفَّ صَلاَةً وَلاَ أَتَمَّ مِنَ النَّبِيِّ صلى الله عليه وسلم، وَإِنْ كَانَ لَيَسْمَعُ بُكَاءَ الصَّبِيِّ فَيُخَفِّفُ مَخَافَةَ أَنْ تُفْتَنَ أُمُّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 708In-book reference : Book 10, Hadith 103USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 676   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 709,
    "id": 709,
    "url": "https://sunnah.com/bukhari:709",
    "bookNumber": 10,
    "hadithNumber": 104,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"When I start the prayer I intend to prolong it, but on hearing the cries of a child, I \ncut short the prayer because I know that the cries of the child will incite its mother's passions.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، قَالَ حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنِّي لأَدْخُلُ فِي الصَّلاَةِ وَأَنَا أُرِيدُ إِطَالَتَهَا، فَأَسْمَعُ بُكَاءَ الصَّبِيِّ، فَأَتَجَوَّزُ فِي صَلاَتِي مِمَّا أَعْلَمُ مِنْ شِدَّةِ وَجْدِ أُمِّهِ مِنْ بُكَائِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 709In-book reference : Book 10, Hadith 104USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 677   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 710,
    "id": 710,
    "url": "https://sunnah.com/bukhari:710",
    "bookNumber": 10,
    "hadithNumber": 105,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet, said, \"Whenever I start the prayer I intend to prolong it, but on hearing the cries of a \nchild, I cut short the prayer because I know that the cries of the child will incite its mother's passions.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنِّي لأَدْخُلُ فِي الصَّلاَةِ فَأُرِيدُ إِطَالَتَهَا، فَأَسْمَعُ بُكَاءَ الصَّبِيِّ، فَأَتَجَوَّزُ مِمَّا أَعْلَمُ مِنْ شِدَّةِ وَجْدِ أُمِّهِ مِنْ بُكَائِهِ ‏\"‏‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 710In-book reference : Book 10, Hadith 105USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 678   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 711,
    "id": 711,
    "url": "https://sunnah.com/bukhari:711",
    "bookNumber": 10,
    "hadithNumber": 106,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Mu`adh used to pray with the Prophet (ﷺ) and then go and lead his people (tribe) in the prayer.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَأَبُو النُّعْمَانِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ، قَالَ كَانَ مُعَاذٌ يُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَأْتِي قَوْمَهُ فَيُصَلِّي بِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 711In-book reference : Book 10, Hadith 106USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 679   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 712,
    "id": 712,
    "url": "https://sunnah.com/bukhari:712",
    "bookNumber": 10,
    "hadithNumber": 107,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet, became ill in his fatal illness, Someone came to inform him about the prayer, and \nthe Prophet (ﷺ) told him to tell Abu Bakr to lead the people in the prayer. I said, \"Abu Bakr is a \nsofthearted man and if he stands for the prayer in your place, he would weep and would not be able to \nrecite the Qur'an.\" The Prophet (ﷺ) said, \"Tell Abu Bakr to lead the prayer.\" I said the same as before. He \n(repeated the same order and) on the third or the fourth time he said, \"You are the companions of \nJoseph. Tell Abu Bakr to lead the prayer.\" So Abu Bakr led the prayer and meanwhile the Prophet (ﷺ) felt \nbetter and came out with the help of two men; as if I see him just now dragging his feet on the ground. \nWhen Abu Bakr saw him, he tried to retreat but the Prophet (ﷺ) beckoned him to carry on. Abu Bakr \nretreated a bit and the Prophet (ﷺ) sat on his (left) side. Abu Bakr was repeating the Takbir (Allahu \nAkbar) of Allah's Messenger (ﷺ) for the people to hear.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا مَرِضَ النَّبِيُّ صلى الله عليه وسلم مَرَضَهُ الَّذِي مَاتَ فِيهِ أَتَاهُ بِلاَلٌ يُؤْذِنُهُ بِالصَّلاَةِ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ ‏\"‏‏.‏ قُلْتُ إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ، إِنْ يَقُمْ مَقَامَكَ يَبْكِي فَلاَ يَقْدِرُ عَلَى الْقِرَاءَةِ‏.‏ قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ ‏\"‏‏.‏ فَقُلْتُ مِثْلَهُ فَقَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ إِنَّكُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ ‏\"‏‏.‏ فَصَلَّى وَخَرَجَ النَّبِيُّ صلى الله عليه وسلم يُهَادَى بَيْنَ رَجُلَيْنِ، كَأَنِّي أَنْظُرُ إِلَيْهِ يَخُطُّ بِرِجْلَيْهِ الأَرْضَ، فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ يَتَأَخَّرُ، فَأَشَارَ إِلَيْهِ أَنْ صَلِّ، فَتَأَخَّرَ أَبُو بَكْرٍ ـ رضى الله عنه ـ وَقَعَدَ النَّبِيُّ صلى الله عليه وسلم إِلَى جَنْبِهِ، وَأَبُو بَكْرٍ يُسْمِعُ النَّاسَ التَّكْبِيرَ‏.‏ تَابَعَهُ مُحَاضِرٌ عَنِ الأَعْمَشِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 712In-book reference : Book 10, Hadith 107USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 680   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 713,
    "id": 713,
    "url": "https://sunnah.com/bukhari:713",
    "bookNumber": 10,
    "hadithNumber": 108,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) became seriously ill, Bilal came to him for the prayer. He said, \"Tell Abu Bakr \nto lead the people in the prayer.\" I said, \"O Allah's Messenger (ﷺ)! Abu Bakr is a softhearted man and if he \nstands in your place, he would not be able to make the people hear him. Will you order `Umar (to lead \nthe prayer)?\" The Prophet (ﷺ) said, \"Tell Abu Bakr to lead the people in the prayer.\" Then I said to Hafsa, \n\"Tell him, Abu i Bakr is a softhearted man and if he stands in his place, he would not be able to make \nthe people hear him. Would you order `Umar to lead the prayer?' \" Hafsa did so. The Prophet (ﷺ) said, \n\"Verily you are the companions of Joseph. Tell Abu Bakr to lead the people in the prayer.\" So Abu- \nBakr stood for the prayer. In the meantime Allah's Messenger (ﷺ) felt better and came out with the help of \ntwo persons and both of his legs were dragging on the ground till he entered the mosque. When Abu \nBakr heard him coming, he tried to retreat but Allah's Messenger (ﷺ) beckoned him to carry on. The Prophet (ﷺ) \nsat on his left side. Abu Bakr was praying while standing and Allah's Messenger (ﷺ) was leading the prayer \nwhile sitting. Abu Bakr was following the Prophet (ﷺ) and the people were following Abu Bakr (in the \nprayer).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَ بِلاَلٌ يُؤْذِنُهُ بِالصَّلاَةِ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ، وَإِنَّهُ مَتَى مَا يَقُمْ مَقَامَكَ لاَ يُسْمِعُ النَّاسَ، فَلَوْ أَمَرْتَ عُمَرَ‏.‏ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ، وَإِنَّهُ مَتَى يَقُمْ مَقَامَكَ لاَ يُسْمِعِ النَّاسَ، فَلَوْ أَمَرْتَ عُمَرَ‏.‏ قَالَ ‏\"‏ إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ ‏\"‏‏.‏ فَلَمَّا دَخَلَ فِي الصَّلاَةِ وَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَفْسِهِ خِفَّةً، فَقَامَ يُهَادَى بَيْنَ رَجُلَيْنِ، وَرِجْلاَهُ يَخُطَّانِ فِي الأَرْضِ حَتَّى دَخَلَ الْمَسْجِدَ، فَلَمَّا سَمِعَ أَبُو بَكْرٍ حِسَّهُ ذَهَبَ أَبُو بَكْرٍ يَتَأَخَّرُ، فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى جَلَسَ عَنْ يَسَارِ أَبِي بَكْرٍ، فَكَانَ أَبُو بَكْرٍ يُصَلِّي قَائِمًا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي قَاعِدًا، يَقْتَدِي أَبُو بَكْرٍ بِصَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ مُقْتَدُونَ بِصَلاَةِ أَبِي بَكْرٍ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 713In-book reference : Book 10, Hadith 108USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 681   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 714,
    "id": 714,
    "url": "https://sunnah.com/bukhari:714",
    "bookNumber": 10,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Huraira:",
    "english": "Once Allah's Messenger (ﷺ) prayed two rak`at (instead of four) and finished his prayer. Dhul-Yadain asked \nhim whether the prayer had been reduced or whether he had forgotten. Allah's Messenger (ﷺ) asked the \npeople whether Dhul-Yadain was telling the truth. The people replied in the affirmative. Then Allah's \nApostle stood up, offered the remaining two rak`at and then finished his prayer with Taslim and then \nsaid, \"Allahu Akbar.\" He followed it with two prostrations like ordinary prostrations or a bit longer.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنَ اثْنَتَيْنِ، فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقَصُرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَالَ النَّاسُ نَعَمْ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى اثْنَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 714In-book reference : Book 10, Hadith 109USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 682   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 715,
    "id": 715,
    "url": "https://sunnah.com/bukhari:715",
    "bookNumber": 10,
    "hadithNumber": 110,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) prayed two rak`at of Zuhr prayer (instead of four) and he was told that he had prayed two \nrak`at only. Then he prayed two more rak`at and finished them with the Taslim followed by two \nprostrations.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ رَكْعَتَيْنِ، فَقِيلَ صَلَّيْتَ رَكْعَتَيْنِ‏.‏ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 715In-book reference : Book 10, Hadith 110USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 683   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 716,
    "id": 716,
    "url": "https://sunnah.com/bukhari:716",
    "bookNumber": 10,
    "hadithNumber": 111,
    "narrator": "Narrated `Aisha:",
    "english": "the mother of the faithful believers: Allah's Messenger (ﷺ) in his last illness said, \"Tell Abu Bakr to lead the \npeople in the prayer.\" I said, \"If Abu Bakr stood in your place, he would not be able to make the \npeople hear him owing to his weeping. So please order `Umar to lead the prayer.\" He said, \"Tell Abu \nBakr to lead the people in the prayer.\" I said to Hafsa, \"Say to him, 'Abu Bakr is a softhearted man and \nif he stood in your place he would not be able to make the people hear him owing to his weeping. So \norder `Umar to lead the people in the prayer.' \" Hafsa did so but Allah's Messenger (ﷺ) said, \"Keep quiet. \nVerily you are the companions of (Prophet) Joseph. Tell Abu Bakr to lead the people in the prayer.\" \nHafsa said to me, \"I never got any good from you.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي مَرَضِهِ ‏\"‏ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ قُلْتُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ‏.‏ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ لِحَفْصَةَ قُولِي لَهُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ لِلنَّاسِ‏.‏ فَفَعَلَتْ حَفْصَةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَهْ، إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ لِعَائِشَةَ مَا كُنْتُ لأُصِيبَ مِنْكِ خَيْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 716In-book reference : Book 10, Hadith 111USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 684   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 717,
    "id": 717,
    "url": "https://sunnah.com/bukhari:717",
    "bookNumber": 10,
    "hadithNumber": 112,
    "narrator": "Narrated An-Nu`man bin 'Bashir:",
    "english": "The Prophet (ﷺ) said, \"Straighten your rows or Allah will alter your faces.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ مُرَّةَ، قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَتُسَوُّنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 717In-book reference : Book 10, Hadith 112USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 685   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 718,
    "id": 718,
    "url": "https://sunnah.com/bukhari:718",
    "bookNumber": 10,
    "hadithNumber": 113,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Straighten your rows, for I see you from behind my back.'",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقِيمُوا الصُّفُوفَ فَإِنِّي أَرَاكُمْ خَلْفَ ظَهْرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 718In-book reference : Book 10, Hadith 113USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 686   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 719,
    "id": 719,
    "url": "https://sunnah.com/bukhari:719",
    "bookNumber": 10,
    "hadithNumber": 114,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once the Iqama was pronounced and Allah's Messenger (ﷺ) faced us and said, \"Straighten your rows and \nstand closer together, for I see you from behind my back.'",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، حَدَّثَنَا أَنَسٌ، قَالَ أُقِيمَتِ الصَّلاَةُ فَأَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَجْهِهِ فَقَالَ ‏\n\"‏ أَقِيمُوا صُفُوفَكُمْ وَتَرَاصُّوا، فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 719In-book reference : Book 10, Hadith 114USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 687   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 720,
    "id": 720,
    "url": "https://sunnah.com/bukhari:720",
    "bookNumber": 10,
    "hadithNumber": 115,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or \nof being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for \nthe Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the \nFajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward \nfor the first row, they would draw lots for it.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشُّهَدَاءُ الْغَرِقُ وَالْمَطْعُونُ وَالْمَبْطُونُ وَالْهَدْمُ ‏\"‏‏.‏ وَقَالَ ‏\"‏ وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا ‏{‏إِلَيْهِ‏}‏ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا، وَلَوْ يَعْلَمُونَ مَا فِي الصَّفِّ الْمُقَدَّمِ لاَسْتَهَمُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 720, 721In-book reference : Book 10, Hadith 115USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 688   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 721,
    "id": 721,
    "url": "https://sunnah.com/bukhari:721",
    "bookNumber": 10,
    "hadithNumber": 115,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or \nof being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for \nthe Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the \nFajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward \nfor the first row, they would draw lots for it.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشُّهَدَاءُ الْغَرِقُ وَالْمَطْعُونُ وَالْمَبْطُونُ وَالْهَدْمُ ‏\"‏‏.‏ وَقَالَ ‏\"‏ وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا ‏{‏إِلَيْهِ‏}‏ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا، وَلَوْ يَعْلَمُونَ مَا فِي الصَّفِّ الْمُقَدَّمِ لاَسْتَهَمُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 720, 721In-book reference : Book 10, Hadith 115USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 688   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 722,
    "id": 722,
    "url": "https://sunnah.com/bukhari:722",
    "bookNumber": 10,
    "hadithNumber": 116,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Imam is (appointed) to be followed. So do not differ from him, bow when he \nbows, and say, \"Rabbana-lakal hamd\" if he says \"Sami`a l-lahu liman hamidah\"; and if he prostrates, \nprostrate (after him), and if he prays sitting, pray sitting all together, and straighten the rows for the \nprayer, as the straightening of the rows is amongst those things which make your prayer a correct and \nperfect one. (See Hadith No. 657).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَلاَ تَخْتَلِفُوا عَلَيْهِ، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ، وَأَقِيمُوا الصَّفَّ فِي الصَّلاَةِ، فَإِنَّ إِقَامَةَ الصَّفِّ مِنْ حُسْنِ الصَّلاَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 722In-book reference : Book 10, Hadith 116USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 689   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 723,
    "id": 723,
    "url": "https://sunnah.com/bukhari:723",
    "bookNumber": 10,
    "hadithNumber": 117,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Straighten your rows as the straightening of rows is essential for a perfect and \ncorrect prayer. \"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ إِقَامَةِ الصَّلاَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 723In-book reference : Book 10, Hadith 117USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 690   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 724,
    "id": 724,
    "url": "https://sunnah.com/bukhari:724",
    "bookNumber": 10,
    "hadithNumber": 118,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I arrived at Medina and was asked whether I found any change since the days of Allah's Messenger (ﷺ). I \nsaid, \"I have not found any change except that you do not stand in alignment in your prayers.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، قَالَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ، عَنْ بُشَيْرِ بْنِ يَسَارٍ الأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَدِمَ الْمَدِينَةَ فَقِيلَ لَهُ مَا أَنْكَرْتَ مِنَّا مُنْذُ يَوْمِ عَهِدْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَا أَنْكَرْتُ شَيْئًا إِلاَّ أَنَّكُمْ لاَ تُقِيمُونَ الصُّفُوفَ‏.‏ وَقَالَ عُقْبَةُ بْنُ عُبَيْدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ قَدِمَ عَلَيْنَا أَنَسُ بْنُ مَالِكٍ الْمَدِينَةَ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 724In-book reference : Book 10, Hadith 118USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 691   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 725,
    "id": 725,
    "url": "https://sunnah.com/bukhari:725",
    "bookNumber": 10,
    "hadithNumber": 119,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Straighten your rows for I see you from behind my back.\" Anas added, \"Everyone \nof us used to put his shoulder with the shoulder of his companion and his foot with the foot of his \ncompanion.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقِيمُوا صُفُوفَكُمْ فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏‏.‏ وَكَانَ أَحَدُنَا يُلْزِقُ مَنْكِبَهُ بِمَنْكِبِ صَاحِبِهِ وَقَدَمَهُ بِقَدَمِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 725In-book reference : Book 10, Hadith 119USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 692   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 726,
    "id": 726,
    "url": "https://sunnah.com/bukhari:726",
    "bookNumber": 10,
    "hadithNumber": 120,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I prayed with the Prophet (ﷺ) one night and stood on his left side. Allah's Messenger (ﷺ) caught hold of my head \nfrom behind and drew me to his right and then offered the prayer and slept. Later the Mu'adh-dhin \ncame and the Prophet (ﷺ) stood up for prayer without performing ablution.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقُمْتُ عَنْ يَسَارِهِ، فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَأْسِي مِنْ وَرَائِي، فَجَعَلَنِي عَنْ يَمِينِهِ، فَصَلَّى وَرَقَدَ فَجَاءَهُ الْمُؤَذِّنُ، فَقَامَ وَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 726In-book reference : Book 10, Hadith 120USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 693   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 727,
    "id": 727,
    "url": "https://sunnah.com/bukhari:727",
    "bookNumber": 10,
    "hadithNumber": 121,
    "narrator": "Narrated Anas bin Malik:",
    "english": "One night an orphan and I offered the prayers behind the Prophet (ﷺ) in my house and my mother (Um \nSulaim) was standing behind us (by herself forming a row).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْحَاقَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ صَلَّيْتُ أَنَا وَيَتِيمٌ، فِي بَيْتِنَا خَلْفَ النَّبِيِّ صلى الله عليه وسلم وَأُمِّي أُمُّ سُلَيْمٍ خَلْفَنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 727In-book reference : Book 10, Hadith 121USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 694   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 728,
    "id": 728,
    "url": "https://sunnah.com/bukhari:728",
    "bookNumber": 10,
    "hadithNumber": 122,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "One night I stood to the left of the Prophet (ﷺ) in the prayer but he caught hold of me by the hand or by \nthe shoulder (arm) till he made me stand on his right and beckoned with his hand (for me) to go from \nbehind (him). (Al-Kashmaihani [??] , Fath-ul-Bari).",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قُمْتُ لَيْلَةً أُصَلِّي عَنْ يَسَارِ النَّبِيِّ صلى الله عليه وسلم فَأَخَذَ بِيَدِي أَوْ بِعَضُدِي حَتَّى أَقَامَنِي عَنْ يَمِينِهِ، وَقَالَ بِيَدِهِ مِنْ وَرَائِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 728In-book reference : Book 10, Hadith 122USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 695   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 729,
    "id": 729,
    "url": "https://sunnah.com/bukhari:729",
    "bookNumber": 10,
    "hadithNumber": 123,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to pray in his room at night. As the wall of the room was LOW, the people saw \nhim and some of them stood up to follow him in the prayer. In the morning they spread the news. The \nfollowing night the Prophet (ﷺ) stood for the prayer and the people followed him. This went on for two or \nthree nights. Thereupon Allah's Messenger (ﷺ) did not stand for the prayer the following night, and did not \ncome out. In the morning, the people asked him about it. He replied, that he way afraid that the night \nprayer might become compulsory.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا عَبْدَةُ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ فِي حُجْرَتِهِ، وَجِدَارُ الْحُجْرَةِ قَصِيرٌ، فَرَأَى النَّاسُ شَخْصَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ أُنَاسٌ يُصَلُّونَ بِصَلاَتِهِ، فَأَصْبَحُوا فَتَحَدَّثُوا بِذَلِكَ، فَقَامَ لَيْلَةَ الثَّانِيَةِ، فَقَامَ مَعَهُ أُنَاسٌ يُصَلُّونَ بِصَلاَتِهِ، صَنَعُوا ذَلِكَ لَيْلَتَيْنِ أَوْ ثَلاَثَةً، حَتَّى إِذَا كَانَ بَعْدَ ذَلِكَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَخْرُجْ، فَلَمَّا أَصْبَحَ ذَكَرَ ذَلِكَ النَّاسُ فَقَالَ ‏\n\"‏ إِنِّي خَشِيتُ أَنْ تُكْتَبَ عَلَيْكُمْ صَلاَةُ اللَّيْلِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 729In-book reference : Book 10, Hadith 123USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 696   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 730,
    "id": 730,
    "url": "https://sunnah.com/bukhari:730",
    "bookNumber": 10,
    "hadithNumber": 124,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) had a mat which he used to spread during the day and use as a curtain at night. So a \nnumber of people gathered at night facing it and prayed behind him.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لَهُ حَصِيرٌ يَبْسُطُهُ بِالنَّهَارِ، وَيَحْتَجِرُهُ بِاللَّيْلِ، فَثَابَ إِلَيْهِ نَاسٌ، فَصَلَّوْا وَرَاءَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 730In-book reference : Book 10, Hadith 124USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 697   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 731,
    "id": 731,
    "url": "https://sunnah.com/bukhari:731",
    "bookNumber": 10,
    "hadithNumber": 125,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "Allah's Messenger (ﷺ) made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit \nsaid that it was made of a mat\") and he prayed there for a few nights, and so some of his companions \nprayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to \nthem and said, \"I have seen and understood what you did. You should pray in your houses, for the best \nprayer of a person is that which he prays in his house except the compulsory prayers.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ حُجْرَةً ـ قَالَ حَسِبْتُ أَنَّهُ قَالَ ـ مِنْ حَصِيرٍ فِي رَمَضَانَ فَصَلَّى فِيهَا لَيَالِيَ، فَصَلَّى بِصَلاَتِهِ نَاسٌ مِنْ أَصْحَابِهِ، فَلَمَّا عَلِمَ بِهِمْ جَعَلَ يَقْعُدُ، فَخَرَجَ إِلَيْهِمْ فَقَالَ ‏\n\"‏ قَدْ عَرَفْتُ الَّذِي رَأَيْتُ مِنْ صَنِيعِكُمْ، فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ، فَإِنَّ أَفْضَلَ الصَّلاَةِ صَلاَةُ الْمَرْءِ فِي بَيْتِهِ إِلاَّ الْمَكْتُوبَةَ ‏\"‏‏.‏ قَالَ عَفَّانُ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى، سَمِعْتُ أَبَا النَّضْرِ، عَنْ بُسْرٍ، عَنْ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 731In-book reference : Book 10, Hadith 125USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 698   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 732,
    "id": 732,
    "url": "https://sunnah.com/bukhari:732",
    "bookNumber": 10,
    "hadithNumber": 126,
    "narrator": "Narrated Anas bin Malik Al-Ansari:",
    "english": "Allah's Messenger (ﷺ) rode a horse and fell down and the right side of his body was injured. On that day he \nprayed one of the prayers sitting and we also prayed behind him sitting. When the Prophet (ﷺ) finished the \nprayer with Taslim, he said, \"The Imam is to be followed and if he prays standing then pray standing, \nand bow when he bows, and raise your heads when he raises his head; prostrate when he prostrates; \nand if he says \"Sami`a l-lahu liman hamidah\", you should say, \"Rabbana wa laka l-hamd.:",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ الأَنْصَارِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ فَرَسًا، فَجُحِشَ شِقُّهُ الأَيْمَنُ، قَالَ أَنَسٌ ـ رضى الله عنه ـ فَصَلَّى لَنَا يَوْمَئِذٍ صَلاَةً مِنَ الصَّلَوَاتِ وَهْوَ قَاعِدٌ، فَصَلَّيْنَا وَرَاءَهُ قُعُودًا، ثُمَّ قَالَ لَمَّا سَلَّمَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 732In-book reference : Book 10, Hadith 126USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 699   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 733,
    "id": 733,
    "url": "https://sunnah.com/bukhari:733",
    "bookNumber": 10,
    "hadithNumber": 127,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) fell from a horse and got injured so he led the prayer sitting and we also prayed \nsitting. When he completed the prayer he said, \"The Imam is to be followed; if he says Takbir then say \nTakbir, bow if he bows; raise your heads when he raises his head, when he says, 'Sami`a l-lahu liman \nhamidah say, 'Rabbana laka l-hamd', and prostrate when he prostrates.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ خَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ فَرَسٍ فَجُحِشَ فَصَلَّى لَنَا قَاعِدًا فَصَلَّيْنَا مَعَهُ قُعُودًا، ثُمَّ انْصَرَفَ فَقَالَ ‏\n\"‏ إِنَّمَا الإِمَامُ ـ أَوْ إِنَّمَا جُعِلَ الإِمَامُ ـ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 733In-book reference : Book 10, Hadith 127USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 700   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 734,
    "id": 734,
    "url": "https://sunnah.com/bukhari:734",
    "bookNumber": 10,
    "hadithNumber": 128,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Imam is to be followed. Say the Takbir when he says it; bow if he bows; if he \nsays 'Sami`a l-lahu liman hamidah', say, ' Rabbana wa laka l-hamd', prostrate if he prostrates and pray \nsitting altogether if he prays sitting.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 734In-book reference : Book 10, Hadith 128USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 701   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 735,
    "id": 735,
    "url": "https://sunnah.com/bukhari:735",
    "bookNumber": 10,
    "hadithNumber": 129,
    "narrator": "Narrated Salim bin `Abdullah:",
    "english": "My father said, \"Allah's Messenger (ﷺ) used to raise both his hands up to the level of his shoulders when \nopening the prayer; and on saying the Takbir for bowing. And on raising his head from bowing he \nused to do the same and then say \"Sami`a l-lahu liman hamidah, Rabbana wa laka l-hamd.\" And he \ndid not do that (i.e. raising his hands) in prostrations.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْفَعُ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ إِذَا افْتَتَحَ الصَّلاَةَ، وَإِذَا كَبَّرَ لِلرُّكُوعِ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ أَيْضًا وَقَالَ ‏\n\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَكَانَ لاَ يَفْعَلُ ذَلِكَ فِي السُّجُودِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 735In-book reference : Book 10, Hadith 129USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 702   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 736,
    "id": 736,
    "url": "https://sunnah.com/bukhari:736",
    "bookNumber": 10,
    "hadithNumber": 130,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I saw that whenever Allah's Messenger (ﷺ) stood for the prayer, he used to raise both his hands up to the \nshoulders, and used to do the same on saying the Takbir for bowing and on raising his head from it \nand used to say, \"Sami`a l-lahu liman hamidah\". But he did not do that (i.e. raising his hands) in \nprostrations.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، رضى الله عنهما قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ فِي الصَّلاَةِ رَفَعَ يَدَيْهِ حَتَّى يَكُونَا حَذْوَ مَنْكِبَيْهِ، وَكَانَ يَفْعَلُ ذَلِكَ حِينَ يُكَبِّرُ لِلرُّكُوعِ، وَيَفْعَلُ ذَلِكَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ وَيَقُولُ ‏\n\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ وَلاَ يَفْعَلُ ذَلِكَ فِي السُّجُودِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 736In-book reference : Book 10, Hadith 130USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 703   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 737,
    "id": 737,
    "url": "https://sunnah.com/bukhari:737",
    "bookNumber": 10,
    "hadithNumber": 131,
    "narrator": "Narrated Abu Qilaba:",
    "english": "I saw Malik bin Huwairith saying Takbir and raising both his hands (on starting the prayers and \nraising his hands on bowing and also on raising his head after bowing. Malik bin Huwairith said, \n\"Allah's Messenger (ﷺ) did the same.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّهُ رَأَى مَالِكَ بْنَ الْحُوَيْرِثِ إِذَا صَلَّى كَبَّرَ وَرَفَعَ يَدَيْهِ، وَإِذَا أَرَادَ أَنْ يَرْكَعَ رَفَعَ يَدَيْهِ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَ يَدَيْهِ، وَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ هَكَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 737In-book reference : Book 10, Hadith 131USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 704   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 738,
    "id": 738,
    "url": "https://sunnah.com/bukhari:738",
    "bookNumber": 10,
    "hadithNumber": 132,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I saw Allah's Messenger (ﷺ) opening the prayer with the Takbir and raising his hands to the level of his \nshoulders at the time of saying the Takbir, and on saying the Takbir for bowing he did the same; and \nwhen he said, \"Sami`a l-lahu liman hamidah \", he did the same and then said, \"Rabbana wa laka lhamd.\" \nBut he did not do the same on prostrating and on lifting the head from it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم افْتَتَحَ التَّكْبِيرَ فِي الصَّلاَةِ، فَرَفَعَ يَدَيْهِ حِينَ يُكَبِّرُ حَتَّى يَجْعَلَهُمَا حَذْوَ مَنْكِبَيْهِ، وَإِذَا كَبَّرَ لِلرُّكُوعِ فَعَلَ مِثْلَهُ، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَعَلَ مِثْلَهُ وَقَالَ ‏\n\"‏ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَلاَ يَفْعَلُ ذَلِكَ حِينَ يَسْجُدُ وَلاَ حِينَ يَرْفَعُ رَأْسَهُ مِنَ السُّجُودِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 738In-book reference : Book 10, Hadith 132USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 705   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 739,
    "id": 739,
    "url": "https://sunnah.com/bukhari:739",
    "bookNumber": 10,
    "hadithNumber": 133,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever Ibn `Umar started the prayer with Takbir, he used to raise his hands: whenever he bowed, \nhe used to raise his hands (before bowing) and also used to raise his hands on saying, \"Sami`a l-lahu \nliman hamidah\", and he used to do the same on rising from the second rak`a (for the 3rd rak`a). Ibn \n`Umar said: \"The Prophet (ﷺ) used to do the same.\"",
    "arabic": "حَدَّثَنَا عَيَّاشٌ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ إِذَا دَخَلَ فِي الصَّلاَةِ كَبَّرَ وَرَفَعَ يَدَيْهِ، وَإِذَا رَكَعَ رَفَعَ يَدَيْهِ، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ رَفَعَ يَدَيْهِ، وَإِذَا قَامَ مِنَ الرَّكْعَتَيْنِ رَفَعَ يَدَيْهِ‏.‏ وَرَفَعَ ذَلِكَ ابْنُ عُمَرَ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم‏.‏ رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ ابْنُ طَهْمَانَ عَنْ أَيُّوبَ وَمُوسَى بْنِ عُقْبَةَ مُخْتَصَرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 739In-book reference : Book 10, Hadith 133USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 706   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 740,
    "id": 740,
    "url": "https://sunnah.com/bukhari:740",
    "bookNumber": 10,
    "hadithNumber": 134,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The people were ordered to place the right hand on the left forearm in the prayer. Abu Hazim said, \"I \nknew that the order was from the Prophet (ﷺ) .\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ كَانَ النَّاسُ يُؤْمَرُونَ أَنْ يَضَعَ الرَّجُلُ الْيَدَ الْيُمْنَى عَلَى ذِرَاعِهِ الْيُسْرَى فِي الصَّلاَةِ‏.‏ قَالَ أَبُو حَازِمٍ لاَ أَعْلَمُهُ إِلاَّ يَنْمِي ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ إِسْمَاعِيلُ يُنْمَى ذَلِكَ‏.‏ وَلَمْ يَقُلْ يَنْمِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 740In-book reference : Book 10, Hadith 134USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 707   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 741,
    "id": 741,
    "url": "https://sunnah.com/bukhari:741",
    "bookNumber": 10,
    "hadithNumber": 135,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"You see me facing the Qibla; but, by Allah, nothing is hidden from me \nregarding your bowing and submissiveness and I see you from behind my back.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ هَلْ تَرَوْنَ قِبْلَتِي هَا هُنَا وَاللَّهِ مَا يَخْفَى عَلَىَّ رُكُوعُكُمْ وَلاَ خُشُوعُكُمْ، وَإِنِّي لأَرَاكُمْ وَرَاءَ ظَهْرِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 741In-book reference : Book 10, Hadith 135USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 708   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 742,
    "id": 742,
    "url": "https://sunnah.com/bukhari:742",
    "bookNumber": 10,
    "hadithNumber": 136,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Perform the bowing and the prostrations properly. By Allah, I see you from behind \nme (or from behind my back) when you bow or prostrate.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقِيمُوا الرُّكُوعَ وَالسُّجُودَ، فَوَاللَّهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِي ـ وَرُبَّمَا قَالَ مِنْ بَعْدِ ظَهْرِي ـ إِذَا رَكَعْتُمْ وَسَجَدْتُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 742In-book reference : Book 10, Hadith 136USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 709   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 743,
    "id": 743,
    "url": "https://sunnah.com/bukhari:743",
    "bookNumber": 10,
    "hadithNumber": 137,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet, Abu Bakr and `Umar used to start the prayer with \"Al hamdu li l-lahi Rabbi l-`alamin \n(All praise is but to Allah, Lord of the Worlds).",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ كَانُوا يَفْتَتِحُونَ الصَّلاَةَ بِ ـ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 743In-book reference : Book 10, Hadith 137USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 710   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 744,
    "id": 744,
    "url": "https://sunnah.com/bukhari:744",
    "bookNumber": 10,
    "hadithNumber": 138,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) used to keep silent between the Takbir and the recitation of Qur'an and that interval of \nsilence used to be a short one. I said to the Prophet (ﷺ) \"May my parents be sacrificed for you! What do \nyou say in the pause between Takbir and recitation?\" The Prophet (ﷺ) said, \"I say, 'Allahumma, baa`id \nbaini wa baina khatayaya kama baa`adta baina l-mashriqi wa l-maghrib. Allahumma, naqqini min \nkhatayaya kama yunaqqa th-thawbu l-abyadu mina d-danas. Allahumma, ighsil khatayaya bi l-maa'i \nwa th-thalji wa l-barad (O Allah! Set me apart from my sins (faults) as the East and West are set apart \nfrom each other and clean me from sins as a white garment is cleaned of dirt (after thorough washing). \nO Allah! Wash off my sins with water, snow and hail.)\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، قَالَ حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْكُتُ بَيْنَ التَّكْبِيرِ وَبَيْنَ الْقِرَاءَةِ إِسْكَاتَةً ـ قَالَ أَحْسِبُهُ قَالَ هُنَيَّةً ـ فَقُلْتُ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ، إِسْكَاتُكَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ مَا تَقُولُ قَالَ ‏\n\"‏ أَقُولُ اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 744In-book reference : Book 10, Hadith 138USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 711   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 745,
    "id": 745,
    "url": "https://sunnah.com/bukhari:745",
    "bookNumber": 10,
    "hadithNumber": 139,
    "narrator": "Narrated Asma' bint Abi Bakr:",
    "english": "The Prophet (ﷺ) once offered the eclipse prayer. He stood for a long time and then did a prolonged \nbowing. He stood up straight again and kept on standing for a long time, then bowed a long bowing \nand then stood up straight and then prostrated a prolonged prostration and then lifted his head and \nprostrated a prolonged prostration. And then he stood up for a long time and then did a prolonged \nbowing and then stood up straight again and kept on standing for a long time. Then he bowed a long \nbowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head \nand went for a prolonged prostration. On completion o the prayer, he said, \"Paradise became s near to \nme that if I had dared, I would have plucked one of its bunches for you and Hell became so near to me \nthat said, 'O my Lord will I be among those people?' Then suddenly I saw a woman and a cat was \nlacerating her with it claws. On inquiring, it was said that the woman had imprisoned the cat till it died \nof starvation and she neither fed it no freed it so that it could feed itself.\"",
    "arabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا نَافِعُ بْنُ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى صَلاَةَ الْكُسُوفِ، فَقَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَسَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ انْصَرَفَ فَقَالَ ‏\"‏ قَدْ دَنَتْ مِنِّي الْجَنَّةُ حَتَّى لَوِ اجْتَرَأْتُ عَلَيْهَا لَجِئْتُكُمْ بِقِطَافٍ مِنْ قِطَافِهَا، وَدَنَتْ مِنِّي النَّارُ حَتَّى قُلْتُ أَىْ رَبِّ وَأَنَا مَعَهُمْ فَإِذَا امْرَأَةٌ ـ حَسِبْتُ أَنَّهُ قَالَ ـ تَخْدِشُهَا هِرَّةٌ قُلْتُ مَا شَأْنُ هَذِهِ قَالُوا حَبَسَتْهَا حَتَّى مَاتَتْ جُوعًا، لاَ أَطْعَمَتْهَا، وَلاَ أَرْسَلَتْهَا تَأْكُلُ ‏\"‏‏.‏ قَالَ نَافِعٌ حَسِبْتُ أَنَّهُ قَالَ ‏\"‏ مِنْ خَشِيشِ أَوْ خُشَاشِ الأَرْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 745In-book reference : Book 10, Hadith 139USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 712   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 746,
    "id": 746,
    "url": "https://sunnah.com/bukhari:746",
    "bookNumber": 10,
    "hadithNumber": 140,
    "narrator": "Narrated Abu Ma`mar:",
    "english": "We asked Khabbab whether Allah's Messenger (ﷺ) used to recite (the Qur'an) in the Zuhr and the `Asr \nprayers. He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By \nthe movement of his beard.\"",
    "arabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، قَالَ قُلْنَا لِخَبَّابٍ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ‏.‏ قُلْنَا بِمَ كُنْتُمْ تَعْرِفُونَ ذَاكَ قَالَ بِاضْطِرَابِ لِحْيَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 746In-book reference : Book 10, Hadith 140USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 713   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 747,
    "id": 747,
    "url": "https://sunnah.com/bukhari:747",
    "bookNumber": 10,
    "hadithNumber": 141,
    "narrator": "Narrated Al-Bara:",
    "english": "(And Al-Bara was not a liar) Whenever we offered prayer with the Prophet (ﷺ) and he raised his head \nfrom the bowing, we used to remain standing till we saw him prostrating .",
    "arabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، يَخْطُبُ قَالَ حَدَّثَنَا الْبَرَاءُ، وَكَانَ، غَيْرَ كَذُوبٍ أَنَّهُمْ كَانُوا إِذَا صَلَّوْا مَعَ النَّبِيِّ صلى الله عليه وسلم فَرَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَامُوا قِيَامًا حَتَّى يَرَوْنَهُ قَدْ سَجَدَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 747In-book reference : Book 10, Hadith 141USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 714   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 748,
    "id": 748,
    "url": "https://sunnah.com/bukhari:748",
    "bookNumber": 10,
    "hadithNumber": 142,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Once solar eclipse occurred during the lifetime of Allah's Messenger (ﷺ). He offered the eclipse prayer. His \ncompanions asked, \"O Allah's Messenger (ﷺ)! We saw you trying to take something while standing at your \nplace and then we saw you retreating.\" The Prophet (ﷺ) said, \"I was shown Paradise and wanted to have a \nbunch of fruit from it. Had I taken it, you would have eaten from it as long as the world remains.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، رضى الله عنهما قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى، قَالُوا يَا رَسُولَ اللَّهِ، رَأَيْنَاكَ تَنَاوَلُ شَيْئًا فِي مَقَامِكَ، ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ‏.‏ قَالَ ‏\n\"‏ إِنِّي أُرِيتُ الْجَنَّةَ، فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا، وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 748In-book reference : Book 10, Hadith 142USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 715   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 749,
    "id": 749,
    "url": "https://sunnah.com/bukhari:749",
    "bookNumber": 10,
    "hadithNumber": 143,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) led us in prayer and then went up to the pulpit and beckoned with both hands towards the \nQibla of the mosque and then said, \"When I started leading you in prayer, I saw the display of \nParadise and Hell on the wall of the mosque (facing the Qibla). I never saw good and bad as I have \nseen today.\" He repeated the last statement thrice.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، قَالَ حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ صَلَّى لَنَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ رَقَا الْمِنْبَرَ، فَأَشَارَ بِيَدَيْهِ قِبَلَ قِبْلَةِ الْمَسْجِدِ ثُمَّ قَالَ ‏\n\"‏ لَقَدْ رَأَيْتُ الآنَ مُنْذُ صَلَّيْتُ لَكُمُ الصَّلاَةَ الْجَنَّةَ وَالنَّارَ مُمَثَّلَتَيْنِ فِي قِبْلَةِ هَذَا الْجِدَارِ، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ ‏\"‏ ثَلاَثًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 749In-book reference : Book 10, Hadith 143USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 716   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 750,
    "id": 750,
    "url": "https://sunnah.com/bukhari:750",
    "bookNumber": 10,
    "hadithNumber": 144,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"What is wrong with those people who look towards the sky during the prayer?\" His \ntalk grew stern while delivering this speech and he said, \"They should stop (looking towards the sky \nduring the prayer); otherwise their eyesight would be taken away.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، قَالَ حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي صَلاَتِهِمْ ‏\"‏‏.‏ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ حَتَّى قَالَ ‏\"‏ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 750In-book reference : Book 10, Hadith 144USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 717   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 751,
    "id": 751,
    "url": "https://sunnah.com/bukhari:751",
    "bookNumber": 10,
    "hadithNumber": 145,
    "narrator": "Narrated `Aisha:",
    "english": "I asked Allah's Messenger (ﷺ) about looking hither and thither in prayer. He replied, \"It is a way of stealing \nby which Satan takes away (a portion) from the prayer of a person.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، قَالَ حَدَّثَنَا أَشْعَثُ بْنُ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ الاِلْتِفَاتِ فِي الصَّلاَةِ فَقَالَ ‏\n\"‏ هُوَ اخْتِلاَسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلاَةِ الْعَبْدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 751In-book reference : Book 10, Hadith 145USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 718   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 752,
    "id": 752,
    "url": "https://sunnah.com/bukhari:752",
    "bookNumber": 10,
    "hadithNumber": 146,
    "narrator": "Narrated `Aisha:",
    "english": "Once the Prophet (ﷺ) prayed on a Khamisa with marks on it and said, \"The marks on it diverted my \nattention, take this Khamisa to Abu Jahm and bring an Inbijaniya (from him.)\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى فِي خَمِيصَةٍ لَهَا أَعْلاَمٌ فَقَالَ ‏\n\"‏ شَغَلَتْنِي أَعْلاَمُ هَذِهِ، اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَأْتُونِي بِأَنْبِجَانِيَّةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 752In-book reference : Book 10, Hadith 146USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 719   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 753,
    "id": 753,
    "url": "https://sunnah.com/bukhari:753",
    "bookNumber": 10,
    "hadithNumber": 147,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) saw expectoration in the direction of the Qibla of the mosque while he was leading the \nprayer, and scratched it off. After finishing the prayer, he said, \"Whenever any of you is in prayer he \nshould know that Allah is in front of him. So none should spit in front of him in the prayer.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ قَالَ رَأَى النَّبِيُّ صلى الله عليه وسلم نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ، وَهْوَ يُصَلِّي بَيْنَ يَدَىِ النَّاسِ، فَحَتَّهَا ثُمَّ قَالَ حِينَ انْصَرَفَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا كَانَ فِي الصَّلاَةِ فَإِنَّ اللَّهَ قِبَلَ وَجْهِهِ، فَلاَ يَتَنَخَّمَنَّ أَحَدٌ قِبَلَ وَجْهِهِ فِي الصَّلاَةِ ‏\"‏‏.‏ رَوَاهُ مُوسَى بْنُ عُقْبَةَ وَابْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 753In-book reference : Book 10, Hadith 147USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 720   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 754,
    "id": 754,
    "url": "https://sunnah.com/bukhari:754",
    "bookNumber": 10,
    "hadithNumber": 148,
    "narrator": "Narrated Anas:",
    "english": "While the Muslims were offering the Fajr prayer, Allah's Messenger (ﷺ) suddenly appeared before them by \nliving the curtain of the dwelling place of `Aisha, looked towards the Muslims who were standing in \nrows. He smiled with pleasure. Abu Bakr started retreating to join the row on the assumption that the \nProphet wanted to come out for the prayer. The Muslims intended to leave the prayer (and were on the \nverge of being put to trial), but the Prophet (ﷺ) beckoned them to complete their prayer and then he let the \ncurtain fall. He died in the last hours of that day.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسٌ، قَالَ بَيْنَمَا الْمُسْلِمُونَ فِي صَلاَةِ الْفَجْرِ لَمْ يَفْجَأْهُمْ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ فَنَظَرَ إِلَيْهِمْ وَهُمْ صُفُوفٌ، فَتَبَسَّمَ يَضْحَكُ، وَنَكَصَ أَبُو بَكْرٍ رضى الله عنه عَلَى عَقِبَيْهِ لِيَصِلَ لَهُ الصَّفَّ فَظَنَّ أَنَّهُ يُرِيدُ الْخُرُوجَ، وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ، فَأَشَارَ إِلَيْهِمْ أَتِمُّوا صَلاَتَكُمْ، فَأَرْخَى السِّتْرَ، وَتُوُفِّيَ مِنْ آخِرِ ذَلِكَ الْيَوْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 754In-book reference : Book 10, Hadith 148USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 721   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 755,
    "id": 755,
    "url": "https://sunnah.com/bukhari:755",
    "bookNumber": 10,
    "hadithNumber": 149,
    "narrator": "Narrated Jabir bin Samura:",
    "english": "The People of Kufa complained against Sa`d to `Umar and the latter dismissed him and appointed \n`Ammar as their chief . They lodged many complaints against Sa`d and even they alleged that he did \nnot pray properly. `Umar sent for him and said, \"O Aba 'Is-haq! These people claim that you do not \npray properly.\" Abu 'Is-haq said, \"By Allah, I used to pray with them a prayer similar to that of Allah's \nApostle and I never reduced anything of it. I used to prolong the first two rak`at of `Isha prayer and \nshorten the last two rak`at.\" `Umar said, \"O Aba 'Is-haq, this was what I thought about you.\" And then \nhe sent one or more persons with him to Kufa so as to ask the people about him. So they went there \nand did not leave any mosque without asking about him. All the people praised him till they came to \nthe mosque of the tribe of Bani `Abs; one of the men called Usama bin Qatada with a surname of Aba \nSa`da stood up and said, \"As you have put us under an oath; I am bound to tell you that Sa`d never \nwent himself with the army and never distributed (the war booty) equally and never did justice in legal \nverdicts.\" (On hearing it) Sa`d said, \"I pray to Allah for three things: O Allah! If this slave of yours is \na liar and got up for showing off, give him a long life, increase his poverty and put him to trials.\" (And \nso it happened). Later on when that person was asked how he was, he used to reply that he was an old \nman in trial as the result of Sa`d's curse. `Abdul Malik, the sub narrator, said that he had seen him \nafterwards and his eyebrows were overhanging his eyes owing to old age and he used to tease and \nassault the small girls in the way.",
    "arabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ شَكَا أَهْلُ الْكُوفَةِ سَعْدًا إِلَى عُمَرَ ـ رضى الله عنه ـ فَعَزَلَهُ وَاسْتَعْمَلَ عَلَيْهِمْ عَمَّارًا، فَشَكَوْا حَتَّى ذَكَرُوا أَنَّهُ لاَ يُحْسِنُ يُصَلِّي، فَأَرْسَلَ إِلَيْهِ فَقَالَ يَا أَبَا إِسْحَاقَ إِنَّ هَؤُلاَءِ يَزْعُمُونَ أَنَّكَ لاَ تُحْسِنُ تُصَلِّي قَالَ أَبُو إِسْحَاقَ أَمَّا أَنَا وَاللَّهِ فَإِنِّي كُنْتُ أُصَلِّي بِهِمْ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أَخْرِمُ عَنْهَا، أُصَلِّي صَلاَةَ الْعِشَاءِ فَأَرْكُدُ فِي الأُولَيَيْنِ وَأُخِفُّ فِي الأُخْرَيَيْنِ‏.‏ قَالَ ذَاكَ الظَّنُّ بِكَ يَا أَبَا إِسْحَاقَ‏.‏ فَأَرْسَلَ مَعَهُ رَجُلاً أَوْ رِجَالاً إِلَى الْكُوفَةِ، فَسَأَلَ عَنْهُ أَهْلَ الْكُوفَةِ، وَلَمْ يَدَعْ مَسْجِدًا إِلاَّ سَأَلَ عَنْهُ، وَيُثْنُونَ مَعْرُوفًا، حَتَّى دَخَلَ مَسْجِدًا لِبَنِي عَبْسٍ، فَقَامَ رَجُلٌ مِنْهُمْ يُقَالُ لَهُ أُسَامَةُ بْنُ قَتَادَةَ يُكْنَى أَبَا سَعْدَةَ قَالَ أَمَّا إِذْ نَشَدْتَنَا فَإِنَّ سَعْدًا كَانَ لاَ يَسِيرُ بِالسَّرِيَّةِ، وَلاَ يَقْسِمُ بِالسَّوِيَّةِ، وَلاَ يَعْدِلُ فِي الْقَضِيَّةِ‏.‏ قَالَ سَعْدٌ أَمَا وَاللَّهِ لأَدْعُوَنَّ بِثَلاَثٍ، اللَّهُمَّ إِنْ كَانَ عَبْدُكَ هَذَا كَاذِبًا، قَامَ رِيَاءً وَسُمْعَةً فَأَطِلْ عُمْرَهُ، وَأَطِلْ فَقْرَهُ، وَعَرِّضْهُ بِالْفِتَنِ، وَكَانَ بَعْدُ إِذَا سُئِلَ يَقُولُ شَيْخٌ كَبِيرٌ مَفْتُونٌ، أَصَابَتْنِي دَعْوَةُ سَعْدٍ‏.‏ قَالَ عَبْدُ الْمَلِكِ فَأَنَا رَأَيْتُهُ بَعْدُ قَدْ سَقَطَ حَاجِبَاهُ عَلَى عَيْنَيْهِ مِنَ الْكِبَرِ، وَإِنَّهُ لَيَتَعَرَّضُ لِلْجَوَارِي فِي الطُّرُقِ يَغْمِزُهُنَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 755In-book reference : Book 10, Hadith 149USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 722   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 756,
    "id": 756,
    "url": "https://sunnah.com/bukhari:756",
    "bookNumber": 10,
    "hadithNumber": 150,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever does not recite Al-Fatiha in his prayer, his prayer is invalid.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ صَلاَةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 756In-book reference : Book 10, Hadith 150USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 723   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 757,
    "id": 757,
    "url": "https://sunnah.com/bukhari:757",
    "bookNumber": 10,
    "hadithNumber": 151,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) entered the mosque and a person followed him. The man prayed and went to the \nProphet and greeted him. The Prophet (ﷺ) returned the greeting and said to him, \"Go back and pray, for \nyou have not prayed.\" The man went back prayed in the same way as before, returned and greeted the \nProphet who said, \"Go back and pray, for you have not prayed.\" This happened thrice. The man said, \n\"By Him Who sent you with the Truth, I cannot offer the prayer in a better way than this. Please, \nteach me how to pray.\" The Prophet (ﷺ) said, \"When you stand for Prayer say Takbir and then recite from \nthe Holy Qur'an (of what you know by heart) and then bow till you feel at ease. Then raise your head \nand stand up straight, then prostrate till you feel at ease during your prostration, then sit with calmness \ntill you feel at ease (do not hurry) and do the same in all your prayers.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ، فَدَخَلَ رَجُلٌ فَصَلَّى فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَرَدَّ وَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ فَرَجَعَ يُصَلِّي كَمَا صَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ثَلاَثًا‏.‏ فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أُحْسِنُ غَيْرَهُ فَعَلِّمْنِي‏.‏ فَقَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَكَبِّرْ، ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا، وَافْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 757In-book reference : Book 10, Hadith 151USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 724   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 758,
    "id": 758,
    "url": "https://sunnah.com/bukhari:758",
    "bookNumber": 10,
    "hadithNumber": 152,
    "narrator": "Narrated Jabir bin Samura:",
    "english": "Sa`d said, \"I used to pray with them a prayer similar to that of Allah's Messenger (ﷺ) (the prayer of Zuhr and \n`Asr) reducing nothing from them. I used to prolong the first two rak`at and shorten the last two \nrak`at.\" `Umar said to Sa`d \"This was what we thought about you.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ قَالَ سَعْدٌ كُنْتُ أُصَلِّي بِهِمْ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَتَىِ الْعَشِيِّ لاَ أَخْرِمُ عَنْهَا، أَرْكُدُ فِي الأُولَيَيْنِ وَأَحْذِفُ فِي الأُخْرَيَيْنِ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ ذَلِكَ الظَّنُّ بِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 758In-book reference : Book 10, Hadith 152USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 725   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 759,
    "id": 759,
    "url": "https://sunnah.com/bukhari:759",
    "bookNumber": 10,
    "hadithNumber": 153,
    "narrator": "Narrated `Abdullah bin Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) in Zuhr prayers used to recite Al-Fatiha along with two other Suras in \nthe first two rak`at: a long one in the first rak`a and a shorter (Sura) in the second, and at times the \nverses were audible. In the `Asr prayer the Prophet (ﷺ) used to recite Al-Fatiha and two more Suras in the \nfirst two rak`at and used to prolong the first rak`a. And he used to prolong the first rak`a of the Fajr \nprayer and shorten the second.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنْ صَلاَةِ الظُّهْرِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ، يُطَوِّلُ فِي الأُولَى، وَيُقَصِّرُ فِي الثَّانِيَةِ، وَيُسْمِعُ الآيَةَ أَحْيَانًا، وَكَانَ يَقْرَأُ فِي الْعَصْرِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ، وَكَانَ يُطَوِّلُ فِي الأُولَى، وَكَانَ يُطَوِّلُ فِي الرَّكْعَةِ الأُولَى مِنْ صَلاَةِ الصُّبْحِ، وَيُقَصِّرُ فِي الثَّانِيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 759In-book reference : Book 10, Hadith 153USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 726   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 760,
    "id": 760,
    "url": "https://sunnah.com/bukhari:760",
    "bookNumber": 10,
    "hadithNumber": 154,
    "narrator": "Narrated Abu Ma`mar:",
    "english": "I asked Khabbab whether the Prophet (ﷺ) used to recite the Qur'an in the Zuhr and the `Asr prayers. He \nreplied in the affirmative. We said, \"How did you come to know that?\" He said, \"From the movement \nof his beard.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي عُمَارَةُ، عَنْ أَبِي مَعْمَرٍ، قَالَ سَأَلْنَا خَبَّابًا أَكَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ‏.‏ قُلْنَا بِأَىِّ شَىْءٍ كُنْتُمْ تَعْرِفُونَ قَالَ بِاضْطِرَابِ لِحْيَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 760In-book reference : Book 10, Hadith 154USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 761,
    "id": 761,
    "url": "https://sunnah.com/bukhari:761",
    "bookNumber": 10,
    "hadithNumber": 155,
    "narrator": "Narrated Abu Ma`mar:",
    "english": "I asked Khabbab bin Al-Art whether the Prophet (ﷺ) used to recite the Qur'an in the Zuhr and the `Asr \nprayers. He replied in the affirmative. I said, \"How did you come to know that?\" He replied, \"From \nthe movement of his beard.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، قَالَ قُلْتُ لِخَبَّابِ بْنِ الأَرَتِّ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ‏.‏ قَالَ قُلْتُ بِأَىِّ شَىْءٍ كُنْتُمْ تَعْلَمُونَ قِرَاءَتَهُ قَالَ بِاضْطِرَابِ لِحْيَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 761In-book reference : Book 10, Hadith 155USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 728   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 762,
    "id": 762,
    "url": "https://sunnah.com/bukhari:762",
    "bookNumber": 10,
    "hadithNumber": 156,
    "narrator": "Narrated `Abdullah bin Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) used to recite Al-Fatiha along with another Sura in the first two rak`at of \nthe Zuhr and the `Asr prayers and at times a verse or so was audible to us.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ هِشَامٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الرَّكْعَتَيْنِ مِنَ الظُّهْرِ وَالْعَصْرِ بِفَاتِحَةِ الْكِتَابِ، وَسُورَةٍ سُورَةٍ، وَيُسْمِعُنَا الآيَةَ أَحْيَانًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 762In-book reference : Book 10, Hadith 156USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 729   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 763,
    "id": 763,
    "url": "https://sunnah.com/bukhari:763",
    "bookNumber": 10,
    "hadithNumber": 157,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(My mother) Umu-l-Fadl heard me reciting \"Wal Mursalati `Urfan\" (77) and said, \"O my son! By \nAllah, your recitation made me remember that it was the last Sura I heard from Allah's Messenger (ﷺ). He \nrecited it in the Maghrib prayer. \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ إِنَّ أُمَّ الْفَضْلِ سَمِعَتْهُ وَهُوَ يَقْرَأُ ‏{‏وَالْمُرْسَلاَتِ عُرْفًا‏}‏ فَقَالَتْ يَا بُنَىَّ وَاللَّهِ لَقَدْ ذَكَّرْتَنِي بِقِرَاءَتِكَ هَذِهِ السُّورَةَ، إِنَّهَا لآخِرُ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهَا فِي الْمَغْرِبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 763In-book reference : Book 10, Hadith 157USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 730   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 764,
    "id": 764,
    "url": "https://sunnah.com/bukhari:764",
    "bookNumber": 10,
    "hadithNumber": 158,
    "narrator": "Narrated Marwan bin Al-Hakam:",
    "english": "Zaid bin Thabit said to me, \"Why do you recite very short Suras in the Maghrib prayer while I heard \nthe Prophet (ﷺ) reciting the longer of the two long Suras?\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ، قَالَ قَالَ لِي زَيْدُ بْنُ ثَابِتٍ مَا لَكَ تَقْرَأُ فِي الْمَغْرِبِ بِقِصَارٍ، وَقَدْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ بِطُولِ الطُّولَيَيْنِ",
    "reference": "Reference : Sahih al-Bukhari 764In-book reference : Book 10, Hadith 158USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 731   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 765,
    "id": 765,
    "url": "https://sunnah.com/bukhari:765",
    "bookNumber": 10,
    "hadithNumber": 159,
    "narrator": "Narrated Jubair bin Mut`im:",
    "english": "My father said, \"I heard Allah's Messenger (ﷺ) reciting \"at-Tur\" (52) in the Maghrib prayer.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ فِي الْمَغْرِبِ بِالطُّورِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 765In-book reference : Book 10, Hadith 159USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 732   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 766,
    "id": 766,
    "url": "https://sunnah.com/bukhari:766",
    "bookNumber": 10,
    "hadithNumber": 160,
    "narrator": "Narrated Abu Rafi`:",
    "english": "I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and \nprostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited \nthat Sura) and I will go on doing it till I meet him.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، عَنْ بَكْرٍ، عَنْ أَبِي رَافِعٍ، قَالَ صَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ فَقُلْتُ لَهُ قَالَ سَجَدْتُ خَلْفَ أَبِي الْقَاسِمِ صلى الله عليه وسلم فَلاَ أَزَالُ أَسْجُدُ بِهَا حَتَّى أَلْقَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 766In-book reference : Book 10, Hadith 160USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 733   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 767,
    "id": 767,
    "url": "https://sunnah.com/bukhari:767",
    "bookNumber": 10,
    "hadithNumber": 161,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) was on a journey and recited in one of the first two rak`at of the `Isha' prayer \"Wa t-teeni \nwa z-zaitun.\" (95)",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، قَالَ سَمِعْتُ الْبَرَاءَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي سَفَرٍ فَقَرَأَ فِي الْعِشَاءِ فِي إِحْدَى الرَّكْعَتَيْنِ بِالتِّينِ وَالزَّيْتُونِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 767In-book reference : Book 10, Hadith 161USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 734   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 768,
    "id": 768,
    "url": "https://sunnah.com/bukhari:768",
    "bookNumber": 10,
    "hadithNumber": 162,
    "narrator": "Narrated Abu Rafi`:",
    "english": "Once I prayed the `Isha' prayer with Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and \nprostrated. I said, \"What is that?\" He said, \"I prostrated behind Abul-Qasim, (the Prophet) (when he \nrecited that Sura) and I will go on doing it till I meet him.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنِي التَّيْمِيُّ، عَنْ بَكْرٍ، عَنْ أَبِي رَافِعٍ، قَالَ صَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ فَقُلْتُ مَا هَذِهِ قَالَ سَجَدْتُ بِهَا خَلْفَ أَبِي الْقَاسِمِ صلى الله عليه وسلم فَلاَ أَزَالُ أَسْجُدُ بِهَا حَتَّى أَلْقَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 768In-book reference : Book 10, Hadith 162USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 735   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 769,
    "id": 769,
    "url": "https://sunnah.com/bukhari:769",
    "bookNumber": 10,
    "hadithNumber": 163,
    "narrator": "Narrated Al-Bara:",
    "english": "I heard the Prophet (ﷺ) reciting wa t-teeni wa z-zaitun\" (95) in the `Isha' prayer, and I never heard a \nsweeter voice or a better way of recitation than that of the Prophet.",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا مِسْعَرٌ، قَالَ حَدَّثَنَا عَدِيُّ بْنُ ثَابِتٍ، سَمِعَ الْبَرَاءَ، رضى الله عنه قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ ‏{‏وَالتِّينِ وَالزَّيْتُونِ‏}‏ فِي الْعِشَاءِ، وَمَا سَمِعْتُ أَحَدًا أَحْسَنَ صَوْتًا مِنْهُ أَوْ قِرَاءَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 769In-book reference : Book 10, Hadith 163USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 736   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 770,
    "id": 770,
    "url": "https://sunnah.com/bukhari:770",
    "bookNumber": 10,
    "hadithNumber": 164,
    "narrator": "Narrated Jabir bin Samura:",
    "english": "`Umar said to Sa`d, \"The people complained against you in everything, even in prayer.\" Sa`d replied, \n\"Really I used to prolong the first two rak`at and shorten the last two and I will never shorten the \nprayer in which I follow Allah's Messenger (ﷺ).\" `Umar said, \"You are telling the truth and that is what I \nthink a tout you.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَوْنٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ قَالَ عُمَرُ لِسَعْدٍ لَقَدْ شَكَوْكَ فِي كُلِّ شَىْءٍ حَتَّى الصَّلاَةِ‏.‏ قَالَ أَمَّا أَنَا فَأَمُدُّ فِي الأُولَيَيْنِ، وَأَحْذِفُ فِي الأُخْرَيَيْنِ، وَلاَ آلُو مَا اقْتَدَيْتُ بِهِ مِنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ صَدَقْتَ، ذَاكَ الظَّنُّ بِكَ، أَوْ ظَنِّي بِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 770In-book reference : Book 10, Hadith 164USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 737   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 771,
    "id": 771,
    "url": "https://sunnah.com/bukhari:771",
    "bookNumber": 10,
    "hadithNumber": 165,
    "narrator": "Narrated Saiyar bin Salama:",
    "english": "My father and I went to Abu Barza-al-Aslami to ask him about the stated times for the prayers. He \nreplied, \"The Prophet (ﷺ) used to offer the Zuhr prayer when the sun just declined from its highest \nposition at noon; the `Asr at a time when if a man went to the farthest place in Medina (after praying) \nhe would find the sun still hot (bright). (The sub narrator said: I have forgotten what Abu Barza said \nabout the Maghrib prayer). The Prophet (ﷺ) never found any harm in delaying the `Isha' prayer to the first \nthird of the night and he never liked to sleep before it and to talk after it. He used to offer the morning \nprayer at a time when after finishing it one could recognize the person sitting beside him and used to \nrecite between 60 to 100 verses in one or both the rak`at.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا سَيَّارُ بْنُ سَلاَمَةَ، قَالَ دَخَلْتُ أَنَا وَأَبِي، عَلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ فَسَأَلْنَاهُ عَنْ وَقْتِ الصَّلَوَاتِ، فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ حِينَ تَزُولُ الشَّمْسُ، وَالْعَصْرَ وَيَرْجِعُ الرَّجُلُ إِلَى أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ، وَلاَ يُبَالِي بِتَأْخِيرِ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ وَلاَ يُحِبُّ النَّوْمَ قَبْلَهَا، وَلاَ الْحَدِيثَ بَعْدَهَا، وَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ الرَّجُلُ فَيَعْرِفُ جَلِيسَهُ، وَكَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ أَوْ إِحْدَاهُمَا مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 771In-book reference : Book 10, Hadith 165USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 738   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 772,
    "id": 772,
    "url": "https://sunnah.com/bukhari:772",
    "bookNumber": 10,
    "hadithNumber": 166,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Qur'an is recited in every prayer and in those prayers in which Allah's Messenger (ﷺ) recited aloud for \nus, we recite aloud in the same prayers for you; and the prayers in which the Prophet (ﷺ) recited quietly, \nwe recite quietly. If you recite \"Al-Fatiha\" only it is sufficient but if you recite something else in \naddition, it is better.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ فِي كُلِّ صَلاَةٍ يُقْرَأُ، فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَسْمَعْنَاكُمْ، وَمَا أَخْفَى عَنَّا أَخْفَيْنَا عَنْكُمْ، وَإِنْ لَمْ تَزِدْ عَلَى أُمِّ الْقُرْآنِ أَجْزَأَتْ، وَإِنْ زِدْتَ فَهُوَ خَيْرٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 772In-book reference : Book 10, Hadith 166USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 739   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 773,
    "id": 773,
    "url": "https://sunnah.com/bukhari:773",
    "bookNumber": 10,
    "hadithNumber": 167,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) set out with the intention of going to Suq `Ukaz (market of `Ukaz) along with some of his \ncompanions. At the same time, a barrier was put between the devils and the news of heaven. Fire \ncommenced to be thrown at them. The Devils went to their people, who asked them, \"What is wrong \nwith you?\" They said, \"A barrier has been placed between us and the news of heaven. And fire has \nbeen thrown at us.\" They said, \"The thing which has put a barrier between you and the news of heaven \nmust be something which has happened recently. Go eastward and westward and see what has put a \nbarrier between you and the news of heaven.\" Those who went towards Tuhama came across the \nProphet at a place called Nakhla and it was on the way to Suq `Ukaz and the Prophet (ﷺ) was offering the \nFajr prayer with his companions. When they heard the Qur'an they listened to it and said, \"By Allah, \nthis is the thing which has put a barrier between us and the news of heaven.\" They went to their people \nand said, \"O our people; verily we have heard a wonderful recital (Qur'an) which shows the true path; \nwe believed in it and would not ascribe partners to our Lord.\" Allah revealed the following verses to \nhis Prophet (Sura 'Jinn') (72): \"Say: It has been revealed to me.\" And what was revealed to him was \nthe conversation of the Jinns.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ، وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ، فَرَجَعَتِ الشَّيَاطِينُ إِلَى قَوْمِهِمْ‏.‏ فَقَالُوا مَا لَكُمْ فَقَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ‏.‏ قَالُوا مَا حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ إِلاَّ شَىْءٌ حَدَثَ، فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا، فَانْظُرُوا مَا هَذَا الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ فَانْصَرَفَ أُولَئِكَ الَّذِينَ تَوَجَّهُوا نَحْوَ تِهَامَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ بِنَخْلَةَ، عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَهْوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ، فَلَمَّا سَمِعُوا الْقُرْآنَ اسْتَمَعُوا لَهُ فَقَالُوا هَذَا وَاللَّهِ الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ فَهُنَالِكَ حِينَ رَجَعُوا إِلَى قَوْمِهِمْ وَقَالُوا يَا قَوْمَنَا ‏{‏إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا‏}‏ فَأَنْزَلَ اللَّهُ عَلَى نَبِيِّهِ صلى الله عليه وسلم ‏{‏قُلْ أُوحِيَ إِلَىَّ‏}‏ وَإِنَّمَا أُوحِيَ إِلَيْهِ قَوْلُ الْجِنِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 773In-book reference : Book 10, Hadith 167USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 740   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 774,
    "id": 774,
    "url": "https://sunnah.com/bukhari:774",
    "bookNumber": 10,
    "hadithNumber": 168,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) recited aloud in the prayers in which he was ordered to do so and quietly in the prayers in \nwhich he was ordered to do so. \"And your Lord is not forgetful.\" \"Verily there was a good example \nfor you in the ways of the Prophet.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَرَأَ النَّبِيُّ صلى الله عليه وسلم فِيمَا أُمِرَ، وَسَكَتَ فِيمَا أُمِرَ ‏{‏وَمَا كَانَ رَبُّكَ نَسِيًّا‏}‏ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 774In-book reference : Book 10, Hadith 168USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 741   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 775,
    "id": 775,
    "url": "https://sunnah.com/bukhari:775",
    "bookNumber": 10,
    "hadithNumber": 170,
    "narrator": "Narrated Abu Wa'il:",
    "english": "A man came to Ibn Mas`ud and said, \"I recited the Mufassal (Suras) at night in one rak`a.\" Ibn \nMas`ud said, \"This recitation is (too quick) like the recitation of poetry. I know the identical Suras \nwhich the Prophet (ﷺ) used to recite in pairs.\" Ibn Mas`ud then mentioned 20 Mufassal Suras including \ntwo Suras from the family of (i.e. those verses which begin with) Ha, Meem [??] (which the Prophet (ﷺ) \nused to recite) in each rak`a.",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ مَسْعُودٍ فَقَالَ قَرَأْتُ الْمُفَصَّلَ اللَّيْلَةَ فِي رَكْعَةٍ‏.‏ فَقَالَ هَذًّا كَهَذِّ الشِّعْرِ لَقَدْ عَرَفْتُ النَّظَائِرَ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرِنُ بَيْنَهُنَّ فَذَكَرَ عِشْرِينَ سُورَةً مِنَ الْمُفَصَّلِ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 775In-book reference : Book 10, Hadith 170USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 742   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 776,
    "id": 776,
    "url": "https://sunnah.com/bukhari:776",
    "bookNumber": 10,
    "hadithNumber": 171,
    "narrator": "Narrated `Abdullah bin Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) uses to recite Al-Fatiha followed by another Sura in the first two rak`at \nof the prayer and used to recite only Al-Fatiha in the last two rak`at of the Zuhr prayer. Sometimes a \nverse or so was audible and he used to prolong the first rak`a more than the second and used to do the \nsame in the `Asr and Fajr prayers.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الظُّهْرِ فِي الأُولَيَيْنِ بِأُمِّ الْكِتَابِ وَسُورَتَيْنِ، وَفِي الرَّكْعَتَيْنِ الأُخْرَيَيْنِ بِأُمِّ الْكِتَابِ، وَيُسْمِعُنَا الآيَةَ، وَيُطَوِّلُ فِي الرَّكْعَةِ الأُولَى مَا لاَ يُطَوِّلُ فِي الرَّكْعَةِ الثَّانِيَةِ، وَهَكَذَا فِي الْعَصْرِ وَهَكَذَا فِي الصُّبْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 776In-book reference : Book 10, Hadith 171USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 743   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 777,
    "id": 777,
    "url": "https://sunnah.com/bukhari:777",
    "bookNumber": 10,
    "hadithNumber": 172,
    "narrator": "Narrated Abu Ma`mar:",
    "english": "We said to Khabbab \"Did Allah's Messenger (ﷺ) used to recite in Zuhr and `Asr prayers?\" He replied in the \naffirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his \nbeard.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، قُلْتُ لِخَبَّابٍ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ‏.‏ قُلْنَا مِنْ أَيْنَ عَلِمْتَ قَالَ بِاضْطِرَابِ لِحْيَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 777In-book reference : Book 10, Hadith 172USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 744   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 778,
    "id": 778,
    "url": "https://sunnah.com/bukhari:778",
    "bookNumber": 10,
    "hadithNumber": 173,
    "narrator": "Narrated `Abdullah bin Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) used to recite Al-Fatiha along with another Sura in the first two rak`at of \nthe Zuhr and `Asr prayers. A verse or so was audible at times and he used to prolong the first rak`a.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ بِأُمِّ الْكِتَابِ وَسُورَةٍ مَعَهَا فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنْ صَلاَةِ الظُّهْرِ وَصَلاَةِ الْعَصْرِ، وَيُسْمِعُنَا الآيَةَ أَحْيَانًا، وَكَانَ يُطِيلُ فِي الرَّكْعَةِ الأُولَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 778In-book reference : Book 10, Hadith 173USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 745   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 779,
    "id": 779,
    "url": "https://sunnah.com/bukhari:779",
    "bookNumber": 10,
    "hadithNumber": 174,
    "narrator": "Narrated `Abdullah bin Abi Qatada:",
    "english": "My father said, \"The Prophet (ﷺ) used to prolong the first rak`a of the Zuhr prayer and shorten the second \none and used to do the same in the Fajr prayer.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُطَوِّلُ فِي الرَّكْعَةِ الأُولَى مِنْ صَلاَةِ الظُّهْرِ، وَيُقَصِّرُ فِي الثَّانِيَةِ، وَيَفْعَلُ ذَلِكَ فِي صَلاَةِ الصُّبْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 779In-book reference : Book 10, Hadith 174USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 746   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 780,
    "id": 780,
    "url": "https://sunnah.com/bukhari:780",
    "bookNumber": 10,
    "hadithNumber": 175,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Say Amin\" when the Imam says it and if the Amin of any one of you coincides \nwith that of the angels then all his past sins will be forgiven.\" Ibn Shihab said, \"Allah's Messenger (ﷺ) used \nto Say \"Amin.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ وَقَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ آمِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 780In-book reference : Book 10, Hadith 175USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 747   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 781,
    "id": 781,
    "url": "https://sunnah.com/bukhari:781",
    "bookNumber": 10,
    "hadithNumber": 176,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If any one of you says, \"Amin\" and the angels in the heavens say \"Amin\" and \nthe former coincides with the latter, all his past sins will be forgiven.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَالَ أَحَدُكُمْ آمِينَ‏.‏ وَقَالَتِ الْمَلاَئِكَةُ فِي السَّمَاءِ آمِينَ‏.‏ فَوَافَقَتْ إِحْدَاهُمَا الأُخْرَى، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 781In-book reference : Book 10, Hadith 176USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 748   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 782,
    "id": 782,
    "url": "https://sunnah.com/bukhari:782",
    "bookNumber": 10,
    "hadithNumber": 177,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Say Amen when the Imam says 'Ghairi l-maghdubi `alaihim wala d-daalleen' \n(not the path of those who earn Your Anger (such as Jews) nor of those who go astray (such as \nChristians)); all the past sins of the person whose saying (of Amin) coincides with that of the angels, \nwill be forgiven\".",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَالَ الإِمَامُ ‏{‏غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ‏}‏ فَقُولُوا آمِينَ‏.‏ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَنُعَيْمٌ الْمُجْمِرُ عَنْ أَبِي هُرَيْرَةَ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 782In-book reference : Book 10, Hadith 177USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 749   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 783,
    "id": 783,
    "url": "https://sunnah.com/bukhari:783",
    "bookNumber": 10,
    "hadithNumber": 178,
    "narrator": "Narrated Abu Bakra:",
    "english": "I reached the Prophet (ﷺ) in the mosque while he was bowing in prayer and I too bowed before joining the \nrow mentioned it to the Prophet (ﷺ) and he said to me, \"May Allah increase your love for the good. But do \nnot repeat it again (bowing in that way).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنِ الأَعْلَمِ ـ وَهْوَ زِيَادٌ ـ عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، أَنَّهُ انْتَهَى إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ رَاكِعٌ، فَرَكَعَ قَبْلَ أَنْ يَصِلَ إِلَى الصَّفِّ، فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ زَادَكَ اللَّهُ حِرْصًا وَلاَ تَعُدْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 783In-book reference : Book 10, Hadith 178USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 750   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 784,
    "id": 784,
    "url": "https://sunnah.com/bukhari:784",
    "bookNumber": 10,
    "hadithNumber": 179,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "I offered the prayer with `Ali in Basra and he made us remember the prayer which we used to pray \nwith Allah's Messenger (ﷺ). `Ali said Takbir on each rising and bowing.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ صَلَّى مَعَ عَلِيٍّ ـ رضى الله عنه ـ بِالْبَصْرَةِ فَقَالَ ذَكَّرَنَا هَذَا الرَّجُلُ صَلاَةً كُنَّا نُصَلِّيهَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَذَكَرَ أَنَّهُ كَانَ يُكَبِّرُ كُلَّمَا رَفَعَ وَكُلَّمَا وَضَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 784In-book reference : Book 10, Hadith 179USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 751   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 785,
    "id": 785,
    "url": "https://sunnah.com/bukhari:785",
    "bookNumber": 10,
    "hadithNumber": 180,
    "narrator": "Narrated Abu Salama:",
    "english": "When Abu Huraira led us in prayer he used to say Takbir on each bowing and rising. On the \ncompletion of the prayer he used to say, \"My prayer is more similar to the prayer of Allah's Messenger (ﷺ) \nthan that of anyone of you.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُصَلِّي بِهِمْ، فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ، فَإِذَا انْصَرَفَ قَالَ إِنِّي لأَشْبَهُكُمْ صَلاَةً بِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 785In-book reference : Book 10, Hadith 180USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 752   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 786,
    "id": 786,
    "url": "https://sunnah.com/bukhari:786",
    "bookNumber": 10,
    "hadithNumber": 181,
    "narrator": "Narrated Mutarrif bin `Abdullah:",
    "english": "`Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib. When `Ali prostrated, he said \nthe Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said \nthe Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me \nremember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ، قَالَ صَلَّيْتُ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ رضى الله عنه ـ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ،، فَكَانَ إِذَا سَجَدَ كَبَّرَ، وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ، وَإِذَا نَهَضَ مِنَ الرَّكْعَتَيْنِ كَبَّرَ، فَلَمَّا قَضَى الصَّلاَةَ أَخَذَ بِيَدِي عِمْرَانُ بْنُ حُصَيْنٍ فَقَالَ قَدْ ذَكَّرَنِي هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم‏.‏ أَوْ قَالَ لَقَدْ صَلَّى بِنَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 786In-book reference : Book 10, Hadith 181USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 753   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 787,
    "id": 787,
    "url": "https://sunnah.com/bukhari:787",
    "bookNumber": 10,
    "hadithNumber": 182,
    "narrator": "Narrated `Ikrima:",
    "english": "I saw a person praying at Muqam-Ibrahim (the place of Abraham by the Ka`ba) and he was saying \nTakbir on every bowing, rising, standing and sitting. I asked Ibn `Abbas (about this prayer). He \nadmonished me saying: \"Isn't that the prayer of the Prophet?\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ عِكْرِمَةَ، قَالَ رَأَيْتُ رَجُلاً عِنْدَ الْمَقَامِ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَإِذَا قَامَ وَإِذَا وَضَعَ، فَأَخْبَرْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ أَوَلَيْسَ تِلْكَ صَلاَةَ النَّبِيِّ صلى الله عليه وسلم لاَ أُمَّ لَكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 787In-book reference : Book 10, Hadith 182USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 754   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 788,
    "id": 788,
    "url": "https://sunnah.com/bukhari:788",
    "bookNumber": 10,
    "hadithNumber": 183,
    "narrator": "Narrated `Ikrima:",
    "english": "I prayed behind a Sheikh at Mecca and he said twenty two Takbirs (during the prayer). I told Ibn \n`Abbas that he (i.e. that Sheikh) was foolish. Ibn `Abbas admonished me and said, \"This is the \ntradition of Abul-Qasim.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ أَخْبَرَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، قَالَ صَلَّيْتُ خَلْفَ شَيْخٍ بِمَكَّةَ فَكَبَّرَ ثِنْتَيْنِ وَعِشْرِينَ تَكْبِيرَةً، فَقُلْتُ لاِبْنِ عَبَّاسٍ إِنَّهُ أَحْمَقُ‏.‏ فَقَالَ ثَكِلَتْكَ أُمُّكَ، سُنَّةُ أَبِي الْقَاسِمِ صلى الله عليه وسلم‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا عِكْرِمَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 788In-book reference : Book 10, Hadith 183USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 755   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 789,
    "id": 789,
    "url": "https://sunnah.com/bukhari:789",
    "bookNumber": 10,
    "hadithNumber": 184,
    "narrator": "And narrated Abu Huraira:",
    "english": "Whenever Allah's Messenger (ﷺ) stood for the prayer, \nhe said Takbir on starting the prayer and then on bowing. On rising from bowing he said, \"Sami`a llahu \nliman hamidah,\" and then while standing straight he used to say, \"Rabbana laka-l hamd\" (Al- \nLaith said, \"(The Prophet (ﷺ) said), 'Wa laka l-hamd'.\" He used to say Takbir on prostrating and on raising \nhis head from prostration; again he would Say Takbir on prostrating and raising his head. He would \nthen do the same in the whole of the prayer till it was completed. On rising from the second rak`a \n(after sitting for at-Tahiyyat), he used to say Takbir.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ إِلَى الصَّلاَةِ يُكَبِّرُ حِينَ يَقُومُ، ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ، ثُمَّ يَقُولُ سَمِعَ اللَّهُ لَمِنْ حَمِدَهُ‏.‏ حِينَ يَرْفَعُ صُلْبَهُ مِنَ الرَّكْعَةِ، ثُمَّ يَقُولُ وَهُوَ قَائِمٌ رَبَّنَا لَكَ الْحَمْدُ ـ قَالَ عَبْدُ اللَّهِ ‏{‏بْنُ صَالِحٍ عَنِ اللَّيْثِ‏}‏ وَلَكَ الْحَمْدُ ـ ثُمَّ يُكَبِّرُ حِينَ يَهْوِي، ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ، ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ، ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ، ثُمَّ يَفْعَلُ ذَلِكَ فِي الصَّلاَةِ كُلِّهَا حَتَّى يَقْضِيَهَا، وَيُكَبِّرُ حِينَ يَقُومُ مِنَ الثِّنْتَيْنِ بَعْدَ الْجُلُوسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 789In-book reference : Book 10, Hadith 184USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 755   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 790,
    "id": 790,
    "url": "https://sunnah.com/bukhari:790",
    "bookNumber": 10,
    "hadithNumber": 185,
    "narrator": "Narrated Mus`ab bin Sa`d:",
    "english": "I offered prayer beside my father and approximated both my hands and placed them in between the \nknees. My father told me not to do so and said, \"We used to do the same but we were forbidden (by \nthe Prophet) to do it and were ordered to place the hands on the knees.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي يَعْفُورٍ، قَالَ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ، يَقُولُ صَلَّيْتُ إِلَى جَنْبِ أَبِي فَطَبَّقْتُ بَيْنَ كَفَّىَّ ثُمَّ وَضَعْتُهُمَا بَيْنَ فَخِذَىَّ، فَنَهَانِي أَبِي وَقَالَ كُنَّا نَفْعَلُهُ فَنُهِينَا عَنْهُ، وَأُمِرْنَا أَنْ نَضَعَ أَيْدِيَنَا عَلَى الرُّكَبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 790In-book reference : Book 10, Hadith 185USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 756   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 791,
    "id": 791,
    "url": "https://sunnah.com/bukhari:791",
    "bookNumber": 10,
    "hadithNumber": 186,
    "narrator": "Narrated Zaid bin Wahb:",
    "english": "Hudhaifa saw a person who was not performing the bowing and prostration perfectly. He said to him, \n\"You have not prayed and if you should die you would die on a religion other than that of \nMuhammad.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، قَالَ رَأَى حُذَيْفَةُ رَجُلاً لاَ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ قَالَ مَا صَلَّيْتَ، وَلَوْ مُتَّ مُتَّ عَلَى غَيْرِ الْفِطْرَةِ الَّتِي فَطَرَ اللَّهُ مُحَمَّدًا صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 791In-book reference : Book 10, Hadith 186USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 757   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 792,
    "id": 792,
    "url": "https://sunnah.com/bukhari:792",
    "bookNumber": 10,
    "hadithNumber": 187,
    "narrator": "Narrated Al-Bara:",
    "english": "The bowing, the prostration the sitting in between the two prostrations and the standing after the \nbowing of the Prophet (ﷺ) but not qiyam (standing in the prayer) and qu`ud (sitting in the prayer) used to \nbe approximately equal (in duration).",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي الْحَكَمُ، عَنِ ابْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ، قَالَ كَانَ رُكُوعُ النَّبِيِّ صلى الله عليه وسلم وَسُجُودُهُ وَبَيْنَ السَّجْدَتَيْنِ وَإِذَا رَفَعَ مِنَ الرُّكُوعِ، مَا خَلاَ الْقِيَامَ وَالْقُعُودَ، قَرِيبًا مِنَ السَّوَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 792In-book reference : Book 10, Hadith 187USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 758   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 793,
    "id": 793,
    "url": "https://sunnah.com/bukhari:793",
    "bookNumber": 10,
    "hadithNumber": 188,
    "narrator": "Narrated Abu Huraira:",
    "english": "Once the Prophet (ﷺ) entered the mosque, a man came in, offered the prayer and greeted the Prophet. The \nProphet returned his greeting and said to him, \"Go back and pray again for you have not prayed.\" The \nman offered the prayer again, came back and greeted the Prophet. He said to him thrice, \"Go back and \npray again for you have not prayed.\" The man said, \"By Him Who has sent you with the truth! I do \nnot know a better way of praying. Kindly teach Me how to pray.\" He said, \"When you stand for the \nprayer, say Takbir and then recite from the Qur'an what you know and then bow with calmness till \nyou feel at ease, then rise from bowing till you stand straight. Afterwards prostrate calmly till you feel \nat ease and then raise (your head) and sit with Calmness till you feel at ease and then prostrate with \ncalmness till you feel at ease in prostration and do the same in the whole of your prayer.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَرَدَّ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ السَّلاَمَ فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ فَصَلَّى، ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ ثَلاَثًا‏.‏ فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ فَمَا أُحْسِنُ غَيْرَهُ فَعَلِّمْنِي‏.‏ قَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَكَبِّرْ، ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 793In-book reference : Book 10, Hadith 188USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 759   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 794,
    "id": 794,
    "url": "https://sunnah.com/bukhari:794",
    "bookNumber": 10,
    "hadithNumber": 189,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to say in his bowing and prostrations, \"Subhanaka l-lahumma Rabbana wa \nbihamdika; Allahumma ghfir li.' (Exalted [from unbecoming attributes] Are you O Allah our Lord, \nand by Your praise [do I exalt you]. O Allah! Forgive me).",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ ‏\n\"‏ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 794In-book reference : Book 10, Hadith 189USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 760   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 795,
    "id": 795,
    "url": "https://sunnah.com/bukhari:795",
    "bookNumber": 10,
    "hadithNumber": 190,
    "narrator": "Narrated Abu Huraira:",
    "english": "When the Prophet (ﷺ) said, \"Sami`a l-lahu liman hamidah,\" (Allah heard those who sent praises to Him), \nhe would say, \"Rabbana wa laka l-hamd.\" On bowing and raising his head from it the Prophet (ﷺ) used to \nsay Takbir. He also used to say Takbir on rising after the two prostrations. (See Hadith No. 656).",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ قَالَ ‏\"‏ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ يُكَبِّرُ، وَإِذَا قَامَ مِنَ السَّجْدَتَيْنِ قَالَ ‏\"‏ اللَّهُ أَكْبَرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 795In-book reference : Book 10, Hadith 190USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 761   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 796,
    "id": 796,
    "url": "https://sunnah.com/bukhari:796",
    "bookNumber": 10,
    "hadithNumber": 191,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When the Imam says, \"Sami`a l-lahu liman hamidah,\" you should say, \n\"Allahumma Rabbana laka l-hamd.\" And if the saying of any one of you coincides with that of the \nangels, all his past sins will be forgiven.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَالَ الإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ‏.‏ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 796In-book reference : Book 10, Hadith 191USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 762   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 797,
    "id": 797,
    "url": "https://sunnah.com/bukhari:797",
    "bookNumber": 10,
    "hadithNumber": 192,
    "narrator": "Narrated Abu Salama:",
    "english": "Abu Hurairah said, \"No doubt, my Salat is similar to that of the Prophet (ﷺ).\" Abu Hurairah used to recite Qunut after saying Sami' Allahu liman hamida in the last Rak'a of the Zuhr, Isha and Fajr Prayers. He would ask Allah's Forgiveness for the true believers and curse the disbelievers.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لأُقَرِّبَنَّ صَلاَةَ النَّبِيِّ صلى الله عليه وسلم‏.‏ فَكَانَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ يَقْنُتُ فِي الرَّكْعَةِ الآخِرَةِ مِنْ صَلاَةِ الظُّهْرِ وَصَلاَةِ الْعِشَاءِ، وَصَلاَةِ الصُّبْحِ، بَعْدَ مَا يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَيَدْعُو لِلْمُؤْمِنِينَ وَيَلْعَنُ الْكُفَّارَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 797In-book reference : Book 10, Hadith 192USC-MSA web (English) reference : Vol. 1, Book 11, Hadith 762   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 798,
    "id": 798,
    "url": "https://sunnah.com/bukhari:798",
    "bookNumber": 10,
    "hadithNumber": 193,
    "narrator": "Narrated Anas:",
    "english": "The qunut [supplication before going down for prostration] used to be recited in the Maghrib and the \nFajr prayers.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ الْقُنُوتُ فِي الْمَغْرِبِ وَالْفَجْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 798In-book reference : Book 10, Hadith 193USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 763   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 799,
    "id": 799,
    "url": "https://sunnah.com/bukhari:799",
    "bookNumber": 10,
    "hadithNumber": 194,
    "narrator": "Narrated Rifa`a bin Rafi` Az-Zuraqi:",
    "english": "One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a \nl-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban \nmubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the \nProphet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The \nProphet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and \nstood straight till all the vertebrae of his spinal column came to a natural position.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلاَّدٍ الزُّرَقِيِّ، عَنْ أَبِيهِ، عَنْ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ، قَالَ كُنَّا يَوْمًا نُصَلِّي وَرَاءَ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا رَفَعَ رَأْسَهُ مِنَ الرَّكْعَةِ قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ قَالَ رَجُلٌ وَرَاءَهُ رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، فَلَمَّا انْصَرَفَ قَالَ ‏\"‏ مَنِ الْمُتَكَلِّمُ ‏\"‏‏.‏ قَالَ أَنَا‏.‏ قَالَ ‏\"‏ رَأَيْتُ بِضْعَةً وَثَلاَثِينَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَكْتُبُهَا أَوَّلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 799In-book reference : Book 10, Hadith 194USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 764   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 800,
    "id": 800,
    "url": "https://sunnah.com/bukhari:800",
    "bookNumber": 10,
    "hadithNumber": 195,
    "narrator": "Narrated Thabit:",
    "english": "Anas used to demonstrate to us the prayer of the Prophet (ﷺ) and while demonstrating, he used to raise his \nhead from bowing and stand so long that we would say that he had forgotten (the prostration).",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، قَالَ كَانَ أَنَسٌ يَنْعَتُ لَنَا صَلاَةَ النَّبِيِّ صلى الله عليه وسلم فَكَانَ يُصَلِّي وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَامَ حَتَّى نَقُولَ قَدْ نَسِيَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 800In-book reference : Book 10, Hadith 195USC-MSA web (English) reference : Vol. 1, Book 12, Hadith 765   (deprecated numbering scheme)"
  }
]