[
  {
    "hadithGlobalNumber": 4601,
    "id": 4601,
    "url": "https://sunnah.com/bukhari:4601",
    "bookNumber": 65,
    "hadithNumber": 123,
    "narrator": "Narrated `Aisha:",
    "english": "Regarding the Verse:--\"If a woman fears cruelty or desertion on her husband's part.\" (4.128) It is \nabout a man who has a woman (wife) and he does not like her and wants to divorce her but she says to \nhim, \"I make you free as regards myself.\" So this Verse was revealed in this connection.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏‏.‏ قَالَتِ الرَّجُلُ تَكُونُ عِنْدَهُ الْمَرْأَةُ لَيْسَ بِمُسْتَكْثِرٍ مِنْهَا يُرِيدُ أَنْ يُفَارِقَهَا فَتَقُولُ أَجْعَلُكَ مِنْ شَأْنِي فِي حِلٍّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4601In-book reference : Book 65, Hadith 123USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 125   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4602,
    "id": 4602,
    "url": "https://sunnah.com/bukhari:4602",
    "bookNumber": 65,
    "hadithNumber": 124,
    "narrator": "Narrated Al-Aswad:",
    "english": "While we were sitting in a circle in `Abdullah's gathering, Hudhaifa came and stopped before us, and \ngreeted us and then said, \"People better than you became hypocrites.\" Al-Aswad said: I testify the \nuniqueness of Allah! Allah says: \"Verily! The hypocrites will be in the lowest depths of the Fire.\" \n(4.145) \nOn that `Abdullah smiled and Hudhaifa sat somewhere in the Mosque. `Abdullah then got up and his \ncompanions (sitting around him) dispersed. Hudhaifa then threw a pebble at me (to attract my \nattention). I went to him and he said, \"I was surprised at `Abdullah's smile though he understood what \nI said. Verily, people better than you became hypocrite and then repented and Allah forgave them.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، قَالَ كُنَّا فِي حَلْقَةِ عَبْدِ اللَّهِ فَجَاءَ حُذَيْفَةُ حَتَّى قَامَ عَلَيْنَا، فَسَلَّمَ ثُمَّ قَالَ لَقَدْ أُنْزِلَ النِّفَاقُ عَلَى قَوْمٍ خَيْرٍ مِنْكُمْ‏.‏ قَالَ الأَسْوَدُ سُبْحَانَ اللَّهِ، إِنَّ اللَّهَ يَقُولُ ‏{‏إِنَّ الْمُنَافِقِينَ فِي الدَّرَكِ الأَسْفَلِ مِنَ النَّارِ‏}‏ فَتَبَسَّمَ عَبْدُ اللَّهِ، وَجَلَسَ حُذَيْفَةُ فِي نَاحِيَةِ الْمَسْجِدِ، فَقَامَ عَبْدُ اللَّهِ فَتَفَرَّقَ أَصْحَابُهُ، فَرَمَانِي بِالْحَصَا، فَأَتَيْتُهُ فَقَالَ حُذَيْفَةُ عَجِبْتُ مِنْ ضَحِكِهِ، وَقَدْ عَرَفَ مَا قُلْتُ، لَقَدْ أُنْزِلَ النِّفَاقُ عَلَى قَوْمٍ كَانُوا خَيْرًا مِنْكُمْ، ثُمَّ تَابُوا فَتَابَ اللَّهُ عَلَيْهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4602In-book reference : Book 65, Hadith 124USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 126   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4603,
    "id": 4603,
    "url": "https://sunnah.com/bukhari:4603",
    "bookNumber": 65,
    "hadithNumber": 125,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"None has the right to say that I am better than Jonah bin Matta.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يَنْبَغِي لأَحَدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4603In-book reference : Book 65, Hadith 125USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 127   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4604,
    "id": 4604,
    "url": "https://sunnah.com/bukhari:4604",
    "bookNumber": 65,
    "hadithNumber": 126,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Whoever says that I am better than Jonah bin Matta, is a liar.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى فَقَدْ كَذَبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4604In-book reference : Book 65, Hadith 126USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 128   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4605,
    "id": 4605,
    "url": "https://sunnah.com/bukhari:4605",
    "bookNumber": 65,
    "hadithNumber": 127,
    "narrator": "Narrated Al-Bara:",
    "english": "The last Sura that was revealed was Bara'a, and the last Verse that was revealed was: \"They ask you \nfor a legal verdict, Say: Allah's directs (thus) about those who leave no descendants or ascendants as \nheirs.\" (4.176)",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ آخِرُ سُورَةٍ نَزَلَتْ بَرَاءَةَ، وَآخِرُ آيَةٍ نَزَلَتْ ‏{‏يَسْتَفْتُونَكَ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4605In-book reference : Book 65, Hadith 127USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 129   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4606,
    "id": 4606,
    "url": "https://sunnah.com/bukhari:4606",
    "bookNumber": 65,
    "hadithNumber": 128,
    "narrator": "Narrated Tariq bin Shihab:",
    "english": "The Jews said to `Umar, \"You (i.e. Muslims) recite a Verse, and had it been revealed to us, we would \nhave taken the day of its revelation as a day of celebration.\" `Umar said, \"I know very well when and \nwhere it was revealed, and where Allah's Messenger (ﷺ) was when it was revealed. (It was revealed on) the \nday of `Arafat (Hajj Day), and by Allah, I was at `Arafat\" Sufyan, a sub-narrator said: I am in doubt \nwhether the Verse:-- \"This day I have perfected your religion for you.\" was revealed on a Friday or \nnot.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ قَيْسٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَتِ الْيَهُودُ لِعُمَرَ إِنَّكُمْ تَقْرَءُونَ آيَةً لَوْ نَزَلَتْ فِينَا لاَتَّخَذْنَاهَا عِيدًا‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ حَيْثُ أُنْزِلَتْ، وَأَيْنَ أُنْزِلَتْ، وَأَيْنَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أُنْزِلَتْ يَوْمَ عَرَفَةَ، وَإِنَّا وَاللَّهِ بِعَرَفَةَ ـ قَالَ سُفْيَانُ وَأَشُكُّ كَانَ يَوْمَ الْجُمُعَةِ أَمْ لاَ – ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4606In-book reference : Book 65, Hadith 128USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 130   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4607,
    "id": 4607,
    "url": "https://sunnah.com/bukhari:4607",
    "bookNumber": 65,
    "hadithNumber": 129,
    "narrator": "Narrated Aisha:",
    "english": "The wife of the Prophet (ﷺ) : We set out with Allah's Messenger (ﷺ) on one of his journeys, and when we were at \nBaida' or at Dhat-al-Jaish, a necklace of mine was broken (and lost). Allah's Messenger (ﷺ) stayed there to \nlook for it, and so did the people along with him. Neither were they at a place of water, nor did they \nhave any water with them. So the people went to Abu Bakr As-Siddiq and said, \"Don't you see what \n`Aisha has done? She has made Allah's Messenger (ﷺ) and the people, stay where there is no water and they \nhave no water with them.\" Abu Bakr came while Allah's Messenger (ﷺ) was sleeping with his head on my \nthigh. He said (to me), \"You have detained Allah's Messenger (ﷺ) and the people where there is no water, \nand they have no water with them.\" So he admonished me and said what Allah wished him to say, and \nhe hit me on my flanks with his hand. Nothing prevented me from moving (because of pain! but the \nposition of Allah's Messenger (ﷺ) on my thigh. So Allah's Messenger (ﷺ) got up when dawn broke and there was no \nwater, so Allah revealed the Verse of Tayammum. Usaid bin Hudair said, \"It is not the first blessing of \nyours, O the family of Abu Bakr.\" Then we made the camel on which I was riding, got up, and found \nthe necklace under it.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ عَائِشَةُ فَعَاتَبَنِي أَبُو بَكْرٍ، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، وَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ، فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ قَالَتْ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَإِذَا الْعِقْدُ تَحْتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4607In-book reference : Book 65, Hadith 129USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 131   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4608,
    "id": 4608,
    "url": "https://sunnah.com/bukhari:4608",
    "bookNumber": 65,
    "hadithNumber": 130,
    "narrator": "Narrated Aisha:",
    "english": "A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet (ﷺ) made his \ncamel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr came to me and \nhit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as \nmotionless as a dead person because of the position of Allah's Messenger (ﷺ) ; (on my lap) although Abu \nBakr had hurt me (with the slap). Then the Prophet (ﷺ) woke up and it was the time for the morning \n(prayer). Water was sought, but in vain; so the following Verse was revealed:-- \n\"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair said, \"Allah has \nblessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ سَقَطَتْ قِلاَدَةٌ لِي بِالْبَيْدَاءِ وَنَحْنُ دَاخِلُونَ الْمَدِينَةَ، فَأَنَاخَ النَّبِيُّ صلى الله عليه وسلم وَنَزَلَ، فَثَنَى رَأْسَهُ فِي حَجْرِي رَاقِدًا، أَقْبَلَ أَبُو بَكْرٍ فَلَكَزَنِي لَكْزَةً شَدِيدَةً وَقَالَ حَبَسْتِ النَّاسَ فِي قِلاَدَةٍ‏.‏ فَبِي الْمَوْتُ لِمَكَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَوْجَعَنِي، ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَيْقَظَ وَحَضَرَتِ الصُّبْحُ فَالْتُمِسَ الْمَاءُ فَلَمْ يُوجَدْ فَنَزَلَتْ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاَةِ‏}‏ الآيَةَ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ لَقَدْ بَارَكَ اللَّهُ لِلنَّاسِ فِيكُمْ يَا آلَ أَبِي بَكْرٍ، مَا أَنْتُمْ إِلاَّ بَرَكَةٌ لَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4608In-book reference : Book 65, Hadith 130USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 132   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4609,
    "id": 4609,
    "url": "https://sunnah.com/bukhari:4609",
    "bookNumber": 65,
    "hadithNumber": 131,
    "narrator": "Narrated `Abdullah (bin Masud):",
    "english": "On the day of Badr, Al-Miqdad said, \"O Allah's Messenger (ﷺ)! We do not say to you as the children of \nIsrael said to Moses, 'Go you and your Lord and fight you two; we are sitting here, (5.24) but (we \nsay). \"Proceed, and we are with you.\" That seemed to delight Allah's Messenger (ﷺ) greatly.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مُخَارِقٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، سَمِعْتُ ابْنَ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ شَهِدْتُ مِنَ الْمِقْدَادِ ح وَحَدَّثَنِي حَمْدَانُ بْنُ عُمَرَ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا الأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ مُخَارِقٍ عَنْ طَارِقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ الْمِقْدَادُ يَوْمَ بَدْرٍ يَا رَسُولَ اللَّهِ إِنَّا لاَ نَقُولُ لَكَ كَمَا قَالَتْ بَنُو إِسْرَائِيلَ لِمُوسَى ‏{‏فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلاَ إِنَّا هَا هُنَا قَاعِدُونَ‏}‏ وَلَكِنِ امْضِ وَنَحْنُ مَعَكَ‏.‏ فَكَأَنَّهُ سُرِّيَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَرَوَاهُ وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُخَارِقٍ عَنْ طَارِقٍ أَنَّ الْمِقْدَادَ قَالَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4609In-book reference : Book 65, Hadith 131USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 133   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4610,
    "id": 4610,
    "url": "https://sunnah.com/bukhari:4610",
    "bookNumber": 65,
    "hadithNumber": 132,
    "narrator": "Narrated Abu Qilaba:",
    "english": "That he was sitting behind `Umar bin `Abdul `Aziz and the people mentioned and mentioned (about \nat-Qasama) and they said (various things), and said that the Caliphs had permitted it. `Umar bin \n`Abdul `Aziz turned towards Abu Qilaba who was behind him and said. \"What do you say, O \n`Abdullah bin Zaid?\" or said, \"What do you say, O Abu Qilaba?\" Abu Qilaba said, \"I do not know that \nkilling a person is lawful in Islam except in three cases: a married person committing illegal sexual \nintercourse, one who has murdered somebody unlawfully, or one who wages war against Allah and \nHis Apostle.\" 'Anbasa said, \"Anas narrated to us such-and-such.\" Abu Qilaba said, \"Anas narrated to \nme in this concern, saying, some people came to the Prophet (ﷺ) and they spoke to him saying, 'The \nclimate of this land does not suit us.' The Prophet (ﷺ) said, 'These are camels belonging to us, and they are \nto be taken out to the pasture. So take them out and drink of their milk and urine.' So they took them \nand set out and drank of their urine and milk, and having recovered, they attacked the shepherd, killed \nhim and drove away the camels.' Why should there be any delay in punishing them as they murdered \n(a person) and waged war against Allah and His Apostle and frightened Allah's Messenger (ﷺ) ?\" Anbasa \nsaid, \"I testify the uniqueness of Allah!\" Abu Qilaba said, \"Do you suspect me?\" 'Anbasa said, \"No, \nAnas narrated that (Hadith) to us.\" Then 'Anbasa added, \"O the people of such-and-such (country), \nyou will remain in good state as long as Allah keeps this (man) and the like of this (man) amongst \nyou.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ حَدَّثَنِي سَلْمَانُ أَبُو رَجَاءٍ، مَوْلَى أَبِي قِلاَبَةَ عَنْ أَبِي قِلاَبَةَ، أَنَّهُ كَانَ جَالِسًا خَلْفَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، فَذَكَرُوا وَذَكَرُوا فَقَالُوا وَقَالُوا قَدْ أَقَادَتْ بِهَا الْخُلَفَاءُ، فَالْتَفَتَ إِلَى أَبِي قِلاَبَةَ وَهْوَ خَلْفَ ظَهْرِهِ، فَقَالَ مَا تَقُولُ يَا عَبْدَ اللَّهِ بْنَ زَيْدٍ أَوْ قَالَ مَا تَقُولُ يَا أَبَا قِلاَبَةَ قُلْتُ مَا عَلِمْتُ نَفْسًا حَلَّ قَتْلُهَا فِي الإِسْلاَمِ إِلاَّ رَجُلٌ زَنَى بَعْدَ إِحْصَانٍ، أَوْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ، أَوْ حَارَبَ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏ فَقَالَ عَنْبَسَةُ حَدَّثَنَا أَنَسٌ بِكَذَا وَكَذَا‏.‏ قُلْتُ إِيَّاىَ حَدَّثَ أَنَسٌ قَالَ قَدِمَ قَوْمٌ عَلَى النَّبِيِّ صلى الله عليه وسلم فَكَلَّمُوهُ فَقَالُوا قَدِ اسْتَوْخَمْنَا هَذِهِ الأَرْضَ‏.‏ فَقَالَ ‏\n\"‏ هَذِهِ نَعَمٌ لَنَا تَخْرُجُ، فَاخْرُجُوا فِيهَا، فَاشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏‏.‏ فَخَرَجُوا فِيهَا فَشَرِبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا وَاسْتَصَحُّوا، وَمَالُوا عَلَى الرَّاعِي فَقَتَلُوهُ، وَاطَّرَدُوا النَّعَمَ، فَمَا يُسْتَبْطَأُ مِنْ هَؤُلاَءِ قَتَلُوا النَّفْسَ وَحَارَبُوا اللَّهَ وَرَسُولَهُ، وَخَوَّفُوا رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ تَتَّهِمُنِي قَالَ حَدَّثَنَا بِهَذَا أَنَسٌ‏.‏ قَالَ وَقَالَ يَا أَهْلَ كَذَا إِنَّكُمْ لَنْ تَزَالُوا بِخَيْرٍ مَا أُبْقِيَ هَذَا فِيكُمْ أَوْ مِثْلُ هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4610In-book reference : Book 65, Hadith 132USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 134   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4611,
    "id": 4611,
    "url": "https://sunnah.com/bukhari:4611",
    "bookNumber": 65,
    "hadithNumber": 133,
    "narrator": "Narrated Anas (bin Malik):",
    "english": "Ar-Rubai (the paternal aunt of Anas bin Malik) broke the incisor tooth of young Ansari girl. Her \nfamily demanded the Qisas and they came to the Prophet (ﷺ) who passed the judgment of Qisas. Anas bin \nAn-Nadr (the paternal uncle of Anas bin Malik) said, \"O Allah's Messenger (ﷺ)! By Allah, her tooth will not \nbe broken.\" The Prophet (ﷺ) said, \"O Anas! (The law prescribed in) Allah's Book is Qisas.\" But the \npeople (i.e. the relatives of the girl) gave up their claim and accepted a compensation. On that Allah's \nApostle said, \"Some of Allah's worshippers are such that if they take an oath, Allah will fulfill it for \nthem.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَسَرَتِ الرُّبَيِّعُ ـ وَهْىَ عَمَّةُ أَنَسِ بْنِ مَالِكٍ ـ ثَنِيَّةَ جَارِيَةٍ مِنَ الأَنْصَارِ، فَطَلَبَ الْقَوْمُ الْقِصَاصَ، فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْقِصَاصِ‏.‏ فَقَالَ أَنَسُ بْنُ النَّضْرِ عَمُّ أَنَسِ بْنِ مَالِكٍ لاَ وَاللَّهِ لاَ تُكْسَرْ سِنُّهَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏ فَرَضِيَ الْقَوْمُ وَقَبِلُوا الأَرْشَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4611In-book reference : Book 65, Hadith 133USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 135   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4612,
    "id": 4612,
    "url": "https://sunnah.com/bukhari:4612",
    "bookNumber": 65,
    "hadithNumber": 134,
    "narrator": "Narrated `Aisha:",
    "english": "Whoever tells that Muhammad concealed part of what was revealed to him, is a liar, for Allah says:-- \n\"O Apostle (Muhammad)! Proclaim (the Message) which has been sent down to you from your Lord.\" \n(5.67)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا صلى الله عليه وسلم كَتَمَ شَيْئًا مِمَّا أُنْزِلَ عَلَيْهِ، فَقَدْ كَذَبَ، وَاللَّهُ يَقُولُ ‏{‏يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4612In-book reference : Book 65, Hadith 134USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 136   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4613,
    "id": 4613,
    "url": "https://sunnah.com/bukhari:4613",
    "bookNumber": 65,
    "hadithNumber": 135,
    "narrator": "Narrated `Aisha:",
    "english": "This Verse: \"Allah will not punish you for what is unintentional in your oaths.\" (5.89) was revealed \nabout a man's state men (during his talk), \"No, by Allah,\" and \"Yes, by Allah.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنِ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ‏}‏ فِي قَوْلِ الرَّجُلِ لاَ وَاللَّهِ، وَبَلَى وَاللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4613In-book reference : Book 65, Hadith 135USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 137   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4614,
    "id": 4614,
    "url": "https://sunnah.com/bukhari:4614",
    "bookNumber": 65,
    "hadithNumber": 136,
    "narrator": "Narrated Aisha:",
    "english": "That her father (Abu Bakr) never broke his oath till Allah revealed the order of the legal expiation for \noath. Abu Bakr said, \"If I ever take an oath (to do something) and later find that to do something else \nis better, then I accept Allah's permission and do that which is better, (and do the legal expiation for \nmy oath ) \".",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ أَبَاهَا، كَانَ لاَ يَحْنَثُ فِي يَمِينٍ حَتَّى أَنْزَلَ اللَّهُ كَفَّارَةَ الْيَمِينِ‏.‏ قَالَ أَبُو بَكْرٍ لاَ أَرَى يَمِينًا أُرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ قَبِلْتُ رُخْصَةَ اللَّهِ، وَفَعَلْتُ الَّذِي هُوَ خَيْرٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4614In-book reference : Book 65, Hadith 136USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 138   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4615,
    "id": 4615,
    "url": "https://sunnah.com/bukhari:4615",
    "bookNumber": 65,
    "hadithNumber": 137,
    "narrator": "Narrated `Abdullah:",
    "english": "We used to participate in the holy wars carried on by the Prophet (ﷺ) and we had no women (wives) with \nus. So we said (to the Prophet (ﷺ) ). \"Shall we castrate ourselves?\" But the Prophet (ﷺ) forbade us to do that \nand thenceforth he allowed us to marry a woman (temporarily) by giving her even a garment, and then \nhe recited: \"O you who believe! Do not make unlawful the good things which Allah has made lawful \nfor you.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه قَالَ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ مَعَنَا نِسَاءٌ فَقُلْنَا أَلاَ نَخْتَصِي فَنَهَانَا عَنْ ذَلِكَ، فَرَخَّصَ لَنَا بَعْدَ ذَلِكَ أَنْ نَتَزَوَّجَ الْمَرْأَةَ بِالثَّوْبِ، ثُمَّ قَرَأَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4615In-book reference : Book 65, Hadith 137USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 139   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4616,
    "id": 4616,
    "url": "https://sunnah.com/bukhari:4616",
    "bookNumber": 65,
    "hadithNumber": 138,
    "narrator": "Narrated Ibn `Umar:",
    "english": "(The Verse of) prohibiting alcoholic drinks was revealed when there were in Medina five kinds of \n(alcoholic) drinks none of which was produced from grapes.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَزَلَ تَحْرِيمُ الْخَمْرِ وَإِنَّ فِي الْمَدِينَةِ يَوْمَئِذٍ لَخَمْسَةَ أَشْرِبَةٍ، مَا فِيهَا شَرَابُ الْعِنَبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4616In-book reference : Book 65, Hadith 138USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 140   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4617,
    "id": 4617,
    "url": "https://sunnah.com/bukhari:4617",
    "bookNumber": 65,
    "hadithNumber": 139,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We had no alcoholic drink except that which was produced from dates and which you call Fadikh. \nWhile I was standing offering drinks to Abu Talh and so-and-so and so-and-so, a man cam and said, \n\"Has the news reached you? They said, \"What is that?\" He said. \"Alcoholic drinks have been \nprohibited. They said, \"Spill (the contents of these pots, O Anas! \"Then they neither asked about it \n(alcoholic drinks) nor returned it after the news from that man.",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ مَا كَانَ لَنَا خَمْرٌ غَيْرُ فَضِيخِكُمْ هَذَا الَّذِي تُسَمُّونَهُ الْفَضِيخَ‏.‏ فَإِنِّي لَقَائِمٌ أَسْقِي أَبَا طَلْحَةَ وَفُلاَنًا وَفُلاَنًا إِذْ جَاءَ رَجُلٌ فَقَالَ وَهَلْ بَلَغَكُمُ الْخَبَرُ فَقَالُوا وَمَا ذَاكَ قَالَ حُرِّمَتِ الْخَمْرُ‏.‏ قَالُوا أَهْرِقْ هَذِهِ الْقِلاَلَ يَا أَنَسُ‏.‏ قَالَ فَمَا سَأَلُوا عَنْهَا وَلاَ رَاجَعُوهَا بَعْدَ خَبَرِ الرَّجُلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4617In-book reference : Book 65, Hadith 139USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 141   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4618,
    "id": 4618,
    "url": "https://sunnah.com/bukhari:4618",
    "bookNumber": 65,
    "hadithNumber": 140,
    "narrator": "Narrated Jabir:",
    "english": "Some people drank alcoholic beverages in the morning (of the day) of the Uhud battle and on the \nsame day they were killed as martyrs, and that was before wine was prohibited.",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ صَبَّحَ أُنَاسٌ غَدَاةَ أُحُدٍ الْخَمْرَ فَقُتِلُوا مِنْ يَوْمِهِمْ جَمِيعًا شُهَدَاءَ، وَذَلِكَ قَبْلَ تَحْرِيمِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4618In-book reference : Book 65, Hadith 140USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 142   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4619,
    "id": 4619,
    "url": "https://sunnah.com/bukhari:4619",
    "bookNumber": 65,
    "hadithNumber": 141,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I heard `Umar while he was on the pulpit of the Prophet (ﷺ) saying, \"Now then O people! The revelation \nabout the prohibition of alcoholic drinks was revealed; and alcoholic drinks are extracted from five \nthings: Grapes, dates, honey, wheat and barley. And the alcoholic drink is that which confuses and \nstupefies the mind.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عِيسَى، وَابْنُ، إِدْرِيسَ عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ ـ رضى الله عنه ـ عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم يَقُولُ أَمَّا بَعْدُ أَيُّهَا النَّاسُ إِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنْ خَمْسَةٍ، مِنَ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4619In-book reference : Book 65, Hadith 141USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 143   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4620,
    "id": 4620,
    "url": "https://sunnah.com/bukhari:4620",
    "bookNumber": 65,
    "hadithNumber": 142,
    "narrator": "Narrated Anas:",
    "english": "The alcoholic drink which was spilled was Al-Fadikh. I used to offer alcoholic drinks to the people at \nthe residence of Abu Talha. Then the order of prohibiting Alcoholic drinks was revealed, and the \nProphet ordered somebody to announce that: Abu Talha said to me, \"Go out and see what this voice \n(this announcement ) is.\" I went out and (on coming back) said, \"This is somebody announcing that \nalcoholic beverages have been prohibited.\" Abu Talha said to me, \"Go and spill it (i.e. the wine),\" \nThen it (alcoholic drinks) was seen flowing through the streets of Medina. At that time the wine was \nAl-Fadikh. The people said, \"Some people (Muslims) were killed (during the battle of Uhud) while \nwine was in their stomachs.\" So Allah revealed: \"On those who believe and do good deeds there is no \nblame for what they ate (in the past).\" (5.93)",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ الْخَمْرَ، الَّتِي أُهْرِيقَتِ الْفَضِيخُ‏.‏ وَزَادَنِي مُحَمَّدٌ عَنْ أَبِي النُّعْمَانِ قَالَ كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ فَنَزَلَ تَحْرِيمُ الْخَمْرِ، فَأَمَرَ مُنَادِيًا فَنَادَى‏.‏ فَقَالَ أَبُو طَلْحَةَ اخْرُجْ فَانْظُرْ مَا هَذَا الصَّوْتُ قَالَ فَخَرَجْتُ فَقُلْتُ هَذَا مُنَادٍ يُنَادِي أَلاَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ لِي اذْهَبْ فَأَهْرِقْهَا‏.‏ قَالَ فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ‏.‏ قَالَ وَكَانَتْ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ فَقَالَ بَعْضُ الْقَوْمِ قُتِلَ قَوْمٌ وَهْىَ فِي بُطُونِهِمْ قَالَ فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4620In-book reference : Book 65, Hadith 142USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 144   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4621,
    "id": 4621,
    "url": "https://sunnah.com/bukhari:4621",
    "bookNumber": 65,
    "hadithNumber": 143,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) delivered a sermon the like of which I had never heard before. He said, \"If you but knew \nwhat I know then you would have laughed little and wept much.\" On hearing that, the companions of \nthe Prophet (ﷺ) covered their faces and the sound of their weeping was heard. A man said, \"Who is my \nfather?\" The Prophet (ﷺ) said, \"So-and-so.\" So this Verse was revealed: \"Ask not about things which, if \nmade plain to you, may cause you trouble.\" (5.101)",
    "arabic": "حَدَّثَنَا مُنْذِرُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجَارُودِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم خُطْبَةً مَا سَمِعْتُ مِثْلَهَا قَطُّ، قَالَ ‏\"‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏ قَالَ فَغَطَّى أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وُجُوهَهُمْ لَهُمْ خَنِينٌ، فَقَالَ رَجُلٌ مَنْ أَبِي قَالَ فُلاَنٌ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏‏.‏ رَوَاهُ النَّضْرُ وَرَوْحُ بْنُ عُبَادَةَ عَنْ شُعْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4621In-book reference : Book 65, Hadith 143USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 145   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4622,
    "id": 4622,
    "url": "https://sunnah.com/bukhari:4622",
    "bookNumber": 65,
    "hadithNumber": 144,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Some people were asking Allah's Messenger (ﷺ) questions mockingly. A man would say, \"Who is my \nfather?\" Another man whose she-camel had gone astray would say, \"Where is my she-camel? \"So \nAllah revealed this Verse in this connection: \"O you who believe! Ask not about things which, if \nmade plain to you, may cause you trouble.\" (5.101)",
    "arabic": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو خَيْثَمَةَ، حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ قَوْمٌ يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتِهْزَاءً، فَيَقُولُ الرَّجُلُ مَنْ أَبِي وَيَقُولُ الرَّجُلُ تَضِلُّ نَاقَتُهُ أَيْنَ نَاقَتِي فَأَنْزَلَ اللَّهُ فِيهِمْ هَذِهِ الآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏ حَتَّى فَرَغَ مِنَ الآيَةِ كُلِّهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4622In-book reference : Book 65, Hadith 144USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 146   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4623,
    "id": 4623,
    "url": "https://sunnah.com/bukhari:4623",
    "bookNumber": 65,
    "hadithNumber": 145,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "Bahira is a she-camel whose milk is kept for the idols and nobody is allowed to milk it; Sa'iba was the \nshe-camel which they used to set free for their gods and nothing was allowed to be carried on it. Abu \nHuraira said: Allah's Messenger (ﷺ) said, \"I saw `Amr bin 'Amir Al-Khuza`i (in a dream) dragging his \nintestines in the Fire, and he was the first person to establish the tradition of setting free the animals \n(for the sake of their deities),\" Wasila is the she-camel which gives birth to a she-camel as its first \ndelivery, and then gives birth to another she-camel as its second delivery. People (in the Pre-lslamic \nperiods of ignorance) used to let that she camel loose for their idols if it gave birth to two she-camels \nsuccessively without giving birth to a male camel in between. 'Ham' was the male camel which was \nused for copulation. When it had finished the number of copulations assigned for it, they would let it \nloose for their idols and excuse it from burdens so that nothing would be carried on it, and they called \nit the 'Hami.' Abu Huraira said, \"I heard the Prophet (ﷺ) saying so.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ الْبَحِيرَةُ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ فَلاَ يَحْلُبُهَا أَحَدٌ مِنَ النَّاسِ‏.‏ وَالسَّائِبَةُ كَانُوا يُسَيِّبُونَهَا لآلِهَتِهِمْ لاَ يُحْمَلُ عَلَيْهَا شَىْءٌ‏.‏ قَالَ وَقَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ عَمْرَو بْنَ عَامِرٍ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ، كَانَ أَوَّلَ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏ وَالْوَصِيلَةُ النَّاقَةُ الْبِكْرُ تُبَكِّرُ فِي أَوَّلِ نِتَاجِ الإِبِلِ، ثُمَّ تُثَنِّي بَعْدُ بِأُنْثَى‏.‏ وَكَانُوا يُسَيِّبُونَهُمْ لِطَوَاغِيتِهِمْ إِنْ وَصَلَتْ إِحْدَاهُمَا بِالأُخْرَى لَيْسَ بَيْنَهُمَا ذَكَرٌ‏.‏ وَالْحَامِ فَحْلُ الإِبِلِ يَضْرِبُ الضِّرَابَ الْمَعْدُودَ، فَإِذَا قَضَى ضِرَابَهُ وَدَعُوهُ لِلطَّوَاغِيتِ وَأَعْفَوْهُ مِنَ الْحَمْلِ فَلَمْ يُحْمَلْ عَلَيْهِ شَىْءٌ وَسَمَّوْهُ الْحَامِيَ‏.‏       \nوَقَالَ لي أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، سَمِعْتُ سَعِيدًا، قَالَ يُخْبِرُهُ بِهَذَا قَالَ وَقَالَ أَبُو هُرَيْرَةَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏ وَرَوَاهُ ابْنُ الْهَادِ عَنِ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4623In-book reference : Book 65, Hadith 145USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 147   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4624,
    "id": 4624,
    "url": "https://sunnah.com/bukhari:4624",
    "bookNumber": 65,
    "hadithNumber": 146,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"I saw Hell and its different portions were consuming each other and saw `Amr \ndragging his intestines (in it), and he was the first person to establish the tradition of letting animals \nloose (for the idols).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ أَبُو عَبْدِ اللَّهِ الْكَرْمَانِيُّ، حَدَّثَنَا حَسَّانُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، رضى الله عنها قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا، وَرَأَيْتُ عَمْرًا يَجُرُّ قُصْبَهُ، وَهْوَ أَوَّلُ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4624In-book reference : Book 65, Hadith 146USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 148   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4625,
    "id": 4625,
    "url": "https://sunnah.com/bukhari:4625",
    "bookNumber": 65,
    "hadithNumber": 147,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) delivered a sermon and said, \"O people! You will be gathered before Allah barefooted, \nnaked and not circumcised.\" Then (quoting Qur'an) he said:-- \n\"As We began the first creation, We shall repeat it. A promise We have undertaken: Truly we shall do \nit..\" (21.104) \nThe Prophet (ﷺ) then said, \"The first of the human beings to be dressed on the Day of Resurrection, will \nbe Abraham. Lo! Some men from my followers will be brought and then (the angels) will drive them \nto the left side (Hell-Fire). I will say. 'O my Lord! (They are) my companions!' Then a reply will come \n(from Almighty), 'You do not know what they did after you.' I will say as the pious slave (the Prophet (ﷺ) \nJesus) said: And I was a witness over them while I dwelt amongst them. When You took me up. You \nwere the Watcher over them and You are a Witness to all things.' (5.117) Then it will be said, \"These \npeople have continued to be apostates since you left them.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّكُمْ مَحْشُورُونَ إِلَى اللَّهِ حُفَاةً عُرَاةً غُرْلاً ـ ثُمَّ قَالَ ـ ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ إِلَى آخِرِ الآيَةِ ـ ثُمَّ قَالَ ـ أَلاَ وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، أَلاَ وَإِنَّهُ يُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ، فَأَقُولُ يَا رَبِّ أُصَيْحَابِي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ‏}‏ فَيُقَالُ إِنَّ هَؤُلاَءِ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4625In-book reference : Book 65, Hadith 147USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 149   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4626,
    "id": 4626,
    "url": "https://sunnah.com/bukhari:4626",
    "bookNumber": 65,
    "hadithNumber": 148,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"You will be gathered (on the Day of Resurrection) and some people will be driven \n(by the angels) to the left side (and taken to Hell) whereupon I will say as the pious slave (Jesus) said:- \n- \"And I was a witness over them while I dwelt amongst them...the ALMIGHTY, the All Wise.\" \n(5.117-118)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ، وَإِنَّ نَاسًا يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ، فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْعَزِيزُ الْحَكِيمُ ‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4626In-book reference : Book 65, Hadith 148USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 150   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4627,
    "id": 4627,
    "url": "https://sunnah.com/bukhari:4627",
    "bookNumber": 65,
    "hadithNumber": 149,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"The key of the Unseen are five: Verily with Allah (Alone) is the knowledge of \nthe Hour He sends down the rain and knows what is in the wombs. No soul knows what it will earn \ntomorrow, and no soul knows in what land it will die. Verily, Allah is All-Knower, All-Aware.\" \n(31.34)",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَفَاتِحُ الْغَيْبِ خَمْسٌ إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ، وَيُنَزِّلُ الْغَيْثَ، وَيَعْلَمُ مَا فِي الأَرْحَامِ، وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا، وَمَا تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ، إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4627In-book reference : Book 65, Hadith 149USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 151   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4628,
    "id": 4628,
    "url": "https://sunnah.com/bukhari:4628",
    "bookNumber": 65,
    "hadithNumber": 150,
    "narrator": "Narrated Jabir:",
    "english": "When this Verse was revealed: \"Say: He has power to send torment on you from above.\" (6.65) \nAllah's Messenger (ﷺ) said, \"O Allah! I seek refuge with Your Face (from this punishment).\" And when the \nverse: \"or send torment from below your feet,\" (was revealed), Allah's Messenger (ﷺ) said, \"(O Allah!) I seek \nrefuge with Your Face (from this punishment).\" (But when there was revealed): \"Or confuse you in \nparty strife and make you to taste the violence of one another.\" (6.65) Allah's Messenger (ﷺ) said, \"This is \nlighter (or, this is easier).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ‏}‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ قَالَ ‏{‏أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ‏}‏ قَالَ ‏\"‏ أَعُوذُ بِوَجْهِكَ‏\"‏ ‏{‏أَوْ يَلْبِسَكُمْ شِيَعًا وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ‏}‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا أَهْوَنُ ‏\"‏‏.‏ أَوْ ‏\"‏ هَذَا أَيْسَرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4628In-book reference : Book 65, Hadith 150USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 152   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4629,
    "id": 4629,
    "url": "https://sunnah.com/bukhari:4629",
    "bookNumber": 65,
    "hadithNumber": 151,
    "narrator": "Narrated `Abdullah:",
    "english": "When:\"...and confuse not their belief with wrong.\" (6.82) was revealed, the Prophet's companions \nsaid, \"Which of us has not done wrong?\" Then there was revealed:-- \"Verily joining others in worship \nwith Allah is a tremendous wrong indeed.\" (31.13)",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏{‏وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قَالَ أَصْحَابُهُ وَأَيُّنَا لَمْ يَظْلِمْ فَنَزَلَتْ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4629In-book reference : Book 65, Hadith 151USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 153   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4630,
    "id": 4630,
    "url": "https://sunnah.com/bukhari:4630",
    "bookNumber": 65,
    "hadithNumber": 152,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"Nobody has the rights to say that I am better than Jonah bin Matta.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ حَدَّثَنِي ابْنُ عَمِّ، نَبِيِّكُمْ يَعْنِي ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4630In-book reference : Book 65, Hadith 152USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 154   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4631,
    "id": 4631,
    "url": "https://sunnah.com/bukhari:4631",
    "bookNumber": 65,
    "hadithNumber": 153,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Nobody has the right to say that I am better than Jonah bin Matta.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا سَعْدُ بْنُ إِبْرَاهِيمَ، قَالَ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4631In-book reference : Book 65, Hadith 153USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 155   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4632,
    "id": 4632,
    "url": "https://sunnah.com/bukhari:4632",
    "bookNumber": 65,
    "hadithNumber": 154,
    "narrator": "Narrated Mujahid:",
    "english": "That he asked Ibn `Abbas, \"Is there a prostration Surat-al-Sa`d?\" (38.24) Ibn `Abbas said, \"Yes,\" and \nthen recited: \"We gave...So follow their guidance.\" (6.85,90) Then he said, \"He (David ) is one them \n(i.e. those prophets).\" Mujahid narrated: I asked Ibn `Abbas (regarding the above Verse). He said, \n\"Your Prophet (Muhammad) was one of those who were ordered to follow them.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ مُجَاهِدًا، أَخْبَرَهُ أَنَّهُ، سَأَلَ ابْنَ عَبَّاسٍ أَفِي ‏\"‏ ص ‏\"‏ سَجْدَةٌ فَقَالَ نَعَمْ‏.‏ ثُمَّ تَلاَ ‏{‏وَوَهَبْنَا‏}‏ إِلَى قَوْلِهِ ‏{‏فَبِهُدَاهُمُ اقْتَدِهْ‏}‏ ثُمَّ قَالَ هُوَ مِنْهُمْ‏.‏ زَادَ يَزِيدُ بْنُ هَارُونَ وَمُحَمَّدُ بْنُ عُبَيْدٍ وَسَهْلُ بْنُ يُوسُفَ عَنِ الْعَوَّامِ عَنْ مُجَاهِدٍ قُلْتُ لاِبْنِ عَبَّاسٍ فَقَالَ نَبِيُّكُمْ صلى الله عليه وسلم مِمَّنْ أُمِرَ أَنْ يَقْتَدِيَ بِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4632In-book reference : Book 65, Hadith 154USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 156   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4633,
    "id": 4633,
    "url": "https://sunnah.com/bukhari:4633",
    "bookNumber": 65,
    "hadithNumber": 155,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"May Allah curse the Jews! When Allah forbade them to eat the fat of animals, they \nmelted it and sold it, and utilized its price! \"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، قَالَ عَطَاءٌ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ، لَمَّا حَرَّمَ اللَّهُ عَلَيْهِمْ شُحُومَهَا جَمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوهَا ‏\"‏‏.‏\nوَقَالَ أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ، حَدَّثَنَا يَزِيدُ، كَتَبَ إِلَىَّ عَطَاءٌ سَمِعْتُ جَابِرًا، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4633In-book reference : Book 65, Hadith 155USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 157   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4634,
    "id": 4634,
    "url": "https://sunnah.com/bukhari:4634",
    "bookNumber": 65,
    "hadithNumber": 156,
    "narrator": "Narrated Abu Wail:",
    "english": "`Abdullah (bin Mas`ud) said, \"None has more sense of ghaira than Allah therefore - He prohibits \nshameful sins (illegal sexual intercourse, etc.) whether committed openly or secretly. And none loves \nto be praised more than Allah does, and for this reason He praises Himself.\" I asked Abu Wali, \"Did \nyou hear it from `Abdullah?\" He said, \"Yes,\" I said, \"Did `Abdullah ascribe it to Allah's Messenger (ﷺ)?\" He \nsaid, \"Yes.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ ‏\n\"‏ لاَ أَحَدَ أَغْيَرُ مِنَ اللَّهِ، وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَلاَ شَىْءَ أَحَبُّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ، لِذَلِكَ مَدَحَ نَفْسَهُ ‏\"‏‏.‏ قُلْتُ سَمِعْتَهُ مِنْ عَبْدِ اللَّهِ قَالَ نَعَمْ‏.‏ قُلْتُ وَرَفَعَهُ قَالَ نَعَمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4634In-book reference : Book 65, Hadith 156USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 158   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4635,
    "id": 4635,
    "url": "https://sunnah.com/bukhari:4635",
    "bookNumber": 65,
    "hadithNumber": 157,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until the sun rises from the West: and when \nthe people see it, then whoever will be living on the surface of the earth will have faith, and that is (the \ntime) when no good will it do to a soul to believe then, if it believed not before.\" (6.158)",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ، حَدَّثَنَا أَبُو زُرْعَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا رَآهَا النَّاسُ آمَنَ مَنْ عَلَيْهَا، فَذَاكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا، لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4635In-book reference : Book 65, Hadith 157USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 159   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4636,
    "id": 4636,
    "url": "https://sunnah.com/bukhari:4636",
    "bookNumber": 65,
    "hadithNumber": 158,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The hour will not be established till the sun rises from the West; and when it \nrises (from the West) and the people see it, they all will believe. And that is (the time) when no good \nwill it do to a soul to believe then.\" Then he recited the whole Verse (6.158)",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ، وَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا ‏\"‏‏.‏ ثُمَّ قَرَأَ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4636In-book reference : Book 65, Hadith 158USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 160   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4637,
    "id": 4637,
    "url": "https://sunnah.com/bukhari:4637",
    "bookNumber": 65,
    "hadithNumber": 159,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "Allah's Messenger (ﷺ) said, \"None has more sense of ghaira than Allah, and for this He has forbidden \nshameful sins whether committed openly or secretly, and none loves to be praised more than Allah \ndoes, and this is why He Praises Himself.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قُلْتُ أَنْتَ سَمِعْتَ هَذَا مِنْ عَبْدِ اللَّهِ قَالَ نَعَمْ، وَرَفَعَهُ‏.‏ قَالَ ‏\n\"‏ لاَ أَحَدَ أَغْيَرُ مِنَ اللَّهِ، فَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَلاَ أَحَدَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللَّهِ، فَلِذَلِكَ مَدَحَ نَفْسَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4637In-book reference : Book 65, Hadith 159USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 161   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4638,
    "id": 4638,
    "url": "https://sunnah.com/bukhari:4638",
    "bookNumber": 65,
    "hadithNumber": 160,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "A man from the Jews, having been slapped on his face, came to the Prophet (ﷺ) and said, \"O Muhammad! \nA man from your companions from the Ansar has slapped me on my face!\" The Prophet (ﷺ) said, \"Call \nhim.\" When they called him, the Prophet (ﷺ) said, \"Why did you slap him?\" He said, \"O Allah's Messenger (ﷺ)! \nWhile I was passing by the Jews, I heard him saying, 'By Him Who selected Moses above the human \nbeings,' I said, 'Even above Muhammad?' I became furious and slapped him on the face.\" The Prophet (ﷺ) \nsaid, \"Do not give me superiority over the other prophets, for on the Day of Resurrection the people \nwill become unconscious and I will be the first to regain consciousness. Then I will see Moses holding \none of the legs of the Throne. I will not know whether he has come to his senses before me or that the \nshock he had received at the Mountain, (during his worldly life) was sufficient for him.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ مِنَ الْيَهُودِ إِلَى النَّبِيِّ صلى الله عليه وسلم قَدْ لُطِمَ وَجْهُهُ وَقَالَ يَا مُحَمَّدُ إِنَّ رَجُلاً مِنْ أَصْحَابِكَ مِنَ الأَنْصَارِ لَطَمَ وَجْهِي‏.‏ قَالَ ‏\"‏ ادْعُوهُ ‏\"‏‏.‏ فَدَعَوْهُ قَالَ ‏\"‏ لِمَ لَطَمْتَ وَجْهَهُ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، إِنِّي مَرَرْتُ بِالْيَهُودِ فَسَمِعْتُهُ يَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ‏.‏ فَقُلْتُ وَعَلَى مُحَمَّدٍ وَأَخَذَتْنِي غَضْبَةٌ فَلَطَمْتُهُ‏.‏ قَالَ ‏\"‏ لاَ تُخَيِّرُونِي مِنْ بَيْنِ الأَنْبِيَاءِ، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَفَاقَ قَبْلِي أَمْ جُزِيَ بِصَعْقَةِ الطُّورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4638In-book reference : Book 65, Hadith 160USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 162   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4639,
    "id": 4639,
    "url": "https://sunnah.com/bukhari:4639",
    "bookNumber": 65,
    "hadithNumber": 161,
    "narrator": "Narrated Sa`id Ibn Zaid:",
    "english": "The Prophet (ﷺ) said, \"Al-Kam'a is like the Mann (sweet resin or gum) (in that it grows naturally without \nhuman care) and its water is a cure for the eye diseases.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءُ الْعَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4639In-book reference : Book 65, Hadith 161USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 163   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4640,
    "id": 4640,
    "url": "https://sunnah.com/bukhari:4640",
    "bookNumber": 65,
    "hadithNumber": 162,
    "narrator": "Narrated Abu Ad-Darda:",
    "english": "There was a dispute between Abu Bakr and `Umar, and Abu Bakr made `Umar angry. So `Umar left \nangrily. Abu Bakr followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar \nrefused to do so and closed his door in Abu Bakr's face. So Abu Bakr went to Allah's Messenger (ﷺ) while \nwe were with him. Allah's Messenger (ﷺ) said, \"This friend of yours must have quarrelled (with somebody).\" \nIn the meantime `Umar repented and felt sorry for what he had done, so he came, greeted (those who \nwere present) and sat with the Prophet (ﷺ) and related the story to him. Allah's Messenger (ﷺ) became angry and \nAbu Bakr started saying, \"O Allah's Messenger (ﷺ)! By Allah, I was more at fault (than `Umar).\" Allah's \nApostle said, \"Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving \nfor me my companion? When I said, 'O people I am sent to you all as the Messenger of Allah,' you said, \n'You tell a lie.' while Abu Bakr said, 'You have spoken the truth .\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، وَمُوسَى بْنُ هَارُونَ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ بْنِ زَبْرٍ، قَالَ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، قَالَ سَمِعْتُ أَبَا الدَّرْدَاءِ، يَقُولُ كَانَتْ بَيْنَ أَبِي بَكْرٍ وَعُمَرَ مُحَاوَرَةٌ، فَأَغْضَبَ أَبُو بَكْرٍ عُمَرَ، فَانْصَرَفَ عَنْهُ عُمَرُ مُغْضَبًا، فَاتَّبَعَهُ أَبُو بَكْرٍ يَسْأَلُهُ أَنْ يَسْتَغْفِرَ لَهُ، فَلَمْ يَفْعَلْ حَتَّى أَغْلَقَ بَابَهُ فِي وَجْهِهِ، فَأَقْبَلَ أَبُو بَكْرٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَبُو الدَّرْدَاءِ وَنَحْنُ عِنْدَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا صَاحِبُكُمْ هَذَا فَقَدْ غَامَرَ ‏\"‏‏.‏ قَالَ وَنَدِمَ عُمَرُ عَلَى مَا كَانَ مِنْهُ فَأَقْبَلَ حَتَّى سَلَّمَ وَجَلَسَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَصَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الْخَبَرَ‏.‏ قَالَ أَبُو الدَّرْدَاءِ وَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَعَلَ أَبُو بَكْرٍ يَقُولُ وَاللَّهِ يَا رَسُولَ اللَّهِ لأَنَا كُنْتُ أَظْلَمَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي هَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي إِنِّي قُلْتُ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا فَقُلْتُمْ كَذَبْتَ‏.‏ وَقَالَ أَبُو بَكْرٍ صَدَقْتَ ‏ قَالَ أَبُو عَبْد اللَّهِ غَامَرَ سَبَقَ بِالْخَيْر\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4640In-book reference : Book 65, Hadith 162USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 164   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4641,
    "id": 4641,
    "url": "https://sunnah.com/bukhari:4641",
    "bookNumber": 65,
    "hadithNumber": 163,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"It was said to the children of Israel, 'Enter the gate in prostration and say \nHitatun. (7.161) We shall forgive you, your faults.' But they changed (Allah's Order) and entered, \ndragging themselves on their buttocks and said, 'Habatun (a grain) in a Sha'ratin (hair).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ‏{‏ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ نَغْفِرْ لَكُمْ خَطَايَاكُمْ‏}‏ فَبَدَّلُوا فَدَخَلُوا يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ وَقَالُوا حَبَّةٌ فِي شَعَرَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4641In-book reference : Book 65, Hadith 163USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 165   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4642,
    "id": 4642,
    "url": "https://sunnah.com/bukhari:4642",
    "bookNumber": 65,
    "hadithNumber": 164,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "'Uyaina bin Hisn bin Hudhaifa came and stayed with his nephew Al-Hurr bin Qais who was one of \nthose whom `Umar used to keep near him, as the Qurra' (learned men knowing Qur'an by heart) were \nthe people of `Umar's meetings and his advisors whether they were old or young. 'Uyaina said to his \nnephew, \"O son of my brother! You have an approach to this chief, so get for me the permission to see \nhim.\" Al-Hurr said, \"I will get the permission for you to see him.\" So Al-Hurr asked the permission \nfor 'Uyaina and `Umar admitted him. When 'Uyaina entered upon him, he said, \"Beware! O the son of \nAl-Khattab! By Allah, you neither give us sufficient provision nor judge among us with justice.\" \nThereupon `Umar became so furious that he intended to harm him, but Al-Hurr said, \"O chief of the \nBelievers! Allah said to His Prophet: \"Hold to forgiveness; command what is right; and leave (don't \npunish) the foolish.\" (7.199) and this (i.e. 'Uyaina) is one of the foolish.\" By Allah, `Umar did not \noverlook that Verse when Al-Hurr recited it before him; he observed (the orders of) Allah's Book \nstrictly.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ عُيَيْنَةُ بْنُ حِصْنِ بْنِ حُذَيْفَةَ فَنَزَلَ عَلَى ابْنِ أَخِيهِ الْحُرِّ بْنِ قَيْسٍ، وَكَانَ مِنَ النَّفَرِ الَّذِينَ يُدْنِيهِمْ عُمَرُ، وَكَانَ الْقُرَّاءُ أَصْحَابَ مَجَالِسِ عُمَرَ وَمُشَاوَرَتِهِ كُهُولاً كَانُوا أَوْ شُبَّانًا‏.‏ فَقَالَ عُيَيْنَةُ لاِبْنِ أَخِيهِ يَا ابْنَ أَخِي، لَكَ وَجْهٌ عِنْدَ هَذَا الأَمِيرِ فَاسْتَأْذِنْ لِي عَلَيْهِ‏.‏ قَالَ سَأَسْتَأْذِنُ لَكَ عَلَيْهِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَاسْتَأْذَنَ الْحُرُّ لِعُيَيْنَةَ فَأَذِنَ لَهُ عُمَرُ، فَلَمَّا دَخَلَ عَلَيْهِ قَالَ هِيْ يَا ابْنَ الْخَطَّابِ، فَوَاللَّهِ مَا تُعْطِينَا الْجَزْلَ، وَلاَ تَحْكُمُ بَيْنَنَا بِالْعَدْلِ‏.‏ فَغَضِبَ عُمَرُ حَتَّى هَمَّ بِهِ، فَقَالَ لَهُ الْحُرُّ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ اللَّهَ تَعَالَى قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ‏}‏ وَإِنَّ هَذَا مِنَ الْجَاهِلِينَ‏.‏ وَاللَّهِ مَا جَاوَزَهَا عُمَرُ حِينَ تَلاَهَا عَلَيْهِ، وَكَانَ وَقَّافًا عِنْدَ كِتَابِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4642In-book reference : Book 65, Hadith 164USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 166   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4643,
    "id": 4643,
    "url": "https://sunnah.com/bukhari:4643",
    "bookNumber": 65,
    "hadithNumber": 165,
    "narrator": "Narrated `Abdullah bin AzZubair:",
    "english": "(The Verse) \"Hold to forgiveness; command what is right...\" was revealed by Allah except in \nconnection with the character of the people.",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ‏}‏ قَالَ مَا أَنْزَلَ اللَّهُ إِلاَّ فِي أَخْلاَقِ النَّاسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4643In-book reference : Book 65, Hadith 165USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 167   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4644,
    "id": 4644,
    "url": "https://sunnah.com/bukhari:4644",
    "bookNumber": 65,
    "hadithNumber": 166,
    "narrator": "`Abdullah bin Az-Zubair said:",
    "english": "Allah ordered His Prophet \nto forgive the people their misbehavior (towards him).",
    "arabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ بَرَّادٍ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ أَمَرَ اللَّهُ نَبِيَّهُ صلى الله عليه وسلم أَنْ يَأْخُذَ الْعَفْوَ مِنْ أَخْلاَقِ النَّاسِ‏.‏ أَوْ كَمَا قَالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4644In-book reference : Book 65, Hadith 166USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 167   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4645,
    "id": 4645,
    "url": "https://sunnah.com/bukhari:4645",
    "bookNumber": 65,
    "hadithNumber": 167,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "I asked Ibn `Abbas regarding Surat-al-Anfal. He said, \"It was revealed in connection with the Battle of \nBadr.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ ـ رضى الله عنهما ـ سُورَةُ الأَنْفَالِ قَالَ نَزَلَتْ فِي بَدْرٍ‏.‏ الشَّوْكَةُ الْحَدُّ ‏{‏مُرْدَفِينَ‏}‏ فَوْجًا بَعْدَ فَوْجٍ، رَدِفَنِي وَأَرْدَفَنِي جَاءَ بَعْدِي ‏{‏ذُوقُوا‏}‏ بَاشِرُوا وَجَرِّبُوا وَلَيْسَ هَذَا مِنْ ذَوْقِ الْفَمِ ‏{‏فَيَرْكُمَهُ‏}‏ يَجْمَعُهُ‏.‏ ‏{‏شَرِّدْ‏}‏ فَرِّقْ ‏{‏وَإِنْ جَنَحُوا‏}‏ طَلَبُوا ‏{‏يُثْخِنَ‏}‏ يَغْلِبَ‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏مُكَاءً‏}‏ إِدْخَالُ أَصَابِعِهِمْ فِي أَفْوَاهِهِمْ وَ‏{‏تَصْدِيَةً‏}‏ الصَّفِيرُ ‏{‏لِيُثْبِتُوكَ‏}‏ لِيَحْبِسُوكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4645In-book reference : Book 65, Hadith 167USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 168   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4646,
    "id": 4646,
    "url": "https://sunnah.com/bukhari:4646",
    "bookNumber": 65,
    "hadithNumber": 168,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding the Verse: \"Verily! The worst of beasts in the Sight of Allah are the deaf and the dumb---- \nthose who understand not.\" (8.22) \n(The people referred to here) were some persons from the tribe of Bani `Abd-Addar.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لاَ يَعْقِلُونَ‏}‏ قَالَ هُمْ نَفَرٌ مِنْ بَنِي عَبْدِ الدَّارِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4646In-book reference : Book 65, Hadith 168USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 169   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4647,
    "id": 4647,
    "url": "https://sunnah.com/bukhari:4647",
    "bookNumber": 65,
    "hadithNumber": 169,
    "narrator": "Narrated Abu Sa`id bin Al-Mu'alla:",
    "english": "While I was praying, Allah's Messenger (ﷺ) passed me and called me, but I did not go to him until I had \nfinished the prayer. Then I went to him, and he said, \"What prevented you from coming to me? Didn't \nAllah say:-- \"O you who believe! Answer the call of Allah (by obeying Him) and His Apostle when \nHe calls you?\" He then said, \"I will inform you of the greatest Sura in the Qur'an before I leave (the \nmosque).\" When Allah's Messenger (ﷺ) got ready to leave (the mosque), I reminded him. He said, \"It is: \n'Praise be to Allah, the Lord of the worlds.' (i.e. Surat-al-Fatiha) As-sab'a Al-Mathani (the seven \nrepeatedly recited Verses).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، سَمِعْتُ حَفْصَ بْنَ عَاصِمٍ، يُحَدِّثُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى ـ رضى الله عنه ـ قَالَ كُنْتُ أُصَلِّي فَمَرَّ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَعَانِي فَلَمْ آتِهِ حَتَّى صَلَّيْتُ، ثُمَّ أَتَيْتُهُ فَقَالَ ‏\"‏ مَا مَنَعَكَ أَنْ تَأْتِيَ أَلَمْ يَقُلِ اللَّهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ‏}‏ ثُمَّ قَالَ لأُعَلِّمَنَّكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ أَخْرُجَ ‏\"‏‏.‏ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيَخْرُجَ فَذَكَرْتُ لَهُ‏.‏       \nوَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبٍ، سَمِعَ حَفْصًا، سَمِعَ أَبَا سَعِيدٍ، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا، وَقَالَ هِيَ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ السَّبْعُ الْمَثَانِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4647In-book reference : Book 65, Hadith 169USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 170   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4648,
    "id": 4648,
    "url": "https://sunnah.com/bukhari:4648",
    "bookNumber": 65,
    "hadithNumber": 170,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You, then rain down on us a shower \nof stones from the sky or bring on us a painful torment.\" So Allah revealed:-- \"But Allah would not \npunish them while you were amongst them, nor He will punish them while they seek (Allah's) \nforgiveness...\" (8.33) And why Allah should not punish them while they turn away (men) from Al- \nMasjid-al-Haram (the Sacred Mosque of Mecca)...\" (8.33-34)",
    "arabic": "حَدَّثَنِي أَحْمَدُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ ـ هُوَ ابْنُ كُرْدِيدٍ صَاحِبُ الزِّيَادِيِّ ـ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَبُو جَهْلٍ ‏{‏اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ‏}‏ فَنَزَلَتْ ‏{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَنْ لاَ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4648In-book reference : Book 65, Hadith 170USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 171   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4649,
    "id": 4649,
    "url": "https://sunnah.com/bukhari:4649",
    "bookNumber": 65,
    "hadithNumber": 171,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You), then rain down on us a shower \nof stones from the sky or bring on us a painful punishment.\" So there was revealed:-- 'But Allah \nwould not punish them while you (Muhammad) were amongst them, nor will He punish them while \nthey seek (Allah's) Forgiveness. And why Allah should not punish them while they stop (men) from \nAl-Masjid-al-Haram ..' (8.33-34)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ النَّضْرِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ، صَاحِبِ الزِّيَادِيِّ سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ أَبُو جَهْلٍ ‏{‏اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ‏}‏ فَنَزَلَتْ ‏{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَنْ لاَ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4649In-book reference : Book 65, Hadith 171USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 172   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4650,
    "id": 4650,
    "url": "https://sunnah.com/bukhari:4650",
    "bookNumber": 65,
    "hadithNumber": 172,
    "narrator": "Narrated Ibn `Umar:",
    "english": "That a man came to him (while two groups of Muslims were fighting) and said, \"O Abu `Abdur \nRahman! Don't you hear what Allah has mentioned in His Book: \n'And if two groups of believers fight against each other...' (49.9) \nSo what prevents you from fighting as Allah has mentioned in His Book?\"' Ibn `Umar said, \"O son of \nmy brother! I would rather be blamed for not fighting because of this Verse than to be blamed because \nof another Verse where Allah says: \n'And whoever kills a believer intentionally...\" (4.93) Then that man said, \"Allah says:-- 'And fight \nthem until there is no more afflictions (worshipping other besides Allah) and the religion (i.e. \nworship) will be all for Allah (Alone)\" (8.39) Ibn `Umar said, \"We did this during the lifetime of \nAllah's Messenger (ﷺ) when the number of Muslims was small, and a man was put to trial because of his \nreligion, the pagans would either kill or chain him; but when the Muslims increased (and Islam \nspread), there was no persecution.\" When that man saw that Ibn `Umar did not agree to his proposal, \nhe said, \"What is your opinion regarding `Ali and `Uthman?\" Ibn `Umar said, \"What is my opinion \nregarding `Ali and `Uthman? As for `Uthman, Allah forgave him and you disliked to forgive him, and \n`Ali is the cousin and son-in-law of Allah's Messenger (ﷺ) .\" Then he pointed out with his hand and said, \n\"And that is his daughter's (house) which you can see.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى، حَدَّثَنَا حَيْوَةُ، عَنْ بَكْرِ بْنِ عَمْرٍو، عَنْ بُكَيْرٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، جَاءَهُ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا‏}‏ إِلَى آخِرِ الآيَةِ، فَمَا يَمْنَعُكَ أَنْ لاَ تُقَاتِلَ كَمَا ذَكَرَ اللَّهُ فِي كِتَابِهِ‏.‏ فَقَالَ يَا ابْنَ أَخِي أَغْتَرُّ بِهَذِهِ الآيَةِ وَلاَ أُقَاتِلُ أَحَبُّ إِلَىَّ مِنْ أَنْ أَغْتَرَّ بِهَذِهِ الآيَةِ الَّتِي يَقُولُ اللَّهُ تَعَالَى ‏{‏وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا‏}‏ إِلَى آخِرِهَا‏.‏ قَالَ فَإِنَّ اللَّهَ يَقُولُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏‏.‏ قَالَ ابْنُ عُمَرَ قَدْ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ كَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ، إِمَّا يَقْتُلُوهُ وَإِمَّا يُوثِقُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ، فَلَمْ تَكُنْ فِتْنَةٌ، فَلَمَّا رَأَى أَنَّهُ لاَ يُوَافِقُهُ فِيمَا يُرِيدُ قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ‏.‏ قَالَ ابْنُ عُمَرَ مَا قَوْلِي فِي عَلِيٍّ وَعُثْمَانَ أَمَّا عُثْمَانُ فَكَانَ اللَّهُ قَدْ عَفَا عَنْهُ، فَكَرِهْتُمْ أَنْ يَعْفُوَ عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ وَهَذِهِ ابْنَتُهُ أَوْ بِنْتُهُ حَيْثُ تَرَوْنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4650In-book reference : Book 65, Hadith 172USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 173   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4651,
    "id": 4651,
    "url": "https://sunnah.com/bukhari:4651",
    "bookNumber": 65,
    "hadithNumber": 173,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Umar came to us and a man said (to him), \"What do you think about 'Qit-alal-Fitnah' (fighting \ncaused by afflictions).\" Ibn `Umar said (to him), \"And do you understand what an affliction is? \nMuhammad used to fight against the pagans, and his fighting with them was an affliction, (and his \nfighting was) not like your fighting which is carried on for the sake of ruling.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا بَيَانٌ، أَنَّ وَبَرَةَ، حَدَّثَهُ قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ خَرَجَ عَلَيْنَا أَوْ إِلَيْنَا ابْنُ عُمَرَ، فَقَالَ رَجُلٌ كَيْفَ تَرَى فِي قِتَالِ الْفِتْنَةِ‏.‏ فَقَالَ وَهَلْ تَدْرِي مَا الْفِتْنَةُ كَانَ مُحَمَّدٌ صلى الله عليه وسلم يُقَاتِلُ الْمُشْرِكِينَ، وَكَانَ الدُّخُولُ عَلَيْهِمْ فِتْنَةً، وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4651In-book reference : Book 65, Hadith 173USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 174   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4652,
    "id": 4652,
    "url": "https://sunnah.com/bukhari:4652",
    "bookNumber": 65,
    "hadithNumber": 174,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Verse:-- \"If there are twenty steadfast amongst you, they will overcome two hundred.\" \n(8.65) was revealed, then it became obligatory for the Muslims that one (Muslim) should not flee from \nten (non-Muslims). Sufyan (the sub-narrator) once said, \"Twenty (Muslims) should not flee before \ntwo hundred (non Muslims).\" Then there was revealed: 'But now Allah has lightened your (task)..' \n(8.66) \nSo it became obligatory that one-hundred (Muslims) should not flee before two hundred (nonmuslims). \n(Once Sufyan said extra, \"The Verse: 'Urge the believers to the fight. If there are twenty \nsteadfast amongst you (Muslims) ..' was revealed.) Sufyan said, \"Ibn Shabrama said, \"I see that this \norder is applicable to the obligation of enjoining good and forbidding evil.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لَمَّا نَزَلَتْ ‏{‏إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ‏}‏ فَكُتِبَ عَلَيْهِمْ أَنْ لاَ يَفِرَّ وَاحِدٌ مِنْ عَشَرَةٍ ـ فَقَالَ سُفْيَانُ غَيْرَ مَرَّةٍ أَنْ لاَ يَفِرَّ عِشْرُونَ مِنْ مِائَتَيْنِ ـ ثُمَّ نَزَلَتِ ‏{‏الآنَ خَفَّفَ اللَّهُ عَنْكُمُ‏}‏ الآيَةَ، فَكَتَبَ أَنْ لاَ يَفِرَّ مِائَةٌ مِنْ مِائَتَيْنِ ـ زَادَ سُفْيَانُ مَرَّةً ـ نَزَلَتْ ‏{‏حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ‏}‏‏.‏ قَالَ سُفْيَانُ وَقَالَ ابْنُ شُبْرُمَةَ وَأُرَى الأَمْرَ بِالْمَعْرُوفِ وَالنَّهْىَ عَنِ الْمُنْكَرِ مِثْلَ هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4652In-book reference : Book 65, Hadith 174USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 175   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4653,
    "id": 4653,
    "url": "https://sunnah.com/bukhari:4653",
    "bookNumber": 65,
    "hadithNumber": 175,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Verse:--'If there are twenty steadfast amongst you (Muslims), they will overcome twohundred \n(non-Muslims).' was revealed, it became hard on the Muslims when it became compulsory \nthat one Muslim ought not to flee (in war) before ten (non-Muslims). So (Allah) lightened the order by \nrevealing: \n'(But) now Allah has lightened your (task) for He knows that there is weakness in you. So if there are \nof you one-hundred steadfast, they will overcome (two-hundred (non-Muslims).' (8.66) So when \nAllah reduced the number of enemies which Muslims should withstand, their patience and \nperseverance against the enemy decreased as much as their task was lightened for them.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ السُّلَمِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ أَخْبَرَنِي الزُّبَيْرُ بْنُ خِرِّيتٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا نَزَلَتْ ‏{‏إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ‏}‏ شَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ حِينَ فُرِضَ عَلَيْهِمْ أَنْ لاَ يَفِرَّ وَاحِدٌ مِنْ عَشَرَةٍ، فَجَاءَ التَّخْفِيفُ فَقَالَ رالآنَ خَفَّفَ اللَّهُ عَنْكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضُعْفًا فَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ صَابِرَةٌ يَغْلِبُوا مِائَتَيْنِ‏}‏‏.‏ قَالَ فَلَمَّا خَفَّفَ اللَّهُ عَنْهُمْ مِنَ الْعِدَّةِ نَقَصَ مِنَ الصَّبْرِ بِقَدْرِ مَا خُفِّفَ عَنْهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4653In-book reference : Book 65, Hadith 175USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 176   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4654,
    "id": 4654,
    "url": "https://sunnah.com/bukhari:4654",
    "bookNumber": 65,
    "hadithNumber": 176,
    "narrator": "Narrated Al-Bara:",
    "english": "The last Verse that was revealed was: \n'They ask you for a legal verdict: Say: Allah directs (thus) about Al-Kalalah (those who leave no \ndescendants or ascendants as heirs).' And the last Sura which was revealed was Baraatun (9) .",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ آخِرُ آيَةٍ نَزَلَتْ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏ وَآخِرُ سُورَةٍ نَزَلَتْ بَرَاءَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4654In-book reference : Book 65, Hadith 176USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 177   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4655,
    "id": 4655,
    "url": "https://sunnah.com/bukhari:4655",
    "bookNumber": 65,
    "hadithNumber": 177,
    "narrator": "Narrated Humaid bin `Abdur-Rahman:",
    "english": "Abu Huraira said, \"During that Hajj (in which Abu Bakr was the chief of the pilgrims) Abu Bakr sent \nme along with announcers on the Day of Nahr ( 10th of Dhul-Hijja) in Mina to announce: \"No pagans \nshall perform, Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked \nstate.\" Humaid bin `Abdur Rahman added: Then Allah's Messenger (ﷺ) sent `Ali bin Abi Talib (after Abu \nBakr) and ordered him to recite aloud in public Surat Bara'a. Abu Huraira added, \"So `Ali, along with \nus, recited Bara'a (loudly) before the people at Mina on the Day of Nahr and announced; \"No pagan \nshall perform Hajj after this year and none shall perform the Tawaf around the Ka`ba in a naked \nstate.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، وَأَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَنِي أَبُو بَكْرٍ فِي تِلْكَ الْحَجَّةِ فِي مُؤَذِّنِينَ، بَعَثَهُمْ يَوْمَ النَّحْرِ يُؤَذِّنُونَ بِمِنًى أَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ قَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ ثُمَّ أَرْدَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَلِيِّ بْنِ أَبِي طَالِبٍ، وَأَمَرَهُ أَنْ يُؤَذِّنَ بِبَرَاءَةَ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَذَّنَ مَعَنَا عَلِيٌّ يَوْمَ النَّحْرِ فِي أَهْلِ مِنًى بِبَرَاءَةَ، وَأَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4655In-book reference : Book 65, Hadith 177USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 178   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4656,
    "id": 4656,
    "url": "https://sunnah.com/bukhari:4656",
    "bookNumber": 65,
    "hadithNumber": 178,
    "narrator": "Narrated Humaid bin `Abdur Rahman:",
    "english": "Abu Huraira said, \"Abu Bakr sent me in that Hajj in which he was the chief of the pilgrims along with \nthe announcers whom he sent on the Day of Nahr to announce at Mina: \"No pagan shall perform Hajj \nafter this year, and none shall perform the Tawaf around the Ka`ba in a naked state.\" Humaid added: \nThat the Prophet (ﷺ) sent `Ali bin Abi Talib (after Abu Bakr) and ordered him to recite aloud in public \nSurat-Baraa. Abu Huraira added, \"So `Ali, along with us, recited Bara'a (loudly) before the people at \nMina on the Day of Nahr and announced \"No pagan shall perform Hajj after this year and none shall \nperform the Tawaf around the Ka`ba in a naked state.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَعَثَنِي أَبُو بَكْرٍ ـ رضى الله عنه ـ فِي تِلْكَ الْحَجَّةِ فِي الْمُؤَذِّنِينَ، بَعَثَهُمْ يَوْمَ النَّحْرِ يُؤَذِّنُونَ بِمِنًى أَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ قَالَ حُمَيْدٌ ثُمَّ أَرْدَفَ النَّبِيُّ صلى الله عليه وسلم بِعَلِيِّ بْنِ أَبِي طَالِبٍ، فَأَمَرَهُ أَنْ يُؤَذِّنَ بِبَرَاءَةَ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَذَّنَ مَعَنَا عَلِيٌّ فِي أَهْلِ مِنًى يَوْمَ النَّحْرِ بِبَرَاءَةَ، وَأَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4656In-book reference : Book 65, Hadith 178USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 179   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4657,
    "id": 4657,
    "url": "https://sunnah.com/bukhari:4657",
    "bookNumber": 65,
    "hadithNumber": 179,
    "narrator": "Narrated Humaid bin `Abdur-Rahman:",
    "english": "Abu Huraira said that Abu Bakr sent him during the Hajj in which Abu Bakr was made the chief of \nthe pilgrims by Allah's Messenger (ﷺ) before (the year of) Hajjat al-Wada` in a group (of announcers) to \nannounce before the people; 'No pagan shall perform the Hajj after this year, and none shall perform \nthe Tawaf around the Ka`ba in a naked state. Humaid used to say The Day of Nahr is the day of Al- \nHajj Al-Akbar (the Greatest Day) because of the narration of Abu Huraira.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ بَعَثَهُ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهَا قَبْلَ حَجَّةِ الْوَدَاعِ فِي رَهْطٍ يُؤَذِّنُ فِي النَّاسِ أَنْ لاَ يَحُجَّنَّ بَعْدَ الْعَامِ مُشْرِكٌ وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ فَكَانَ حُمَيْدٌ يَقُولُ يَوْمُ النَّحْرِ يَوْمُ الْحَجِّ الأَكْبَرِ‏.‏ مِنْ أَجْلِ حَدِيثِ أَبِي هُرَيْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4657In-book reference : Book 65, Hadith 179USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 180   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4658,
    "id": 4658,
    "url": "https://sunnah.com/bukhari:4658",
    "bookNumber": 65,
    "hadithNumber": 180,
    "narrator": "Narrated Zaid bin Wahb:",
    "english": "We were with Hudhaifa and he said, \"None remains of the people described by this Verse (9.12), \n\"Except three, and of the hypocrites except four.\" A bedouin said, \"You the companions of \nMuhammad! Tell us (things) and we do not know that about those who break open our houses and \nsteal our precious things? ' He (Hudhaifa) replied, \"Those are Al Fussaq (rebellious wrongdoers) (not \ndisbelievers or hypocrites). Really, none remains of them (hypocrite) but four, one of whom is a very \nold man who, if he drinks water, does not feel its coldness.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، قَالَ كُنَّا عِنْدَ حُذَيْفَةَ فَقَالَ مَا بَقِيَ مِنْ أَصْحَابِ هَذِهِ الآيَةِ إِلاَّ ثَلاَثَةٌ، وَلاَ مِنَ الْمُنَافِقِينَ إِلاَّ أَرْبَعَةٌ‏.‏ فَقَالَ أَعْرَابِيٌّ إِنَّكُمْ أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم تُخْبِرُونَا فَلاَ نَدْرِي فَمَا بَالُ هَؤُلاَءِ الَّذِينَ يَبْقُرُونَ بُيُوتَنَا وَيَسْرِقُونَ أَعْلاَقَنَا‏.‏ قَالَ أُولَئِكَ الْفُسَّاقُ، أَجَلْ لَمْ يَبْقَ مِنْهُمْ إِلاَّ أَرْبَعَةٌ‏.‏ أَحَدُهُمْ شَيْخٌ كَبِيرٌ لَوْ شَرِبَ الْمَاءَ الْبَارِدَ لَمَا وَجَدَ بَرْدَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4658In-book reference : Book 65, Hadith 180USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 181   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4659,
    "id": 4659,
    "url": "https://sunnah.com/bukhari:4659",
    "bookNumber": 65,
    "hadithNumber": 181,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Kanz (money, the Zakat of which is not paid) of anyone of you will appear \nin the form of bald-headed poisonous male snake on the Day of Resurrection.\"",
    "arabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4659In-book reference : Book 65, Hadith 181USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 182   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4660,
    "id": 4660,
    "url": "https://sunnah.com/bukhari:4660",
    "bookNumber": 65,
    "hadithNumber": 182,
    "narrator": "Narrated Zaid bin Wahb:",
    "english": "I passed by (visited ) Abu Dhar at Ar-Rabadha and said to him, \"What has brought you to this land?\" \nHe said, \"We were at Sham and I recited the Verse: \"They who hoard up gold and silver and spend \nthem not in the way of Allah; announce to them a painful torment, \" (9.34) where upon Muawiya \nsaid, 'This Verse is not for us, but for the people of the Scripture.' Then I said, 'But it is both for us \n(Muslim) and for them.' \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ حُصَيْنٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ مَرَرْتُ عَلَى أَبِي ذَرٍّ بِالرَّبَذَةِ فَقُلْتُ مَا أَنْزَلَكَ بِهَذِهِ الأَرْضِ قَالَ كُنَّا بِالشَّأْمِ فَقَرَأْتُ ‏{‏وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ‏}‏ قَالَ مُعَاوِيَةُ مَا هَذِهِ فِينَا، مَا هَذِهِ إِلاَّ فِي أَهْلِ الْكِتَابِ‏.‏ قَالَ قُلْتُ إِنَّهَا لَفِينَا وَفِيهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4660In-book reference : Book 65, Hadith 182USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 183   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4661,
    "id": 4661,
    "url": "https://sunnah.com/bukhari:4661",
    "bookNumber": 65,
    "hadithNumber": 183,
    "narrator": "Narrated Khãlid bin Aslam:",
    "english": "We\nwent out with 'Abdullãh bin 'Umar and he\nsaid, \"This (Verse) was revealed before the\nprescription of Zakat, and when Zakãt was\nprescribed, Allah made it a means of\npurifying one's wealth.\"",
    "arabic": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ خَالِدِ بْنِ أَسْلَمَ، قَالَ خَرَجْنَا مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ هَذَا قَبْلَ أَنْ تُنْزَلَ، الزَّكَاةُ، فَلَمَّا أُنْزِلَتْ جَعَلَهَا اللَّهُ طُهْرًا لِلأَمْوَالِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4661In-book reference : Book 65, Hadith 183USC-MSA web (English) reference : Vol. 1, Book 60, Hadith 183   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4662,
    "id": 4662,
    "url": "https://sunnah.com/bukhari:4662",
    "bookNumber": 65,
    "hadithNumber": 184,
    "narrator": "Narrated Abu Bakr:",
    "english": "The Prophet (ﷺ) said, \"Time has come back to its original state which it had when Allah created the \nHeavens and the Earth; the year is twelve months, four of which are sacred. Three of them are in \nsuccession; Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and (the fourth being) Rajab Mudar (named \nafter the tribe of Mudar as they used to respect this month) which stands between Jumad (ath-thani) \nand Sha'ban.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الزَّمَانَ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا، أَرْبَعَةٌ حُرُمٌ، ثَلاَثٌ مُتَوَالِيَاتٌ، ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4662In-book reference : Book 65, Hadith 184USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 184   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4663,
    "id": 4663,
    "url": "https://sunnah.com/bukhari:4663",
    "bookNumber": 65,
    "hadithNumber": 185,
    "narrator": "Narrated Abu Bakr:",
    "english": "I was in the company of the Prophet (ﷺ) in the cave, and on seeing the traces of the pagans, I said, \"O \nAllah's Messenger (ﷺ) If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you \nthink of two, the third of whom is Allah?\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا ثَابِتٌ، حَدَّثَنَا أَنَسٌ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْغَارِ، فَرَأَيْتُ آثَارَ الْمُشْرِكِينَ قُلْتُ يَا رَسُولَ اللَّهِ، لَوْ أَنَّ أَحَدَهُمْ رَفَعَ قَدَمَهُ رَآنَا‏.‏ قَالَ ‏\n\"‏ مَا ظَنُّكَ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4663In-book reference : Book 65, Hadith 185USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 185   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4664,
    "id": 4664,
    "url": "https://sunnah.com/bukhari:4664",
    "bookNumber": 65,
    "hadithNumber": 186,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "When there happened the disagreement between Ibn Az-Zubair and Ibn `Abbas, I said (to the latter), \n\"(Why don't you take the oath of allegiance to him as) his father is Az-Zubair, and his mother is \nAsma,' and his aunt is `Aisha, and his maternal grandfather is Abu Bakr, and his grandmother is \nSafiya?\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ حِينَ وَقَعَ بَيْنَهُ وَبَيْنَ ابْنِ الزُّبَيْرِ قُلْتُ أَبُوهُ الزُّبَيْرُ، وَأُمُّهُ أَسْمَاءُ، وَخَالَتُهُ عَائِشَةُ، وَجَدُّهُ أَبُو بَكْرٍ، وَجَدَّتُهُ صَفِيَّةُ‏.‏ فَقُلْتُ لِسُفْيَانَ إِسْنَادُهُ‏.‏ فَقَالَ حَدَّثَنَا، فَشَغَلَهُ إِنْسَانٌ وَلَمْ يَقُلِ ابْنُ جُرَيْجٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4664In-book reference : Book 65, Hadith 186USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 186   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4665,
    "id": 4665,
    "url": "https://sunnah.com/bukhari:4665",
    "bookNumber": 65,
    "hadithNumber": 187,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "There was a disagreement between them (i.e. Ibn `Abbas and Ibn Az-Zubair) so I went to Ibn `Abbas \nin the morning and said (to him), \"Do you want to fight against Ibn Zubair and thus make lawful what \nAllah has made unlawful (i.e. fighting in Meccas?\" Ibn `Abbas said, \"Allah forbid! Allah ordained \nthat Ibn Zubair and Bani Umaiya would permit (fighting in Mecca), but by Allah, I will never regard it \nas permissible.\" Ibn `Abbas added. \"The people asked me to take the oath of allegiance to Ibn \nAzZubair. I said, 'He is really entitled to assume authority for his father, Az-Zubair was the helper of \nthe Prophet, his (maternal) grandfather, Abu Bakr was (the Prophet's) companion in the cave, his \nmother, Asma' was 'Dhatun-Nitaq', his aunt, `Aisha was the mother of the Believers, his paternal aunt, \nKhadija was the wife of the Prophet (ﷺ) , and the paternal aunt of the Prophet (ﷺ) was his grandmother. He \nhimself is pious and chaste in Islam, well versed in the Knowledge of the Qur'an. By Allah! (Really, I \nleft my relatives, Bani Umaiya for his sake though) they are my close relatives, and if they should be \nmy rulers, they are equally apt to be so and are descended from a noble family.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَكَانَ بَيْنَهُمَا شَىْءٌ فَغَدَوْتُ عَلَى ابْنِ عَبَّاسٍ فَقُلْتُ أَتُرِيدُ أَنْ تُقَاتِلَ ابْنَ الزُّبَيْرِ، فَتُحِلُّ حَرَمَ اللَّهِ‏.‏ فَقَالَ مَعَاذَ اللَّهِ، إِنَّ اللَّهَ كَتَبَ ابْنَ الزُّبَيْرِ وَبَنِي أُمَيَّةَ مُحِلِّينَ، وَإِنِّي وَاللَّهِ لاَ أُحِلُّهُ أَبَدًا‏.‏ قَالَ قَالَ النَّاسُ بَايِعْ لاِبْنِ الزُّبَيْرِ‏.‏ فَقُلْتُ وَأَيْنَ بِهَذَا الأَمْرِ عَنْهُ أَمَّا أَبُوهُ فَحَوَارِيُّ النَّبِيِّ صلى الله عليه وسلم، يُرِيدُ الزُّبَيْرَ، وَأَمَّا جَدُّهُ فَصَاحِبُ الْغَارِ، يُرِيدُ أَبَا بَكْرٍ، وَأُمُّهُ فَذَاتُ النِّطَاقِ، يُرِيدُ أَسْمَاءَ، وَأَمَّا خَالَتُهُ فَأُمُّ الْمُؤْمِنِينَ، يُرِيدُ عَائِشَةَ، وَأَمَّا عَمَّتُهُ فَزَوْجُ النَّبِيِّ صلى الله عليه وسلم، يُرِيدُ خَدِيجَةَ، وَأَمَّا عَمَّةُ النَّبِيِّ صلى الله عليه وسلم فَجَدَّتُهُ، يُرِيدُ صَفِيَّةَ، ثُمَّ عَفِيفٌ فِي الإِسْلاَمِ، قَارِئٌ لِلْقُرْآنِ‏.‏ وَاللَّهِ إِنْ وَصَلُونِي وَصَلُونِي مِنْ قَرِيبٍ، وَإِنْ رَبُّونِي رَبَّنِي أَكْفَاءٌ كِرَامٌ، فَآثَرَ التُّوَيْتَاتِ وَالأُسَامَاتِ وَالْحُمَيْدَاتِ، يُرِيدُ أَبْطُنًا مِنْ بَنِي أَسَدٍ بَنِي تُوَيْتٍ وَبَنِي أُسَامَةَ وَبَنِي أَسَدٍ، إِنَّ ابْنَ أَبِي الْعَاصِ بَرَزَ يَمْشِي الْقُدَمِيَّةَ، يَعْنِي عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، وَإِنَّهُ لَوَّى ذَنَبَهُ، يَعْنِي ابْنَ الزُّبَيْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4665In-book reference : Book 65, Hadith 187USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 187   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4666,
    "id": 4666,
    "url": "https://sunnah.com/bukhari:4666",
    "bookNumber": 65,
    "hadithNumber": 188,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "We entered upon Ibn `Abbas and he said \"Are you not astonished at Ibn Az-Zubair's assuming the \ncaliphate?\" I said (to myself), \"I will support him and speak of his good traits as I did not do even for \nAbu Bakr and `Umar though they were more entitled to receive al I good than he was.\" I said \"He (i.e \nIbn Az-Zubair) is the son of the aunt of the Prophet (ﷺ) and the son of AzZubair, and the grandson of Abu \nBakr and the son of Khadija's brother, and the son of `Aisha's sister.\" Nevertheless, he considers \nhimself to be superior to me and does not want me to be one of his friends. So I said, \"I never \nexpected that he would refuse my offer to support him, and I don't think he intends to do me any good, \ntherefore, if my cousins should inevitably be my rulers, it will be better for me to be ruled by them \nthan by some others.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، دَخَلْنَا عَلَى ابْنِ عَبَّاسٍ فَقَالَ أَلاَ تَعْجَبُونَ لاِبْنِ الزُّبَيْرِ قَامَ فِي أَمْرِهِ هَذَا فَقُلْتُ لأُحَاسِبَنَّ نَفْسِي لَهُ مَا حَاسَبْتُهَا لأَبِي بَكْرٍ وَلاَ لِعُمَرَ، وَلَهُمَا كَانَا أَوْلَى بِكُلِّ خَيْرٍ مِنْهُ، وَقُلْتُ ابْنُ عَمَّةِ النَّبِيِّ صلى الله عليه وسلم، وَابْنُ الزُّبَيْرِ، وَابْنُ أَبِي بَكْرٍ، وَابْنُ أَخِي خَدِيجَةَ، وَابْنُ أُخْتِ عَائِشَةَ فَإِذَا هُوَ يَتَعَلَّى عَنِّي وَلاَ يُرِيدُ ذَلِكَ فَقُلْتُ مَا كُنْتُ أَظُنُّ أَنِّي أَعْرِضُ هَذَا مِنْ نَفْسِي، فَيَدَعُهُ، وَمَا أُرَاهُ يُرِيدُ خَيْرًا، وَإِنْ كَانَ لاَ بُدَّ لأَنْ يَرُبَّنِي بَنُو عَمِّي أَحَبُّ إِلَىَّ مِنْ أَنْ يَرُبَّنِي غَيْرُهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4666In-book reference : Book 65, Hadith 188USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 188   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4667,
    "id": 4667,
    "url": "https://sunnah.com/bukhari:4667",
    "bookNumber": 65,
    "hadithNumber": 189,
    "narrator": "Narrated Abu Sa`id:",
    "english": "Something was sent to the Prophet (ﷺ) and he distributed it amongst four (men) and said, \"I want to attract \ntheir hearts,(to Islam thereby),\" A man said (to the Prophet (ﷺ) ), \"You have not done justice.\" Thereupon \nthe Prophet (ﷺ) said, \"There will emerge from the offspring of this (man) some people who will renounce \nthe religion.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيد ٍ ـ رضى الله عنه ـ قَالَ بُعِثَ إِلَى النَّبِيِّ صلى الله عليه وسلم بِشَىْءٍ، فَقَسَمَهُ بَيْنَ أَرْبَعَةٍ وَقَالَ ‏\"‏ أَتَأَلَّفُهُمْ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مَا عَدَلْتَ‏.‏ فَقَالَ ‏\"‏ يَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَمْرُقُونَ مِنَ الدِّينِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4667In-book reference : Book 65, Hadith 189USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 189   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4668,
    "id": 4668,
    "url": "https://sunnah.com/bukhari:4668",
    "bookNumber": 65,
    "hadithNumber": 190,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "When we were ordered to give alms, we began to work as porters (to earn something we could give in \ncharity). Abu `Aqil came with one half of a Sa` (special measure for food grains) and another person \nbrought more than he did. So the hypocrites said, \"Allah is not in need of the alms of this (i.e. Abu `Aqil); \nand this other person did not give alms but for showing off.\" Then Allah revealed:-- \n'Those who criticize such of the Believers who give charity voluntarily and those who could not find \nto give in charity except what is available to them.' (9.79)",
    "arabic": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ أَبُو مُحَمَّدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ لَمَّا أُمِرْنَا بِالصَّدَقَةِ كُنَّا نَتَحَامَلُ فَجَاءَ أَبُو عَقِيلٍ بِنِصْفِ صَاعٍ، وَجَاءَ إِنْسَانٌ بِأَكْثَرَ مِنْهُ، فَقَالَ الْمُنَافِقُونَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ صَدَقَةِ هَذَا، وَمَا فَعَلَ هَذَا الآخَرُ إِلاَّ رِئَاءً‏.‏ فَنَزَلَتْ ‏{‏الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لاَ يَجِدُونَ إِلاَّ جُهْدَهُمْ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4668In-book reference : Book 65, Hadith 190USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 190   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4669,
    "id": 4669,
    "url": "https://sunnah.com/bukhari:4669",
    "bookNumber": 65,
    "hadithNumber": 191,
    "narrator": "Narrated Shaqiq:",
    "english": "Abu Mas`ud Al-Ansari said, \"Allah's Messenger (ﷺ), used to order us to give alms. So one of us would exert \nhimself to earn one Mud (special measure of wheat or dates, etc.,) to give in charity; while today one \nof us may have one hundred thousand.\" Shaqiq said: As if Abu Masud referred to himself.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ أَحَدَّثَكُمْ زَائِدَةُ عَنْ سُلَيْمَانَ عَنْ شَقِيقٍ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِالصَّدَقَةِ، فَيَحْتَالُ أَحَدُنَا حَتَّى يَجِيءَ بِالْمُدِّ، وَإِنَّ لأَحَدِهِمِ الْيَوْمَ مِائَةَ أَلْفٍ‏.‏ كَأَنَّهُ يُعَرِّضُ بِنَفْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4669In-book reference : Book 65, Hadith 191USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 191   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4670,
    "id": 4670,
    "url": "https://sunnah.com/bukhari:4670",
    "bookNumber": 65,
    "hadithNumber": 192,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When `Abdullah bin 'Ubai died, his son `Abdullah bin `Abdullah came to Allah's Messenger (ﷺ) and asked \nhim to give him his shirt in order to shroud his father in it. He gave it to him and then `Abdullah asked \nthe Prophet (ﷺ) to offer the funeral prayer for him (his father). Allah's Messenger (ﷺ) got up to offer the funeral \nprayer for him, but `Umar got up too and got hold of the garment of Allah's Messenger (ﷺ) and said, \"O \nAllah's Messenger (ﷺ) Will you offer the funeral prayer for him though your Lord has forbidden you to offer \nthe prayer for him\" Allah's Messenger (ﷺ) said, \"But Allah has given me the choice by saying: \n'(Whether you) ask forgiveness for them, or do not ask forgiveness for them; even if you ask \nforgiveness for them seventy times..' (9.80) so I will ask more than seventy times.\" `Umar said, \"But \nhe (`Abdullah bin 'Ubai) is a hypocrite!\" However, Allah's Messenger (ﷺ) did offer the funeral prayer for him \nwhereupon Allah revealed: \n'And never (O Muhammad) pray for anyone of them that dies, nor stand at his grave.' (9.84)",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ، ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ فَقَامَ عُمَرُ فَأَخَذَ بِثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ تُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ رَبُّكَ أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً‏}‏ وَسَأَزِيدُهُ عَلَى السَّبْعِينَ ‏\"‏‏.‏ قَالَ إِنَّهُ مُنَافِقٌ‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4670In-book reference : Book 65, Hadith 192USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 192   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4671,
    "id": 4671,
    "url": "https://sunnah.com/bukhari:4671",
    "bookNumber": 65,
    "hadithNumber": 193,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "When `Abdullah bin Ubai bin Salul died, Allah's Messenger (ﷺ) was called in order to offer the funeral \nprayer for him. When Allah's Messenger (ﷺ) got up (to offer the prayer) I jumped towards him and said, \"O \nAllah's Messenger (ﷺ)! Do you offer the prayer for Ibn Ubai although he said so-and-so on such-and-such-a \nday?\" I went on mentioning his sayings. Allah's Messenger (ﷺ) smiled and said, \"Keep away from me, O \n`Umar!\" But when I spoke too much to him, he said, \"I have been given the choice, and I have chosen \n(this) ; and if I knew that if I asked forgiveness for him more than seventy times, he would be for \ngiven, I would ask it for more times than that.\" So Allah's Messenger (ﷺ) offered the funeral prayer for him \nand then left, but he did not stay long before the two Verses of Surat-Bara'a were revealed, i.e.:-- 'And \nnever (O Muhammad) pray for anyone of them that dies.... and died in a state of rebellion.' (9.84) \nLater I was astonished at my daring to speak like that to Allah's Messenger (ﷺ) and Allah and His Apostle \nknow best.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ،‏.‏ وَقَالَ غَيْرُهُ حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ دُعِيَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَلَمَّا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبْتُ إِلَيْهِ، فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتُصَلِّي عَلَى ابْنِ أُبَىٍّ وَقَدْ قَالَ يَوْمَ كَذَا كَذَا وَكَذَا قَالَ أُعَدِّدُ عَلَيْهِ قَوْلَهُ، فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ أَخِّرْ عَنِّي يَا عُمَرُ ‏\"‏‏.‏ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ ‏\"‏ إِنِّي خُيِّرْتُ فَاخْتَرْتُ، لَوْ أَعْلَمُ أَنِّي إِنْ زِدْتُ عَلَى السَّبْعِينَ يُغْفَرْ لَهُ لَزِدْتُ عَلَيْهَا ‏\"‏‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ انْصَرَفَ فَلَمْ يَمْكُثْ إِلاَّ يَسِيرًا حَتَّى نَزَلَتِ الآيَتَانِ مِنْ بَرَاءَةَ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ إِلَى قَوْلِهِ ‏{‏وَهُمْ فَاسِقُونَ‏}‏ قَالَ فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4671In-book reference : Book 65, Hadith 193USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 193   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4672,
    "id": 4672,
    "url": "https://sunnah.com/bukhari:4672",
    "bookNumber": 65,
    "hadithNumber": 194,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When `Abdullah bin Ubai died, his son `Abdullah bin `Abdullah came to Allah's Messenger (ﷺ) who gave \nhis shirt to him and ordered him to shroud his father in it. Then he stood up to offer the funeral prayer \nfor the deceased, but `Umar bin Al-Khattab took hold of his garment and said, \"Do you offer the \nfuneral prayer for him though he was a hypocrite and Allah has forbidden you to ask forgiveness for \nhypocrites?\" The Prophet (ﷺ) said, \"Allah has given me the choice (or Allah has informed me) saying: \n\"Whether you, O Muhammad, ask forgiveness for them, or do not ask forgiveness for them, even if \nyou ask forgiveness for them seventy times, Allah will not forgive them,\" (9.80) The he added, \"I will \n(appeal to Allah for his sake) more than seventy times.\" So Allah's Messenger (ﷺ) offered the funeral prayer \nfor him and we too, offered the prayer along with him. Then Allah revealed: \"And never, O \nMuhammad, pray (funeral prayer) for anyone of them that dies, nor stand at his grave. Certainly they \ndisbelieved in Allah and His Apostle and died in a state of rebellion.\" (9.84)",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُ قَمِيصَهُ وَأَمَرَهُ أَنْ يُكَفِّنَهُ فِيهِ ثُمَّ قَامَ يُصَلِّي عَلَيْهِ، فَأَخَذَ عُمَرُ بْنُ الْخَطَّابِ بِثَوْبِهِ فَقَالَ تُصَلِّي عَلَيْهِ وَهْوَ مُنَافِقٌ وَقَدْ نَهَاكَ اللَّهُ أَنْ تَسْتَغْفِرَ لَهُمْ‏.‏ قَالَ ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ أَوْ أَخْبَرَنِي فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏ فَقَالَ سَأَزِيدُهُ عَلَى سَبْعِينَ ‏\"‏‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَلَّيْنَا مَعَهُ ثُمَّ أَنْزَلَ اللَّهُ عَلَيْهِ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4672In-book reference : Book 65, Hadith 194USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 194   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4673,
    "id": 4673,
    "url": "https://sunnah.com/bukhari:4673",
    "bookNumber": 65,
    "hadithNumber": 195,
    "narrator": "Narrated `Abdullah bin Ka`b:",
    "english": "I heard Ka`b bin Malik at the time he remained behind and did not join (the battle of) Tabuk, saying, \n\"By Allah, no blessing has Allah bestowed upon me, besides my guidance to Islam, better than that of \nhelping me speak the truth to Allah's Messenger (ﷺ) otherwise I would have told the Prophet (ﷺ) a lie and would \nhave been ruined like those who had told a lie when the Divine Inspiration was revealed:-- \"They will \nswear by Allah to you (Muslims) when you return to them.. the rebellious people.\" (9.95-96)",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، حِينَ تَخَلَّفَ عَنْ تَبُوكَ، وَاللَّهِ، مَا أَنْعَمَ اللَّهُ عَلَىَّ مِنْ نِعْمَةٍ بَعْدَ إِذْ هَدَانِي أَعْظَمَ مِنْ صِدْقِي رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ لاَ أَكُونَ كَذَبْتُهُ فَأَهْلِكَ كَمَا هَلَكَ الَّذِينَ كَذَبُوا حِينَ أُنْزِلَ الْوَحْىُ ‏{‏سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ‏}‏ إِلَى ‏{‏الْفَاسِقِينَ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4673In-book reference : Book 65, Hadith 195USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 195   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4674,
    "id": 4674,
    "url": "https://sunnah.com/bukhari:4674",
    "bookNumber": 65,
    "hadithNumber": 196,
    "narrator": "Narrated Samura bin Jundab:",
    "english": "Allah's Messenger (ﷺ) said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built \nwith gold bricks and silver bricks. There we met men who, half of their bodies, look like the mosthandsome \nhuman beings you have ever seen, and the other half, the ugliest human beings you have \never seen. Those two visitors said to those men, 'Go and dip yourselves in that river. So they dipped \nthemselves therein and then came to us, their ugliness having disappeared and they were in the mosthandsome \nshape. The visitors said, 'The first is the Garden of Eden and that is your dwelling place.' \nThen they added, 'As for those people who were half ugly and half handsome, they were those who \nmixed good deeds and bad deeds, but Allah forgave them.\"",
    "arabic": "حَدَّثَنَا مُؤَمَّلٌ ـ هُوَ ابْنُ هِشَامٍ ـ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، وَحَدَّثَنَا عَوْفٌ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا سَمُرَةُ بْنُ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَنَا ‏\n\"‏ أَتَانِي اللَّيْلَةَ آتِيَانِ فَابْتَعَثَانِي، فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ، فَتَلَقَّانَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ، وَشَطْرٌ كَأَقْبَحِ مَا أَنْتَ رَاءٍ قَالاَ لَهُمُ اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهْرِ‏.‏ فَوَقَعُوا فِيهِ ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ، فَصَارُوا فِي أَحْسَنِ صُورَةٍ قَالاَ لِي هَذِهِ جَنَّةُ عَدْنٍ، وَهَذَاكَ مَنْزِلُكَ قَالاَ أَمَّا الْقَوْمُ الَّذِينَ كَانُوا شَطْرٌ مِنْهُمْ حَسَنٌ وَشَطْرٌ مِنْهُمْ قَبِيحٌ فَإِنَّهُمْ خَلَطُوا عَمَلاً صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ اللَّهُ عَنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4674In-book reference : Book 65, Hadith 196USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 196   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4675,
    "id": 4675,
    "url": "https://sunnah.com/bukhari:4675",
    "bookNumber": 65,
    "hadithNumber": 197,
    "narrator": "Narrated Al-Musaiyab:",
    "english": "When Abu Talib's death approached, the Prophet (ﷺ) went to him while Abu Jahl and `Abdullah bin Abi \nUmaiya were present with him. The Prophet (ﷺ) said, \"O uncle, say: None has the right to be worshipped \nexcept Allah, so that I may argue for your case with it before Allah.\" On that, Abu Jahl and `Abdullah \nbin Abu Umaiya said, \"O Abu Talib! Do you want to renounce `Abdul Muttalib's religion?\" Then the \nProphet said, \"I will keep on asking (Allah for) forgiveness for you unless I am forbidden to do so.\" \nThen there was revealed:-- \n'It is not fitting for the Prophet (ﷺ) and those who believe that they should invoke (Allah) for forgiveness \nfor pagans even though they be of kin, after it has become clear to them that they are companions of \nthe Fire.' (9.113)",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ دَخَلَ عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَعِنْدَهُ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَىْ عَمِّ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ أُحَاجُّ لَكَ بِهَا عِنْدَ اللَّهِ ‏\"‏‏.‏ فَقَالَ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ يَا أَبَا طَالِبٍ، أَتَرْغَبُ عَنْ مِلَّةِ عَبْدِ الْمُطَّلِبِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لأَسْتَغْفِرَنَّ لَكَ مَا لَمْ أُنْهَ عَنْكَ ‏\"‏‏.‏ فَنَزَلَتْ ‏{‏مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَى مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4675In-book reference : Book 65, Hadith 197USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 197   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4676,
    "id": 4676,
    "url": "https://sunnah.com/bukhari:4676",
    "bookNumber": 65,
    "hadithNumber": 198,
    "narrator": "Narrated `Abdullah bin Ka`b:",
    "english": "I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained \nbehind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I \nwould like to give up all my property in the cause of Allah and His Apostle,' The Prophet (ﷺ) said to me, \n'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained \nbehind till for them the earth, vast as it is, was straitened...\" (9.118)",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، قَالَ أَحْمَدُ حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبٍ ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، فِي حَدِيثِهِ ‏{‏وَعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا‏}‏ قَالَ فِي آخِرِ حَدِيثِهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَرَسُولِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ بَعْضَ مَالِكَ، فَهْوَ خَيْرٌ لَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4676In-book reference : Book 65, Hadith 198USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 198   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4677,
    "id": 4677,
    "url": "https://sunnah.com/bukhari:4677",
    "bookNumber": 65,
    "hadithNumber": 199,
    "narrator": "Narrated `Abdullah bin Ka`b:",
    "english": "I heard Ka`b bin Malik who was one of the three who were forgiven, saying that he had never \nremained behind Allah's Messenger (ﷺ) in any Ghazwa which he had fought except two Ghazwat Ghazwat- \nAl-`Usra (Tabuk) and Ghazwat-Badr. He added. \"I decided to tell the truth to Allah's Messenger (ﷺ) in the \nforenoon, and scarcely did he return from a journey he made, except in the forenoon, he would go first \nto the mosque and offer a two-rak`at prayer. \nThe Prophet (ﷺ) forbade others to speak to me or to my two companions, but he did not prohibit speaking \nto any of those who had remained behind excepting us. So the people avoided speaking to us, and I \nstayed in that state till I could no longer bear it, and the only thing that worried me was that I might \ndie and the Prophet (ﷺ) would not offer the funeral prayer for me, or Allah's Messenger (ﷺ) might die and I \nwould be left in that social status among the people that nobody would speak to me or offer the \nfuneral prayer for me. But Allah revealed His Forgiveness for us to the Prophet (ﷺ) in the last third of the \nnight while Allah's Messenger (ﷺ) was with Um Salama. Um Salama sympathized with me and helped me in \nmy disaster. Allah's Messenger (ﷺ) said, 'O Um Salama! Ka`b has been forgiven!' \nShe said, 'Shall I send someone to him to give him the good tidings?' He said, 'If you did so, the \npeople would not let you sleep the rest of the night.' So when the Prophet (ﷺ) had offered the Fajr prayer, \nhe announced Allah's Forgiveness for us. His face used to look as bright as a piece of the (full) moon \nwhenever he was pleased. When Allah revealed His Forgiveness for us, we were the three whose case \nhad been deferred while the excuse presented by those who had apologized had been accepted. But \nwhen there were mentioned those who had told the Prophet (ﷺ) lies and remained behind (the battle of \nTabuk) and had given false excuses, they were described with the worse description one may be \ndescribed with. Allah said: 'They will present their excuses to you (Muslims) when you return to \nthem. Say: Present no excuses; we shall not believe you. Allah has already informed us of the true \nstate of matters concerning you. Allah and His Apostle will observe your actions.\" (9.94)",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، حَدَّثَنَا إِسْحَاقُ بْنُ رَاشِدٍ، أَنَّ الزُّهْرِيَّ، حَدَّثَهُ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ،، وَهْوَ أَحَدُ الثَّلاَثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ أَنَّهُ لَمْ يَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا قَطُّ غَيْرَ غَزْوَتَيْنِ غَزْوَةِ الْعُسْرَةِ وَغَزْوَةِ بَدْرٍ‏.‏ قَالَ فَأَجْمَعْتُ صِدْقَ رَسُولِ اللَّهِ صلى الله عليه وسلم ضُحًى، وَكَانَ قَلَّمَا يَقْدَمُ مِنْ سَفَرٍ سَافَرَهُ إِلاَّ ضُحًى وَكَانَ يَبْدَأُ بِالْمَسْجِدِ، فَيَرْكَعُ رَكْعَتَيْنِ، وَنَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَلاَمِي وَكَلاَمِ صَاحِبَىَّ، وَلَمْ يَنْهَ عَنْ كَلاَمِ أَحَدٍ مِنَ الْمُتَخَلِّفِينَ غَيْرِنَا، فَاجْتَنَبَ النَّاسُ كَلاَمَنَا، فَلَبِثْتُ كَذَلِكَ حَتَّى طَالَ عَلَىَّ الأَمْرُ، وَمَا مِنْ شَىْءٍ أَهَمُّ إِلَىَّ مِنْ أَنْ أَمُوتَ فَلاَ يُصَلِّي عَلَىَّ النَّبِيُّ صلى الله عليه وسلم أَوْ يَمُوتَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَكُونَ مِنَ النَّاسِ بِتِلْكَ الْمَنْزِلَةِ، فَلاَ يُكَلِّمُنِي أَحَدٌ مِنْهُمْ، وَلاَ يُصَلِّي عَلَىَّ، فَأَنْزَلَ اللَّهُ تَوْبَتَنَا عَلَى نَبِيِّهِ صلى الله عليه وسلم حِينَ بَقِيَ الثُّلُثُ الآخِرُ مِنَ اللَّيْلِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ أُمِّ سَلَمَةَ، وَكَانَتْ أُمُّ سَلَمَةَ مُحْسِنَةً فِي شَأْنِي مَعْنِيَّةً فِي أَمْرِي، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أُمَّ سَلَمَةَ تِيبَ عَلَى كَعْبٍ ‏\"‏‏.‏ قَالَتْ أَفَلاَ أُرْسِلُ إِلَيْهِ فَأُبَشِّرَهُ قَالَ ‏\"‏ إِذًا يَحْطِمَكُمُ النَّاسُ فَيَمْنَعُونَكُمُ النَّوْمَ سَائِرَ اللَّيْلَةِ ‏\"‏‏.‏ حَتَّى إِذَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْفَجْرِ آذَنَ بِتَوْبَةِ اللَّهِ عَلَيْنَا، وَكَانَ إِذَا اسْتَبْشَرَ اسْتَنَارَ وَجْهُهُ حَتَّى كَأَنَّهُ قِطْعَةٌ مِنَ الْقَمَرِ، وَكُنَّا أَيُّهَا الثَّلاَثَةُ الَّذِينَ خُلِّفُوا عَنِ الأَمْرِ الَّذِي قُبِلَ مِنْ هَؤُلاَءِ الَّذِينَ اعْتَذَرُوا حِينَ أَنْزَلَ اللَّهُ لَنَا التَّوْبَةَ، فَلَمَّا ذُكِرَ الَّذِينَ كَذَبُوا رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْمُتَخَلِّفِينَ، وَاعْتَذَرُوا بِالْبَاطِلِ، ذُكِرُوا بِشَرِّ مَا ذُكِرَ بِهِ أَحَدٌ قَالَ اللَّهُ سُبْحَانَهُ ‏{‏يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ قُلْ لاَ تَعْتَذِرُوا لَنْ نُؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا اللَّهُ مِنْ أَخْبَارِكُمْ وَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4677In-book reference : Book 65, Hadith 199USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 199   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4678,
    "id": 4678,
    "url": "https://sunnah.com/bukhari:4678",
    "bookNumber": 65,
    "hadithNumber": 200,
    "narrator": "Narrated `Abdullah bin Ka`b:",
    "english": "I heard Ka`b bin Malik talking about the story of the battle of Tabuk when he remained behind, \"By \nAllah, I do not know anyone whom Allah has helped for telling the truth more than me since I \nmentioned that truth to Allah's Messenger (ﷺ) till today, I have never intended to tell a lie. And Allah \nrevealed to His Apostle: \"Verily! Allah has forgiven the Prophet, the Muhajirin............ and be with \nthose who are true (in words and deeds).\" (9.117-119) (See Hadith No. 702 Vol 5).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ ـ وَكَانَ قَائِدَ كَعْبِ بْنِ مَالِكٍ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ قِصَّةِ، تَبُوكَ‏.‏ فَوَاللَّهِ مَا أَعْلَمُ أَحَدًا أَبْلاَهُ اللَّهُ فِي صِدْقِ الْحَدِيثِ أَحْسَنَ مِمَّا أَبْلاَنِي، مَا تَعَمَّدْتُ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى يَوْمِي هَذَا كَذِبًا، وَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى رَسُولِهِ صلى الله عليه وسلم ‏{‏لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ‏}‏ إِلَى قَوْلِهِ ‏{‏وَكُونُوا مَعَ الصَّادِقِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4678In-book reference : Book 65, Hadith 200USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 200   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4679,
    "id": 4679,
    "url": "https://sunnah.com/bukhari:4679",
    "bookNumber": 65,
    "hadithNumber": 201,
    "narrator": "Narrated Zaid bin Thabit Al-Ansari:",
    "english": "who was one of those who used to write the Divine Revelation: Abu Bakr sent for me after the \n(heavy) casualties among the warriors (of the battle) of Yamama (where a great number of Qurra' \nwere killed). `Umar was present with Abu Bakr who said, `Umar has come to me and said, The people \nhave suffered heavy casualties on the day of (the battle of) Yamama, and I am afraid that there will be \nmore casualties among the Qurra' (those who know the Qur'an by heart) at other battle-fields, whereby \na large part of the Qur'an may be lost, unless you collect it. And I am of the opinion that you should \ncollect the Qur'an.\" Abu Bakr added, \"I said to `Umar, 'How can I do something which Allah's \nApostle has not done?' `Umar said (to me), 'By Allah, it is (really) a good thing.' So `Umar kept on \npressing, trying to persuade me to accept his proposal, till Allah opened my bosom for it and I had the \nsame opinion as `Umar.\" (Zaid bin Thabit added:) `Umar was sitting with him (Abu Bakr) and was \nnot speaking. me). \"You are a wise young man and we do not suspect you (of telling lies or of \nforgetfulness): and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). Therefore, look for \nthe Qur'an and collect it (in one manuscript). \" By Allah, if he (Abu Bakr) had ordered me to shift one \nof the mountains (from its place) it would not have been harder for me than what he had ordered me \nconcerning the collection of the Qur'an. I said to both of them, \"How dare you do a thing which the \nProphet has not done?\" Abu Bakr said, \"By Allah, it is (really) a good thing. So I kept on arguing with \nhim about it till Allah opened my bosom for that which He had opened the bosoms of Abu Bakr and \n`Umar. So I started locating Qur'anic material and collecting it from parchments, scapula, leaf-stalks \nof date palms and from the memories of men (who knew it by heart). I found with Khuza`ima two \nVerses of Surat-at-Tauba which I had not found with anybody else, (and they were):-- \n\"Verily there has come to you an Apostle (Muhammad) from amongst yourselves. It grieves him that \nyou should receive any injury or difficulty He (Muhammad) is ardently anxious over you (to be \nrightly guided)\" (9.128) \nThe manuscript on which the Qur'an was collected, remained with Abu Bakr till Allah took him unto \nHim, and then with `Umar till Allah took him unto Him, and finally it remained with Hafsa, `Umar's \ndaughter.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، أَنَّ زَيْدَ بْنَ ثَابِتٍ الأَنْصَارِيَّ ـ رضى الله عنه ـ وَكَانَ مِمَّنْ يَكْتُبُ الْوَحْىَ قَالَ أَرْسَلَ إِلَىَّ أَبُو بَكْرٍ مَقْتَلَ أَهْلِ الْيَمَامَةِ وَعِنْدَهُ عُمَرُ، فَقَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِالنَّاسِ، وَإِنِّي أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِالْقُرَّاءِ فِي الْمَوَاطِنِ فَيَذْهَبَ كَثِيرٌ مِنَ الْقُرْآنِ، إِلاَّ أَنْ تَجْمَعُوهُ، وَإِنِّي لأَرَى أَنْ تَجْمَعَ الْقُرْآنَ‏.‏ قَالَ أَبُو بَكْرٍ قُلْتُ لِعُمَرَ كَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ هُوَ وَاللَّهِ خَيْرٌ‏.‏ فَلَمْ يَزَلْ عُمَرُ يُرَاجِعُنِي فِيهِ حَتَّى شَرَحَ اللَّهُ لِذَلِكَ صَدْرِي، وَرَأَيْتُ الَّذِي رَأَى عُمَرُ‏.‏ قَالَ زَيْدُ بْنُ ثَابِتٍ وَعُمَرُ عِنْدَهُ جَالِسٌ لاَ يَتَكَلَّمُ‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ وَلاَ نَتَّهِمُكَ، كُنْتَ تَكْتُبُ الْوَحْىَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَتَبَّعِ الْقُرْآنَ فَاجْمَعْهُ‏.‏ فَوَاللَّهِ لَوْ كَلَّفَنِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ أَثْقَلَ عَلَىَّ مِمَّا أَمَرَنِي بِهِ مِنْ جَمْعِ الْقُرْآنِ قُلْتُ كَيْفَ تَفْعَلاَنِ شَيْئًا لَمْ يَفْعَلْهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ هُوَ وَاللَّهِ خَيْرٌ، فَلَمْ أَزَلْ أُرَاجِعُهُ حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ اللَّهُ لَهُ صَدْرَ أَبِي بَكْرٍ وَعُمَرَ، فَقُمْتُ فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الرِّقَاعِ وَالأَكْتَافِ وَالْعُسُبِ وَصُدُورِ الرِّجَالِ، حَتَّى وَجَدْتُ مِنْ سُورَةِ التَّوْبَةِ آيَتَيْنِ مَعَ خُزَيْمَةَ الأَنْصَارِيِّ، لَمْ أَجِدْهُمَا مَعَ أَحَدٍ غَيْرِهِ ‏{‏لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ‏}‏ إِلَى آخِرِهِمَا، وَكَانَتِ الصُّحُفُ الَّتِي جُمِعَ فِيهَا الْقُرْآنُ عِنْدَ أَبِي بَكْرٍ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ عِنْدَ عُمَرَ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ عِنْدَ حَفْصَةَ بِنْتِ عُمَرَ‏.‏ تَابَعَهُ عُثْمَانُ بْنُ عُمَرَ وَاللَّيْثُ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ وَقَالَ مَعَ أَبِي خُزَيْمَةَ الأَنْصَارِيِّ‏.‏ وَقَالَ مُوسَى عَنْ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ شِهَابٍ مَعَ أَبِي خُزَيْمَةَ‏.‏ وَتَابَعَهُ يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ‏.‏ وَقَالَ أَبُو ثَابِتٍ حَدَّثَنَا إِبْرَاهِيمُ وَقَالَ مَعَ خُزَيْمَةَ، أَوْ أَبِي خُزَيْمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4679In-book reference : Book 65, Hadith 201USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 201   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4680,
    "id": 4680,
    "url": "https://sunnah.com/bukhari:4680",
    "bookNumber": 65,
    "hadithNumber": 202,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) arrived at Medina, the Jews were observing the fast on 'Ashura' (10th of Muharram) \nand they said, \"This is the day when Moses became victorious over Pharaoh,\" On that, the Prophet (ﷺ) \nsaid to his companions, \"You (Muslims) have more right to celebrate Moses' victory than they have, \nso observe the fast on this day.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَالْيَهُودُ تَصُومُ عَاشُورَاءَ فَقَالُوا هَذَا يَوْمٌ ظَهَرَ فِيهِ مُوسَى عَلَى فِرْعَوْنَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\n\"‏ أَنْتُمْ أَحَقُّ بِمُوسَى مِنْهُمْ، فَصُومُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4680In-book reference : Book 65, Hadith 202USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4681,
    "id": 4681,
    "url": "https://sunnah.com/bukhari:4681",
    "bookNumber": 65,
    "hadithNumber": 203,
    "narrator": "Narrated Muhammad bin `Abbas bin Ja`far:",
    "english": "That he heard Ibn `Abbas reciting: \"No doubt! They fold up their breasts.\" (11.5) and asked him \nabout its explanation. He said, \"Some people used to hide themselves while answering the call of \nnature in an open space lest they be exposed to the sky, and also when they had sexual relation with \ntheir wives in an open space lest they be exposed to the sky, so the above revelation was sent down \nregarding them.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ صَبَّاحٍ، حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبَّادِ بْنِ جَعْفَرٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقْرَأُ ‏{‏أَلاَ إِنَّهُمْ تَثْنَوْنِي صُدُورُهُمْ‏}‏ قَالَ سَأَلْتُهُ عَنْهَا فَقَالَ أُنَاسٌ كَانُوا يَسْتَحْيُونَ أَنْ يَتَخَلَّوْا فَيُفْضُوا إِلَى السَّمَاءِ، وَأَنْ يُجَامِعُوا نِسَاءَهُمْ فَيُفْضُوا إِلَى السَّمَاءِ، فَنَزَلَ ذَلِكَ فِيهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4681In-book reference : Book 65, Hadith 203USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 203   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4682,
    "id": 4682,
    "url": "https://sunnah.com/bukhari:4682",
    "bookNumber": 65,
    "hadithNumber": 204,
    "narrator": "Narrated Muhammad bin `Abbas bin Ja`far:",
    "english": "Ibn `Abbas recited. \"No doubt! They fold up their breasts.\" I said, \"O Abu `Abbas! What is meant by \n\"They fold up their breasts?\" He said, \"A man used to feel shy on having sexual relation with his wife \nor on answering the call of nature (in an open space) so this Verse was revealed:-- \"No doubt! They \nfold up their breasts.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، وَأَخْبَرَنِي مُحَمَّدُ بْنُ عَبَّادِ بْنِ جَعْفَرٍ، أَنَّ ابْنَ عَبَّاسٍ، قَرَأَ ‏{‏أَلاَ إِنَّهُمْ تَثْنَوْنِي صُدُورُهُمْ‏}‏ قُلْتُ يَا أَبَا الْعَبَّاسِ مَا تَثْنَوْنِي صُدُورُهُمْ قَالَ كَانَ الرَّجُلُ يُجَامِعُ امْرَأَتَهُ فَيَسْتَحِي أَوْ يَتَخَلَّى فَيَسْتَحِي فَنَزَلَتْ ‏{‏أَلاَ إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4682In-book reference : Book 65, Hadith 204USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 204   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4683,
    "id": 4683,
    "url": "https://sunnah.com/bukhari:4683",
    "bookNumber": 65,
    "hadithNumber": 205,
    "narrator": "Narrated `Amr:",
    "english": "Ibn `Abbas recited:-- \"No doubt! They fold up their breasts in order to hide from Him. Surely! Even \nwhen they cover themselves with their garments..\" (11.5)",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، قَالَ قَرَأَ ابْنُ عَبَّاسٍ ‏{‏أَلاَ إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ لِيَسْتَخْفُوا مِنْهُ أَلاَ حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ‏}‏ وَقَالَ غَيْرُهُ عَنِ ابْنِ عَبَّاسٍ ‏{‏يَسْتَغْشُونَ‏}‏ يُغَطُّونَ رُءُوسَهُمْ ‏{‏سِيءَ بِهِمْ‏}‏ سَاءَ ظَنُّهُ بِقَوْمِهِ‏.‏ ‏{‏وَضَاقَ بِهِمْ‏}‏ بِأَضْيَافِهِ ‏{‏بِقِطْعٍ مِنَ اللَّيْلِ‏}‏ بِسَوَادٍ‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏أُنِيبُ‏}‏ أَرْجِعُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4683In-book reference : Book 65, Hadith 205USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 205   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4684,
    "id": 4684,
    "url": "https://sunnah.com/bukhari:4684",
    "bookNumber": 65,
    "hadithNumber": 206,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah said, 'Spend (O man), and I shall spend on you.\" He also said, \"Allah's \nHand is full, and (its fullness) is not affected by the continuous spending night and day.\" He also said, \n\"Do you see what He has spent since He created the Heavens and the Earth? Nevertheless, what is in \nHis Hand is not decreased, and His Throne was over the water; and in His Hand there is the balance \n(of justice) whereby He raises and lowers (people).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنْفِقْ أُنْفِقْ عَلَيْكَ ـ وَقَالَ ـ يَدُ اللَّهِ مَلأَى لاَ تَغِيضُهَا نَفَقَةٌ، سَحَّاءُ اللَّيْلَ وَالنَّهَارَ ـ وَقَالَ ـ أَرَأَيْتُمْ مَا أَنْفَقَ مُنْذُ خَلَقَ السَّمَاءَ وَالأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَدِهِ، وَكَانَ عَرْشُهُ عَلَى الْمَاءِ، وَبِيَدِهِ الْمِيزَانُ يَخْفِضُ وَيَرْفَعُ ‏\"‏‏.‏ ‏{‏اعْتَرَاكَ‏}‏ افْتَعَلْتَ مِنْ عَرَوْتُهُ أَىْ أَصَبْتُهُ، وَمِنْهُ يَعْرُوهُ وَاعْتَرَانِي ‏{‏آخِذٌ بِنَاصِيَتِهَا‏}‏ أَىْ فِي مِلْكِهِ وَسُلْطَانِهِ‏.‏ عَنِيدٌ وَعَنُودٌ وَعَانِدٌ وَاحِدٌ، هُوَ تَأْكِيدُ التَّجَبُّرِ، ‏{‏اسْتَعْمَرَكُمْ‏}‏ جَعَلَكُمْ عُمَّارًا، أَعْمَرْتُهُ الدَّارَ فَهْىَ عُمْرَى جَعَلْتُهَا لَهُ‏.‏ ‏{‏نَكِرَهُمْ‏}‏ وَأَنْكَرَهُمْ وَاسْتَنْكَرَهُمْ وَاحِدٌ ‏{‏حَمِيدٌ مَجِيدٌ‏}‏ كَأَنَّهُ فَعِيلٌ مِنْ مَاجِدٍ‏.‏ مَحْمُودٌ مِنْ حَمِدَ‏.‏ سِجِّيلٌ الشَّدِيدُ الْكَبِيرُ‏.‏ سِجِّيلٌ وَسِجِّينٌ وَاللاَّمُ وَالنُّونُ أُخْتَانِ، وَقَالَ تَمِيمُ بْنُ مُقْبِلٍ \nوَرَجْلَةٍ يَضْرِبُونَ الْبَيْضَ ضَاحِيَةً ضَرْبًا تَوَاصَى بِهِ الأَبْطَالُ سِجِّينَا",
    "reference": "Reference : Sahih al-Bukhari 4684In-book reference : Book 65, Hadith 206USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 206   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4685,
    "id": 4685,
    "url": "https://sunnah.com/bukhari:4685",
    "bookNumber": 65,
    "hadithNumber": 207,
    "narrator": "Narrated Safwan bin Muhriz:",
    "english": "While Ibn `Umar was performing the Tawaf (around the Ka`ba), a man came up to him and said, \"O \nAbu `AbdurRahman!\" or said, \"O Ibn `Umar! Did you hear anything from the Prophet (ﷺ) about An35 \nNajwa?\" Ibn `Umar said, \"I heard the Prophet (ﷺ) saying, 'The Believer will be brought near his Lord.\" \n(Hisham, a sub-narrator said, reporting the Prophet's words), \"The believer will come near (his Lord) \ntill his Lord covers him with His screen and makes him confess his sins. (Allah will ask him), 'Do you \nknow (that you did) 'such-and-such sin?\" He will say twice, 'Yes, I do.' Then Allah will say, 'I \nconcealed it in the world and I forgive it for you today.' Then the record of his good deeds will be \nfolded up. As for the others, or the disbelievers, it will be announced publicly before the witnesses: \n'These are ones who lied against their Lord.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، وَهِشَامٌ، قَالاَ حَدَّثَنَا قَتَادَةُ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، قَالَ بَيْنَا ابْنُ عُمَرَ يَطُوفُ إِذْ عَرَضَ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ ـ أَوْ قَالَ يَا ابْنَ عُمَرَ ـ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي النَّجْوَى فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُدْنَى الْمُؤْمِنُ مِنْ رَبِّهِ ـ وَقَالَ هِشَامٌ يَدْنُو الْمُؤْمِنُ ـ حَتَّى يَضَعَ عَلَيْهِ كَنَفَهُ، فَيُقَرِّرُهُ بِذُنُوبِهِ تَعْرِفُ ذَنْبَ كَذَا يَقُولُ أَعْرِفُ، يَقُولُ رَبِّ أَعْرِفُ مَرَّتَيْنِ، فَيَقُولُ سَتَرْتُهَا فِي الدُّنْيَا وَأَغْفِرُهَا لَكَ الْيَوْمَ ثُمَّ تُطْوَى صَحِيفَةُ حَسَنَاتِهِ، وَأَمَّا الآخَرُونَ أَوِ الْكُفَّارُ فَيُنَادَى عَلَى رُءُوسِ الأَشْهَادِ هَؤُلاَءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ ‏\"‏‏.‏ وَقَالَ شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا صَفْوَانُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4685In-book reference : Book 65, Hadith 207USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4686,
    "id": 4686,
    "url": "https://sunnah.com/bukhari:4686",
    "bookNumber": 65,
    "hadithNumber": 208,
    "narrator": "Narrated Abu Musa:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah gives respite to the oppressor, but when He takes him over, He never \nreleases him.\" Then he recited:-- \n\"Such is the seizure of your Lord when He seizes (population of) towns in the midst of their wrong: \nPainful indeed, and severe is His seizure.' (11.102)",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا بُرَيْدُ بْنُ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ لَيُمْلِي لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ‏\"‏‏.‏ قَالَ ثُمَّ قَرَأَ ‏{‏وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهْىَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4686In-book reference : Book 65, Hadith 208USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4687,
    "id": 4687,
    "url": "https://sunnah.com/bukhari:4687",
    "bookNumber": 65,
    "hadithNumber": 209,
    "narrator": "Narrated Ibn Masud:",
    "english": "A man kissed a woman and then came to Allah's Messenger (ﷺ) and told him of that, so this Divine \nInspiration was revealed to the Prophet (ﷺ) 'And offer Prayers perfectly at the two ends of the day, and in \nsome hours of the night; (i.e. (five) compulsory prayers). Verily, the good deeds remove the evil deeds \n(small sins) That is a reminder for the mindful.' (11.114) The man said, Is this instruction for me \nonly?' The Prophet (ﷺ) said, \"It is for all those of my followers who encounter a similar situation.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ ـ هُوَ ابْنُ زُرَيْعٍ ـ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، أَصَابَ مِنَ امْرَأَةٍ قُبْلَةً، فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَأُنْزِلَتْ عَلَيْهِ ‏{‏وَأَقِمِ الصَّلاَةَ طَرَفَىِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ‏}‏‏.‏ قَالَ الرَّجُلُ أَلِيَ هَذِهِ قَالَ ‏\n\"‏ لِمَنْ عَمِلَ بِهَا مِنْ أُمَّتِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4687In-book reference : Book 65, Hadith 209USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4688,
    "id": 4688,
    "url": "https://sunnah.com/bukhari:4688",
    "bookNumber": 65,
    "hadithNumber": 210,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"The honorable, the son of the honorable the son of the honorable, i.e. Joseph, the \nson of Jacob, the son of Isaac, the son of Abraham.\"",
    "arabic": "وَقَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَرِيمُ بْنُ الْكَرِيمِ بْنِ الْكَرِيمِ بْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4688In-book reference : Book 65, Hadith 210USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4689,
    "id": 4689,
    "url": "https://sunnah.com/bukhari:4689",
    "bookNumber": 65,
    "hadithNumber": 211,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) was asked, \"Who are the most honorable of the people?\" The Prophet (ﷺ) said, \"The most \nhonorable of them in Allah's Sight are those who keep their duty to Allah and fear Him. They said, \n\"We do not ask you about that.\" He said, \"Then the most honorable of the people is Joseph, Allah's \nprophet, the son of Allah's prophet, the son of Allah's prophet, the son of Allah's Khalil i.e. Abraham) \nThey said, \"We do not ask you about that.\" The Prophet (ﷺ) said, Do you ask about (the virtues of the \nancestry of the Arabs?\" They said, \"Yes,\" He said, \"Those who were the best amongst you in the Prelslamic \nPeriod are the best amongst you in Islam if they comprehend (the Islamic religion).",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ النَّاسِ أَكْرَمُ قَالَ ‏\"‏ أَكْرَمُهُمْ عِنْدَ اللَّهِ أَتْقَاهُمْ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَأَكْرَمُ النَّاسِ يُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ فَخِيَارُكُمْ فِي الْجَاهِلِيَّةِ خِيَارُكُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا ‏\"‏‏.‏ تَابَعَهُ أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4689In-book reference : Book 65, Hadith 211USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4690,
    "id": 4690,
    "url": "https://sunnah.com/bukhari:4690",
    "bookNumber": 65,
    "hadithNumber": 212,
    "narrator": "Narrated Az-Zuhri:",
    "english": "`Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah \nrelated the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they \nhad said and Allah later declared her innocence. Each of them related a part of the narration (wherein) \nthe Prophet (ﷺ) said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you \nhave committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I \nfind no example for my case except that of Joseph's father (when he said), 'So (for me) patience is \nmost fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang \namongst you..\" (24.11)",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ قَالَ وَحَدَّثَنَا الْحَجَّاجُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ الأَيْلِيُّ، قَالَ سَمِعْتُ الزُّهْرِيَّ، سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنَ وَقَّاصٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، عَنْ حَدِيثِ، عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا فَبَرَّأَهَا اللَّهُ، كُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنْ كُنْتِ بَرِيئَةً فَسَيُبَرِّئُكِ اللَّهُ، وَإِنْ كُنْتِ أَلْمَمْتِ بِذَنْبٍ فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ ‏\"‏‏.‏ قُلْتُ إِنِّي وَاللَّهِ لاَ أَجِدُ مَثَلاً إِلاَّ أَبَا يُوسُفَ ‏{‏فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏}‏ وَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ‏}‏ الْعَشْرَ الآيَاتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4690In-book reference : Book 65, Hadith 212USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 212   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4691,
    "id": 4691,
    "url": "https://sunnah.com/bukhari:4691",
    "bookNumber": 65,
    "hadithNumber": 213,
    "narrator": "Narrated Um Ruman:",
    "english": "Who was `Aisha's mother: While I was with `Aisha, `Aisha got fever, whereupon the Prophet (ﷺ) said, \n\"Probably her fever is caused by the story related by the people (about her).\" I said, \"Yes.\" Then \n`Aisha sat up and said, \"My example and your example is similar to that of Jacob and his sons:--'Nay, \nbut your minds have made up a tale. So (for me) patience is most fitting. It is Allah (alone) Whose \nhelp can be sought against that which you assert.' (12.18)",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، قَالَ حَدَّثَنِي مَسْرُوقُ بْنُ الأَجْدَعِ، قَالَ حَدَّثَتْنِي أُمُّ رُومَانَ، وَهْىَ أُمُّ عَائِشَةَ قَالَتْ بَيْنَا أَنَا وَعَائِشَةُ أَخَذَتْهَا الْحُمَّى، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَعَلَّ فِي حَدِيثٍ تُحُدِّثَ ‏\"‏‏.‏ قَالَتْ نَعَمْ وَقَعَدَتْ عَائِشَةُ قَالَتْ مَثَلِي وَمَثَلُكُمْ كَيَعْقُوبَ وَبَنِيهِ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4691In-book reference : Book 65, Hadith 213USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4692,
    "id": 4692,
    "url": "https://sunnah.com/bukhari:4692",
    "bookNumber": 65,
    "hadithNumber": 214,
    "narrator": "Narrated Abu Wail:",
    "english": "`Abdullah bin Mas`ud recited \"Haita laka (Come you),\" and added, \"We recite it as we were taught \nit.\"",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ هَيْتَ لَكَ قَالَ وَإِنَّمَا نَقْرَؤُهَا كَمَا عُلِّمْنَاهَا ‏{‏مَثْوَاهُ‏}‏ مُقَامُهُ ‏{‏أَلْفَيَا‏}‏ وَجَدَا ‏{‏أَلْفَوْا آبَاءَهُمْ‏}‏ ‏{‏أَلْفَيْنَا‏}‏ وَعَنِ ابْنِ مَسْعُودٍ ‏{‏بَلْ عَجِبْتَ وَيَسْخَرُونَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4692In-book reference : Book 65, Hadith 214USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 214   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4693,
    "id": 4693,
    "url": "https://sunnah.com/bukhari:4693",
    "bookNumber": 65,
    "hadithNumber": 215,
    "narrator": "Narrated `Abdullah (bin Mas`ud):",
    "english": "When the Prophet (ﷺ) realized that the Quraish had delayed in embracing Islam, he said, \"O Allah! \nProtect me against their evil by afflicting them with seven (years of famine) like the seven years of \n(Prophet) Joseph.\" So they were struck with a year of famine that destroyed everything till they had to \neat bones, and till a man would look towards the sky and see something like smoke between him and \nit. Allah said:-- \n\"Then watch you (O Muhammad) for the day when the sky will produce a kind of smoke plainly \nvisible.\" (44.10) And Allah further said:-- \"Verily! We shall withdraw the punishment a little, Verily \nyou will return (to disbelief).\" (44.15) (Will Allah relieve them from torture on the Day of \nResurrection?) (The punishment of) the smoke had passed and Al-Baltsha (the destruction of the \npagans in the Badr battle) had passed too.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ قُرَيْشًا لَمَّا أَبْطَئُوا عَنِ النَّبِيِّ صلى الله عليه وسلم بِالإِسْلاَمِ قَالَ ‏\"‏ اللَّهُمَّ اكْفِنِيهِمْ بِسَبْعٍ كَسَبْعِ يُوسُفَ ‏\"‏ فَأَصَابَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَىْءٍ حَتَّى أَكَلُوا الْعِظَامَ حَتَّى جَعَلَ الرَّجُلُ يَنْظُرُ إِلَى السَّمَاءِ فَيَرَى بَيْنَهُ وَبَيْنَهَا مِثْلَ الدُّخَانِ قَالَ اللَّهُ ‏{‏فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ قَالَ اللَّهُ ‏{‏إِنَّا كَاشِفُو الْعَذَابِ قَلِيلاً إِنَّكُمْ عَائِدُونَ‏}‏ أَفَيُكْشَفُ عَنْهُمُ الْعَذَابُ يَوْمَ الْقِيَامَةِ، وَقَدْ مَضَى الدُّخَانُ وَمَضَتِ الْبَطْشَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4693In-book reference : Book 65, Hadith 215USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 215   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4694,
    "id": 4694,
    "url": "https://sunnah.com/bukhari:4694",
    "bookNumber": 65,
    "hadithNumber": 216,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"May Allah bestow His Mercy on (Prophet) Lot. (When his nation troubled him) \nhe wished if he could betake himself to some powerful support; and if I were to remain in prison for \nthe period Joseph had remained, I would surely respond to the call; and we shall have more right (to \nbe in doubt) than Abraham: When Allah said to him, \"Don't you believe?' Abraham said, 'Yes, (I do \nbelieve) but to be stronger in faith; (2.260)",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَرْحَمُ اللَّهُ لُوطًا، لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ، وَلَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ لأَجَبْتُ الدَّاعِيَ، وَنَحْنُ أَحَقُّ مِنْ إِبْرَاهِيمَ إِذْ قَالَ لَهُ ‏{‏أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4694In-book reference : Book 65, Hadith 216USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 216   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4695,
    "id": 4695,
    "url": "https://sunnah.com/bukhari:4695",
    "bookNumber": 65,
    "hadithNumber": 217,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "That when he asked `Aisha about the statement of Allah \"Until when the Apostles gave up hope (of \ntheir people).\" (12.110) she told him (its meaning), `Urwa added, \"I said, 'Did they (Apostles) suspect \nthat they were betrayed (by Allah) or that they were treated as liars by (their people)?' `Aisha said, \n'(They suspected) that they were treated as liars by (their people),' I said, 'But they were sure that their \npeople treated them as liars and it was not a matter of suspicion.' She said, 'Yes, upon my life they \nwere sure about it.' I said to her. 'So they (Apostles) suspected that they were betrayed (by Allah).' She \nsaid, \"Allah forbid! The Apostles never suspected their Lord of such a thing.' I said, 'What about this \nVerse then?' She said, 'It is about the Apostles' followers who believed in their Lord and trusted their \nApostles, but the period of trials was prolonged and victory was delayed till the Apostles gave up all \nhope of converting those of the people who disbelieved them and the Apostles thought that their \nfollowers treated them as liars; thereupon Allah's help came to them.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَهُ وَهُوَ يَسْأَلُهَا عَنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ‏}‏ قَالَ قُلْتُ أَكُذِبُوا أَمْ كُذِّبُوا قَالَتْ عَائِشَةُ كُذِّبُوا‏.‏ قُلْتُ فَقَدِ اسْتَيْقَنُوا أَنَّ قَوْمَهُمْ كَذَّبُوهُمْ فَمَا هُوَ بِالظَّنِّ قَالَتْ أَجَلْ لَعَمْرِي لَقَدِ اسْتَيْقَنُوا بِذَلِكَ‏.‏ فَقُلْتُ لَهَا وَظَنُّوا أَنَّهُمْ قَدْ كُذِبُوا قَالَتْ مَعَاذَ اللَّهِ لَمْ تَكُنِ الرُّسُلُ تَظُنُّ ذَلِكَ بِرَبِّهَا‏.‏ قُلْتُ فَمَا هَذِهِ الآيَةُ‏.‏ قَالَتْ هُمْ أَتْبَاعُ الرُّسُلِ الَّذِينَ آمَنُوا بِرَبِّهِمْ وَصَدَّقُوهُمْ، فَطَالَ عَلَيْهِمُ الْبَلاَءُ، وَاسْتَأْخَرَ عَنْهُمُ النَّصْرُ حَتَّى اسْتَيْأَسَ الرُّسُلُ مِمَّنْ كَذَّبَهُمْ مِنْ قَوْمِهِمْ وَظَنَّتِ الرُّسُلُ أَنَّ أَتْبَاعَهُمْ قَدْ كَذَّبُوهُمْ جَاءَهُمْ نَصْرُ اللَّهِ عِنْدَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4695In-book reference : Book 65, Hadith 217USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 217   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4696,
    "id": 4696,
    "url": "https://sunnah.com/bukhari:4696",
    "bookNumber": 65,
    "hadithNumber": 218,
    "narrator": "Narrated `Urwa:",
    "english": "\"I told her (`Aisha): (Regarding the above narration), they (Apostles) were betrayed (by Allah).\" She \nsaid: Allah forbid or said similarly.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، فَقُلْتُ لَعَلَّهَا ‏{‏كُذِبُوا‏}‏ مُخَفَّفَةً‏.‏ قَالَتْ مَعَاذَ اللَّهِ‏ نَحْوَهُ.",
    "reference": "Reference : Sahih al-Bukhari 4696In-book reference : Book 65, Hadith 218USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 218   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4697,
    "id": 4697,
    "url": "https://sunnah.com/bukhari:4697",
    "bookNumber": 65,
    "hadithNumber": 219,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"The keys of Unseen are five which none knows but Allah: None knows what \nwill happen tomorrow but Allah; none knows what is in the wombs (a male child or a female) but \nAllah; none knows when it will rain but Allah; none knows at what place one will die; none knows \nwhen the Hour will be established but Allah.\" (See The Qur'an 31:34.\")",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَفَاتِيحُ الْغَيْبِ خَمْسٌ لاَ يَعْلَمُهَا إِلاَّ اللَّهُ لاَ يَعْلَمُ مَا فِي غَدٍ إِلاَّ اللَّهُ، وَلاَ يَعْلَمُ مَا تَغِيضُ الأَرْحَامُ إِلاَّ اللَّهُ وَلاَ يَعْلَمُ مَتَى يَأْتِي الْمَطَرُ أَحَدٌ إِلاَّ اللَّهُ، وَلاَ تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ، وَلاَ يَعْلَمُ مَتَى تَقُومُ السَّاعَةُ إِلاَّ اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4697In-book reference : Book 65, Hadith 219USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4698,
    "id": 4698,
    "url": "https://sunnah.com/bukhari:4698",
    "bookNumber": 65,
    "hadithNumber": 220,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While we were with Allah's Messenger (ﷺ) he said, \"Tell me of a tree which resembles a Muslim man. Its \nleaves do not fall and it does not, and does not, and does not, and it gives its fruits every now and \nthen.\" It came to my mind that such a tree must be the date palm, but seeing Abu Bakr and `Umar \nsaying nothing, I disliked to speak. So when they did not say anything, Allah's Messenger (ﷺ) said, \"It is the \ndate-palm tree.\" When we got up (from that place), I said to `Umar, \"O my father! By Allah, it came \nto my mind that it must be the date palm tree.\" `Umar said, \"What prevented you from speaking\" I \nreplied, \"I did not see you speaking, so I misliked to speak or say anything.\" `Umar then said, \"If you \nhad said it, it would have been dearer to me than so-and-so.\"",
    "arabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَخْبِرُونِي بِشَجَرَةٍ تُشْبِهُ أَوْ كَالرَّجُلِ الْمُسْلِمِ لاَ يَتَحَاتُّ وَرَقُهَا وَلاَ وَلاَ وَلاَ، تُؤْتِي أُكْلَهَا كُلَّ حِينٍ ‏\"‏‏.‏ قَالَ ابْنُ عُمَرَ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لاَ يَتَكَلَّمَانِ، فَكَرِهْتُ أَنْ أَتَكَلَّمَ، فَلَمَّا لَمْ يَقُولُوا شَيْئًا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏ فَلَمَّا قُمْنَا قُلْتُ لِعُمَرَ يَا أَبَتَاهُ وَاللَّهِ لَقَدْ كَانَ وَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَقَالَ مَا مَنَعَكَ أَنْ تَكَلَّمَ قَالَ لَمْ أَرَكُمْ تَكَلَّمُونَ، فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا‏.‏ قَالَ عُمَرُ لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ كَذَا وَكَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4698In-book reference : Book 65, Hadith 220USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4699,
    "id": 4699,
    "url": "https://sunnah.com/bukhari:4699",
    "bookNumber": 65,
    "hadithNumber": 221,
    "narrator": "Narrated Al-Bara bin Azib:",
    "english": "Allah's Messenger (ﷺ) said, \"When a Muslim is questioned in his grave, he will testify that none has the right \nto be worshipped but Allah and that Muhammad is Allah's Messenger (ﷺ), and that is what is meant by \nAllah's Statement:-- \n\"Allah will keep firm those who believe with a Word that stands firm in this world and in the \nHereafter.\" (14.27)",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ، قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُسْلِمُ إِذَا سُئِلَ فِي الْقَبْرِ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَذَلِكَ قَوْلُهُ ‏{‏يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4699In-book reference : Book 65, Hadith 221USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4700,
    "id": 4700,
    "url": "https://sunnah.com/bukhari:4700",
    "bookNumber": 65,
    "hadithNumber": 222,
    "narrator": "Narrated Ata:",
    "english": "When Ibn `Abbas heard:-- \"Have you not seen those who have changed the favor of Allah into \ndisbelief?\" (14.28) he said, \"Those were the disbelieving pagans of Mecca.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، سَمِعَ ابْنَ عَبَّاسٍ، ‏{‏أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَةَ اللَّهِ كُفْرًا‏}‏ قَالَ هُمْ كُفَّارُ أَهْلِ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4700In-book reference : Book 65, Hadith 222USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 222   (deprecated numbering scheme)"
  }
]