[
  {
    "hadithGlobalNumber": 6903,
    "id": 6903,
    "url": "https://sunnah.com/bukhari:6903",
    "bookNumber": 87,
    "hadithNumber": 42,
    "narrator": "Narrated Ash-Shu`bi:",
    "english": "I heard Abu Juhaifa saying, \"I asked `Ali 'Have you got any Divine literature apart from the Qur'an?' \n(Once he said...apart from what the people have?) `Ali replied, 'By Him Who made the grain split \n(germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of \nunderstanding Allah's Book which He may endow a man with and we have what is written in this \npaper.' I asked, 'What is written in this paper?' He replied, 'Al-`Aql (the regulation of Diya), about the \nransom of captives, and the Judgment that a Muslim should not be killed in Qisas (equality in \npunishment) for killing a disbeliever.\" (See Hadith No. 283,Vol. 4)",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا مُطَرِّفٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، قَالَ سَأَلْتُ عَلِيًّا ـ رضى الله عنه ـ هَلْ عِنْدَكُمْ شَىْءٌ مَا لَيْسَ فِي الْقُرْآنِ وَقَالَ مَرَّةً مَا لَيْسَ عِنْدَ النَّاسِ فَقَالَ وَالَّذِي فَلَقَ الْحَبَّ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلاَّ مَا فِي الْقُرْآنِ، إِلاَّ فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ، وَمَا فِي الصَّحِيفَةِ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ، وَفِكَاكُ الأَسِيرِ، وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6903In-book reference : Book 87, Hadith 42USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6904,
    "id": 6904,
    "url": "https://sunnah.com/bukhari:6904",
    "bookNumber": 87,
    "hadithNumber": 43,
    "narrator": "Narrated Abu Huraira:",
    "english": "Two women from the tribe of Hudhail (fought with each other) and one of them threw (a stone at) the \nother, causing her to have a miscarriage and Allah's Messenger (ﷺ) gave his verdict that the killer (of the \nfetus) should give a male or female slave (as a Diya).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، وَحَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ امْرَأَتَيْنِ، مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الأُخْرَى، فَطَرَحَتْ جَنِينَهَا، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6904In-book reference : Book 87, Hadith 43USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6905,
    "id": 6905,
    "url": "https://sunnah.com/bukhari:6905",
    "bookNumber": 87,
    "hadithNumber": 44,
    "narrator": "Narrated Hisham's father from Al-Mughira bin Shu'ba:",
    "english": "'Umar consulted the companions about the case of a woman's abortion \n     (caused by somebody else). Al-Mughira said: The Prophet (ﷺ) gave the \n     verdict that a male or female slave should be given (as a Diya). Then \n     Muhammad bin Maslama testified that he had witnessed the Prophet (ﷺ) \n     giving such a verdict.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّهُ اسْتَشَارَهُمْ فِي إِمْلاَصِ الْمَرْأَةِ فَقَالَ الْمُغِيرَةُ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالْغُرَّةِ عَبْدٍ أَوْ أَمَةٍ‏.‏   فَقَالَ ائْتِ مَنْ يَشْهَدُ مَعَكَ، فَشَهِدَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَّهُ شَهِدَ النَّبِيَّ صلى الله عليه وسلم قَضَى بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6905, 6906In-book reference : Book 87, Hadith 44USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6906,
    "id": 6906,
    "url": "https://sunnah.com/bukhari:6906",
    "bookNumber": 87,
    "hadithNumber": 44,
    "narrator": "Narrated Hisham's father from Al-Mughira bin Shu'ba:",
    "english": "'Umar consulted the companions about the case of a woman's abortion \n     (caused by somebody else). Al-Mughira said: The Prophet (ﷺ) gave the \n     verdict that a male or female slave should be given (as a Diya). Then \n     Muhammad bin Maslama testified that he had witnessed the Prophet (ﷺ) \n     giving such a verdict.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّهُ اسْتَشَارَهُمْ فِي إِمْلاَصِ الْمَرْأَةِ فَقَالَ الْمُغِيرَةُ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالْغُرَّةِ عَبْدٍ أَوْ أَمَةٍ‏.‏   فَقَالَ ائْتِ مَنْ يَشْهَدُ مَعَكَ، فَشَهِدَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَّهُ شَهِدَ النَّبِيَّ صلى الله عليه وسلم قَضَى بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6905, 6906In-book reference : Book 87, Hadith 44USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6907,
    "id": 6907,
    "url": "https://sunnah.com/bukhari:6907",
    "bookNumber": 87,
    "hadithNumber": 45,
    "narrator": "Narrated Hisham's father:",
    "english": "'Umar asked the people, \"Who heard the Prophet (ﷺ) giving his verdict \n     regarding abortions?\" Al-Mughira said, \"I heard him judging that a \n     male or female slave should be given (as a Diya).\" 'Umar said, \n     \"Present a witness to testify your statement.\" Muhammad bin Maslama \n     said, \"I testify that the Prophet (ﷺ) gave such a judgment.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنْ عُمَرَ، نَشَدَ النَّاسَ مَنْ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَضَى فِي السِّقْطِ وَقَالَ الْمُغِيرَةُ أَنَا سَمِعْتُهُ قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏   قَالَ ائْتِ مَنْ يَشْهَدُ مَعَكَ عَلَى هَذَا فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَا أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6907, 6908In-book reference : Book 87, Hadith 45USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6908,
    "id": 6908,
    "url": "https://sunnah.com/bukhari:6908",
    "bookNumber": 87,
    "hadithNumber": 45,
    "narrator": "Narrated Hisham's father:",
    "english": "'Umar asked the people, \"Who heard the Prophet (ﷺ) giving his verdict \n     regarding abortions?\" Al-Mughira said, \"I heard him judging that a \n     male or female slave should be given (as a Diya).\" 'Umar said, \n     \"Present a witness to testify your statement.\" Muhammad bin Maslama \n     said, \"I testify that the Prophet (ﷺ) gave such a judgment.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنْ عُمَرَ، نَشَدَ النَّاسَ مَنْ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَضَى فِي السِّقْطِ وَقَالَ الْمُغِيرَةُ أَنَا سَمِعْتُهُ قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏   قَالَ ائْتِ مَنْ يَشْهَدُ مَعَكَ عَلَى هَذَا فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَا أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6907, 6908In-book reference : Book 87, Hadith 45USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6909,
    "id": 6909,
    "url": "https://sunnah.com/bukhari:6909",
    "bookNumber": 87,
    "hadithNumber": 47,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) gave a verdict regarding an aborted fetus of a woman from Bani Lihyan that the killer \n(of the fetus) should give a male or female slave (as a Diya) but the woman who was required to give \nthe slave, died, so Allah's Messenger (ﷺ) gave the verdict that her inheritance be given to her children and \nher husband and the Diya be paid by her 'Asaba.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ،‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لِحْيَانَ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا، وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6909In-book reference : Book 87, Hadith 47USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6910,
    "id": 6910,
    "url": "https://sunnah.com/bukhari:6910",
    "bookNumber": 87,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Huraira:",
    "english": "Two women from Hudhail fought with each other and one of them hit the other with a stone that \nkilled her and what was in her womb. The relatives of the killer and the relatives of the victim \nsubmitted their case to the Prophet (ﷺ) who judged that the Diya for the fetus was a male or female slave, \nand the Diya for the killed woman was to be paid by the 'Asaba (near relatives) of the killer.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ، فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ قَتَلَتْهَا وَمَا فِي بَطْنِهَا، فَاخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَضَى أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ، وَقَضَى دِيَةَ الْمَرْأَةِ عَلَى عَاقِلَتِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6910In-book reference : Book 87, Hadith 48USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6911,
    "id": 6911,
    "url": "https://sunnah.com/bukhari:6911",
    "bookNumber": 87,
    "hadithNumber": 49,
    "narrator": "Narrated `Abdul-`Aziz:",
    "english": "Anas said, \"When Allah's Messenger (ﷺ) arrived at Medina, Abu Talha took hold of my hand and brought \nme to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas is an intelligent boy, so let him serve you.\" \nAnas added, \"So I served the Prophet (ﷺ) L at home and on journeys; by Allah, he never said to me for \nanything which I did: Why have you done this like this or, for anything which I did not do: 'Why have \nyou not done this like this?\"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ أَخَذَ أَبُو طَلْحَةَ بِيَدِي فَانْطَلَقَ بِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَنَسًا غُلاَمٌ كَيِّسٌ فَلْيَخْدُمْكَ‏.‏ قَالَ فَخَدَمْتُهُ فِي الْحَضَرِ وَالسَّفَرِ، فَوَاللَّهِ مَا قَالَ لِي لِشَىْءٍ صَنَعْتُهُ، لِمَ صَنَعْتَ هَذَا هَكَذَا وَلاَ لِشَىْءٍ لَمْ أَصْنَعْهُ لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا",
    "reference": "Reference : Sahih al-Bukhari 6911In-book reference : Book 87, Hadith 49USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 46   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6912,
    "id": 6912,
    "url": "https://sunnah.com/bukhari:6912",
    "bookNumber": 87,
    "hadithNumber": 50,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There is no Diya for persons killed by animals or for the one who has been \nkilled accidentally by falling into a well or for the one killed in a mine. And one-fifth of Rikaz \n(treasures buried before the Islamic era) is to be given to the state.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَجْمَاءُ جُرْحُهَا جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6912In-book reference : Book 87, Hadith 50USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6913,
    "id": 6913,
    "url": "https://sunnah.com/bukhari:6913",
    "bookNumber": 87,
    "hadithNumber": 51,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"There is no Diya for a person injured or killed by an animal (going about without \nsomebody to control it) and similarly, there is no Diya for the one who falls and dies in a well, and \nalso the one who dies in a mine. As regards the Ar-Rikaz (buried wealth), one-fifth thereof is for the \nstate.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَجْمَاءُ عَقْلُهَا جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6913In-book reference : Book 87, Hadith 51USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6914,
    "id": 6914,
    "url": "https://sunnah.com/bukhari:6914",
    "bookNumber": 87,
    "hadithNumber": 52,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "The Prophet (ﷺ) said, \"Whoever killed a Mu'ahid (a person who is granted the pledge of protection by the \nMuslims) shall not smell the fragrance of Paradise though its fragrance can be smelt at a distance of \nforty years (of traveling).",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ، وَإِنَّ رِيحَهَا يُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6914In-book reference : Book 87, Hadith 52USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6915,
    "id": 6915,
    "url": "https://sunnah.com/bukhari:6915",
    "bookNumber": 87,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "I asked `Ali \"Do you have anything Divine literature besides what is in the Qur'an?\" Or, as Uyaina \nonce said, \"Apart from what the people have?\" `Ali said, \"By Him Who made the grain split \n(germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of \nunderstanding Allah's Book which He may endow a man, with and what is written in this sheet of \npaper.\" I asked, \"What is on this paper?\" He replied, \"The legal regulations of Diya (Blood-money) \nand the (ransom for) releasing of the captives, and the judgment that no Muslim should be killed in \nQisas (equality in punishment) for killing a Kafir (disbeliever).",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُطَرِّفٌ، أَنَّ عَامِرًا، حَدَّثَهُمْ عَنْ أَبِي جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيٍّ‏.‏ وَحَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا مُطَرِّفٌ، سَمِعْتُ الشَّعْبِيَّ، يُحَدِّثُ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، قَالَ سَأَلْتُ عَلِيًّا ـ رضى الله عنه ـ هَلْ عِنْدَكُمْ شَىْءٌ مِمَّا لَيْسَ فِي الْقُرْآنِ ـ وَقَالَ ابْنُ عُيَيْنَةَ مَرَّةً مَا لَيْسَ عِنْدَ النَّاسِ ـ فَقَالَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلاَّ مَا فِي الْقُرْآنِ إِلاَّ فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ وَمَا فِي الصَّحِيفَةِ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ، وَفِكَاكُ الأَسِيرِ، وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6915In-book reference : Book 87, Hadith 53USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6916,
    "id": 6916,
    "url": "https://sunnah.com/bukhari:6916",
    "bookNumber": 87,
    "hadithNumber": 54,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The Prophet (ﷺ) said, \"Do not prefer some prophets to others.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُخَيِّرُوا بَيْنَ الأَنْبِيَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6916In-book reference : Book 87, Hadith 54USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 51   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6917,
    "id": 6917,
    "url": "https://sunnah.com/bukhari:6917",
    "bookNumber": 87,
    "hadithNumber": 55,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "A Jew whose face had been slapped (by someone), came to the Prophet (ﷺ) and said, \"O Muhammad! A \nman from your Ansari companions slapped me. \" The Prophet (ﷺ) said, \"Call him\". They called him and \nthe Prophet (ﷺ) asked him, \"Why did you slap his face?\" He said, \"O Allah's Messenger (ﷺ)! While I was passing \nby the Jews, I heard him saying, 'By Him Who chose Moses above all the human beings.' I said \n(protestingly), 'Even above Muhammad?' So I became furious and slapped him.\" The Prophet (ﷺ) said, \n\"Do not give me preference to other prophets, for the people will become unconscious on the Day of \nResurrection and I will be the first to gain conscious, and behold, I will Find Moses holding one of the \npillars of the Throne (of Allah). Then I will not know whether he has become conscious before me or \nhe has been exempted because of his unconsciousness at the mountain (during his worldly life) which \nhe received.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَاءَ رَجُلٌ مِنَ الْيَهُودِ إِلَى النَّبِيِّ صلى الله عليه وسلم قَدْ لُطِمَ وَجْهُهُ فَقَالَ يَا مُحَمَّدُ إِنَّ رَجُلاً مِنْ أَصْحَابِكَ مِنَ الأَنْصَارِ لَطَمَ فِي وَجْهِي‏.‏ قَالَ ‏\"‏ ادْعُوهُ ‏\"‏‏.‏ فَدَعَوْهُ‏.‏ قَالَ ‏\"‏ لِمَ لَطَمْتَ وَجْهَهُ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنِّي مَرَرْتُ بِالْيَهُودِ فَسَمِعْتُهُ يَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ‏.‏ قَالَ قُلْتُ وَعَلَى مُحَمَّدٍ صلى الله عليه وسلم قَالَ فَأَخَذَتْنِي غَضْبَةٌ فَلَطَمْتُهُ‏.‏ قَالَ ‏\"‏ لاَ تُخَيِّرُونِي مِنْ بَيْنِ الأَنْبِيَاءِ فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَفَاقَ قَبْلِي أَمْ جُزِيَ بِصَعْقَةِ الطُّورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6917In-book reference : Book 87, Hadith 55USC-MSA web (English) reference : Vol. 9, Book 83, Hadith 52   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6918,
    "id": 6918,
    "url": "https://sunnah.com/bukhari:6918",
    "bookNumber": 88,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah:",
    "english": "When the Verse: 'It is those who believe and confuse not their belief with wrong (i.e., worshipping \nothers besides Allah): (6.82) was revealed, it became very hard on the companions of the Prophet (ﷺ) and \nthey said, \"Who among us has not confused his belief with wrong (oppression)?\" On that, Allah's \nApostle said, \"This is not meant (by the Verse). Don't you listen to Luqman's statement: 'Verily! \nJoining others in worship with Allah is a great wrong indeed.' (31.13)",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَقَالُوا أَيُّنَا لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيْسَ بِذَاكَ، أَلاَ تَسْمَعُونَ إِلَى قَوْلِ لُقْمَانَ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6918In-book reference : Book 88, Hadith 1USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 53   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6919,
    "id": 6919,
    "url": "https://sunnah.com/bukhari:6919",
    "bookNumber": 88,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet. said, \"The biggest of the great sins are: To join others in worship with Allah, to be \nundutiful to one's parents, and to give a false witness.\" He repeated it thrice, or said, \"....a false \nstatement,\" and kept on repeating that warning till we wished he would stop saying it. (See Hadith \nNo.7, Vol. 8)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا الْجُرَيْرِيُّ، وَحَدَّثَنِي قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَكْبَرُ الْكَبَائِرِ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَشَهَادَةُ الزُّورِ، وَشَهَادَةُ الزُّورِ ـ ثَلاَثًا ـ أَوْ قَوْلُ الزُّورِ ‏\"‏‏.‏ فَمَا زَالَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6919In-book reference : Book 88, Hadith 2USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 54   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6920,
    "id": 6920,
    "url": "https://sunnah.com/bukhari:6920",
    "bookNumber": 88,
    "hadithNumber": 3,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "A bedouin came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! What are the biggest sins?: The Prophet (ﷺ) \nsaid, \"To join others in worship with Allah.\" The bedouin said, \"What is next?\" The Prophet (ﷺ) said, \"To \nbe undutiful to one's parents.\" The bedouin said \"What is next?\" The Prophet (ﷺ) said \"To take an oath \n'Al-Ghamus.\" The bedouin said, \"What is an oath 'Al-Ghamus'?\" The Prophet (ﷺ) said, \"The false oath \nthrough which one deprives a Muslim of his property (unjustly).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، أَخْبَرَنَا شَيْبَانُ، عَنْ فِرَاسٍ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا الْكَبَائِرُ قَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ ‏\"‏‏.‏ قَالَ ثُمَّ مَاذَا قَالَ ‏\"‏ ثُمَّ عُقُوقُ الْوَالِدَيْنِ ‏\"‏‏.‏ قَالَ ثُمَّ مَاذَا قَالَ ‏\"‏ الْيَمِينُ الْغَمُوسُ ‏\"‏‏.‏ قُلْتُ وَمَا الْيَمِينُ الْغَمُوسُ قَالَ ‏\"‏ الَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا كَاذِبٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6920In-book reference : Book 88, Hadith 3USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6921,
    "id": 6921,
    "url": "https://sunnah.com/bukhari:6921",
    "bookNumber": 88,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn Mas`ud:",
    "english": "A man said, \"O Allah's Messenger (ﷺ)! Shall we be punished for what we did in the Prelslamic Period of \nignorance?\" The Prophet (ﷺ) said, \"Whoever does good in Islam will not be punished for what he did in \nthe Pre-lslamic Period of ignorance and whoever does evil in Islam will be punished for his former \nand later (bad deeds).",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنُؤَاخَذُ بِمَا عَمِلْنَا فِي الْجَاهِلِيَّةِ قَالَ ‏\n\"‏ مَنْ أَحْسَنَ فِي الإِسْلاَمِ لَمْ يُؤَاخَذْ بِمَا عَمِلَ فِي الْجَاهِلِيَّةِ، وَمَنْ أَسَاءَ فِي الإِسْلاَمِ أُخِذَ بِالأَوَّلِ وَالآخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6921In-book reference : Book 88, Hadith 4USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 56   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6922,
    "id": 6922,
    "url": "https://sunnah.com/bukhari:6922",
    "bookNumber": 88,
    "hadithNumber": 5,
    "narrator": "Narrated `Ikrima:",
    "english": "Some Zanadiqa (atheists) were brought to `Ali and he burnt them. The news of this event, reached Ibn \n`Abbas who said, \"If I had been in his place, I would not have burnt them, as Allah's Messenger (ﷺ) forbade \nit, saying, 'Do not punish anybody with Allah's punishment (fire).' I would have killed them according \nto the statement of Allah's Messenger (ﷺ), 'Whoever changed his Islamic religion, then kill him.'\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، قَالَ أُتِيَ عَلِيٌّ ـ رضى الله عنه ـ بِزَنَادِقَةٍ فَأَحْرَقَهُمْ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ لَوْ كُنْتُ أَنَا لَمْ أُحْرِقْهُمْ لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6922In-book reference : Book 88, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 57   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6923,
    "id": 6923,
    "url": "https://sunnah.com/bukhari:6923",
    "bookNumber": 88,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Burda:",
    "english": "Abu Musa said, \"I came to the Prophet (ﷺ) along with two men (from the tribe) of Ash`ariyin, one on my \nright and the other on my left, while Allah's Messenger (ﷺ) was brushing his teeth (with a Siwak), and both \nmen asked him for some employment. The Prophet (ﷺ) said, 'O Abu Musa (O `Abdullah bin Qais!).' I \nsaid, 'By Him Who sent you with the Truth, these two men did not tell me what was in their hearts and \nI did not feel (realize) that they were seeking employment.' As if I were looking now at his Siwak \nbeing drawn to a corner under his lips, and he said, 'We never (or, we do not) appoint for our affairs \nanyone who seeks to be employed. But O Abu Musa! (or `Abdullah bin Qais!) Go to Yemen.'\" The \nProphet then sent Mu`adh bin Jabal after him and when Mu`adh reached him, he spread out a cushion \nfor him and requested him to get down (and sit on the cushion). Behold: There was a fettered man \nbeside Abu Muisa. Mu`adh asked, \"Who is this (man)?\" Abu Muisa said, \"He was a Jew and became a \nMuslim and then reverted back to Judaism.\" Then Abu Muisa requested Mu`adh to sit down but \nMu`adh said, \"I will not sit down till he has been killed. This is the judgment of Allah and His Apostle \n(for such cases) and repeated it thrice. Then Abu Musa ordered that the man be killed, and he was \nkilled. Abu Musa added, \"Then we discussed the night prayers and one of us said, 'I pray and sleep, \nand I hope that Allah will reward me for my sleep as well as for my prayers.'\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، أَحَدُهُمَا عَنْ يَمِينِي، وَالآخَرُ عَنْ يَسَارِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ فَكِلاَهُمَا سَأَلَ‏.‏ فَقَالَ ‏\"‏ يَا أَبَا مُوسَى ‏\"‏‏.‏ أَوْ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ‏\"‏‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا، وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتِ شَفَتِهِ قَلَصَتْ فَقَالَ ‏\"‏ لَنْ ـ أَوْ ـ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ، وَلَكِنِ اذْهَبْ أَنْتَ يَا أَبَا مُوسَى ـ أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ـ إِلَى الْيَمَنِ ‏\"‏‏.‏ ثُمَّ أَتْبَعَهُ مُعَاذُ بْنُ جَبَلٍ، فَلَمَّا قَدِمَ عَلَيْهِ أَلْقَى لَهُ وِسَادَةً قَالَ انْزِلْ، وَإِذَا رَجُلٌ عِنْدَهُ مُوثَقٌ‏.‏ قَالَ مَا هَذَا قَالَ كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ تَهَوَّدَ‏.‏ قَالَ اجْلِسْ‏.‏ قَالَ لاَ أَجْلِسُ حَتَّى يُقْتَلَ‏.‏ قَضَاءُ اللَّهِ وَرَسُولِهِ‏.‏ ثَلاَثَ مَرَّاتٍ، فَأَمَرَ بِهِ فَقُتِلَ، ثُمَّ تَذَاكَرْنَا قِيَامَ اللَّيْلِ، فَقَالَ أَحَدُهُمَا أَمَّا أَنَا فَأَقُومُ وَأَنَامُ، وَأَرْجُو فِي نَوْمَتِي مَا أَرْجُو فِي قَوْمَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6923In-book reference : Book 88, Hadith 6USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 58   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6924,
    "id": 6924,
    "url": "https://sunnah.com/bukhari:6924",
    "bookNumber": 88,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "When the Prophet (ﷺ) died and Abu Bakr became his successor and some of the Arabs reverted to \ndisbelief, `Umar said, \"O Abu Bakr! How can you fight these people although Allah's Messenger (ﷺ) said, 'I \nhave been ordered to fight the people till they say: 'None has the right to be worshipped but Allah, \n'and whoever said, 'None has the right to be worshipped but Allah', Allah will save his property and \nhis life from me, unless (he does something for which he receives legal punishment) justly, and his \naccount will be with Allah?' \"Abu Bakr said, \"By Allah! I will fight whoever differentiates between \nprayers and Zakat as Zakat is the right to be taken from property (according to Allah's Orders). By \nAllah! If they refused to pay me even a kid they used to pay to Allah's Messenger (ﷺ), I would fight with \nthem for withholding it.\" `Umar said, \"By Allah: It was nothing, but I noticed that Allah opened Abu \nBakr's chest towards the decision to fight, therefore I realized that his decision was right.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ، وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ، قَالَ عُمَرُ يَا أَبَا بَكْرٍ، كَيْفَ تُقَاتِلُ النَّاسَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏   قَالَ أَبُو بَكْرٍ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ، فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ أَنْ قَدْ شَرَحَ اللَّهُ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6924, 6925In-book reference : Book 88, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6925,
    "id": 6925,
    "url": "https://sunnah.com/bukhari:6925",
    "bookNumber": 88,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "When the Prophet (ﷺ) died and Abu Bakr became his successor and some of the Arabs reverted to \ndisbelief, `Umar said, \"O Abu Bakr! How can you fight these people although Allah's Messenger (ﷺ) said, 'I \nhave been ordered to fight the people till they say: 'None has the right to be worshipped but Allah, \n'and whoever said, 'None has the right to be worshipped but Allah', Allah will save his property and \nhis life from me, unless (he does something for which he receives legal punishment) justly, and his \naccount will be with Allah?' \"Abu Bakr said, \"By Allah! I will fight whoever differentiates between \nprayers and Zakat as Zakat is the right to be taken from property (according to Allah's Orders). By \nAllah! If they refused to pay me even a kid they used to pay to Allah's Messenger (ﷺ), I would fight with \nthem for withholding it.\" `Umar said, \"By Allah: It was nothing, but I noticed that Allah opened Abu \nBakr's chest towards the decision to fight, therefore I realized that his decision was right.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ، وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ، قَالَ عُمَرُ يَا أَبَا بَكْرٍ، كَيْفَ تُقَاتِلُ النَّاسَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏   قَالَ أَبُو بَكْرٍ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ، فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ أَنْ قَدْ شَرَحَ اللَّهُ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6924, 6925In-book reference : Book 88, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6926,
    "id": 6926,
    "url": "https://sunnah.com/bukhari:6926",
    "bookNumber": 88,
    "hadithNumber": 8,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A Jew passed by Allah's Messenger (ﷺ) and said, \"As-Samu 'Alaika.\" Allah's Messenger (ﷺ) said in reply, \"We \n'Alaika.\" Allah's Messenger (ﷺ) then said to his companions, \"Do you know what he (the Jew) has said? He \nsaid, 'As-Samu 'Alaika.'\" They said, \"O Allah's Messenger (ﷺ)! Shall we kill him?\" The Prophet, said, \"No. \nWhen the people of the Book greet you, say: 'Wa 'Alaikum.'\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ مَرَّ يَهُودِيٌّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ السَّامُ عَلَيْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَيْكَ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَدْرُونَ مَا يَقُولُ قَالَ السَّامُ عَلَيْكَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَلاَ نَقْتُلُهُ قَالَ ‏\"‏ لاَ، إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6926In-book reference : Book 88, Hadith 8USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 60   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6927,
    "id": 6927,
    "url": "https://sunnah.com/bukhari:6927",
    "bookNumber": 88,
    "hadithNumber": 9,
    "narrator": "Narrated `Aisha:",
    "english": "A group of Jews asked permission to visit the Prophet (and when they were admitted) they said, \"As- \nSamu 'Alaika (Death be upon you).\" I said (to them), \"But death and the curse of Allah be upon you!\" \nThe Prophet (ﷺ) said, \"O `Aisha! Allah is kind and lenient and likes that one should be kind and lenient in \nall matters.\" I said, \"Haven't you heard what they said?\" He said, \"I said (to them), 'Wa 'Alaikum (and \nupon you).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ رَهْطٌ مِنَ الْيَهُودِ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ فَقُلْتُ بَلْ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ‏.‏ فَقَالَ ‏\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏‏.‏ قُلْتُ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6927In-book reference : Book 88, Hadith 9USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 61   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6928,
    "id": 6928,
    "url": "https://sunnah.com/bukhari:6928",
    "bookNumber": 88,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"When the Jews greet anyone of you they say: 'Sam'Alaika (death be upon you); \nso you should say; 'Wa 'Alaika (and upon you).'\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَمَالِكِ بْنِ أَنَسٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْيَهُودَ إِذَا سَلَّمُوا عَلَى أَحَدِكُمْ إِنَّمَا يَقُولُونَ سَامٌ عَلَيْكَ‏.‏ فَقُلْ عَلَيْكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6928In-book reference : Book 88, Hadith 10USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 62   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6929,
    "id": 6929,
    "url": "https://sunnah.com/bukhari:6929",
    "bookNumber": 88,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdullah:",
    "english": "As if I am looking at the Prophet (ﷺ) while he was speaking about one of the prophets whose people have \nbeaten and wounded him, and he was wiping the blood off his face and saying, \"O Lord! Forgive my, \npeople as they do not know.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ قَالَ عَبْدُ اللَّهِ كَأَنِّي أَنْظُرُ إِلَى النَّبِيِّ صلى الله عليه وسلم يَحْكِي نَبِيًّا مِنَ الأَنْبِيَاءِ ضَرَبَهُ قَوْمُهُ فَأَدْمَوْهُ، فَهْوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ وَيَقُولُ رَبِّ اغْفِرْ لِقَوْمِي، فَإِنَّهُمْ لاَ يَعْلَمُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6929In-book reference : Book 88, Hadith 11USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 63   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6930,
    "id": 6930,
    "url": "https://sunnah.com/bukhari:6930",
    "bookNumber": 88,
    "hadithNumber": 12,
    "narrator": "Narrated `Ali:",
    "english": "Whenever I tell you a narration from Allah's Messenger (ﷺ), by Allah, I would rather fall down from the sky \nthan ascribe a false statement to him, but if I tell you something between me and you (not a Hadith) \nthen it was indeed a trick (i.e., I may say things just to cheat my enemy). No doubt I heard Allah's \nApostle saying, \"During the last days there will appear some young foolish people who will say the \nbest words but their faith will not go beyond their throats (i.e. they will have no faith) and will go out \nfrom (leave) their religion as an arrow goes out of the game. So, where-ever you find them, kill them, \nfor who-ever kills them shall have reward on the Day of Resurrection.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا خَيْثَمَةُ، حَدَّثَنَا سُوَيْدُ بْنُ غَفَلَةَ، قَالَ عَلِيٌّ ـ رضى الله عنه ـ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا فَوَاللَّهِ، لأَنْ أَخِرَّ مِنَ السَّمَاءِ أَحَبُّ إِلَىَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ، وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّ الْحَرْبَ خَدْعَةٌ، وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ سَيَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ، حُدَّاثُ الأَسْنَانِ، سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6930In-book reference : Book 88, Hadith 12USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 64   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6931,
    "id": 6931,
    "url": "https://sunnah.com/bukhari:6931",
    "bookNumber": 88,
    "hadithNumber": 13,
    "narrator": "Narrated `Abdullah bin `Amr bin Yasar:",
    "english": "That they visited Abu Sa`id Al-Khudri and asked him about Al-Harauriyya, a special unorthodox \nreligious sect, \"Did you hear the Prophet (ﷺ) saying anything about them?\" Abu Sa`id said, \"I do not \nknow what Al-Harauriyya is, but I heard the Prophet (ﷺ) saying, \"There will appear in this nation---- he \ndid not say: From this nation ---- a group of people so pious apparently that you will consider your \nprayers inferior to their prayers, but they will recite the Qur'an, the teachings of which will not go \nbeyond their throats and will go out of their religion as an arrow darts through the game, whereupon \nthe archer may look at his arrow, its Nasl at its Risaf and its Fuqa to see whether it is blood-stained or \nnot (i.e. they will have not even a trace of Islam in them).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، وَعَطَاءِ بْنِ يَسَارٍ، أَنَّهُمَا أَتَيَا أَبَا سَعِيدٍ الْخُدْرِيَّ فَسَأَلاَهُ عَنِ الْحَرُورِيَّةِ، أَسَمِعْتَ النَّبِيَّ صلى الله عليه وسلم‏.‏ قَالَ لاَ أَدْرِي مَا الْحَرُورِيَّةُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَخْرُجُ فِي هَذِهِ الأُمَّةِ ـ وَلَمْ يَقُلْ مِنْهَا ـ قَوْمٌ تَحْقِرُونَ صَلاَتَكُمْ مَعَ صَلاَتِهِمْ، يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حُلُوقَهُمْ ـ أَوْ حَنَاجِرَهُمْ ـ يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، فَيَنْظُرُ الرَّامِي إِلَى سَهْمِهِ إِلَى نَصْلِهِ إِلَى رِصَافِهِ، فَيَتَمَارَى فِي الْفُوقَةِ، هَلْ عَلِقَ بِهَا مِنَ الدَّمِ شَىْءٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6931In-book reference : Book 88, Hadith 13USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 65   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6932,
    "id": 6932,
    "url": "https://sunnah.com/bukhari:6932",
    "bookNumber": 88,
    "hadithNumber": 14,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Regarding Al-Harauriyya: The Prophet (ﷺ) said, \"They will go out of Islam as an arrow darts out of the \ngame's body.'",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانُ، حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ وَذَكَرَ الْحَرُورِيَّةَ ـ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَمْرُقُونَ مِنَ الإِسْلاَمِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6932In-book reference : Book 88, Hadith 14USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6933,
    "id": 6933,
    "url": "https://sunnah.com/bukhari:6933",
    "bookNumber": 88,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Sa`id:",
    "english": "While the Prophet (ﷺ) was distributing (something, `Abdullah bin Dhil Khawaisira at-Tamimi came and \nsaid, \"Be just, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"Woe to you ! Who would be just if I were not?\" \n`Umar bin Al-Khattab said, \"Allow me to cut off his neck ! \" The Prophet (ﷺ) said, \" Leave him, for he \nhas companions, and if you compare your prayers with their prayers and your fasting with theirs, you \nwill look down upon your prayers and fasting, in comparison to theirs. Yet they will go out of the \nreligion as an arrow darts through the game's body in which case, if the Qudhadh of the arrow is \nexamined, nothing will be found on it, and when its Nasl is examined, nothing will be found on it; and \nthen its Nadiyi is examined, nothing will be found on it. The arrow has been too fast to be smeared by \ndung and blood. The sign by which these people will be recognized will be a man whose one hand (or \nbreast) will be like the breast of a woman (or like a moving piece of flesh). These people will appear \nwhen there will be differences among the people (Muslims).\" Abu Sa`id added: I testify that I heard \nthis from the Prophet (ﷺ) and also testify that `Ali killed those people while I was with him. The man with \nthe description given by the Prophet (ﷺ) was brought to `Ali. The following Verses were revealed in \nconnection with that very person (i.e., `Abdullah bin Dhil-Khawaisira at-Tarnimi): 'And among them \nare men who accuse you (O Muhammad) in the matter of (the distribution of) the alms.' (9.58)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَقْسِمُ جَاءَ عَبْدُ اللَّهِ بْنُ ذِي الْخُوَيْصِرَةِ التَّمِيمِيُّ فَقَالَ اعْدِلْ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ وَيْلَكَ مَنْ يَعْدِلُ إِذَا لَمْ أَعْدِلْ ‏\"‏‏.‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ دَعْنِي أَضْرِبْ عُنُقَهُ‏.‏ قَالَ ‏\"‏ دَعْهُ فَإِنَّ لَهُ أَصْحَابًا يَحْقِرُ أَحَدُكُمْ صَلاَتَهُ مَعَ صَلاَتِهِ، وَصِيَامَهُ مَعَ صِيَامِهِ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يُنْظَرُ فِي قُذَذِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، يُنْظَرُ فِي نَصْلِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ فِي رِصَافِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ فِي نَضِيِّهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، قَدْ سَبَقَ الْفَرْثَ وَالدَّمَ، آيَتُهُمْ رَجُلٌ إِحْدَى يَدَيْهِ ـ أَوْ قَالَ ثَدْيَيْهِ ـ مِثْلُ ثَدْىِ الْمَرْأَةِ ـ أَوْ قَالَ مِثْلُ الْبَضْعَةِ ـ تَدَرْدَرُ، يَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنَ النَّاسِ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ أَشْهَدُ سَمِعْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم وَأَشْهَدُ أَنَّ عَلِيًّا قَتَلَهُمْ وَأَنَا مَعَهُ، جِيءَ بِالرَّجُلِ عَلَى النَّعْتِ الَّذِي نَعَتَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ فَنَزَلَتْ فِيهِ ‏{‏وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6933In-book reference : Book 88, Hadith 15USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6934,
    "id": 6934,
    "url": "https://sunnah.com/bukhari:6934",
    "bookNumber": 88,
    "hadithNumber": 16,
    "narrator": "Narrated Yusair bin `Amr:",
    "english": "I asked Sahl bin Hunaif, \"Did you hear the Prophet (ﷺ) saying anything about Al-Khawarij?\" He said, \"I \nheard him saying while pointing his hand towards Iraq. \"There will appear in it (i.e, Iraq) some people \nwho will recite the Qur'an but it will not go beyond their throats, and they will go out from (leave) \nIslam as an arrow darts through the game's body.' \"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، حَدَّثَنَا يُسَيْرُ بْنُ عَمْرٍو، قَالَ قُلْتُ لِسَهْلِ بْنِ حُنَيْفٍ هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي الْخَوَارِجِ شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ ـ وَأَهْوَى بِيَدِهِ قِبَلَ الْعِرَاقِ ـ ‏\n\"‏ يَخْرُجُ مِنْهُ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الإِسْلاَمِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6934In-book reference : Book 88, Hadith 16USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 68   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6935,
    "id": 6935,
    "url": "https://sunnah.com/bukhari:6935",
    "bookNumber": 88,
    "hadithNumber": 17,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till two (huge) groups fight against each other, \ntheir claim being one and the same.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ دَعْوَاهُمَا وَاحِدَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6935In-book reference : Book 88, Hadith 17USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6936,
    "id": 6936,
    "url": "https://sunnah.com/bukhari:6936",
    "bookNumber": 88,
    "hadithNumber": 18,
    "narrator": "'Umar bin Al-Khattab said:",
    "english": "I heard Hisham bin Al-Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ). I listened to his recitation and noticed that he recited it in several different ways which Allah's Messenger (ﷺ) had not taught me. So  I was about to jump over him during his Salat (prayer) but I waited till he finished his Salat (prayer) whereupon I put, either his upper garment or my upper garment around his neck and seized him by it and asked him, \"Who has taught you this Surah?\" He replied: \"Allah's Messenger (ﷺ) has taught it to me.\" I said (to him), \"You have told a lie! By Allah, Allah's Messenger (ﷺ) has taught me this Surah which I have heard you reciting.\" So I dragged him to the Allah's Messenger (ﷺ). I said: \"O Allah's Messenger I have heard this man reciting Surat Al-Furqan in a way in which you have not taught me, and you did teach me Surah Al-Furqan.\" On that Allah's Messenger (ﷺ) said, \"O 'Umar, release him! Recite, O Hisham\". So Hisham recited before him in the way as I heard him reciting. Allah's Messenger (ﷺ) said, \"It has been revealed like this.\" Then Allah's Messenger (ﷺ) said, \"Recite, O 'Umar\" So recited it. The Prophet (ﷺ) said, \"It has been revealed like this.\" And then he added, \"This Qur'an has been revealed to be recited in seven different ways, so recite it whichever way is easier for you.\"",
    "arabic": "قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، وَعَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ، أَخْبَرَاهُ أَنَّهُمَا، سَمِعَا عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَمَعْتُ لِقِرَاءَتِهِ، فَإِذَا هُوَ يَقْرَؤُهَا عَلَى حُرُوفٍ كَثِيرَةٍ لَمْ يُقْرِئْنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم كَذَلِكَ، فَكِدْتُ أُسَاوِرُهُ فِي الصَّلاَةِ فَانْتَظَرْتُهُ حَتَّى سَلَّمَ، ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ أَوْ بِرِدَائِي فَقُلْتُ مَنْ أَقْرَأَكَ هَذِهِ السُّورَةَ قَالَ أَقْرَأَنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قُلْتُ لَهُ كَذَبْتَ فَوَاللَّهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقْرَأَنِي هَذِهِ السُّورَةَ الَّتِي سَمِعْتُكَ تَقْرَؤُهَا‏.‏ فَانْطَلَقْتُ أَقُودُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ بِسُورَةِ الْفُرْقَانِ عَلَى حُرُوفٍ لَمْ تُقْرِئْنِيهَا، وَأَنْتَ أَقْرَأْتَنِي سُورَةَ الْفُرْقَانِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسِلْهُ يَا عُمَرُ، اقْرَأْ يَا هِشَامُ ‏\"‏‏.‏ فَقَرَأَ عَلَيْهِ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَؤُهَا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَأْ يَا عُمَرُ ‏\"‏‏.‏ فَقَرَأْتُ فَقَالَ ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6936In-book reference : Book 88, Hadith 18USC-MSA web (English) reference : Vol. 1, Book 84, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6937,
    "id": 6937,
    "url": "https://sunnah.com/bukhari:6937",
    "bookNumber": 88,
    "hadithNumber": 19,
    "narrator": "Narrated `Abdullah:",
    "english": "When the Verse:--'Those who believe and did not confuse their belief with wrong (worshipping others \nbesides Allah).' (6.82) was revealed, it was hard on the companions of the Prophet (ﷺ) and they said, \n\"Who among us has not wronged (oppressed) himself?\" Allah's Messenger (ﷺ) said, \"The meaning of the \nVerse is not as you think, but it is as Luqman said to his son, 'O my son! Join not in worship others \nwith Allah, Verily! Joining others in worship with Allah is a great wrong indeed.'\" (31.13)",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، ح حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَقَالُوا أَيُّنَا لَمْ يَظْلِمْ نَفْسَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ كَمَا تَظُنُّونَ‏.‏ إِنَّمَا هُوَ كَمَا قَالَ لُقْمَانُ لاِبْنِهِ ‏{‏يَا بُنَىَّ لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6937In-book reference : Book 88, Hadith 19USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6938,
    "id": 6938,
    "url": "https://sunnah.com/bukhari:6938",
    "bookNumber": 88,
    "hadithNumber": 20,
    "narrator": "Narrated `Itban bin Malik:",
    "english": "Once Allah's Messenger (ﷺ) came to me in the morning, and a man among us said, \"Where is Malik bin Ad- \nDukhshun?\" Another man from us replied, \"He is a hypocrite who does not love Allah and His \nApostle.\" The Prophet (ﷺ) said, \"Don't you think that he says: None has the right to be worshipped but \nAllah, only for Allah's sake?\" They replied, \"Yes\" The Prophet (ﷺ) said, \"Nobody will meet Allah with \nthat saying on the Day of Resurrection, but Allah will save him from the Fire.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ، يَقُولُ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ رَجُلٌ مِنَّا ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تَقُولُوهُ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ يَبْتَغِي‏.‏ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّهُ لاَ يُوَافَى عَبْدٌ يَوْمَ الْقِيَامَةِ بِهِ إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6938In-book reference : Book 88, Hadith 20USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 71   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6939,
    "id": 6939,
    "url": "https://sunnah.com/bukhari:6939",
    "bookNumber": 88,
    "hadithNumber": 21,
    "narrator": "Narrated:",
    "english": "Abu `Abdur-Rahman and Hibban bin 'Atiyya had a dispute. Abu `Abdur-Rahman said to Hibban, \n\"You know what made your companions (i.e. `Ali) dare to shed blood.\" Hibban said, \"Come on! What \nis that?\" `Abdur-Rahman said, \"Something I heard him saying.\" The other said, \"What was it?\" \n`AbdurRahman said, \"`Ali said, Allah's Messenger (ﷺ) sent for me, Az-Zubair and Abu Marthad, and all of \nus were cavalry men, and said, 'Proceed to Raudat-Hajj (Abu Salama said that Abu 'Awana called it \nlike this, i.e., Hajj where there is a woman carrying a letter from Hatib bin Abi Balta'a to the pagans \n(of Mecca). So bring that letter to me.' So we proceeded riding on our horses till we overtook her at \nthe same place of which Allah's Messenger (ﷺ) had told us. She was traveling on her camel. In that letter \nHatib had written to the Meccans about the proposed attached of Allah's Messenger (ﷺ) against them. We \nasked her, \"Where is the letter which is with you?' She replied, 'I haven't got any letter.' So we made \nher camel kneel down and searched her luggage, but we did not find anything. My two companions \nsaid, 'We do not think that she has got a letter.' I said, 'We know that Allah's Messenger (ﷺ) has not told a \nlie.'\" \nThen `Ali took an oath saying, \"By Him by Whom one should swear! You shall either bring out the \nletter or we shall strip off your clothes.\" She then stretched out her hand for her girdle (round her \nwaist) and brought out the paper (letter). They took the letter to Allah's Messenger (ﷺ). `Umar said, \"O \nAllah's Messenger (ﷺ)! (Hatib) has betrayed Allah, His Apostle and the believers; let me chop off his neck!\" \nAllah's Messenger (ﷺ) said, \"O Hatib! What obliged you to do what you have done?\" Hatib replied, \"O \nAllah's Messenger (ﷺ)! Why (for what reason) should I not believe in Allah and His Apostle? But I intended \nto do the (Mecca) people a favor by virtue of which my family and property may be protected as there \nis none of your companions but has some of his people (relatives) whom Allah urges to protect his \nfamily and property.\" The Prophet (ﷺ) said, \"He has said the truth; therefore, do not say anything to him \nexcept good.\" `Umar again said, \"O Allah's Messenger (ﷺ)! He has betrayed Allah, His Apostle and the \nbelievers; let me chop his neck off!\" The Prophet (ﷺ) said, \"Isn't he from those who fought the battle of \nBadr? And what do you know, Allah might have looked at them (Badr warriors) and said (to them), \n'Do what you like, for I have granted you Paradise?' \" On that, `Umar's eyes became flooded with tears \nand he said, \"Allah and His Apostle know best.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ فُلاَنٍ، قَالَ تَنَازَعَ أَبُو عَبْدِ الرَّحْمَنِ وَحِبَّانُ بْنُ عَطِيَّةَ فَقَالَ أَبُو عَبْدِ الرَّحْمَنِ لِحِبَّانَ لَقَدْ عَلِمْتُ الَّذِي جَرَّأَ صَاحِبَكَ عَلَى الدِّمَاءِ يَعْنِي عَلِيًّا‏.‏ قَالَ مَا هُوَ لاَ أَبَا لَكَ قَالَ شَىْءٌ سَمِعْتُهُ يَقُولُهُ‏.‏ قَالَ مَا هُوَ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَالزُّبَيْرَ وَأَبَا مَرْثَدٍ وَكُلُّنَا فَارِسٌ قَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ حَاجٍ ـ قَالَ أَبُو سَلَمَةَ هَكَذَا قَالَ أَبُو عَوَانَةَ حَاجٍ ـ فَإِنَّ فِيهَا امْرَأَةً مَعَهَا صَحِيفَةٌ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى الْمُشْرِكِينَ فَأْتُونِي بِهَا ‏\"‏‏.‏ فَانْطَلَقْنَا عَلَى أَفْرَاسِنَا حَتَّى أَدْرَكْنَاهَا حَيْثُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم تَسِيرُ عَلَى بَعِيرٍ لَهَا، وَكَانَ كَتَبَ إِلَى أَهْلِ مَكَّةَ بِمَسِيرِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَيْهِمْ‏.‏ فَقُلْنَا أَيْنَ الْكِتَابُ الَّذِي مَعَكِ قَالَتْ مَا مَعِي كِتَابٌ‏.‏ فَأَنَخْنَا بِهَا بَعِيرَهَا، فَابْتَغَيْنَا فِي رَحْلِهَا فَمَا وَجَدْنَا شَيْئًا‏.‏ فَقَالَ صَاحِبِي مَا نَرَى مَعَهَا كِتَابًا‏.‏ قَالَ فَقُلْتُ لَقَدْ عَلِمْنَا مَا كَذَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ حَلَفَ عَلِيٌّ وَالَّذِي يُحْلَفُ بِهِ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لأُجَرِّدَنَّكِ‏.‏ فَأَهْوَتْ إِلَى حُجْزَتِهَا وَهْىَ مُحْتَجِزَةٌ بِكِسَاءٍ فَأَخْرَجَتِ الصَّحِيفَةَ، فَأَتَوْا بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ‏.‏ دَعْنِي فَأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا حَاطِبُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي أَنْ لاَ أَكُونَ مُؤْمِنًا بِاللَّهِ وَرَسُولِهِ، وَلَكِنِّي أَرَدْتُ أَنْ يَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ، يُدْفَعُ بِهَا عَنْ أَهْلِي وَمَالِي، وَلَيْسَ مِنْ أَصْحَابِكَ أَحَدٌ إِلاَّ لَهُ هُنَالِكَ مِنْ قَوْمِهِ مَنْ يَدْفَعُ اللَّهُ بِهِ عَنْ أَهْلِهِ وَمَالِهِ‏.‏ قَالَ ‏\"‏ صَدَقَ، لاَ تَقُولُوا لَهُ إِلاَّ خَيْرًا ‏\"‏‏.‏ قَالَ فَعَادَ عُمَرُ فَقَالَ يَا رَسُولُ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، دَعْنِي فَلأَضْرِبَ عُنُقَهُ‏.‏ قَالَ ‏\"‏ أَوَلَيْسَ مِنْ أَهْلِ بَدْرٍ، وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ عَلَيْهِمْ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ أَوْجَبْتُ لَكُمُ الْجَنَّةَ ‏\"‏‏.‏ فَاغْرَوْرَقَتْ عَيْنَاهُ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6939In-book reference : Book 88, Hadith 21USC-MSA web (English) reference : Vol. 9, Book 84, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6940,
    "id": 6940,
    "url": "https://sunnah.com/bukhari:6940",
    "bookNumber": 89,
    "hadithNumber": 1,
    "narrator": "Narrated Abi Huraira:",
    "english": "The Prophet (ﷺ) used to invoke Allah in his prayer, \"O Allah! Save `Aiyash bin Abi Rabi`a and Salama \nbin Hisham and Al-Walid bin Al-Walid; O Allah! Save the weak among the believers; O Allah! Be \nhard upon the tribe of Mudar and inflict years (of famine) upon them like the (famine) years of \nJoseph.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ هِلاَلِ بْنِ أُسَامَةَ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَدْعُو فِي الصَّلاَةِ ‏\n\"‏ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، وَسَلَمَةَ بْنَ هِشَامٍ، وَالْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، وَابْعَثْ عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6940In-book reference : Book 89, Hadith 1USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6941,
    "id": 6941,
    "url": "https://sunnah.com/bukhari:6941",
    "bookNumber": 89,
    "hadithNumber": 2,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever possesses the (following) three qualities will have the sweetness of \nfaith (1): The one to whom Allah and His Apostle becomes dearer than anything else; (2) Who loves a \nperson and he loves him only for Allah's Sake; (3) who hates to revert to atheism (disbelief) as he \nhates to be thrown into the Fire.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ الطَّائِفِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاَوَةَ الإِيمَانِ أَنْ يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءَ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ، كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6941In-book reference : Book 89, Hadith 2USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 74   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6942,
    "id": 6942,
    "url": "https://sunnah.com/bukhari:6942",
    "bookNumber": 89,
    "hadithNumber": 3,
    "narrator": "Narrated Qais:",
    "english": "I heard Sa`id bin Zaid saying, \"I have seen myself tied and forced by `Umar to leave Islam (Before \n`Umar himself embraced Islam). And if the mountain of Uhud were to collapse for the evil which you \npeople had done to `Uthman, then Uhud would have the right to do so.\" (See Hadith No. 202, Vol. 5)",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبَّادٌ، عَنْ إِسْمَاعِيلَ، سَمِعْتُ قَيْسًا، سَمِعْتُ سَعِيدَ بْنَ زَيْدٍ، يَقُولُ لَقَدْ رَأَيْتُنِي وَإِنَّ عُمَرَ مُوثِقِي عَلَى الإِسْلاَمِ، وَلَوِ انْقَضَّ أُحُدٌ مِمَّا فَعَلْتُمْ بِعُثْمَانَ كَانَ مَحْقُوقًا أَنْ يَنْقَضَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6942In-book reference : Book 89, Hadith 3USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 75   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6943,
    "id": 6943,
    "url": "https://sunnah.com/bukhari:6943",
    "bookNumber": 89,
    "hadithNumber": 4,
    "narrator": "Narrated Khabbab bin Al-Art:",
    "english": "We complained to Allah's Messenger (ﷺ) (about our state) while he was leaning against his sheet cloak in the \nshade of the Ka`ba. We said, \"Will you ask Allah to help us? Will you invoke Allah for us?\" He said, \n\"Among those who were before you a (believer) used to be seized and, a pit used to be dug for him \nand then he used to be placed in it. Then a saw used to be brought and put on his head which would be \nsplit into two halves. His flesh might be combed with iron combs and removed from his bones, yet, all \nthat did not cause him to revert from his religion. By Allah! This religion (Islam) will be completed \n(and triumph) till a rider (traveler) goes from San`a' (the capital of Yemen) to Hadramout fearing \nnobody except Allah and the wolf lest it should trouble his sheep, but you are impatient.\" (See Hadith \nNo. 191, Vol. 5)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، عَنْ خَبَّابِ بْنِ الأَرَتِّ، قَالَ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ مُتَوَسِّدٌ بُرْدَةً لَهُ فِي ظِلِّ الْكَعْبَةِ فَقُلْنَا أَلاَ تَسْتَنْصِرُ لَنَا أَلاَ تَدْعُو لَنَا‏.‏ فَقَالَ ‏\n\"‏ قَدْ كَانَ مَنْ قَبْلَكُمْ يُؤْخَذُ الرَّجُلُ فَيُحْفَرُ لَهُ فِي الأَرْضِ فَيُجْعَلُ فِيهَا، فَيُجَاءُ بِالْمِنْشَارِ فَيُوضَعُ عَلَى رَأْسِهِ فَيُجْعَلُ نِصْفَيْنِ، وَيُمَشَّطُ بِأَمْشَاطِ الْحَدِيدِ مَا دُونَ لَحْمِهِ وَعَظْمِهِ، فَمَا يَصُدُّهُ ذَلِكَ عَنْ دِينِهِ، وَاللَّهِ لَيَتِمَّنَّ هَذَا الأَمْرُ، حَتَّى يَسِيرَ الرَّاكِبُ مِنْ صَنْعَاءَ إِلَى حَضْرَمَوْتَ لاَ يَخَافُ إِلاَّ اللَّهَ وَالذِّئْبَ عَلَى غَنَمِهِ، وَلَكِنَّكُمْ تَسْتَعْجِلُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6943In-book reference : Book 89, Hadith 4USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 76   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6944,
    "id": 6944,
    "url": "https://sunnah.com/bukhari:6944",
    "bookNumber": 89,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "While we were in the mosque, Allah's Messenger (ﷺ) came out to us and said, \"Let us proceed to the Jews.\" \nSo we went along with him till we reached Bait-al-Midras (a place where the Torah used to be recited \nand all the Jews of the town used to gather). The Prophet (ﷺ) stood up and addressed them, \"O Assembly \nof Jews! Embrace Islam and you will be safe!\" The Jews replied, \"O Aba-l-Qasim! You have \nconveyed Allah's message to us.\" The Prophet (ﷺ) said, \"That is what I want (from you).\" He repeated his \nfirst statement for the second time, and they said, \"You have conveyed Allah's message, O Aba-l- \nQasim.\" Then he said it for the third time and added, \"You should Know that the earth belongs to \nAllah and His Apostle, and I want to exile you fro,,, this land, so whoever among you owns some \nproperty, can sell it, otherwise you should know that the Earth belongs to Allah and His Apostle.\" \n(See Hadith No. 392, Vol. 4)",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ فِي الْمَسْجِدِ إِذْ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْطَلِقُوا إِلَى يَهُودَ ‏\"‏‏.‏ فَخَرَجْنَا مَعَهُ حَتَّى جِئْنَا بَيْتَ الْمِدْرَاسِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَنَادَاهُمْ ‏\"‏ يَا مَعْشَرَ يَهُودَ أَسْلِمُوا تَسْلَمُوا ‏\"‏‏.‏ فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ فَقَالَ ‏\"‏ ذَلِكَ أُرِيدُ ‏\"‏، ثُمَّ قَالَهَا الثَّانِيَةَ‏.‏ فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ ثُمَّ قَالَ الثَّالِثَةَ فَقَالَ ‏\"‏ اعْلَمُوا أَنَّ الأَرْضَ لِلَّهِ وَرَسُولِهِ، وَإِنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ، فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ، وَإِلاَّ فَاعْلَمُوا أَنَّمَا الأَرْضُ لِلَّهِ وَرَسُولِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6944In-book reference : Book 89, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 77   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6945,
    "id": 6945,
    "url": "https://sunnah.com/bukhari:6945",
    "bookNumber": 89,
    "hadithNumber": 6,
    "narrator": "Narrated Khansa' bint Khidam Al-Ansariya:",
    "english": "That her father gave her in marriage when she was a matron and she disliked that marriage. So she \ncame and (complained) to the Prophets and he declared that marriage invalid. (See Hadith No. 69, \nVol. 7)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ بْنِ جَارِيَةَ الأَنْصَارِيِّ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهْىَ ثَيِّبٌ، فَكَرِهَتْ ذَلِكَ، فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَرَدَّ نِكَاحَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6945In-book reference : Book 89, Hadith 6USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6946,
    "id": 6946,
    "url": "https://sunnah.com/bukhari:6946",
    "bookNumber": 89,
    "hadithNumber": 7,
    "narrator": "Narrated `Aisha:",
    "english": "I asked the Prophet, \"O Allah's Messenger (ﷺ)! Should the women be asked for their consent to their \nmarriage?\" He said, \"Yes.\" I said, \"A virgin, if asked, feels shy and keeps quiet.\" He said, \"Her silence \nmeans her consent.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ أَبِي عَمْرٍو ـ هُوَ ذَكْوَانُ ـ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ يُسْتَأْمَرُ النِّسَاءُ فِي أَبْضَاعِهِنَّ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ فَإِنَّ الْبِكْرَ تُسْتَأْمَرُ فَتَسْتَحِي فَتَسْكُتُ‏.‏ قَالَ ‏\"‏ سُكَاتُهَا إِذْنُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6946In-book reference : Book 89, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 79   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6947,
    "id": 6947,
    "url": "https://sunnah.com/bukhari:6947",
    "bookNumber": 89,
    "hadithNumber": 8,
    "narrator": "Narrated Jabir:",
    "english": "A man from the Ansar made his slave, a Mudabbar. And apart from that slave he did not have any \nother property. This news reached Allah's Messenger (ﷺ) and he said, \"Who will buy that slave from me?\" So \nNu'aim bin An-Nahham bought him for 800 Dirham. Jabir added: It was a coptic (Egyptian) slave \nwho died that year.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ دَبَّرَ مَمْلُوكًا، وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ، فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ النَّحَّامِ بِثَمَانِمِائَةِ دِرْهَمٍ‏.‏ قَالَ فَسَمِعْتُ جَابِرًا يَقُولُ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6947In-book reference : Book 89, Hadith 8USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6948,
    "id": 6948,
    "url": "https://sunnah.com/bukhari:6948",
    "bookNumber": 89,
    "hadithNumber": 9,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding the Qur'anic Verse: 'O you who believe! You are forbidden to inherit women against their \nwill.' (4.19) The custom (in the Pre-lslamic Period) was that if a man died, his relatives used to have \nthe right to inherit his wife, and if one of them wished, he could marry her, or they could marry her to \nsomebody else, or prevent her from marrying if they wished, for they had more right to dispose of her \nthan her own relatives. Therefore this Verse was revealed concerning this matter.",
    "arabic": "حَدَّثَنَا حُسَيْنُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الشَّيْبَانِيُّ، سُلَيْمَانُ بْنُ فَيْرُوزَ عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،‏.‏ قَالَ الشَّيْبَانِيُّ وَحَدَّثَنِي عَطَاءٌ أَبُو الْحَسَنِ السُّوَائِيُّ،، وَلاَ أَظُنُّهُ إِلاَّ ذَكَرَهُ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا‏}‏ الآيَةَ قَالَ كَانُوا إِذَا مَاتَ الرَّجُلُ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ، إِنْ شَاءَ بَعْضُهُمْ تَزَوَّجَهَا، وَإِنْ شَاءُوا زَوَّجَهَا، وَإِنْ شَاءُوا لَمْ يُزَوِّجْهَا، فَهُمْ أَحَقُّ بِهَا مِنْ أَهْلِهَا، فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6948In-book reference : Book 89, Hadith 9USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6949,
    "id": 6949,
    "url": "https://sunnah.com/bukhari:6949",
    "bookNumber": 89,
    "hadithNumber": 10,
    "narrator": "And Safiyya bint 'Ubaid said:",
    "english": "\"A governmental male-slave tried to seduce a slave-girl from the Khumus of the war booty till he deflowered her by force against her will; therefore 'Umar flogged him according to the law, and exiled him, but he did not flog the female slave because the male-slave had committed illegal sexual intercourse by force, against her will.\"\n\nAz-Zuhri said regarding a virgin slave-girl raped by a free man: The judge has to fine the adulterer as much money as is equal to the price of the female slave and the adulterer has to be flogged (according to the Islamic Law); but if the slave woman is a matron, then, according to the verdict of the Imam, the adulterer is not fined but he has to receive the legal punishment (according to the Islamic Law).",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ، أَنَّ صَفِيَّةَ ابْنَةَ أَبِي عُبَيْدٍ، أَخْبَرَتْهُ أَنَّ عَبْدًا مِنْ رَقِيقِ الإِمَارَةِ وَقَعَ عَلَى وَلِيدَةٍ مِنَ الْخُمُسِ، فَاسْتَكْرَهَهَا حَتَّى افْتَضَّهَا، فَجَلَدَهُ عُمَرُ الْحَدَّ وَنَفَاهُ، وَلَمْ يَجْلِدِ الْوَلِيدَةَ مِنْ أَجْلِ أَنَّهُ اسْتَكْرَهَهَا‏.‏ قَالَ الزُّهْرِيُّ فِي الأَمَةِ الْبِكْرِ، يَفْتَرِعُهَا الْحُرُّ، يُقِيمُ ذَلِكَ الْحَكَمُ مِنَ الأَمَةِ الْعَذْرَاءِ بِقَدْرِ قِيمَتِهَا، وَيُجْلَدُ، وَلَيْسَ فِي الأَمَةِ الثَّيِّبِ فِي قَضَاءِ الأَئِمَّةِ غُرْمٌ، وَلَكِنْ عَلَيْهِ الْحَدُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6949In-book reference : Book 89, Hadith 10USC-MSA web (English) reference : Vol. 1, Book 85, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6950,
    "id": 6950,
    "url": "https://sunnah.com/bukhari:6950",
    "bookNumber": 89,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"(The Prophet) Abraham migrated with his wife Sarah till he reached a town \nwhere there was a king or a tyrant who sent a message, to Abraham, ordering him to send Sarah to \nhim. So when Abraham had sent Sarah, the tyrant got up, intending to do evil with her, but she got up \nand performed ablution and prayed and said, 'O Allah ! If I have believed in You and in Your Apostle, \nthen do not empower this oppressor over me.' So he (the king) had an epileptic fit and started moving \nhis legs violently. \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هَاجَرَ إِبْرَاهِيمُ بِسَارَةَ، دَخَلَ بِهَا قَرْيَةً فِيهَا مَلِكٌ مِنَ الْمُلُوكِ أَوْ جَبَّارٌ مِنَ الْجَبَابِرَةِ، فَأَرْسَلَ إِلَيْهِ أَنْ أَرْسِلْ إِلَىَّ بِهَا‏.‏ فَأَرْسَلَ بِهَا، فَقَامَ إِلَيْهَا فَقَامَتْ تَوَضَّأُ وَتُصَلِّي فَقَالَتِ اللَّهُمَّ إِنْ كُنْتُ آمَنْتُ بِكَ وَبِرَسُولِكَ فَلاَ تُسَلِّطْ عَلَىَّ الْكَافِرَ، فَغُطَّ حَتَّى رَكَضَ بِرِجْلِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6950In-book reference : Book 89, Hadith 11USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 82   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6951,
    "id": 6951,
    "url": "https://sunnah.com/bukhari:6951",
    "bookNumber": 89,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim. So he should neither oppress him nor \nhand him over to an oppressor. And whoever fulfilled the needs of his brother, Allah will fulfill his \nneeds.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرِ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمًا، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ، لاَ يَظْلِمُهُ، وَلاَ يُسْلِمُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ، كَانَ اللَّهُ فِي حَاجَتِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6951In-book reference : Book 89, Hadith 12USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 83   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6952,
    "id": 6952,
    "url": "https://sunnah.com/bukhari:6952",
    "bookNumber": 89,
    "hadithNumber": 13,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) said, \"Help your brother whether he is an oppressor or an oppressed,\" A man said, \"O \nAllah's Messenger (ﷺ)! I will help him if he is oppressed, but if he is an oppressor, how shall I help him?\" \nThe Prophet (ﷺ) said, \"By preventing him from oppressing (others), for that is how to help him.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنْصُرُهُ إِذَا كَانَ مَظْلُومًا، أَفَرَأَيْتَ إِذَا كَانَ ظَالِمًا كَيْفَ أَنْصُرُهُ قَالَ ‏\"‏ تَحْجُزُهُ أَوْ تَمْنَعُهُ مِنَ الظُّلْمِ، فَإِنَّ ذَلِكَ نَصْرُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6952In-book reference : Book 89, Hadith 13USC-MSA web (English) reference : Vol. 9, Book 85, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6953,
    "id": 6953,
    "url": "https://sunnah.com/bukhari:6953",
    "bookNumber": 90,
    "hadithNumber": 1,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "The Prophet (ﷺ) said, 'O people! The reward of deeds depends upon the intentions, and every person will \nget the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, \nthen his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or \nfor a woman to marry, then his emigration was for what he emigrated for.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَخْطُبُ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَا أَيُّهَا النَّاسُ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ هَاجَرَ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6953In-book reference : Book 90, Hadith 1USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 85   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6954,
    "id": 6954,
    "url": "https://sunnah.com/bukhari:6954",
    "bookNumber": 90,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah does not accept prayer of anyone of you if he does Hadath (passes wind) till \nhe performs the ablution (anew).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقْبَلُ اللَّهُ صَلاَةَ أَحَدِكُمْ إِذَا أَحْدَثَ حَتَّى يَتَوَضَّأَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6954In-book reference : Book 90, Hadith 2USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 86   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6955,
    "id": 6955,
    "url": "https://sunnah.com/bukhari:6955",
    "bookNumber": 90,
    "hadithNumber": 3,
    "narrator": "Narrated Anas:",
    "english": "That Abu Bakr wrote for him, Zakat regulations which Allah's Messenger (ﷺ) had made compulsory, and \nwrote that one should neither collect various portions (of the property) nor divide the property into \nvarious portions in order to avoid paying Zakat.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ أَبَا بَكْرٍ كَتَبَ لَهُ فَرِيضَةَ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَلاَ يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6955In-book reference : Book 90, Hadith 3USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 87   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6956,
    "id": 6956,
    "url": "https://sunnah.com/bukhari:6956",
    "bookNumber": 90,
    "hadithNumber": 4,
    "narrator": "Narrated Talha bin 'Ubaidullah:",
    "english": "A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Tell me what \nAllah has enjoined on me as regards prayers.\" The Prophet (ﷺ) said, \"You have to offer perfectly the five \n(compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional \nprayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet (ﷺ) \nsaid, \"You have to observe fast during the month of Ramadan except if you fast some extra optional \nfast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet (ﷺ) then \ntold him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored \nyou, I will not perform any optional deeds of worship and I will not leave anything of what Allah has \nenjoined on me.\" Allah's Messenger (ﷺ) said, \"He will be successful if he has told the truth (or he will enter \nParadise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels \nis two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or \nplays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّ أَعْرَابِيًّا، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثَائِرَ الرَّأْسِ فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَاذَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصَّلاَةِ فَقَالَ ‏\"‏ الصَّلَوَاتِ الْخَمْسَ، إِلاَّ أَنْ تَطَوَّعَ شَيْئًا ‏\"‏‏.‏ فَقَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصِّيَامِ قَالَ ‏\"‏ شَهْرَ رَمَضَانَ، إِلاَّ أَنْ تَطَوَّعَ شَيْئًا ‏\"‏‏.‏ قَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الزَّكَاةِ قَالَ فَأَخْبَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم شَرَائِعَ الإِسْلاَمِ‏.‏ قَالَ وَالَّذِي أَكْرَمَكَ لاَ أَتَطَوَّعُ شَيْئًا وَلاَ أَنْقُصُ مِمَّا فَرَضَ اللَّهُ عَلَىَّ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ ‏\"‏‏.‏ أَوْ ‏\"‏ دَخَلَ الْجَنَّةَ إِنْ صَدَقَ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ فِي عِشْرِينَ وَمِائَةِ بَعِيرٍ حِقَّتَانِ‏.‏ فَإِنْ أَهْلَكَهَا مُتَعَمِّدًا، أَوْ وَهَبَهَا أَوِ احْتَالَ فِيهَا فِرَارًا مِنَ الزَّكَاةِ، فَلاَ شَىْءَ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6956In-book reference : Book 90, Hadith 4USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 88   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6957,
    "id": 6957,
    "url": "https://sunnah.com/bukhari:6957",
    "bookNumber": 90,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ، يَفِرُّ مِنْهُ صَاحِبُهُ فَيَطْلُبُهُ وَيَقُولُ أَنَا كَنْزُكَ‏.‏ قَالَ وَاللَّهِ لَنْ يَزَالَ يَطْلُبُهُ حَتَّى يَبْسُطَ يَدَهُ فَيُلْقِمَهَا فَاهُ ‏\"‏‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا مَا رَبُّ النَّعَمِ لَمْ يُعْطِ حَقَّهَا، تُسَلَّطُ عَلَيْهِ يَوْمَ الْقِيَامَةِ، تَخْبِطُ وَجْهَهُ بِأَخْفَافِهَا ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ فِي رَجُلٍ لَهُ إِبِلٌ، فَخَافَ أَنْ تَجِبَ عَلَيْهِ الصَّدَقَةُ، فَبَاعَهَا بِإِبِلٍ مِثْلِهَا، أَوْ بِغَنَمٍ، أَوْ بِبَقَرٍ، أَوْ بِدَرَاهِمَ، فِرَارًا مِنَ الصَّدَقَةِ بِيَوْمٍ، احْتِيَالاً فَلاَ بَأْسَ عَلَيْهِ، وَهْوَ يَقُولُ إِنْ زَكَّى إِبِلَهُ قَبْلَ أَنْ يَحُولَ الْحَوْلُ بِيَوْمٍ أَوْ بِسَنَةٍ، جَازَتْ عَنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6957, 6958In-book reference : Book 90, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6958,
    "id": 6958,
    "url": "https://sunnah.com/bukhari:6958",
    "bookNumber": 90,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has \nnot been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake \nand its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet (ﷺ) \nadded, \"By Allah, that snake will keep on following him until he stretches out his hand and let the \nsnake swallow it.\" Allah's Messenger (ﷺ) added, \"If the owner of camels does not pay their Zakat, then, on \nthe Day of Resurrection those camels will come to him and will strike his face with their hooves.\" \nSome people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells \nthose camels for similar camels or for sheep or cows or money one day before Zakat becomes due in \norder to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \n\"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which \nZakat becomes due), his Zakat will be valid.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ، يَفِرُّ مِنْهُ صَاحِبُهُ فَيَطْلُبُهُ وَيَقُولُ أَنَا كَنْزُكَ‏.‏ قَالَ وَاللَّهِ لَنْ يَزَالَ يَطْلُبُهُ حَتَّى يَبْسُطَ يَدَهُ فَيُلْقِمَهَا فَاهُ ‏\"‏‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا مَا رَبُّ النَّعَمِ لَمْ يُعْطِ حَقَّهَا، تُسَلَّطُ عَلَيْهِ يَوْمَ الْقِيَامَةِ، تَخْبِطُ وَجْهَهُ بِأَخْفَافِهَا ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ فِي رَجُلٍ لَهُ إِبِلٌ، فَخَافَ أَنْ تَجِبَ عَلَيْهِ الصَّدَقَةُ، فَبَاعَهَا بِإِبِلٍ مِثْلِهَا، أَوْ بِغَنَمٍ، أَوْ بِبَقَرٍ، أَوْ بِدَرَاهِمَ، فِرَارًا مِنَ الصَّدَقَةِ بِيَوْمٍ، احْتِيَالاً فَلاَ بَأْسَ عَلَيْهِ، وَهْوَ يَقُولُ إِنْ زَكَّى إِبِلَهُ قَبْلَ أَنْ يَحُولَ الْحَوْلُ بِيَوْمٍ أَوْ بِسَنَةٍ، جَازَتْ عَنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6957, 6958In-book reference : Book 90, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6959,
    "id": 6959,
    "url": "https://sunnah.com/bukhari:6959",
    "bookNumber": 90,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn Abbas:",
    "english": "Sa'd bin 'Ubada Al-Ansari sought the verdict of Allah's Messenger (ﷺ) \n     regarding a vow made by his mother who had died before fulfilling it. \n     Allah's Messenger (ﷺ) said, \"Fulfill it on her behalf.\" Some people said, \n     \"If the number of camels reaches twenty, then their owner has to pay \n     four sheep as Zakat; and if their owner gives them as a gift or sells \n     them in order to escape the payment of Zakat cunningly before the \n     completion of a year, then he is not to pay anything, and if he \n     slaughters them and then dies, then no Zakat is to be taken from his \n     property.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ الأَنْصَارِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ، تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِذَا بَلَغَتِ الإِبِلُ عِشْرِينَ، فَفِيهَا أَرْبَعُ شِيَاهٍ، فَإِنْ وَهَبَهَا قَبْلَ الْحَوْلِ أَوْ بَاعَهَا، فِرَارًا وَاحْتِيَالاً لإِسْقَاطِ الزَّكَاةِ، فَلاَ شَىْءَ عَلَيْهِ، وَكَذَلِكَ إِنْ أَتْلَفَهَا فَمَاتَ، فَلاَ شَىْءَ فِي مَالِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6959In-book reference : Book 90, Hadith 6USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 90   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6960,
    "id": 6960,
    "url": "https://sunnah.com/bukhari:6960",
    "bookNumber": 90,
    "hadithNumber": 7,
    "narrator": "Narrated 'Abdullah:",
    "english": "Nafi narrated to me that 'Abdullah said that Allah's Messenger (ﷺ) forbade \n     the Shighar. I asked Nafi', \"What is the Shighar?\" He said, \"It is to \n     marry the daughter of a man and marry one's daughter to that man (at \n     the same time) without Mahr (in both cases); or to marry the sister of\n     a man and marry one's own sister to that man without Mahr.\" Some \n     people said, \"If one, by a trick, marries on the basis of Shighar, the\n     marriage is valid but its condition is illegal.\" The same scholar said\n     regarding Al-Mut'a, \"The marriage is invalid and its condition is \n     illegal.\" Some others said, \"The Mut'a and the Shighar are permissible\n     but the condition is illegal.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ‏.‏ قُلْتُ لِنَافِعٍ مَا الشِّغَارُ قَالَ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ، وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ احْتَالَ حَتَّى تَزَوَّجَ عَلَى الشِّغَارِ، فَهْوَ جَائِزٌ، وَالشَّرْطُ بَاطِلٌ‏.‏ وَقَالَ فِي الْمُتْعَةِ النِّكَاحُ فَاسِدٌ، وَالشَّرْطُ بَاطِلٌ‏.‏ وَقَالَ بَعْضُهُمُ الْمُتْعَةُ وَالشِّغَارُ جَائِزٌ، وَالشَّرْطُ بَاطِلٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6960In-book reference : Book 90, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 90   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6961,
    "id": 6961,
    "url": "https://sunnah.com/bukhari:6961",
    "bookNumber": 90,
    "hadithNumber": 8,
    "narrator": "Narrated Muhammad bin `Ali:",
    "english": "`Ali was told that Ibn `Abbas did not see any harm in the Mut'a marriage. `Ali said, \"Allah's Messenger (ﷺ) \nforbade the Mut'a marriage on the Day of the battle of Khaibar and he forbade the eating of donkey's \nmeat.\" Some people said, \"If one, by a tricky way, marries temporarily, his marriage is illegal.\" Others \nsaid, \"The marriage is valid but its condition is illegal.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، حَدَّثَنَا الزُّهْرِيُّ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، أَنَّ عَلِيًّا ـ رضى الله عنه ـ قِيلَ لَهُ إِنَّ ابْنَ عَبَّاسٍ لاَ يَرَى بِمُتْعَةِ النِّسَاءِ بَأْسًا‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهَا يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ احْتَالَ حَتَّى تَمَتَّعَ، فَالنِّكَاحُ فَاسِدٌ‏.‏ وَقَالَ بَعْضُهُمُ النِّكَاحُ جَائِزٌ وَالشَّرْطُ بَاطِلٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6961In-book reference : Book 90, Hadith 8USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 91   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6962,
    "id": 6962,
    "url": "https://sunnah.com/bukhari:6962",
    "bookNumber": 90,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"One should not prevent others from watering their animals with the surplus of \nhis water in order to prevent them from benefiting by the surplus of grass.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ فَضْلُ الْكَلإِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6962In-book reference : Book 90, Hadith 9USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 92   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6963,
    "id": 6963,
    "url": "https://sunnah.com/bukhari:6963",
    "bookNumber": 90,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) forbade the practice of An-Najsh.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6963In-book reference : Book 90, Hadith 10USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 93   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6964,
    "id": 6964,
    "url": "https://sunnah.com/bukhari:6964",
    "bookNumber": 90,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "A man mentioned to the Prophet (ﷺ) that he had always been cheated in bargains. The Prophet (ﷺ) said, \n\"Whenever you do bargain, say, 'No cheating.'\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، ذَكَرَ لِلنَّبِيِّ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ ‏\n\"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6964In-book reference : Book 90, Hadith 11USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 94   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6965,
    "id": 6965,
    "url": "https://sunnah.com/bukhari:6965",
    "bookNumber": 90,
    "hadithNumber": 12,
    "narrator": "Narrated `Urwa:",
    "english": "That he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphan girls, marry (other) women of your choice.' (4.3) `Aisha said, \"It is about an orphan girl under \nthe custody of her guardian who being attracted by her wealth and beauty wants to marry her with \nMahr less than other women of her status. So such guardians were forbidden to marry them unless \nthey treat them justly by giving them their full Mahr. Then the people sought the verdict of Allah's \nApostle for such cases, whereupon Allah revealed: 'They ask your instruction concerning women..' \n(4.127) (The sub-narrator then mentioned the Hadith.)",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ عُرْوَةُ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏‏.‏ قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا، فَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ، ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ فَذَكَرَ الْحَدِيثَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6965In-book reference : Book 90, Hadith 12USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6966,
    "id": 6966,
    "url": "https://sunnah.com/bukhari:6966",
    "bookNumber": 90,
    "hadithNumber": 13,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"For every betrayer there will be a flag by which he will be recognized on the Day \nof Resurrection. \"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُعْرَفُ بِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6966In-book reference : Book 90, Hadith 13USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 96   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6967,
    "id": 6967,
    "url": "https://sunnah.com/bukhari:6967",
    "bookNumber": 90,
    "hadithNumber": 14,
    "narrator": "Narrated Um Salama:",
    "english": "The Prophet (ﷺ) said, \"I am only a human being, and you people have disputes. May be some one \namongst you can present his case in a more eloquent and convincing manner than the other, and I give \nmy judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody \nsomething of his brother's right then he should not take it as I have only, given him a piece of Fire.\" \n(See Hadith No. 638. Vol. 3)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّكُمْ تَخْتَصِمُونَ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ، وَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ، فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا، فَلاَ يَأْخُذْ، فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6967In-book reference : Book 90, Hadith 14USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6968,
    "id": 6968,
    "url": "https://sunnah.com/bukhari:6968",
    "bookNumber": 90,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A virgin should not be married till she is asked for her consent; and the matron \nshould not be married till she is asked whether she agrees to marry or not.\" It was asked, \"O Allah's \nApostle! How will she (the virgin) express her consent?\" He said, \"By keeping silent.\" Some people \nsaid that if a virgin is not asked for her consent and she is not married, and then a man, by playing a trick \npresents two false witnesses that he has married her with her consent and the judge confirms his \nmarriage as a true one, and the husband knows that the witnesses were false ones, then there is no \nharm for him to consummate his marriage with her and the marriage is regarded as valid.",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ، وَلاَ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ ‏\"‏‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ كَيْفَ إِذْنُهَا قَالَ ‏\"‏ إِذَا سَكَتَتْ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنْ لَمْ تُسْتَأْذَنِ الْبِكْرُ وَلَمْ تَزَوَّجْ‏.‏ فَاحْتَالَ رَجُلٌ فَأَقَامَ شَاهِدَىْ زُورٍ أَنَّهُ تَزَوَّجَهَا بِرِضَاهَا، فَأَثْبَتَ الْقَاضِي نِكَاحَهَا، وَالزَّوْجُ يَعْلَمُ أَنَّ الشَّهَادَةَ بَاطِلَةٌ، فَلاَ بَأْسَ أَنْ يَطَأَهَا، وَهْوَ تَزْوِيجٌ صَحِيحٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6968In-book reference : Book 90, Hadith 15USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6969,
    "id": 6969,
    "url": "https://sunnah.com/bukhari:6969",
    "bookNumber": 90,
    "hadithNumber": 16,
    "narrator": "Narrated Al-Qasim:",
    "english": "A woman from the offspring of Ja`far was afraid lest her guardian marry her (to somebody) against \nher will. So she sent for two elderly men from the Ansar, `AbdurRahman and Mujammi', the two sons \nof Jariya, and they said to her, \"Don't be afraid, for Khansa' bint Khidam was given by her father in \nmarriage against her will, then the Prophet (ﷺ) cancelled that marriage.\" (See Hadith No. 78)",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الْقَاسِمِ، أَنَّ امْرَأَةً، مِنْ وَلَدِ جَعْفَرٍ تَخَوَّفَتْ أَنْ يُزَوِّجَهَا وَلِيُّهَا وَهْىَ كَارِهَةٌ فَأَرْسَلَتْ إِلَى شَيْخَيْنِ مِنَ الأَنْصَارِ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَىْ جَارِيَةَ قَالاَ فَلاَ تَخْشَيْنَ، فَإِنَّ خَنْسَاءَ بِنْتَ خِذَامٍ أَنْكَحَهَا أَبُوهَا وَهْىَ كَارِهَةٌ، فَرَدَّ النَّبِيُّ صلى الله عليه وسلم ذَلِكَ‏.‏ قَالَ سُفْيَانُ وَأَمَّا عَبْدُ الرَّحْمَنِ فَسَمِعْتُهُ يَقُولُ عَنْ أَبِيهِ إِنَّ خَنْسَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6969In-book reference : Book 90, Hadith 16USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 99   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6970,
    "id": 6970,
    "url": "https://sunnah.com/bukhari:6970",
    "bookNumber": 90,
    "hadithNumber": 17,
    "narrator": "Narrated Abu Haraira:",
    "english": "Allah's Messenger (ﷺ) said, \"A lady slave should not be given in marriage until she is consulted, and a virgin \nshould not be given in marriage until her permission is granted.\" The people said, \"How will she \nexpress her permission?\" The Prophet (ﷺ) said, \"By keeping silent (when asked her consent).\" Some \npeople said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that \nhe has married a matron with her consent and the judge confirms his marriage, and the husband is sure \nthat he has never married her (before), then such a marriage will be considered as a legal one and he \nmay live with her as husband.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ، وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏‏.‏ قَالُوا كَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ احْتَالَ إِنْسَانٌ بِشَاهِدَىْ زُورٍ عَلَى تَزْوِيجِ امْرَأَةٍ ثَيِّبٍ بِأَمْرِهَا، فَأَثْبَتَ الْقَاضِي نِكَاحَهَا إِيَّاهُ، وَالزَّوْجُ يَعْلَمُ أَنَّهُ لَمْ يَتَزَوَّجْهَا قَطُّ، فَإِنَّهُ يَسَعُهُ هَذَا النِّكَاحُ، وَلاَ بَأْسَ بِالْمُقَامِ لَهُ مَعَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6970In-book reference : Book 90, Hadith 17USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 100   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6971,
    "id": 6971,
    "url": "https://sunnah.com/bukhari:6971",
    "bookNumber": 90,
    "hadithNumber": 18,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin \nfeels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in \nlove with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing \ntwo false witnesses to testify that he has married her, and then she attains the age of puberty and \nagrees to marry him and the judge accepts the false witness and the husband knows that the witnesses \nwere false ones, he may consummate his marriage.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ ذَكْوَانَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبِكْرُ تُسْتَأْذَنُ ‏\"‏‏.‏ قُلْتُ إِنَّ الْبِكْرَ تَسْتَحْيِي قَالَ ‏\"‏ إِذْنُهَا صُمَاتُهَا ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنْ هَوِيَ رَجُلٌ جَارِيَةً يَتِيمَةً أَوْ بِكْرًا، فَأَبَتْ فَاحْتَالَ فَجَاءَ بِشَاهِدَىْ زُورٍ عَلَى أَنَّهُ تَزَوَّجَهَا، فَأَدْرَكَتْ فَرَضِيَتِ الْيَتِيمَةُ، فَقَبِلَ الْقَاضِي شَهَادَةَ الزُّورِ، وَالزَّوْجُ يَعْلَمُ بِبُطْلاَنِ ذَلِكَ، حَلَّ لَهُ الْوَطْءُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6971In-book reference : Book 90, Hadith 18USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 101   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6972,
    "id": 6972,
    "url": "https://sunnah.com/bukhari:6972",
    "bookNumber": 90,
    "hadithNumber": 19,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to like sweets and also used to like honey, and whenever he finished the `Asr \nprayer, he used to visit his wives and stay with them. Once he visited Hafsa and remained with her \nlonger than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her \ntribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Messenger (ﷺ) \nto drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife \nof the Prophet) and said to her, \"When he enters upon you, he will come near to you whereupon you \nshould say to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He will say, 'No.' Then you say to \nhim, 'What is this bad smell? ' And it would be very hard on Allah's Messenger (ﷺ) that a bad smell should be \nfound on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, \n'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. \nAnd you, O Saifya, say the same.\" \nSo when the Prophet (ﷺ) entered upon Sauda (the following happened). Sauda said, \"By Him except \nWhom none has the right to be worshipped, I was about to say to him what you had told me to say \nwhile he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I \nsaid to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this \nsmell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" \nWhen he entered upon me, I told him the same as that, and when he entered upon Safiya, she too told \nhim the same. So when he visited Hafsa again, she said to him, \"O Allah's Messenger (ﷺ)! Shall I give you a \ndrink of it (honey)?\" He said, \"I have no desire for it.\" Sauda said, Subhan Allah! We have deprived \nhim of it (honey).\" I said to her, \"Be quiet!\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ، وَيُحِبُّ الْعَسَلَ، وَكَانَ إِذَا صَلَّى الْعَصْرَ أَجَازَ عَلَى نِسَائِهِ فَيَدْنُو مِنْهُنَّ، فَدَخَلَ عَلَى حَفْصَةَ، فَاحْتَبَسَ عِنْدَهَا أَكْثَرَ مِمَّا كَانَ يَحْتَبِسُ، فَسَأَلْتُ عَنْ ذَلِكَ فَقِيلَ لِي أَهْدَتِ امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةَ عَسَلٍ، فَسَقَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهُ شَرْبَةً‏.‏ فَقُلْتُ أَمَا وَاللَّهِ لَنَحْتَالَنَّ لَهُ‏.‏ فَذَكَرْتُ ذَلِكَ لِسَوْدَةَ قُلْتُ إِذَا دَخَلَ عَلَيْكِ فَإِنَّهُ سَيَدْنُو مِنْكِ فَقُولِي لَهُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ فَإِنَّهُ سَيَقُولُ لاَ‏.‏ فَقُولِي لَهُ مَا هَذِهِ الرِّيحُ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَشْتَدُّ عَلَيْهِ أَنْ تُوجَدُ مِنْهُ الرِّيحُ، فَإِنَّهُ سَيَقُولُ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ‏.‏ فَقُولِي لَهُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ‏.‏ وَسَأَقُولُ ذَلِكَ، وَقُولِيهِ أَنْتِ يَا صَفِيَّةُ‏.‏ فَلَمَّا دَخَلَ عَلَى سَوْدَةَ، قُلْتُ تَقُولُ سَوْدَةُ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَقَدْ كِدْتُ أَنْ أُبَادِرَهُ بِالَّذِي قُلْتِ لِي، وَإِنَّهُ لَعَلَى الْبَابِ فَرَقًا مِنْكِ، فَلَمَّا دَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قُلْتُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَمَا هَذِهِ الرِّيحُ قَالَ ‏\"‏ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ ‏\"‏‏.‏ قُلْتُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ‏.‏ فَلَمَّا دَخَلَ عَلَىَّ قُلْتُ لَهُ مِثْلَ ذَلِكَ‏.‏ وَدَخَلَ عَلَى صَفِيَّةَ فَقَالَتْ لَهُ مِثْلَ ذَلِكَ‏.‏ فَلَمَّا دَخَلَ عَلَى حَفْصَةَ قَالَتْ لَهُ يَا رَسُولَ اللَّهِ أَلاَ أَسْقِيكَ مِنْهُ قَالَ ‏\"‏ لاَ حَاجَةَ لِي بِهِ ‏\"‏‏.‏ قَالَتْ تَقُولُ سَوْدَةُ سُبْحَانَ اللَّهِ لَقَدْ حَرَمْنَاهُ‏.‏ قَالَتْ قُلْتُ لَهَا اسْكُتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6972In-book reference : Book 90, Hadith 19USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 102   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6973,
    "id": 6973,
    "url": "https://sunnah.com/bukhari:6973",
    "bookNumber": 90,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah bin 'Amir bin Rabi`a:",
    "english": "`Umar bin Al-Khattab left for Sham, and when he reached a placed called Sargh, he came to know \nthat there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf told \nhim that Allah's Messenger (ﷺ) said, \"If you hear the news of an outbreak of an epidemic (plague) in a \ncertain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do \nnot leave that place to escape from the epidemic.\" So `Umar returned from Sargh.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ خَرَجَ إِلَى الشَّأْمِ، فَلَمَّا جَاءَ بِسَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ وَقَعَ بِالشَّأْمِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ، وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏‏.‏ فَرَجَعَ عُمَرُ مِنْ سَرْغَ‏.‏ وَعَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6973In-book reference : Book 90, Hadith 20USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6974,
    "id": 6974,
    "url": "https://sunnah.com/bukhari:6974",
    "bookNumber": 90,
    "hadithNumber": 21,
    "narrator": "Narrated 'Amir bin Sa`d bin Abi Waqqas:",
    "english": "That he heard Usama bin Zaid speaking to Sa`d, saying, \"Allah's Messenger (ﷺ) mentioned the plague and \nsaid, 'It is a means of punishment with which some nations were punished and some of it has \nremained, and it appears now and then. So whoever hears that there is an outbreak of plague in some \nland, he should not go to that land, and if the plague breaks out in the land where one is already \npresent, one should not run away from that land, escaping from the plague.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سَمِعَ أُسَامَةَ بْنَ زَيْدٍ، يُحَدِّثُ سَعْدًا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ الْوَجَعَ فَقَالَ ‏\n\"‏ رِجْزٌ ـ أَوْ عَذَابٌ ـ عُذِّبَ بِهِ بَعْضُ الأُمَمِ، ثُمَّ بَقِيَ مِنْهُ بَقِيَّةٌ، فَيَذْهَبُ الْمَرَّةَ وَيَأْتِي الأُخْرَى، فَمَنْ سَمِعَ بِهِ بِأَرْضٍ فَلاَ يَقْدَمَنَّ عَلَيْهِ، وَمَنْ كَانَ بِأَرْضٍ وَقَعَ بِهَا فَلاَ يَخْرُجْ فِرَارًا مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6974In-book reference : Book 90, Hadith 21USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 104   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6975,
    "id": 6975,
    "url": "https://sunnah.com/bukhari:6975",
    "bookNumber": 90,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"The one who takes back his gift is like a dog swallowing its own vomit, and we \n(believers) should not act according to this bad example.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ، لَيْسَ لَنَا مَثَلُ السَّوْءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6975In-book reference : Book 90, Hadith 22USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6976,
    "id": 6976,
    "url": "https://sunnah.com/bukhari:6976",
    "bookNumber": 90,
    "hadithNumber": 23,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) has decreed that preemption is valid in all cases where the real estate concerned has not \nbeen divided, but if the boundaries are established and the ways are made, then there is no preemption. \nA man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. \nHe said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy \nit through preemption, he buys one share out of one hundred shares of the house and then buys the rest \nof the house, then the neighbor can only have the right of preemption for the first share but not for the \nrest of the house; and the buyer may play such a trick in this case.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ إِنَّمَا جَعَلَ النَّبِيُّ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏ وَقَالَ بَعْضُ النَّاسِ الشُّفْعَةُ لِلْجِوَارِ‏.‏ ثُمَّ عَمَدَ إِلَى مَا شَدَّدَهُ فَأَبْطَلَهُ، وَقَالَ إِنِ اشْتَرَى دَارًا فَخَافَ أَنْ يَأْخُذَ الْجَارُ بِالشُّفْعَةِ، فَاشْتَرَى سَهْمًا مِنْ مِائَةِ سَهْمٍ، ثُمَّ اشْتَرَى الْبَاقِيَ، وَكَانَ لِلْجَارِ الشُّفْعَةُ فِي السَّهْمِ الأَوَّلِ، وَلاَ شُفْعَةَ لَهُ فِي بَاقِي الدَّارِ، وَلَهُ أَنْ يَحْتَالَ فِي ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6976In-book reference : Book 90, Hadith 23USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 106   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6977,
    "id": 6977,
    "url": "https://sunnah.com/bukhari:6977",
    "bookNumber": 90,
    "hadithNumber": 24,
    "narrator": "Narrated 'Amr bin Ash-Sharid:",
    "english": "Al-Miswar bin Makhrama came and put his hand on my shoulder and I \n     accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order\n     this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I \n     will not offer more than four hundred in installments over a fixed \n     period.\" Abu Rafi said, \"I was offered five hundred cash but I \n     refused. Had I not heard the Prophet (ﷺ) saying, 'A neighbor is more \n     entitled to receive the care of his neighbor,' I would not have sold \n     it to you.\" The narrator said, to Sufyan: Ma'mar did not say so. \n     Sufyan said, \"But he did say so to me.\" Some people said, \"If someone \n     wants to sell a house and deprived somebody of the right of \n     preemption, he has the right to play a trick to render the preemption \n     invalid. And that is by giving the house to the buyer as a present and\n     marking its boundaries and giving it to him. The buyer then gives the \n     seller one-thousand Dirham as compensation in which case the preemptor\n     loses his right of preemption.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، سَمِعْتُ عَمْرَو بْنَ الشَّرِيدِ، قَالَ جَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى مَنْكِبِي، فَانْطَلَقْتُ مَعَهُ إِلَى سَعْدٍ فَقَالَ أَبُو رَافِعٍ لِلْمِسْوَرِ أَلاَ تَأْمُرُ هَذَا أَنْ يَشْتَرِيَ مِنِّي بَيْتِي الَّذِي فِي دَارِي‏.‏ فَقَالَ لاَ أَزِيدُهُ عَلَى أَرْبَعِمِائَةٍ، إِمَّا مُقَطَّعَةٍ وَإِمَّا مُنَجَّمَةٍ‏.‏ قَالَ أُعْطِيتُ خَمْسَمِائَةٍ نَقْدًا، فَمَنَعْتُهُ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ مَا بِعْتُكَهُ أَوْ قَالَ مَا أَعْطَيْتُكَهُ‏.‏ قُلْتُ لِسُفْيَانَ إِنَّ مَعْمَرًا لَمْ يَقُلْ هَكَذَا‏.‏ قَالَ لَكِنَّهُ قَالَ لِي هَكَذَا‏.‏ وَقَالَ بَعْضُ النَّاسِ إِذَا أَرَادَ أَنْ يَبِيعَ الشُّفْعَةَ فَلَهُ أَنْ يَحْتَالَ حَتَّى يُبْطِلَ الشُّفْعَةَ فَيَهَبُ الْبَائِعُ لِلْمُشْتَرِي الدَّارَ، وَيَحُدُّهَا وَيَدْفَعُهَا إِلَيْهِ، وَيُعَوِّضُهُ الْمُشْتَرِي أَلْفَ دِرْهَمٍ، فَلاَ يَكُونُ لِلشَّفِيعِ فِيهَا شُفْعَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6977In-book reference : Book 90, Hadith 24USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6978,
    "id": 6978,
    "url": "https://sunnah.com/bukhari:6978",
    "bookNumber": 90,
    "hadithNumber": 25,
    "narrator": "Narrated 'Amr bin Ash-Sharid:",
    "english": "Abu Rafi' said that Sa'd offered him \n     four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had \n     not heard Allah's Messenger (ﷺ) saying, 'A neighbor has more right to be \n     taken care of by his neighbor,' then I would not have given it to \n     you.\" Some people said, \"If one has bought a portion of a house and \n     wants to cancel the right of preemption, he may give it as a present \n     to his little son and he will not be obliged to take an oath.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، أَنَّ سَعْدًا، سَاوَمَهُ بَيْتًا بِأَرْبَعِمِائَةِ مِثْقَالٍ فَقَالَ لَوْلاَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ لَمَا أَعْطَيْتُكَ‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ اشْتَرَى نَصِيبَ دَارٍ، فَأَرَادَ أَنْ يُبْطِلَ الشُّفْعَةَ، وَهَبَ لاِبْنِهِ الصَّغِيرِ وَلاَ يَكُونُ عَلَيْهِ يَمِينٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6978In-book reference : Book 90, Hadith 25USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6979,
    "id": 6979,
    "url": "https://sunnah.com/bukhari:6979",
    "bookNumber": 90,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Humaid As-Sa`idi:",
    "english": "Allah's Messenger (ﷺ) appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's \ntribe. When he returned, the Prophet (ﷺ) called him to account. He said (to the Prophet, 'This is your \nmoney, and this has been given to me as a gift.\" On that, Allah's Messenger (ﷺ) said, \"Why didn't you stay in \nyour father's and mother's house to see whether you will be given gifts or not if you are telling the \ntruth?\" Then the Prophet (ﷺ) addressed us, and after praising and glorifying Allah, he said: \"Amma \nBa'du\", I employ a man from among you to manage some affair of what Allah has put under my \ncustody, and then he comes to me and says, 'This is your money and this has been given to me as a \ngift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? \nBy Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of \nResurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a \nmooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till the \nwhiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your \nMessage)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ اسْتَعْمَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً عَلَى صَدَقَاتِ بَنِي سُلَيْمٍ يُدْعَى ابْنَ اللُّتَبِيَّةِ، فَلَمَّا جَاءَ حَاسَبَهُ قَالَ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلاَّ جَلَسْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ، حَتَّى تَأْتِيَكَ هَدِيَّتُكَ إِنْ كُنْتَ صَادِقًا ‏\"‏‏.‏ ثُمَّ خَطَبَنَا فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنِّي أَسْتَعْمِلُ الرَّجُلَ مِنْكُمْ عَلَى الْعَمَلِ مِمَّا وَلاَّنِي اللَّهُ، فَيَأْتِي فَيَقُولُ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ أُهْدِيَتْ لِي‏.‏ أَفَلاَ جَلَسَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ حَتَّى تَأْتِيَهُ هَدِيَّتُهُ، وَاللَّهِ لاَ يَأْخُذُ أَحَدٌ مِنْكُمْ شَيْئًا بِغَيْرِ حَقِّهِ، إِلاَّ لَقِيَ اللَّهَ يَحْمِلُهُ يَوْمَ الْقِيَامَةِ، فَلأَعْرِفَنَّ أَحَدًا مِنْكُمْ لَقِيَ اللَّهَ يَحْمِلُ بَعِيرًا لَهُ رُغَاءٌ، أَوْ بَقَرَةً لَهَا خُوَارٌ، أَوْ شَاةً تَيْعَرُ ‏\"‏‏.‏ ثُمَّ رَفَعَ يَدَهُ حَتَّى رُئِيَ بَيَاضُ إِبْطِهِ يَقُولُ ‏\"‏ اللَّهُمَّ هَلْ بَلَّغْتُ ‏\"‏‏.‏ بَصْرَ عَيْنِي وَسَمْعَ أُذُنِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6979In-book reference : Book 90, Hadith 26USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 108   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6980,
    "id": 6980,
    "url": "https://sunnah.com/bukhari:6980",
    "bookNumber": 90,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Rafi`:",
    "english": "The Prophet (ﷺ) said, \"The neighbor has more right to be taken care of by his neighbor (than anyone \nelse).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play \na trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but \npaying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in \ncash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the \nhouse, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the \nhouse proves to belong to somebody else other than the seller, the buyer should take back from the \nseller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to \nsomebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it \ndoes not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams \n(instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man \nallows (some people) the playing of tricks amongst the Muslims (although) the Prophet (ﷺ) said, 'In \ndealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ اشْتَرَى دَارًا بِعِشْرِينَ أَلْفَ دِرْهَمٍ، فَلاَ بَأْسَ أَنْ يَحْتَالَ حَتَّى يَشْتَرِيَ الدَّارَ بِعِشْرِينَ أَلْفَ دِرْهَمٍ، وَيَنْقُدَهُ تِسْعَةَ آلاَفِ دِرْهَمٍ وَتِسْعَمِائَةَ دِرْهَمٍ وَتِسْعَةً وَتِسْعِينَ، وَيَنْقُدَهُ دِينَارًا بِمَا بَقِيَ مِنَ الْعِشْرِينَ الأَلْفَ، فَإِنْ طَلَبَ الشَّفِيعُ أَخَذَهَا بِعِشْرِينَ أَلْفَ دِرْهَمٍ، وَإِلاَّ فَلاَ سَبِيلَ لَهُ عَلَى الدَّارِ، فَإِنِ اسْتُحِقَّتِ الدَّارُ، رَجَعَ الْمُشْتَرِي عَلَى الْبَائِعِ بِمَا دَفَعَ إِلَيْهِ، وَهْوَ تِسْعَةُ آلاَفِ دِرْهَمٍ وَتِسْعُمِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ دِرْهَمًا وَدِينَارٌ، لأَنَّ الْبَيْعَ حِينَ اسْتُحِقَّ انْتَقَضَ الصَّرْفُ فِي الدِّينَارِ، فَإِنْ وَجَدَ بِهَذِهِ الدَّارِ عَيْبًا وَلَمْ تُسْتَحَقَّ، فَإِنَّهُ يَرُدُّهَا عَلَيْهِ بِعِشْرِينَ أَلْفَ دِرْهَمٍ‏.‏ قَالَ فَأَجَازَ هَذَا الْخِدَاعَ بَيْنَ الْمُسْلِمِينَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ دَاءَ وَلاَ خِبْثَةَ وَلاَ غَائِلَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6980In-book reference : Book 90, Hadith 27USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 109   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6981,
    "id": 6981,
    "url": "https://sunnah.com/bukhari:6981",
    "bookNumber": 90,
    "hadithNumber": 28,
    "narrator": "Narrated `Amr bin Ash-Sharid:",
    "english": "Abu Rafi` sold a house to Sa`d bin Malik for four-hundred Mithqal of gold, and said, \"If I had not \nheard the Prophet (ﷺ) saying, 'The neighbor has more right to be taken care of by his neighbor (than \nanyone else),' then I would not have sold it to you.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، أَنَّ أَبَا رَافِعٍ، سَاوَمَ سَعْدَ بْنَ مَالِكٍ بَيْتًا بِأَرْبَعِمِائَةِ مِثْقَالٍ وَقَالَ لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6981In-book reference : Book 90, Hadith 28USC-MSA web (English) reference : Vol. 9, Book 86, Hadith 110   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6982,
    "id": 6982,
    "url": "https://sunnah.com/bukhari:6982",
    "bookNumber": 91,
    "hadithNumber": 1,
    "narrator": "Narrated `Aisha:",
    "english": "The commencement of the Divine Inspiration to Allah's Messenger (ﷺ) was in the form of good righteous \n(true) dreams in his sleep. He never had a dream but that it came true like bright day light. He used to \ngo in seclusion (the cave of) Hira where he used to worship(Allah Alone) continuously for many \n(days) nights. He used to take with him the journey food for that (stay) and then come back to (his \nwife) Khadija to take his food like-wise again for another period to stay, till suddenly the Truth \ndescended upon him while he was in the cave of Hira. The angel came to him in it and asked him to \nread. The Prophet (ﷺ) replied, \"I do not know how to read.\" (The Prophet (ﷺ) added), \"The angel caught me \n(forcefully) and pressed me so hard that I could not bear it anymore. He then released me and again \nasked me to read, and I replied, \"I do not know how to read,\" whereupon he caught me again and \npressed me a second time till I could not bear it anymore. He then released me and asked me again to \nread, but again I replied, \"I do not know how to read (or, what shall I read?).\" Thereupon he caught \nme for the third time and pressed me and then released me and said, \"Read: In the Name of your Lord, \nWho has created (all that exists). Has created man from a clot. Read and Your Lord is Most \nGenerous...up to..... ..that which he knew not.\" (96.15) \nThen Allah's Messenger (ﷺ) returned with the Inspiration, his neck muscles twitching with terror till he \nentered upon Khadija and said, \"Cover me! Cover me!\" They covered him till his fear was over and \nthen he said, \"O Khadija, what is wrong with me?\" Then he told her everything that had happened and \nsaid, 'I fear that something may happen to me.\" Khadija said, 'Never! But have the glad tidings, for by \nAllah, Allah will never disgrace you as you keep good reactions with your Kith and kin, speak the \ntruth, help the poor and the destitute, serve your guest generously and assist the deserving, calamityafflicted \nones.\" Khadija then accompanied him to (her cousin) Waraqa bin Naufal bin Asad bin \n`Abdul `Uzza bin Qusai. Waraqa was the son of her paternal uncle, i.e., her father's brother, who \nduring the Pre-Islamic Period became a Christian and used to write the Arabic writing and used to \nwrite of the Gospels in Arabic as much as Allah wished him to write. He was an old man and had lost \nhis eyesight. Khadija said to him, \"O my cousin! Listen to the story of your nephew.\" Waraqa asked, \n\"O my nephew! What have you seen?\" The Prophet (ﷺ) described whatever he had seen. \nWaraqa said, \"This is the same Namus (i.e., Gabriel, the Angel who keeps the secrets) whom Allah \nhad sent to Moses. I wish I were young and could live up to the time when your people would turn \nyou out.\" Allah's Messenger (ﷺ) asked, \"Will they turn me out?\" Waraqa replied in the affirmative and said: \n\"Never did a man come with something similar to what you have brought but was treated with \nhostility. If I should remain alive till the day when you will be turned out then I would support you \nstrongly.\" But after a few days Waraqa died and the Divine Inspiration was also paused for a while \nand the Prophet (ﷺ) became so sad as we have heard that he intended several times to throw himself from \nthe tops of high mountains and every time he went up the top of a mountain in order to throw himself \ndown, Gabriel would appear before him and say, \"O Muhammad! You are indeed Allah's Messenger (ﷺ) in \ntruth\" whereupon his heart would become quiet and he would calm down and would return home. And \nwhenever the period of the coming of the inspiration used to become long, he would do as before, but \nwhen he used to reach the top of a mountain, Gabriel would appear before him and say to him what he \nhad said before. (Ibn `Abbas said regarding the meaning of: 'He it is that Cleaves the daybreak (from \nthe darkness)' (6.96) that Al-Asbah. means the light of the sun during the day and the light of the \nmoon at night).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْوَحْىِ الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلاَّ جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، فَكَانَ يَأْتِي حِرَاءً فَيَتَحَنَّثُ فِيهِ ـ وَهْوَ التَّعَبُّدُ ـ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ، وَيَتَزَوَّدُ لِذَلِكَ ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَتُزَوِّدُهُ لِمِثْلِهَا، حَتَّى فَجِئَهُ الْحَقُّ وَهْوَ فِي غَارِ حِرَاءٍ فَجَاءَهُ الْمَلَكُ فِيهِ فَقَالَ اقْرَأْ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجَهْدَ ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَغَطَّنِي الثَّالِثَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ‏\"‏‏.‏ حَتَّى بَلَغَ ‏{‏مَا لَمْ يَعْلَمْ‏}‏ فَرَجَعَ بِهَا تَرْجُفُ بَوَادِرُهُ حَتَّى دَخَلَ عَلَى خَدِيجَةَ فَقَالَ ‏\"‏ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ فَقَالَ ‏\"‏ يَا خَدِيجَةُ مَا لِي ‏\"‏‏.‏ وَأَخْبَرَهَا الْخَبَرَ وَقَالَ ‏\"‏ قَدْ خَشِيتُ عَلَى نَفْسِي ‏\"‏‏.‏ فَقَالَتْ لَهُ كَلاَّ أَبْشِرْ، فَوَاللَّهِ لاَ يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ ثُمَّ انْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى بْنِ قُصَىٍّ ـ وَهْوَ ابْنُ عَمِّ خَدِيجَةَ أَخُو أَبِيهَا، وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعَرَبِيَّ فَيَكْتُبُ بِالْعَرَبِيَّةِ مِنَ الإِنْجِيلِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ ـ فَقَالَتْ لَهُ خَدِيجَةُ أَىِ ابْنَ عَمِّ اسْمَعْ مِنِ ابْنِ أَخِيكَ‏.‏ فَقَالَ وَرَقَةُ ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ النَّبِيُّ صلى الله عليه وسلم مَا رَأَى فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أُنْزِلَ عَلَى مُوسَى، يَا لَيْتَنِي فِيهَا جَذَعًا أَكُونُ حَيًّا، حِينَ يُخْرِجُكَ قَوْمُكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَمُخْرِجِيَّ هُمْ ‏\"‏‏.‏ فَقَالَ وَرَقَةُ نَعَمْ، لَمْ يَأْتِ رَجُلٌ قَطُّ بِمَا جِئْتَ بِهِ إِلاَّ عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الْوَحْىُ فَتْرَةً حَتَّى حَزِنَ النَّبِيُّ صلى الله عليه وسلم فِيمَا بَلَغَنَا حُزْنًا غَدَا مِنْهُ مِرَارًا كَىْ يَتَرَدَّى مِنْ رُءُوسِ شَوَاهِقِ الْجِبَالِ، فَكُلَّمَا أَوْفَى بِذِرْوَةِ جَبَلٍ لِكَىْ يُلْقِيَ مِنْهُ نَفْسَهُ، تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ إِنَّكَ رَسُولُ اللَّهِ حَقًّا‏.‏ فَيَسْكُنُ لِذَلِكَ جَأْشُهُ وَتَقِرُّ نَفْسُهُ فَيَرْجِعُ، فَإِذَا طَالَتْ عَلَيْهِ فَتْرَةُ الْوَحْىِ غَدَا لِمِثْلِ ذَلِكَ، فَإِذَا أَوْفَى بِذِرْوَةِ جَبَلٍ تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ لَهُ مِثْلَ ذَلِكَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏فَالِقُ الإِصْبَاحِ‏}‏ ضَوْءُ الشَّمْسِ بِالنَّهَارِ، وَضَوْءُ الْقَمَرِ بِاللَّيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6982In-book reference : Book 91, Hadith 1USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 111   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6983,
    "id": 6983,
    "url": "https://sunnah.com/bukhari:6983",
    "bookNumber": 91,
    "hadithNumber": 2,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"A good dream (that comes true) of a righteous man is one of forty-six parts of \nprophetism.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرُّؤْيَا الْحَسَنَةُ مِنَ الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6983In-book reference : Book 91, Hadith 2USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6984,
    "id": 6984,
    "url": "https://sunnah.com/bukhari:6984",
    "bookNumber": 91,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) said, \"A true good dream is from Allah, and a bad dream is from Satan.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ سَمِعْتُ أَبَا قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6984In-book reference : Book 91, Hadith 3USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 113   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6985,
    "id": 6985,
    "url": "https://sunnah.com/bukhari:6985",
    "bookNumber": 91,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said, \"If anyone of you sees a dream that he likes, then it is from Allah, and he should \nthank Allah for it and narrate it to others; but if he sees something else, i.e., a dream that he dislikes, \nthen it is from Satan, and he should seek refuge with Allah from its evil, and he should not mention it \nto anybody, for it will not harm him.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يُحِبُّهَا فَإِنَّمَا هِيَ مِنَ اللَّهِ، فَلْيَحْمَدِ اللَّهَ عَلَيْهَا، وَلْيُحَدِّثْ بِهَا، وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ، فَإِنَّمَا هِيَ مِنَ الشَّيْطَانِ، فَلْيَسْتَعِذْ مِنْ شَرِّهَا، وَلاَ يَذْكُرْهَا لأَحَدٍ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6985In-book reference : Book 91, Hadith 4USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 114   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6986,
    "id": 6986,
    "url": "https://sunnah.com/bukhari:6986",
    "bookNumber": 91,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) said, \"A good dream that comes true is from Allah, and a bad dream is from Satan, so if \nanyone of you sees a bad dream, he should seek refuge with Allah from Satan and should spit on the \nleft, for the bad dream will not harm him.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ ـ وَأَثْنَى عَلَيْهِ خَيْرًا لَقِيتُهُ بِالْيَمَامَةِ ـ عَنْ أَبِيهِ، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ فَلْيَتَعَوَّذْ مِنْهُ وَلْيَبْصُقْ عَنْ شِمَالِهِ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏ وَعَنْ أَبِيهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6986In-book reference : Book 91, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 115   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6987,
    "id": 6987,
    "url": "https://sunnah.com/bukhari:6987",
    "bookNumber": 91,
    "hadithNumber": 6,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "The Prophet (ﷺ) said, \"The (good) dreams of a faithful believer is a part of the forty-six parts of \nprophetism:'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6987In-book reference : Book 91, Hadith 6USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 116   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6988,
    "id": 6988,
    "url": "https://sunnah.com/bukhari:6988",
    "bookNumber": 91,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The (good) dream of a faithful believer is a part of the forty-six parts of \nprophetism.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏ رَوَاهُ ثَابِتٌ وَحُمَيْدٌ وَإِسْحَاقُ بْنُ عَبْدِ اللَّهِ وَشُعَيْبٌ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6988In-book reference : Book 91, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 117   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6989,
    "id": 6989,
    "url": "https://sunnah.com/bukhari:6989",
    "bookNumber": 91,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"A good dream is a part of the forty six parts of prophetism.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6989In-book reference : Book 91, Hadith 8USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 118   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6990,
    "id": 6990,
    "url": "https://sunnah.com/bukhari:6990",
    "bookNumber": 91,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Nothing is left of the prophetism except Al-Mubashshirat.\" They \nasked, \"What are Al-Mubashshirat?\" He replied, \"The true good dreams (that conveys glad tidings).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلاَّ الْمُبَشِّرَاتُ ‏\"‏‏.‏ قَالُوا وَمَا الْمُبَشِّرَاتُ قَالَ ‏\"‏ الرُّؤْيَا الصَّالِحَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6990In-book reference : Book 91, Hadith 9USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 119   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6991,
    "id": 6991,
    "url": "https://sunnah.com/bukhari:6991",
    "bookNumber": 91,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Some people were shown the Night of Qadr as being in the last seven days (of the month of \nRamadan). The Prophet (ﷺ) said, \"Seek it in the last seven days (of Ramadan).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنه ـ أَنَّ أُنَاسًا، أُرُوا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الأَوَاخِرِ، وَأَنَّ أُنَاسًا أُرُوا أَنَّهَا فِي الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْتَمِسُوهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6991In-book reference : Book 91, Hadith 10USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 120   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6992,
    "id": 6992,
    "url": "https://sunnah.com/bukhari:6992",
    "bookNumber": 91,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If I stayed in prison as long as Joseph stayed and then the messenger came, I \nwould respond to his call (to go out of the prison) .\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ، ثُمَّ أَتَانِي الدَّاعِي لأَجَبْتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6992In-book reference : Book 91, Hadith 11USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 121   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6993,
    "id": 6993,
    "url": "https://sunnah.com/bukhari:6993",
    "bookNumber": 91,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard the Prophet (ﷺ) saying, \"Whoever sees me in a dream will see me in his wakefulness, and Satan \ncannot imitate me in shape.\" Abu `Abdullah said, \"Ibn Seereen said, 'Only if he sees the Prophet (ﷺ) in his \n(real) shape.'\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ، وَلاَ يَتَمَثَّلُ الشَّيْطَانُ بِي ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ ابْنُ سِيرِينَ إِذَا رَآهُ فِي صُورَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6993In-book reference : Book 91, Hadith 12USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6994,
    "id": 6994,
    "url": "https://sunnah.com/bukhari:6994",
    "bookNumber": 91,
    "hadithNumber": 13,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Whoever has seen me in a dream, then no doubt, he has seen me, for Satan cannot \nimitate my shape.",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَخَيَّلُ بِي، وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6994In-book reference : Book 91, Hadith 13USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 123   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6995,
    "id": 6995,
    "url": "https://sunnah.com/bukhari:6995",
    "bookNumber": 91,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) said, \"A good dream is from Allah, and a bad dream is from Satan. So whoever has seen \n(in a dream) something he dislikes, then he should spit without saliva, thrice on his left and seek refuge \nwith Allah from Satan, for it will not harm him, and Satan cannot appear in my shape.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ عَنْ شِمَالِهِ ثَلاَثًا، وَلْيَتَعَوَّذْ مِنَ الشَّيْطَانِ، فَإِنَّهَا لاَ تَضُرُّهُ، وَإِنَّ الشَّيْطَانَ لاَ يَتَرَاءَى بِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6995In-book reference : Book 91, Hadith 14USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 124   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6996,
    "id": 6996,
    "url": "https://sunnah.com/bukhari:6996",
    "bookNumber": 91,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ خَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، قَالَ أَبُو سَلَمَةَ قَالَ أَبُو قَتَادَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ وَابْنُ أَخِي الزُّهْرِيِّ",
    "reference": "Reference : Sahih al-Bukhari 6996In-book reference : Book 91, Hadith 15USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 125   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6997,
    "id": 6997,
    "url": "https://sunnah.com/bukhari:6997",
    "bookNumber": 91,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said, \"Who ever sees me (in a dream) then he indeed has seen the truth, as Satan cannot \nappear in my shape.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ، فَإِنَّ الشَّيْطَانَ لاَ يَتَكَوَّنُنِي‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6997In-book reference : Book 91, Hadith 16USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 126   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6998,
    "id": 6998,
    "url": "https://sunnah.com/bukhari:6998",
    "bookNumber": 91,
    "hadithNumber": 17,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"I have been given the keys of eloquent speech and given victory with awe (cast \ninto the hearts of the enemy), and while I was sleeping last night, the keys of the treasures of the earth \nwere brought to me till they were put in my hand.\" Abu Huraira added: Allah's Messenger (ﷺ) left (this \nworld) and now you people are carrying those treasures from place to place.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أُعْطِيتُ مَفَاتِيحَ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَمَا أَنَا نَائِمٌ الْبَارِحَةَ إِذْ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ حَتَّى وُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمْ تَنْتَقِلُونَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6998In-book reference : Book 91, Hadith 17USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 127   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6999,
    "id": 6999,
    "url": "https://sunnah.com/bukhari:6999",
    "bookNumber": 91,
    "hadithNumber": 18,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"I saw myself (in a dream) near the Ka`ba last night, and I saw a man with \nwhitish red complexion, the best you may see amongst men of that complexion having long hair \nreaching his earlobes which was the best hair of its sort, and he had combed his hair and water was \ndropping from it, and he was performing the Tawaf around the Ka`ba while he was leaning on two \nmen or on the shoulders of two men. I asked, 'Who is this man?' Somebody replied, '(He is) Messiah, \nson of Mary.' Then I saw another man with very curly hair, blind in the right eye which looked like a \nprotruding out grape. I asked, 'Who is this?' Somebody replied, '(He is) Messiah, Ad-Dajjal.'\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا تَقْطُرُ مَاءً، مُتَّكِئًا عَلَى رَجُلَيْنِ ـ أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ ـ يَطُوفُ بِالْبَيْتِ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6999In-book reference : Book 91, Hadith 18USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 128   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7000,
    "id": 7000,
    "url": "https://sunnah.com/bukhari:7000",
    "bookNumber": 91,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "About a man who came to Allah's Messenger (ﷺ) and said, \"I was shown in a dream last night...\" Then Ibn \n`Abbas mentioned the narration.",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، كَانَ يُحَدِّثُ أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أُرِيتُ اللَّيْلَةَ فِي الْمَنَامِ، وَسَاقَ الْحَدِيثَ‏.‏ وَتَابَعَهُ سُلَيْمَانُ بْنُ كَثِيرٍ وَابْنُ أَخِي الزُّهْرِيِّ وَسُفْيَانُ بْنُ حُسَيْنٍ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ أَوْ أَبَا هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ شُعَيْبٌ وَإِسْحَاقُ بْنُ يَحْيَى عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ مَعْمَرٌ لاَ يُسْنِدُهُ حَتَّى كَانَ بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7000In-book reference : Book 91, Hadith 19USC-MSA web (English) reference : Vol. 9, Book 87, Hadith 129   (deprecated numbering scheme)"
  }
]