[
  {
    "hadithGlobalNumber": 5501,
    "id": 5501,
    "url": "https://sunnah.com/bukhari:5501",
    "bookNumber": 72,
    "hadithNumber": 27,
    "narrator": "Narrated Ka`b:",
    "english": "that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing \none of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of \nit) till I go to the Prophet (ﷺ) and ask him, or, till I send someone to ask him.\" So he went to the Prophet (ﷺ) \nor sent someone to him The Prophet (ﷺ) permitted (them) to eat it.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، سَمِعَ ابْنَ كَعْبِ بْنِ مَالِكٍ، يُخْبِرُ ابْنَ عُمَرَ أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّ جَارِيَةً لَهُمْ كَانَتْ تَرْعَى غَنَمًا بِسَلْعٍ، فَأَبْصَرَتْ بِشَاةٍ مِنْ غَنَمِهَا مَوْتًا، فَكَسَرَتْ حَجَرًا فَذَبَحَتْهَا، فَقَالَ لأَهْلِهِ لاَ تَأْكُلُوا حَتَّى آتِيَ النَّبِيَّ صلى الله عليه وسلم فَأَسْأَلَهُ، أَوْ حَتَّى أُرْسِلَ إِلَيْهِ مَنْ يَسْأَلُهُ‏.‏ فَأَتَى النَّبِيَّ صلى الله عليه وسلم أَوْ بَعَثَ إِلَيْهِ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِأَكْلِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5501In-book reference : Book 72, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 409   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5502,
    "id": 5502,
    "url": "https://sunnah.com/bukhari:5502",
    "bookNumber": 72,
    "hadithNumber": 28,
    "narrator": "Narrated `Abdullah:",
    "english": "that Ka`b had a slave girl who used to graze his sheep on a small mountain, called \"Sl'a\", situated near \nthe market. Once a sheep was dying, so she broke a stone and slaughtered it with it. When they \nmentioned that to the Prophet, he, permitted them to eat it.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ رَجُلٍ، مِنْ بَنِي سَلِمَةَ أَخْبَرَ عَبْدَ اللَّهِ، أَنَّ جَارِيَةً، لِكَعْبِ بْنِ مَالِكٍ تَرْعَى غَنَمًا لَهُ بِالْجُبَيْلِ الَّذِي بِالسُّوقِ وَهْوَ بِسَلْعٍ، فَأُصِيبَتْ شَاةٌ، فَكَسَرَتْ حَجَرًا فَذَبَحَتْهَا، فَذَكَرُوا لِلنَّبِيِّ صلى الله عليه وسلم فَأَمَرَهُمْ بِأَكْلِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5502In-book reference : Book 72, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 410   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5503,
    "id": 5503,
    "url": "https://sunnah.com/bukhari:5503",
    "bookNumber": 72,
    "hadithNumber": 29,
    "narrator": "Narrated Rafi` bin Khadij:",
    "english": "that he said, \"O Allah's Messenger (ﷺ)! We have no knife.\" The Prophet (ﷺ) said, \"if the killing tool causes blood \nto gush out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter \nwith a nail or a tooth, for the nail is the knife of Ethiopians and a tooth is a bone.\" Suddenly a camel \nran away and it was stopped (with an arrow). The Prophet (ﷺ) then said, \"Of these camels there are some \nwhich are as wild as wild beasts; so if one of them runs away from you and you cannot catch it, treat it \nin this manner (i.e. shoot it with an arrow).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رَافِعٍ، عَنْ جَدِّهِ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ لَيْسَ لَنَا مُدًى‏.‏ فَقَالَ ‏\"‏ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ، لَيْسَ الظُّفُرَ وَالسِّنَّ، أَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ، وَأَمَّا السِّنُّ فَعَظْمٌ ‏\"‏‏.‏ وَنَدَّ بَعِيرٌ فَحَبَسَهُ فَقَالَ ‏\"‏ إِنَّ لِهَذِهِ الإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا هَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5503In-book reference : Book 72, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 411   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5504,
    "id": 5504,
    "url": "https://sunnah.com/bukhari:5504",
    "bookNumber": 72,
    "hadithNumber": 30,
    "narrator": "Narrated Ka`b bin Malik:",
    "english": "A lady slaughtered a sheep with a stone and then the Prophet (ﷺ) was asked about it and he permitted it to \nbe eaten.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنٍ لِكَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً، ذَبَحَتْ شَاةً بِحَجَرٍ، فَسُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَمَرَ بِأَكْلِهَا‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنَا نَافِعٌ أَنَّهُ سَمِعَ رَجُلاً مِنَ الأَنْصَارِ يُخْبِرُ عَبْدَ اللَّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ جَارِيَةً لِكَعْبٍ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5504In-book reference : Book 72, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 412   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5505,
    "id": 5505,
    "url": "https://sunnah.com/bukhari:5505",
    "bookNumber": 72,
    "hadithNumber": 31,
    "narrator": "Narrated Mu`adh bin Sa`d or Sa`d bin Mu`adh:",
    "english": "A slave girl belonging to Ka`b used to graze some sheep at Sl'a (mountain). Once one of her sheep \nwas dying. She reached it (before it died) and slaughtered it with a stone. The Prophet (ﷺ) was asked, and \nhe said, \"Eat it.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ عَنْ مُعَاذِ بْنِ سَعْدٍ ـ أَوْ سَعْدِ بْنِ مُعَاذٍ ـ أَخْبَرَهُ أَنَّ جَارِيَةً لِكَعْبِ بْنِ مَالِكٍ كَانَتْ تَرْعَى غَنَمًا بِسَلْعٍ، فَأُصِيبَتْ شَاةٌ مِنْهَا، فَأَدْرَكَتْهَا فَذَبَحَتْهَا بِحَجَرٍ، فَسُئِلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ كُلُوهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5505In-book reference : Book 72, Hadith 31USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 413   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5506,
    "id": 5506,
    "url": "https://sunnah.com/bukhari:5506",
    "bookNumber": 72,
    "hadithNumber": 32,
    "narrator": "Narrated Rafi` bin Khadij:",
    "english": "The Prophet (ﷺ) said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except \nwhat is slaughtered with a tooth or a nail.'",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ كُلْ ـ يَعْنِي ـ مَا أَنْهَرَ الدَّمَ إِلاَّ السِّنَّ وَالظُّفُرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5506In-book reference : Book 72, Hadith 32USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 414   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5507,
    "id": 5507,
    "url": "https://sunnah.com/bukhari:5507",
    "bookNumber": 72,
    "hadithNumber": 33,
    "narrator": "Narrated `Aisha:",
    "english": "A group of people said to the Prophet, \"Some people bring us meat and we do not know whether they \nhave mentioned Allah's Name or not on slaughtering the animal.\" He said, \"Mention Allah's Name on \nit and eat.\" Those people had embraced Islam recently.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا أُسَامَةُ بْنُ حَفْصٍ الْمَدَنِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ قَوْمًا، قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ قَوْمًا يَأْتُونَا بِاللَّحْمِ لاَ نَدْرِي أَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ أَمْ لاَ فَقَالَ ‏\n\"‏ سَمُّوا عَلَيْهِ أَنْتُمْ وَكُلُوهُ ‏\"‏‏.‏ قَالَتْ وَكَانُوا حَدِيثِي عَهْدٍ بِالْكُفْرِ‏.‏ تَابَعَهُ عَلِيٌّ عَنِ الدَّرَاوَرْدِيِّ‏.‏ وَتَابَعَهُ أَبُو خَالِدٍ وَالطُّفَاوِيُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5507In-book reference : Book 72, Hadith 33USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 415   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5508,
    "id": 5508,
    "url": "https://sunnah.com/bukhari:5508",
    "bookNumber": 72,
    "hadithNumber": 34,
    "narrator": "Narrates `Abdullah bin Mughaffal:",
    "english": "While we were besieging the castle of Khaibar, Somebody threw a skin full of fat and I went ahead to \ntake it, but on looking behind, I saw the Prophet (ﷺ) and I felt shy in his presence (and did not take it).",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ ـ رضى الله عنه ـ قَالَ كُنَّا مُحَاصِرِينَ قَصْرَ خَيْبَرَ، فَرَمَى إِنْسَانٌ بِجِرَابٍ فِيهِ شَحْمٌ، فَنَزَوْتُ لآخُذَهُ، فَالْتَفَتُّ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَاسْتَحْيَيْتُ مِنْهُ‏.",
    "reference": "Reference : Sahih al-Bukhari 5508In-book reference : Book 72, Hadith 34USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 416   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5509,
    "id": 5509,
    "url": "https://sunnah.com/bukhari:5509",
    "bookNumber": 72,
    "hadithNumber": 35,
    "narrator": "Narrated Rafi` bin Khadij:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! We are going to face the enemy tomorrow and we do not have knives.\" He \nsaid, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name \nis mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you \nwhy: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some \ncamels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an \narrow and stopped it. Allah's Messenger (ﷺ) said, \"Of these camels there are some which are as wild as wild \nbeasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبِي، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا لاَقُو الْعَدُوِّ غَدًا، وَلَيْسَتْ مَعَنَا مُدًى فَقَالَ ‏\"‏ اعْجَلْ أَوْ أَرِنْ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُحَدِّثُكَ، أَمَّا السِّنُّ فَعَظْمٌ، وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏ وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ فَنَدَّ مِنْهَا بَعِيرٌ، فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، فَإِذَا غَلَبَكُمْ مِنْهَا شَىْءٌ، فَافْعَلُوا بِهِ هَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5509In-book reference : Book 72, Hadith 35USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 417   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5510,
    "id": 5510,
    "url": "https://sunnah.com/bukhari:5510",
    "bookNumber": 72,
    "hadithNumber": 36,
    "narrator": "Narrated Asma bint Abu Bakr:",
    "english": "We slaughtered a horse (by Nahr) during the lifetime of the Prophet (ﷺ) and ate it.",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، امْرَأَتِي عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ نَحَرْنَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَرَسًا فَأَكَلْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5510In-book reference : Book 72, Hadith 36USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 418   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5511,
    "id": 5511,
    "url": "https://sunnah.com/bukhari:5511",
    "bookNumber": 72,
    "hadithNumber": 37,
    "narrator": "Narrated Asma':",
    "english": "We slaughtered a horse (by Dhabh) during the lifetime of Allah's Messenger (ﷺ) while we were at Medina, \nand we ate it.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، سَمِعَ عَبْدَةَ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ ذَبَحْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَسًا وَنَحْنُ بِالْمَدِينَةِ فَأَكَلْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5511In-book reference : Book 72, Hadith 37USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 419   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5512,
    "id": 5512,
    "url": "https://sunnah.com/bukhari:5512",
    "bookNumber": 72,
    "hadithNumber": 38,
    "narrator": "Narrated Asma' bint Abu Bakr:",
    "english": "We slaughtered a horse (by Nahr) during the lifetime of Allah's Messenger (ﷺ) and ate it.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ، قَالَتْ نَحَرْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَسًا فَأَكَلْنَاهُ‏.‏ تَابَعَهُ وَكِيعٌ وَابْنُ عُيَيْنَةَ عَنْ هِشَامٍ فِي النَّحْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5512In-book reference : Book 72, Hadith 38USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 420   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5513,
    "id": 5513,
    "url": "https://sunnah.com/bukhari:5513",
    "bookNumber": 72,
    "hadithNumber": 39,
    "narrator": "Narrated Hisham bin Zaid:",
    "english": "Anas and I went to Al-Hakam bin Aiyub. Anas saw some boys shooting at a tied hen. Anas said, \"The \nProphet has forbidden the shooting of tied or confined animals.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، قَالَ دَخَلْتُ مَعَ أَنَسٍ عَلَى الْحَكَمِ بْنِ أَيُّوبَ، فَرَأَى غِلْمَانًا ـ أَوْ فِتْيَانًا ـ نَصَبُوا دَجَاجَةً يَرْمُونَهَا‏.‏ فَقَالَ أَنَسٌ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُصْبَرَ الْبَهَائِمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5513In-book reference : Book 72, Hadith 39USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 421   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5514,
    "id": 5514,
    "url": "https://sunnah.com/bukhari:5514",
    "bookNumber": 72,
    "hadithNumber": 40,
    "narrator": "Narrated Ibn `Umar:",
    "english": "that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn \n`Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from \ntying the birds for the sake of killing them, as I have heard the Prophet (ﷺ) forbidding the killing of an \nanimal or other living thing after tying them.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، أَخْبَرَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يُحَدِّثُ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ دَخَلَ عَلَى يَحْيَى بْنِ سَعِيدٍ وَغُلاَمٌ مِنْ بَنِي يَحْيَى رَابِطٌ دَجَاجَةً يَرْمِيهَا، فَمَشَى إِلَيْهَا ابْنُ عُمَرَ حَتَّى حَلَّهَا، ثُمَّ أَقْبَلَ بِهَا وَبِالْغُلاَمِ مَعَهُ فَقَالَ ازْجُرُوا غُلاَمَكُمْ عَنْ أَنْ يَصْبِرَ هَذَا الطَّيْرَ لِلْقَتْلِ، فَإِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ تُصْبَرَ بَهِيمَةٌ أَوْ غَيْرُهَا لِلْقَتْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5514In-book reference : Book 72, Hadith 40USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 422   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5515,
    "id": 5515,
    "url": "https://sunnah.com/bukhari:5515",
    "bookNumber": 72,
    "hadithNumber": 41,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "While I was with Ibn `Umar, we passed by a group of young men who had tied a hen and started \nshooting at it. When they saw Ibn `Umar, they dispersed, leaving it. On that Ibn `Umar said, \"Who has \ndone this? The Prophet (ﷺ) cursed the one who did so.\"\n\n\nNarrated Ibn `Umar:\n\nThe Prophet (ﷺ) cursed the one who did Muthla to an animal (i e., cut its limbs or some other part of its \nbody while it is still alive).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ عِنْدَ ابْنِ عُمَرَ فَمَرُّوا بِفِتْيَةٍ أَوْ بِنَفَرٍ نَصَبُوا دَجَاجَةً يَرْمُونَهَا، فَلَمَّا رَأَوُا ابْنَ عُمَرَ تَفَرَّقُوا عَنْهَا، وَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا إِنَّ النَّبِيَّ صلى الله عليه وسلم لَعَنَ مَنْ فَعَلَ هَذَا‏.‏ \nتَابَعَهُ سُلَيْمَانُ عَنْ شُعْبَةَ، حَدَّثَنَا الْمِنْهَالُ، عَنْ سَعِيدٍ، عَنِ ابْنِ عُمَرَ، لَعَنَ النَّبِيُّ صلى الله عليه وسلم مَنْ مَثَّلَ بِالْحَيَوَانِ‏.‏ وَقَالَ عَدِيٌّ عَنْ سَعِيدٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5515In-book reference : Book 72, Hadith 41USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 423   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5516,
    "id": 5516,
    "url": "https://sunnah.com/bukhari:5516",
    "bookNumber": 72,
    "hadithNumber": 42,
    "narrator": "Narrated `Abdullah bin Yazid:",
    "english": "The Prophet (ﷺ) forbade An-Nuhba and Al-Muthla.",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ النُّهْبَةِ وَالْمُثْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5516In-book reference : Book 72, Hadith 42USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 425   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5517,
    "id": 5517,
    "url": "https://sunnah.com/bukhari:5517",
    "bookNumber": 72,
    "hadithNumber": 43,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "I saw the Prophet (ﷺ) eating chicken.",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، عَنْ أَبِي مُوسَى ـ يَعْنِي الأَشْعَرِيَّ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ دَجَاجًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5517In-book reference : Book 72, Hadith 43USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 426   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5518,
    "id": 5518,
    "url": "https://sunnah.com/bukhari:5518",
    "bookNumber": 72,
    "hadithNumber": 44,
    "narrator": "Narrated Zahdam:",
    "english": "We were in the company of Abu Musa Al-Ash`ari and there were friendly relations between us and \nthis tribe of Jarm. Abu Musa was presented with a dish containing chicken. Among the people there \nwas sitting a red-faced man who did not come near the food. Abu Musa said (to him), \"Come on (and \neat), for I have seen Allah's Messenger (ﷺ) eating of it (i.e. chicken).\" He said, \"I have seen it eating \nsomething (dirty) and since then I have disliked it, and have taken an oath that I shall not eat it ' Abu \nMusa said, \"Come on, I will tell you (or narrate to you). Once I went to Allah s Apostle with a group \nof Al-Ash`ariyin, and met him while he was angry, distributing some camels of rak`at. We asked for \nmounts but he took an oath that he would not give us any mounts, and added, 'I have nothing to mount \nyou on' In the meantime some camels of booty were brought to Allah's Messenger (ﷺ) and he asked twice, \n'Where are Al-Ash`ariyin?\" So he gave us five white camels with big humps. We stayed for a short \nwhile (after we had covered a little distance), and then I said to my companions, \"Allah's Messenger (ﷺ) has \nforgotten his oath. By Allah, if we do not remind Allah's Messenger (ﷺ) of his oath, we will never be \nsuccessful.\" So we returned to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We asked you for mounts, \nbut you took an oath that you would not give us any mounts; we think that you have forgotten your \noath.' He said, 'It is Allah Who has given you mounts. By Allah, and Allah willing, if I take an oath \nand later find something else better than that. then I do what is better and expiate my oath.' \"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ بْنُ أَبِي تَمِيمَةَ، عَنِ الْقَاسِمِ، عَنْ زَهْدَمٍ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى الأَشْعَرِيِّ، وَكَانَ بَيْنَنَا وَبَيْنَ هَذَا الْحَىِّ مِنْ جَرْمٍ إِخَاءٌ، فَأُتِيَ بِطَعَامٍ فِيهِ لَحْمُ دَجَاجٍ، وَفِي الْقَوْمِ رَجُلٌ جَالِسٌ أَحْمَرُ فَلَمْ يَدْنُ مِنْ طَعَامِهِ قَالَ ادْنُ فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ مِنْهُ‏.‏ قَالَ إِنِّي رَأَيْتُهُ أَكَلَ شَيْئًا فَقَذِرْتُهُ، فَحَلَفْتُ أَنْ لاَ آكُلَهُ‏.‏ فَقَالَ ادْنُ أُخْبِرْكَ ـ أَوْ أُحَدِّثْكَ ـ إِنِّي أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي نَفَرٍ مِنَ الأَشْعَرِيِّينَ، فَوَافَقْتُهُ وَهْوَ غَضْبَانُ، وَهْوَ يَقْسِمُ نَعَمًا مِنْ نَعَمِ الصَّدَقَةِ فَاسْتَحْمَلْنَاهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا، قَالَ ‏\"‏ مَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏‏.‏ ثُمَّ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَهْبٍ مِنْ إِبِلٍ فَقَالَ ‏\"‏ أَيْنَ الأَشْعَرِيُّونَ أَيْنَ الأَشْعَرِيُّونَ ‏\"‏‏.‏ قَالَ فَأَعْطَانَا خَمْسَ ذَوْدٍ غُرِّ الذُّرَى، فَلَبِثْنَا غَيْرَ بَعِيدٍ، فَقُلْتُ لأَصْحَابِي نَسِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمِينَهُ، فَوَاللَّهِ لَئِنْ تَغَفَّلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَمِينَهُ لاَ نُفْلِحُ أَبَدًا‏.‏ فَرَجَعْنَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا اسْتَحْمَلْنَاكَ، فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا فَظَنَنَّا أَنَّكَ نَسِيتَ يَمِينَكَ‏.‏ فَقَالَ ‏\"‏ إِنَّ اللَّهَ هُوَ حَمَلَكُمْ، إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ، وَتَحَلَّلْتُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5518In-book reference : Book 72, Hadith 44USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 427   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5519,
    "id": 5519,
    "url": "https://sunnah.com/bukhari:5519",
    "bookNumber": 72,
    "hadithNumber": 45,
    "narrator": "Narrated Asma':",
    "english": "We slaughtered a horse during the lifetime of Allah's Messenger (ﷺ) and ate it.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَكَلْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5519In-book reference : Book 72, Hadith 45USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 428   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5520,
    "id": 5520,
    "url": "https://sunnah.com/bukhari:5520",
    "bookNumber": 72,
    "hadithNumber": 46,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the Day of the battle of Khaibar, Allah's Messenger (ﷺ) made donkey's meat unlawful and allowed the \neating of horse flesh.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهم ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ، وَرَخَّصَ فِي لُحُومِ الْخَيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5520In-book reference : Book 72, Hadith 46USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 429   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5521,
    "id": 5521,
    "url": "https://sunnah.com/bukhari:5521",
    "bookNumber": 72,
    "hadithNumber": 47,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) made the meat of donkeys unlawful on the day of the battle of Khaibar.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَالِمٍ، وَنَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ يَوْمَ خَيْبَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5521In-book reference : Book 72, Hadith 47USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5522,
    "id": 5522,
    "url": "https://sunnah.com/bukhari:5522",
    "bookNumber": 72,
    "hadithNumber": 48,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) prohibited the eating of donkey's meat.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ‏.‏ تَابَعَهُ ابْنُ الْمُبَارَكِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ‏.‏ وَقَالَ أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ سَالِمٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5522In-book reference : Book 72, Hadith 48USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 431   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5523,
    "id": 5523,
    "url": "https://sunnah.com/bukhari:5523",
    "bookNumber": 72,
    "hadithNumber": 49,
    "narrator": "Narrated `Ali:",
    "english": "Allah's Messenger (ﷺ) prohibited Al-Mut'a marriage and the eating of donkey's meat in the year of the \nKhaibar battle.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ، وَالْحَسَنِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ ـ رضى الله عنهم ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُتْعَةِ عَامَ خَيْبَرَ وَلُحُومِ حُمُرِ الإِنْسِيَّةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5523In-book reference : Book 72, Hadith 49USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5524,
    "id": 5524,
    "url": "https://sunnah.com/bukhari:5524",
    "bookNumber": 72,
    "hadithNumber": 50,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) prohibited the eating of donkey's meat on the day of the battle of Khaibar, and allowed \nthe eating of horse flesh.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ، وَرَخَّصَ فِي لُحُومِ الْخَيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5524In-book reference : Book 72, Hadith 50USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 433   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5525,
    "id": 5525,
    "url": "https://sunnah.com/bukhari:5525",
    "bookNumber": 72,
    "hadithNumber": 51,
    "narrator": "Narrated Al-Bara' and Ibn Abi `Aufa:",
    "english": "The Prophet (ﷺ) prohibited the eating of donkey's meat.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي عَدِيٌّ، عَنِ الْبَرَاءِ، وَابْنِ أَبِي أَوْفَى، رضى الله عنهم قَالاَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ لُحُومِ الْحُمُرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5525, 5526In-book reference : Book 72, Hadith 51USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5526,
    "id": 5526,
    "url": "https://sunnah.com/bukhari:5526",
    "bookNumber": 72,
    "hadithNumber": 51,
    "narrator": "Narrated Al-Bara' and Ibn Abi `Aufa:",
    "english": "The Prophet (ﷺ) prohibited the eating of donkey's meat.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي عَدِيٌّ، عَنِ الْبَرَاءِ، وَابْنِ أَبِي أَوْفَى، رضى الله عنهم قَالاَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ لُحُومِ الْحُمُرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5525, 5526In-book reference : Book 72, Hadith 51USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5527,
    "id": 5527,
    "url": "https://sunnah.com/bukhari:5527",
    "bookNumber": 72,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Tha'alba:",
    "english": "Allah's Messenger (ﷺ) prohibited the eating of donkey's meat.\n\n\n\n\n\n\n     Narrated Az-Zuhri:\n\n\n     The Prophet (ﷺ) prohibited the eating of beasts having fangs.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا إِدْرِيسَ، أَخْبَرَهُ أَنَّ أَبَا ثَعْلَبَةَ قَالَ حَرَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لُحُومَ الْحُمُرِ الأَهْلِيَّةِ‏.‏ تَابَعَهُ الزُّبَيْدِيُّ وَعُقَيْلٌ عَنِ ابْنِ شِهَابٍ‏.‏ وَقَالَ مَالِكٌ وَمَعْمَرٌ وَالْمَاجِشُونُ وَيُونُسُ وَابْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5527In-book reference : Book 72, Hadith 52USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5528,
    "id": 5528,
    "url": "https://sunnah.com/bukhari:5528",
    "bookNumber": 72,
    "hadithNumber": 53,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Someone came to Allah's Messenger (ﷺ) and said, \"The donkeys have been (slaughtered and) eaten. Another \nman came and said, \"The donkeys have been destroyed.\" On that the Prophet (ﷺ) ordered a caller to \nannounce to the people: Allah and His Apostle forbid you to eat the meat of donkeys, for it is impure.' \nThus the pots were turned upside down while the (donkeys') meat was boiling in them.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَهُ جَاءٍ فَقَالَ أُكِلَتِ الْحُمُرُ، ثُمَّ جَاءَهُ جَاءٍ فَقَالَ أُكِلَتِ الْحُمُرُ‏.‏ ثُمَّ جَاءَهُ جَاءٍ فَقَالَ أُفْنِيَتِ الْحُمُرُ‏.‏ فَأَمَرَ مُنَادِيًا فَنَادَى فِي النَّاسِ إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ، فَإِنَّهَا رِجْسٌ‏.‏ فَأُكْفِئَتِ الْقُدُورُ وَإِنَّهَا لَتَفُورُ بِاللَّحْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5528In-book reference : Book 72, Hadith 53USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 436   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5529,
    "id": 5529,
    "url": "https://sunnah.com/bukhari:5529",
    "bookNumber": 72,
    "hadithNumber": 54,
    "narrator": "Narrated `Amr:",
    "english": "I said to Jabir bin Zaid, \"The people claim that Allah's Messenger (ﷺ) forbade the eating of donkey's meat.\" \nHe said, \"Al-Hakam bin `Amr Al-Ghifari used to say so when he was with us, but Ibn `Abbas, the \ngreat religious learned man, refused to give a final verdict and recited:-- 'Say: I find not in that which \nhas been inspired to me anything forbidden to be eaten by one who wishes to eat it, unless it be \ncarrion, blood poured forth or the flesh of swine...' (6.145)",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو قُلْتُ لِجَابِرِ بْنِ زَيْدٍ يَزْعُمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ حُمُرِ الأَهْلِيَّةِ فَقَالَ قَدْ كَانَ يَقُولُ ذَاكَ الْحَكَمُ بْنُ عَمْرٍو الْغِفَارِيُّ عِنْدَنَا بِالْبَصْرَةِ، وَلَكِنْ أَبَى ذَاكَ الْبَحْرُ ابْنُ عَبَّاسٍ وَقَرَأَ ‏{‏قُلْ لاَ أَجِدُ فِيمَا أُوحِيَ إِلَىَّ مُحَرَّمًا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 5529In-book reference : Book 72, Hadith 54USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 437   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5530,
    "id": 5530,
    "url": "https://sunnah.com/bukhari:5530",
    "bookNumber": 72,
    "hadithNumber": 55,
    "narrator": "Narrated Abu Tha`laba:",
    "english": "Allah's Messenger (ﷺ) forbade the eating of the meat of beasts having fangs.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ‏.‏ تَابَعَهُ يُونُسُ وَمَعْمَرٌ وَابْنُ عُيَيْنَةَ وَالْمَاجِشُونُ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5530In-book reference : Book 72, Hadith 55USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 438   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5531,
    "id": 5531,
    "url": "https://sunnah.com/bukhari:5531",
    "bookNumber": 72,
    "hadithNumber": 56,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Once Allah's Messenger (ﷺ) passed by a dead sheep and said (to the people), \"Why don't you use its hide?\" \nThey said, \"But it is dead,\" He said, \"Only eating it, is prohibited.\"",
    "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِشَاةٍ مَيِّتَةٍ فَقَالَ ‏\"‏ هَلاَّ اسْتَمْتَعْتُمْ بِإِهَابِهَا ‏\"‏‏.‏ قَالُوا إِنَّهَا مَيِّتَةٌ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5531In-book reference : Book 72, Hadith 56USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 439   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5532,
    "id": 5532,
    "url": "https://sunnah.com/bukhari:5532",
    "bookNumber": 72,
    "hadithNumber": 57,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) passed by a dead goat and said, \"There is no harm if its owners benefit from its skin.\"",
    "arabic": "حَدَّثَنَا خَطَّابُ بْنُ عُثْمَانَ، حَدَّثَنَا مُحَمَّدُ بْنُ حِمْيَرَ، عَنْ ثَابِتِ بْنِ عَجْلاَنَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِعَنْزٍ مَيْتَةٍ فَقَالَ ‏\n\"‏ مَا عَلَى أَهْلِهَا لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5532In-book reference : Book 72, Hadith 57USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 440   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5533,
    "id": 5533,
    "url": "https://sunnah.com/bukhari:5533",
    "bookNumber": 72,
    "hadithNumber": 58,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"None is wounded in Allah's Cause but will come on the Day of Resurrection \nwith his wound bleeding. The thing that will come out of his wound will be the color of blood, but its \nsmell will be the smell of musk.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ عَبْدِ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مَكْلُومٍ يُكْلَمُ فِي اللَّهِ إِلاَّ جَاءَ يَوْمَ الْقِيَامَةِ وَكَلْمُهُ يَدْمَى، اللَّوْنُ لَوْنُ دَمٍ وَالرِّيحُ رِيحُ مِسْكٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5533In-book reference : Book 72, Hadith 58USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 441   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5534,
    "id": 5534,
    "url": "https://sunnah.com/bukhari:5534",
    "bookNumber": 72,
    "hadithNumber": 59,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, 'The example of a good pious companion and an evil one is that of a person carrying \nmusk and another blowing a pair of bellows. The one who is carrying musk will either give you some \nperfume as a present, or you will buy some from him, or you will get a good smell from him, but the \none who is blowing a pair of bellows will either burn your clothes or you will get a bad smell from \nhim.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْجَلِيسِ الصَّالِحِ وَالسَّوْءِ كَحَامِلِ الْمِسْكِ وَنَافِخِ الْكِيرِ، فَحَامِلُ الْمِسْكِ إِمَّا أَنْ يُحْذِيَكَ، وَإِمَّا أَنْ تَبْتَاعَ مِنْهُ، وَإِمَّا أَنْ تَجِدَ مِنْهُ رِيحًا طَيِّبَةً، وَنَافِخُ الْكِيرِ إِمَّا أَنْ يُحْرِقَ ثِيَابَكَ، وَإِمَّا أَنْ تَجِدَ رِيحًا خَبِيثَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5534In-book reference : Book 72, Hadith 59USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 442   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5535,
    "id": 5535,
    "url": "https://sunnah.com/bukhari:5535",
    "bookNumber": 72,
    "hadithNumber": 60,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once we provoked a rabbit at Marr-az-Zahran. The people chased it till they got tired. Then I caught It \nand brought it to Abu Talha, who slaughtered it and then sent both its pelvic pieces (or legs) to the \nProphet, and the Prophet (ﷺ) accepted the present.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَنْفَجْنَا أَرْنَبًا وَنَحْنُ بِمَرِّ الظَّهْرَانِ، فَسَعَى الْقَوْمُ فَلَغَبُوا، فَأَخَذْتُهَا فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ فَذَبَحَهَا، فَبَعَثَ بِوَرِكَيْهَا ـ أَوْ قَالَ بِفَخِذَيْهَا ـ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَبِلَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5535In-book reference : Book 72, Hadith 60USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 443   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5536,
    "id": 5536,
    "url": "https://sunnah.com/bukhari:5536",
    "bookNumber": 72,
    "hadithNumber": 61,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"I do not eat mastigure, but I do not prohibit its eating.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الضَّبُّ لَسْتُ آكُلُهُ وَلاَ أُحَرِّمُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5536In-book reference : Book 72, Hadith 61USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 444   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5537,
    "id": 5537,
    "url": "https://sunnah.com/bukhari:5537",
    "bookNumber": 72,
    "hadithNumber": 62,
    "narrator": "Narrated Khalid bin Al-Walid:",
    "english": "Allah's Messenger (ﷺ) and I entered the house of Maimuna. A roasted mastigure was served. Allah's Messenger (ﷺ) \nstretched his hand out (to eat of it) but some woman said, \"Inform Allah's Messenger (ﷺ) of what he is about \nto eat.\" So they said, \"It is mastigure, O Allah's Messenger (ﷺ)!\" He withdrew his hand, whereupon I said, \"O \nAllah's Messenger (ﷺ)! Is it unlawful?\" He said, \"No, but this is not found in the land of my people, so I \ndislike it.\" So I pulled the mastigure towards me and ate it while Allah's Messenger (ﷺ) was looking at me.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ فَأُتِيَ بِضَبٍّ مَحْنُوذٍ، فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ فَقَالَ بَعْضُ النِّسْوَةِ أَخْبِرُوا رَسُولَ اللَّهِ صلى الله عليه وسلم بِمَا يُرِيدُ أَنْ يَأْكُلَ‏.‏ فَقَالُوا هُوَ ضَبٌّ يَا رَسُولَ اللَّهِ‏.‏ فَرَفَعَ يَدَهُ، فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\n\"‏ لاَ، وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5537In-book reference : Book 72, Hadith 62USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 445   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5538,
    "id": 5538,
    "url": "https://sunnah.com/bukhari:5538",
    "bookNumber": 72,
    "hadithNumber": 63,
    "narrator": "Narrated Maimuna:",
    "english": "A mouse fell into the butter-fat and died. The Prophet (ﷺ) was asked about that. He said, \"Throw away the \nmouse and the butter-fat that surrounded it, and eat the rest of the butter-fat (As-Samn).",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يُحَدِّثُهُ عَنْ مَيْمُونَةَ، أَنَّ فَأْرَةً، وَقَعَتْ، فِي سَمْنٍ فَمَاتَتْ، فَسُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْهَا فَقَالَ ‏\n\"‏ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ ‏\"‏‏.‏ قِيلَ لِسُفْيَانَ فَإِنَّ مَعْمَرًا يُحَدِّثُهُ عَنِ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ‏.‏ قَالَ مَا سَمِعْتُ الزُّهْرِيَّ يَقُولُ إِلاَّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَقَدْ سَمِعْتُهُ مِنْهُ مِرَارًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5538In-book reference : Book 72, Hadith 63USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5539,
    "id": 5539,
    "url": "https://sunnah.com/bukhari:5539",
    "bookNumber": 72,
    "hadithNumber": 64,
    "narrator": "Narrated Az-Zhuri:",
    "english": "regarding an animal, e.g., a mouse or some other animal that had fallen into solid or liquid oil or \nbutter-fat: I had been informed that a mouse had died in butter-fat whereupon Allah's Messenger (ﷺ) ordered \nthat the butter-fat near it be thrown away and the rest of the butter-fat can be eaten.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنِ الدَّابَّةِ، تَمُوتُ فِي الزَّيْتِ وَالسَّمْنِ وَهْوَ جَامِدٌ أَوْ غَيْرُ جَامِدٍ، الْفَأْرَةِ أَوْ غَيْرِهَا قَالَ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِفَأْرَةٍ مَاتَتْ فِي سَمْنٍ، فَأَمَرَ بِمَا قَرُبَ مِنْهَا فَطُرِحَ ثُمَّ أُكِلَ، عَنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5539In-book reference : Book 72, Hadith 64USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5540,
    "id": 5540,
    "url": "https://sunnah.com/bukhari:5540",
    "bookNumber": 72,
    "hadithNumber": 65,
    "narrator": "Narrated Maimuna:",
    "english": "The Prophet (ﷺ) was asked about a mouse that had fallen into butter-fat (and died). He said, \"Throw away \nthe mouse and the portion of butter-fat around it, and eat the rest.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ ـ رضى الله عنهم ـ قَالَتْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ فَأْرَةٍ سَقَطَتْ فِي سَمْنٍ فَقَالَ ‏\n\"‏ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5540In-book reference : Book 72, Hadith 65USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 448   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5541,
    "id": 5541,
    "url": "https://sunnah.com/bukhari:5541",
    "bookNumber": 72,
    "hadithNumber": 66,
    "narrator": "Narrated Salim:",
    "english": "that Ibn `Umar disliked the branding of animals on the face. Ibn `Umar said, \"The Prophet (ﷺ) forbade \nbeating (animals) on the face.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ حَنْظَلَةَ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَرِهَ أَنْ تُعْلَمَ الصُّورَةُ،‏.‏ وَقَالَ ابْنُ عُمَرَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُضْرَبَ‏.‏ تَابَعَهُ قُتَيْبَةُ حَدَّثَنَا الْعَنْقَزِيُّ عَنْ حَنْظَلَةَ وَقَالَ تُضْرَبُ الصُّورَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5541In-book reference : Book 72, Hadith 66USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5542,
    "id": 5542,
    "url": "https://sunnah.com/bukhari:5542",
    "bookNumber": 72,
    "hadithNumber": 67,
    "narrator": "Narrated Anas:",
    "english": "I brought a brother of mine to the Prophet (ﷺ) to do Tahnik for him while the Prophet (ﷺ) was in a sheep fold \nof his, and I saw him branding a sheep. (The sub-narrator said: I think Anas said, branding it on the \near.)",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ، قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِأَخٍ لِي يُحَنِّكُهُ، وَهْوَ فِي مِرْبَدٍ لَهُ، فَرَأَيْتُهُ يَسِمُ شَاةً ـ حَسِبْتُهُ قَالَ ـ فِي آذَانِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5542In-book reference : Book 72, Hadith 67USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 450   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5543,
    "id": 5543,
    "url": "https://sunnah.com/bukhari:5543",
    "bookNumber": 72,
    "hadithNumber": 68,
    "narrator": "Narrated Rait' bin Khadij:",
    "english": "I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for \nslaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, \nand if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or \nnail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" \nThe quick ones among the people got the war booty while the Prophet (ﷺ) was behind the people. So they \nplaced the cooking pots on the fire, but the Prophet (ﷺ) ordered the cooking pots to be turned upside \ndown. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. \nThen a camel belonging to the first party of people ran away and they had no horses with them, so a \nman shot it with an arrow whereby Allah stopped it. The Prophet (ﷺ) said, \"Of these animals there are \nsome which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it \nwith an arrow).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا سَعِيدُ بْنُ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّنَا نَلْقَى الْعَدُوَّ غَدًا، وَلَيْسَ مَعَنَا مُدًى‏.‏ فَقَالَ ‏\"‏ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلُوا، مَا لَمْ يَكُنْ سِنٌّ وَلاَ ظُفُرٌ، وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، أَمَّا السِّنُّ فَعَظْمٌ، وَأَمَّا الظُّفْرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏ وَتَقَدَّمَ سَرَعَانُ النَّاسِ فَأَصَابُوا مِنَ الْغَنَائِمِ وَالنَّبِيُّ صلى الله عليه وسلم فِي آخِرِ النَّاسِ فَنَصَبُوا قُدُورًا فَأَمَرَ بِهَا فَأُكْفِئَتْ وَقَسَمَ بَيْنَهُمْ وَعَدَلَ بَعِيرًا بِعَشْرِ شِيَاهٍ، ثُمَّ نَدَّ بَعِيرٌ مِنْ أَوَائِلِ الْقَوْمِ وَلَمْ يَكُنْ مَعَهُمْ خَيْلٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ‏.‏ فَقَالَ ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا فَعَلَ مِنْهَا هَذَا فَافْعَلُوا مِثْلَ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5543In-book reference : Book 72, Hadith 68USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5544,
    "id": 5544,
    "url": "https://sunnah.com/bukhari:5544",
    "bookNumber": 72,
    "hadithNumber": 69,
    "narrator": "Narrated Rafi` bin Khadij:",
    "english": "While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an \narrow and stopped it. The Prophet (ﷺ) said, \"Of these camels some are as wild as wild beasts, so if one of \nthem runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's \nApostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we \nhave no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to \nflow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering \ninstrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
    "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَنَدَّ بَعِيرٌ مِنَ الإِبِلِ ـ قَالَ ـ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ، قَالَ ثُمَّ قَالَ ‏\"‏ إِنَّ لَهَا أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَكُونُ فِي الْمَغَازِي وَالأَسْفَارِ فَنُرِيدُ أَنْ نَذْبَحَ فَلاَ تَكُونُ مُدًى قَالَ ‏\"‏ أَرِنْ مَا نَهَرَ ـ أَوْ أَنْهَرَ ـ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ، غَيْرَ السِّنِّ وَالظُّفُرِ، فَإِنَّ السِّنَّ عَظْمٌ، وَالظُّفُرَ مُدَى الْحَبَشَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5544In-book reference : Book 72, Hadith 69USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5545,
    "id": 5545,
    "url": "https://sunnah.com/bukhari:5545",
    "bookNumber": 73,
    "hadithNumber": 1,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer \nthe (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our \nSunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just \nmeat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing \nthat) Abu Burda bin Niyar got up, for he had slaughtered the sacrifice before the prayer, and said, \"I \nhave got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be \nsufficient for any-one else (as a sacrifice after you). Al-Bara' added: The Prophet (ﷺ) said, \"Whoever \nslaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition \nof the Muslims.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ الإِيَامِيِّ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ثُمَّ نَرْجِعَ فَنَنْحَرَ، مَنْ فَعَلَهُ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلُ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ وَقَدْ ذَبَحَ فَقَالَ إِنَّ عِنْدِي جَذَعَةً‏.‏ فَقَالَ ‏\"‏ اذْبَحْهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ قَالَ مُطَرِّفٌ عَنْ عَامِرٍ عَنِ الْبَرَاءِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ ذَبَحَ بَعْدَ الصَّلاَةِ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5545In-book reference : Book 73, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 453   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5546,
    "id": 5546,
    "url": "https://sunnah.com/bukhari:5546",
    "bookNumber": 73,
    "hadithNumber": 2,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for \nhimself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed \nthe tradition of the Muslims.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَإِنَّمَا ذَبَحَ لِنَفْسِهِ، وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ فَقَدْ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5546In-book reference : Book 73, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 454   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5547,
    "id": 5547,
    "url": "https://sunnah.com/bukhari:5547",
    "bookNumber": 73,
    "hadithNumber": 3,
    "narrator": "Narrated `Uqba bin 'Amir Al-Juhani:",
    "english": "that the Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on \n`Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get \nin my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ بَعْجَةَ الْجُهَنِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَصْحَابِهِ ضَحَايَا، فَصَارَتْ لِعُقْبَةَ جَذَعَةٌ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ صَارَتْ جَذَعَةٌ‏.‏ قَالَ ‏\n\"‏ ضَحِّ بِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5547In-book reference : Book 73, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5548,
    "id": 5548,
    "url": "https://sunnah.com/bukhari:5548",
    "bookNumber": 73,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "that the Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she \nwas weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) \nsaid, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a \nmatter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the \nothers, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef \nwas brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has \nslaughtered some cows as sacrifices on behalf of his wives.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَحَاضَتْ بِسَرِفَ، قَبْلَ أَنْ تَدْخُلَ مَكَّةَ وَهْىَ تَبْكِي فَقَالَ ‏\"‏ مَا لَكِ أَنَفِسْتِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ فَلَمَّا كُنَّا بِمِنًى أُتِيتُ بِلَحْمِ بَقَرٍ، فَقُلْتُ مَا هَذَا قَالُوا ضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ بِالْبَقَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5548In-book reference : Book 73, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5549,
    "id": 5549,
    "url": "https://sunnah.com/bukhari:5549",
    "bookNumber": 73,
    "hadithNumber": 5,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should \nrepeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on \nwhich meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is \nto me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I \ndo not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and then the people went towards some sheep and distributed \nthem among themselves.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ ‏\n\"‏ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ـ وَذَكَرَ جِيرَانَهُ ـ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَرَخَّصَ لَهُ فِي ذَلِكَ، فَلاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ مَنْ سِوَاهُ أَمْ لاَ، ثُمَّ انْكَفَأَ النَّبِيُّ صلى الله عليه وسلم إِلَى كَبْشَيْنِ فَذَبَحَهُمَا، وَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا أَوْ قَالَ فَتَجَزَّعُوهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5549In-book reference : Book 73, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 457   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5550,
    "id": 5550,
    "url": "https://sunnah.com/bukhari:5550",
    "bookNumber": 73,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the \nHeavens and the Earth. The year is twelve months, four of which are sacred, three of them are in \nsuccession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is \nbetween Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \n\"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a \nname other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \n\"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we \nthought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of \nMecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know \nbetter.\" He kept silent so long that we thought that he would call it by a name other than its real name. \nHe said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor \nare as sacred to one another as this day of yours in this town of yours in this month of yours. You will \nmeet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting \nthe necks of each other. It is incumbent upon those who are present to convey this message to those \nwho are absent, for some of those to whom it is conveyed may comprehend it better than some of \nthose who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The \nProphet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered \nAllah's message (to you)?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ، ثَلاَثٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ، أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ، قَالَ ‏\"‏ أَلَيْسَ ذَا الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ، قَالَ ‏\"‏ أَلَيْسَ الْبَلْدَةَ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ ـ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ، وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ، أَلاَ فَلاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَلَعَلَّ بَعْضَ مَنْ يَبْلُغُهُ أَنْ يَكُونَ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ ـ وَكَانَ مُحَمَّدٌ إِذَا ذَكَرَهُ قَالَ صَدَقَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ـ أَلاَ هَلْ بَلَّغْتُ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5550In-book reference : Book 73, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5551,
    "id": 5551,
    "url": "https://sunnah.com/bukhari:5551",
    "bookNumber": 73,
    "hadithNumber": 7,
    "narrator": "Narrated Nafi':",
    "english": "'Abdullah (bin 'Umar) used to slaughter his sacrifice at the \n     slaughtering place (i.e the slaughtering place of the Prophet (ﷺ) ) .",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، قَالَ كَانَ عَبْدُ اللَّهِ يَنْحَرُ فِي الْمَنْحَرِ‏.‏ قَالَ عُبَيْدُ اللَّهِ يَعْنِي مَنْحَرَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5551In-book reference : Book 73, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5552,
    "id": 5552,
    "url": "https://sunnah.com/bukhari:5552",
    "bookNumber": 73,
    "hadithNumber": 8,
    "narrator": "",
    "english": "Ibn 'Umar said, \n\n   \"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَذْبَحُ وَيَنْحَرُ بِالْمُصَلَّى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5552In-book reference : Book 73, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5553,
    "id": 5553,
    "url": "https://sunnah.com/bukhari:5553",
    "bookNumber": 73,
    "hadithNumber": 9,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُضَحِّي بِكَبْشَيْنِ وَأَنَا أُضَحِّي بِكَبْشَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5553In-book reference : Book 73, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 460   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5554,
    "id": 5554,
    "url": "https://sunnah.com/bukhari:5554",
    "bookNumber": 73,
    "hadithNumber": 10,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them \nwith his own hands.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْكَفَأَ إِلَى كَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا بِيَدِهِ‏.‏ تَابَعَهُ وُهَيْبٌ عَنْ أَيُّوبَ‏.‏ وَقَالَ إِسْمَاعِيلُ وَحَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ عَنِ ابْنِ سِيرِينَ عَنْ أَنَسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5554In-book reference : Book 73, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 461   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5555,
    "id": 5555,
    "url": "https://sunnah.com/bukhari:5555",
    "bookNumber": 73,
    "hadithNumber": 11,
    "narrator": "Narrated `Uqba bin 'Amir:",
    "english": "that the Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices \n(`Id--al--Adha). A kid goat was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it \nas a sacrifice (on your behalf).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ ضَحَايَا، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ ضَحِّ أَنْتَ بِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5555In-book reference : Book 73, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 462   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5556,
    "id": 5556,
    "url": "https://sunnah.com/bukhari:5556",
    "bookNumber": 73,
    "hadithNumber": 12,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) \nsaid to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's \nApostle! I have got a domestic kid goat.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be \npermissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice \nbefore the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, \nhe offered his sacrifice properly and followed the tradition of the Muslims.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُطَرِّفٌ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ ضَحَّى خَالٌ لِي يُقَالُ لَهُ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شَاتُكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي دَاجِنًا جَذَعَةً مِنَ الْمَعَزِ‏.‏ قَالَ ‏\"‏ اذْبَحْهَا وَلَنْ تَصْلُحَ لِغَيْرِكَ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَإِنَّمَا يَذْبَحُ لِنَفْسِهِ، وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ فَقَدْ تَمَّ نُسُكُهُ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏‏.‏ تَابَعَهُ عُبَيْدَةُ عَنِ الشَّعْبِيِّ وَإِبْرَاهِيمَ‏.‏ وَتَابَعَهُ وَكِيعٌ عَنْ حُرَيْثٍ عَنِ الشَّعْبِيِّ‏.‏ وَقَالَ عَاصِمٌ وَدَاوُدُ عَنِ الشَّعْبِيِّ عِنْدِي عَنَاقُ لَبَنٍ‏.‏ وَقَالَ زُبَيْدٌ وَفِرَاسٌ عَنِ الشَّعْبِيِّ عِنْدِي جَذَعَةٌ‏.‏ وَقَالَ أَبُو الأَحْوَصِ حَدَّثَنَا مَنْصُورٌ عَنَاقٌ جَذَعَةٌ‏.‏ وَقَالَ ابْنُ عَوْنٍ عَنَاقٌ جَذَعٌ، عَنَاقُ لَبَنٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5556In-book reference : Book 73, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 463   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5557,
    "id": 5557,
    "url": "https://sunnah.com/bukhari:5557",
    "bookNumber": 73,
    "hadithNumber": 13,
    "narrator": "Narrated Al-Bara':",
    "english": "Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \n\"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" \n(Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) \nThe Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient \nfor anyone else after you.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، عَنْ أَبِي جُحَيْفَةَ، عَنِ الْبَرَاءِ، قَالَ ذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبْدِلْهَا ‏\"‏‏.‏ قَالَ لَيْسَ عِنْدِي إِلاَّ جَذَعَةٌ ـ قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ ـ هِيَ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ وَقَالَ حَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ عَنَاقٌ جَذَعَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5557In-book reference : Book 73, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 464   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5558,
    "id": 5558,
    "url": "https://sunnah.com/bukhari:5558",
    "bookNumber": 73,
    "hadithNumber": 14,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his \nfoot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered \nthem with his own hands.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ، فَرَأَيْتُهُ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا يُسَمِّي وَيُكَبِّرُ، فَذَبَحَهُمَا بِيَدِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5558In-book reference : Book 73, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 465   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5559,
    "id": 5559,
    "url": "https://sunnah.com/bukhari:5559",
    "bookNumber": 73,
    "hadithNumber": 15,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not \nbe able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I \nreplied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform \nthe ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" \nAllah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَرِفَ وَأَنَا أَبْكِي، فَقَالَ ‏\"‏ مَا لَكِ أَنَفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ اقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5559In-book reference : Book 73, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5560,
    "id": 5560,
    "url": "https://sunnah.com/bukhari:5560",
    "bookNumber": 73,
    "hadithNumber": 16,
    "narrator": "Narrated Al-Bara':",
    "english": "I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we \nwill do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our \nsacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered \nhis sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that \nwas not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before \nthe prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it \nto make up for that, but it will not be sufficient for anybody else after you.\"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ مِنْ يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ هَذَا فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ نَحَرَ فَإِنَّمَا هُوَ لَحْمٌ يُقَدِّمُهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَالَ أَبُو بُرْدَةَ يَا رَسُولَ اللَّهِ ذَبَحْتُ قَبْلَ أَنْ أُصَلِّيَ، وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ فَقَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا، وَلَنْ تَجْزِيَ أَوْ تُوفِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5560In-book reference : Book 73, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 467   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5561,
    "id": 5561,
    "url": "https://sunnah.com/bukhari:5561",
    "bookNumber": 73,
    "hadithNumber": 17,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter \nanother one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of \nhis neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a \nwhich is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I \ndo not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went \ntowards two rams and slaughtered them, and the people went towards their sheep and slaughtered \nthem.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَالَ رَجُلٌ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ـ وَذَكَرَ مِنْ جِيرَانِهِ فَكَأَنَّ النَّبِيَّ صلى الله عليه وسلم عَذَرَهُ ـ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ شَاتَيْنِ فَرَخَّصَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ أَدْرِي بَلَغَتِ الرُّخْصَةُ أَمْ لاَ، ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ ـ يَعْنِي فَذَبَحَهُمَا ـ ثُمَّ انْكَفَأَ النَّاسُ إِلَى غُنَيْمَةٍ فَذَبَحُوهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5561In-book reference : Book 73, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 468   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5562,
    "id": 5562,
    "url": "https://sunnah.com/bukhari:5562",
    "bookNumber": 73,
    "hadithNumber": 18,
    "narrator": "Narrated Jundab bin Sufyan Al-Bajali:",
    "english": "I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before \noffering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered \ntheir sacrifice yet, should slaughter now.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، سَمِعْتُ جُنْدَبَ بْنَ سُفْيَانَ الْبَجَلِيَّ، قَالَ شَهِدْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ النَّحْرِ فَقَالَ ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيُعِدْ مَكَانَهَا أُخْرَى، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5562In-book reference : Book 73, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 469   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5563,
    "id": 5563,
    "url": "https://sunnah.com/bukhari:5563",
    "bookNumber": 73,
    "hadithNumber": 19,
    "narrator": "Narrated Al-Bara':",
    "english": "One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our \nQibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up \nand said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have \ndone before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I \nslaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَاسْتَقْبَلَ قِبْلَتَنَا، فَلاَ يَذْبَحْ حَتَّى يَنْصَرِفَ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ فَعَلْتُ‏.‏ فَقَالَ ‏\"‏ هُوَ شَىْءٌ عَجَّلْتَهُ ‏\"‏‏.‏ قَالَ فَإِنَّ عِنْدِي جَذَعَةً هِيَ خَيْرٌ مِنْ مُسِنَّتَيْنِ آذْبَحُهَا قَالَ ‏\"‏ نَعَمْ، ثُمَّ لاَ تَجْزِي عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏ قَالَ عَامِرٌ هِيَ خَيْرُ نَسِيكَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5563In-book reference : Book 73, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 470   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5564,
    "id": 5564,
    "url": "https://sunnah.com/bukhari:5564",
    "bookNumber": 73,
    "hadithNumber": 20,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his \nfoot on their sides and slaughter them with his own hands.",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، وَوَضَعَ رِجْلَهُ عَلَى صَفْحَتِهِمَا، وَيَذْبَحُهُمَا بِيَدِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5564In-book reference : Book 73, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 471   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5565,
    "id": 5565,
    "url": "https://sunnah.com/bukhari:5565",
    "bookNumber": 73,
    "hadithNumber": 21,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them \nwith his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their \nsides.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ذَبَحَهُمَا بِيَدِهِ، وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5565In-book reference : Book 73, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 472   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5566,
    "id": 5566,
    "url": "https://sunnah.com/bukhari:5566",
    "bookNumber": 73,
    "hadithNumber": 22,
    "narrator": "Narrated Masruq:",
    "english": "that he came to `Aisha and said to her, \"O Mother of the Believers! There is a man who sends a Hadi \nto Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state \nof Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" \n(What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She \nsaid, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to \nKa`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the \npeople returned (from the Hajj).",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، أَنَّهُ أَتَى عَائِشَةَ، فَقَالَ لَهَا يَا أُمَّ الْمُؤْمِنِينَ إِنَّ رَجُلاً يَبْعَثُ بِالْهَدْىِ إِلَى الْكَعْبَةِ، وَيَجْلِسُ فِي الْمِصْرِ، فَيُوصِي أَنْ تُقَلَّدَ بَدَنَتُهُ، فَلاَ يَزَالُ مِنْ ذَلِكَ الْيَوْمِ مُحْرِمًا حَتَّى يَحِلَّ النَّاسُ‏.‏ قَالَ فَسَمِعْتُ تَصْفِيقَهَا مِنْ وَرَاءِ الْحِجَابِ فَقَالَتْ لَقَدْ كُنْتُ أَفْتِلُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَبْعَثُ هَدْيَهُ إِلَى الْكَعْبَةِ، فَمَا يَحْرُمُ عَلَيْهِ مِمَّا حَلَّ لِلرِّجَالِ مِنْ أَهْلِهِ، حَتَّى يَرْجِعَ النَّاسُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5566In-book reference : Book 73, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 473   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5567,
    "id": 5567,
    "url": "https://sunnah.com/bukhari:5567",
    "bookNumber": 73,
    "hadithNumber": 23,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to \nMedina. (The narrator often said. The meat of the Hadi).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الأَضَاحِيِّ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ، وَقَالَ غَيْرَ مَرَّةٍ لُحُومَ الْهَدْىِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5567In-book reference : Book 73, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 474   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5568,
    "id": 5568,
    "url": "https://sunnah.com/bukhari:5568",
    "bookNumber": 73,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "that once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented \nto him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall \nnot taste it. (In his narration) Abu Sa`id added: I got up and went to my brother, Abu Qatada (who was \nhis maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He \nSa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and \neaten later on).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ، أَنَّ ابْنَ خَبَّابٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ، يُحَدِّثُ أَنَّهُ كَانَ غَائِبًا، فَقَدِمَ فَقُدِّمَ إِلَيْهِ لَحْمٌ‏.‏ قَالَ وَهَذَا مِنْ لَحْمِ ضَحَايَانَا‏.‏ فَقَالَ أَخِّرُوهُ لاَ أَذُوقُهُ‏.‏ قَالَ ثُمَّ قُمْتُ فَخَرَجْتُ حَتَّى آتِيَ أَخِي قَتَادَةَ ـ وَكَانَ أَخَاهُ لأُمِّهِ، وَكَانَ بَدْرِيًّا ـ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنَّهُ قَدْ حَدَثَ بَعْدَكَ أَمْرٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5568In-book reference : Book 73, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5569,
    "id": 5569,
    "url": "https://sunnah.com/bukhari:5569",
    "bookNumber": 73,
    "hadithNumber": 25,
    "narrator": "Narrated Salama bin Al-Aqua':",
    "english": "The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after \nthree days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last \nyear?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having \na hard time and I wanted you to help (the needy).",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ بَعْدَ ثَالِثَةٍ وَفِي بَيْتِهِ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا عَامَ الْمَاضِي قَالَ ‏\"‏ كُلُوا وَأَطْعِمُوا وَادَّخِرُوا فَإِنَّ ذَلِكَ الْعَامَ كَانَ بِالنَّاسِ جَهْدٌ فَأَرَدْتُ أَنْ تُعِينُوا فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5569In-book reference : Book 73, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 476   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5570,
    "id": 5570,
    "url": "https://sunnah.com/bukhari:5570",
    "bookNumber": 73,
    "hadithNumber": 26,
    "narrator": "Narrated `Aisha:",
    "english": "We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \n\"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he \nwanted us to feed of it to others, Allah knows better.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ الضَّحِيَّةُ كُنَّا نُمَلِّحُ مِنْهُ، فَنَقْدَمُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ فَقَالَ ‏\n\"‏ لاَ تَأْكُلُوا إِلاَّ ثَلاَثَةَ أَيَّامٍ ‏\"‏‏.‏ وَلَيْسَتْ بِعَزِيمَةٍ، وَلَكِنْ أَرَادَ أَنْ يُطْعِمَ مِنْهُ وَاللَّهُ أَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5570In-book reference : Book 73, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5571,
    "id": 5571,
    "url": "https://sunnah.com/bukhari:5571",
    "bookNumber": 73,
    "hadithNumber": 27,
    "narrator": "Narrated Abu `Ubaid:",
    "english": "the freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab. \n`Umar offered the `Id prayer before the sermon and then delivered the sermon before the people, \nsaying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two \n'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the \nmeat of your sacrifices.\"",
    "arabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ يَوْمَ الأَضْحَى مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَاكُمْ عَنْ صِيَامِ هَذَيْنِ الْعِيدَيْنِ، أَمَّا أَحَدُهُمَا فَيَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ وَأَمَّا الآخَرُ فَيَوْمٌ تَأْكُلُونَ نُسُكَكُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5571In-book reference : Book 73, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5572,
    "id": 5572,
    "url": "https://sunnah.com/bukhari:5572",
    "bookNumber": 73,
    "hadithNumber": 28,
    "narrator": "Narrated Abu `Ubaid:",
    "english": "(in continuation of above). Then I witnessed the `Id with `Uthman bin `Affan, and that was on a Friday. \nHe offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) \ntogether, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua \nprayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"",
    "arabic": "قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَكَانَ ذَلِكَ يَوْمَ الْجُمُعَةِ، فَصَلَّى قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ هَذَا يَوْمٌ قَدِ اجْتَمَعَ لَكُمْ فِيهِ عِيدَانِ، فَمَنْ أَحَبَّ أَنْ يَنْتَظِرَ الْجُمُعَةَ مِنْ أَهْلِ الْعَوَالِي فَلْيَنْتَظِرْ، وَمَنْ أَحَبَّ أَنْ يَرْجِعَ فَقَدْ أَذِنْتُ لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5572In-book reference : Book 73, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5573,
    "id": 5573,
    "url": "https://sunnah.com/bukhari:5573",
    "bookNumber": 73,
    "hadithNumber": 29,
    "narrator": "Narrated Abu `Ubaid:",
    "english": "(in continuation of above). Then I witnessed (the 'Its) with `Ali bin Abi Talib, and he too offered the `Id prayer before the sermon \nand then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat \nthe meat of your sacrifices for more than three days.\"",
    "arabic": "قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُهُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ، فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلاَثٍ‏.‏ وَعَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ أَبِي عُبَيْدٍ نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5573In-book reference : Book 73, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5574,
    "id": 5574,
    "url": "https://sunnah.com/bukhari:5574",
    "bookNumber": 73,
    "hadithNumber": 30,
    "narrator": "Narrated Salim:",
    "english": "`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for \nthree days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of \nthe meat of Hadi (which is regarded as unlawful after the three days of the `Id).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُوا مِنَ الأَضَاحِيِّ ثَلاَثًا ‏\"‏‏.‏ وَكَانَ عَبْدُ اللَّهِ يَأْكُلُ بِالزَّيْتِ حِينَ يَنْفِرُ مِنْ مِنًى، مِنْ أَجْلِ لُحُومِ الْهَدْىِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5574In-book reference : Book 73, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 68, Hadith 480   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5575,
    "id": 5575,
    "url": "https://sunnah.com/bukhari:5575",
    "bookNumber": 74,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before \ndying), will be deprived of it in the Hereafter.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا، ثُمَّ لَمْ يَتُبْ مِنْهَا، حُرِمَهَا فِي الآخِرَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5575In-book reference : Book 74, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 481   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5576,
    "id": 5576,
    "url": "https://sunnah.com/bukhari:5576",
    "bookNumber": 74,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and \nthe other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel \nsaid, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) \nwine, your nation would have gone astray.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلِيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ، وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا، ثُمَّ أَخَذَ اللَّبَنَ، فَقَالَ جِبْرِيلُ الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ، وَلَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ‏.‏ تَابَعَهُ مَعْمَرٌ وَابْنُ الْهَادِ وَعُثْمَانُ بْنُ عُمَرَ وَالزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5576In-book reference : Book 74, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 482   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5577,
    "id": 5577,
    "url": "https://sunnah.com/bukhari:5577",
    "bookNumber": 74,
    "hadithNumber": 3,
    "narrator": "Narrated Anas:",
    "english": "I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \n\"From among the portents of the our are the following: General ignorance (in religious affairs) will \nprevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks \nwill be drunk (in abundance), men will decrease and women will increase so much so that for every \nfifty women there will be one man to look after them.\"",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا لاَ يُحَدِّثُكُمْ بِهِ غَيْرِي قَالَ ‏\n\"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَظْهَرَ الْجَهْلُ، وَيَقِلَّ الْعِلْمُ، وَيَظْهَرَ الزِّنَا، وَتُشْرَبَ الْخَمْرُ، وَيَقِلَّ الرِّجَالُ، وَيَكْثُرَ النِّسَاءُ، حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً قَيِّمُهُنَّ رَجُلٌ وَاحِدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5577In-book reference : Book 74, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 483   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5578,
    "id": 5578,
    "url": "https://sunnah.com/bukhari:5578",
    "bookNumber": 74,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a \nbeliever; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the \ntime of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman \nbin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority \nof Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who \nrobs (takes illegally something by force) while the people are looking at him, is not a believer at the \ntime he is robbing (taking).",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، وَابْنَ الْمُسَيَّبِ، يَقُولاَنِ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّ أَبَا بَكْرٍ كَانَ يُحَدِّثُهُ عَنْ أَبِي هُرَيْرَةَ ثُمَّ يَقُولُ كَانَ أَبُو بَكْرٍ يُلْحِقُ مَعَهُنَّ ‏\"‏ وَلاَ يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ، يَرْفَعُ النَّاسُ إِلَيْهِ أَبْصَارَهُمْ فِيهَا حِينَ يَنْتَهِبُهَا وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5578In-book reference : Book 74, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 484   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5579,
    "id": 5579,
    "url": "https://sunnah.com/bukhari:5579",
    "bookNumber": 74,
    "hadithNumber": 5,
    "narrator": "Narrated Ibn `Umar:",
    "english": "\"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in \nMedina.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ صَبَّاحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا مَالِكٌ ـ هُوَ ابْنُ مِغْوَلٍ ـ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَقَدْ حُرِّمَتِ الْخَمْرُ، وَمَا بِالْمَدِينَةِ مِنْهَا شَىْءٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5579In-book reference : Book 74, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5580,
    "id": 5580,
    "url": "https://sunnah.com/bukhari:5580",
    "bookNumber": 74,
    "hadithNumber": 6,
    "narrator": "Narrated Anas:",
    "english": "\"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, \nfor most of our liquors were made from unripe and ripe dates.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ عَبْدُ رَبِّهِ بْنُ نَافِعٍ، عَنْ يُونُسَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ حُرِّمَتْ عَلَيْنَا الْخَمْرُ حِينَ حُرِّمَتْ وَمَا نَجِدُ ـ يَعْنِي بِالْمَدِينَةِ ـ خَمْرَ الأَعْنَابِ إِلاَّ قَلِيلاً، وَعَامَّةُ خَمْرِنَا الْبُسْرُ وَالتَّمْرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5580In-book reference : Book 74, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 486   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5581,
    "id": 5581,
    "url": "https://sunnah.com/bukhari:5581",
    "bookNumber": 74,
    "hadithNumber": 7,
    "narrator": "Narrated Ibn `Umar:",
    "english": "`Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, \nand these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an \nalcoholic drink is that, that disturbs the mind.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي حَيَّانَ، حَدَّثَنَا عَامِرٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَامَ عُمَرُ عَلَى الْمِنْبَرِ فَقَالَ أَمَّا بَعْدُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنْ خَمْسَةٍ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5581In-book reference : Book 74, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 487   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5582,
    "id": 5582,
    "url": "https://sunnah.com/bukhari:5582",
    "bookNumber": 74,
    "hadithNumber": 8,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe \ndates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing \nthat) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ أَسْقِي أَبَا عُبَيْدَةَ وَأَبَا طَلْحَةَ وَأُبَىَّ بْنَ كَعْبٍ مِنْ فَضِيخِ زَهْوٍ وَتَمْرٍ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ أَبُو طَلْحَةَ قُمْ يَا أَنَسُ فَأَهْرِقْهَا‏.‏ فَأَهْرَقْتُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5582In-book reference : Book 74, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5583,
    "id": 5583,
    "url": "https://sunnah.com/bukhari:5583",
    "bookNumber": 74,
    "hadithNumber": 9,
    "narrator": "Narrated Anas:",
    "english": "While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the \nyoungest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \n\"Throw it away.\" So I threw it away.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَنَسًا، قَالَ كُنْتُ قَائِمًا عَلَى الْحَىِّ أَسْقِيهِمْ ـ عُمُومَتِي وَأَنَا أَصْغَرُهُمُ ـ الْفَضِيخَ، فَقِيلَ حُرِّمَتِ الْخَمْرُ‏.‏ فَقَالُوا أَكْفِئْهَا‏.‏ فَكَفَأْتُهَا‏.‏ قُلْتُ لأَنَسٍ مَا شَرَابُهُمْ قَالَ رُطَبٌ وَبُسْرٌ‏.‏ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ وَكَانَتْ خَمْرَهُمْ‏.‏ فَلَمْ يُنْكِرْ أَنَسٌ‏.‏ وَحَدَّثَنِي بَعْضُ أَصْحَابِي أَنَّهُ سَمِعَ أَنَسًا يَقُولُ كَانَتْ خَمْرَهُمْ يَوْمَئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5583In-book reference : Book 74, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 489   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5584,
    "id": 5584,
    "url": "https://sunnah.com/bukhari:5584",
    "bookNumber": 74,
    "hadithNumber": 10,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe \ndates.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا يُوسُفُ أَبُو مَعْشَرٍ الْبَرَّاءُ، قَالَ سَمِعْتُ سَعِيدَ بْنَ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي بَكْرُ بْنُ عَبْدِ اللَّهِ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ الْخَمْرَ حُرِّمَتْ، وَالْخَمْرُ يَوْمَئِذٍ الْبُسْرُ وَالتَّمْرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5584In-book reference : Book 74, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 490   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5585,
    "id": 5585,
    "url": "https://sunnah.com/bukhari:5585",
    "bookNumber": 74,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْبِتْعِ فَقَالَ ‏\n\"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهْوَ حَرَامٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5585In-book reference : Book 74, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5586,
    "id": 5586,
    "url": "https://sunnah.com/bukhari:5586",
    "bookNumber": 74,
    "hadithNumber": 12,
    "narrator": "Narrated 'Aisha:",
    "english": "Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey \n     which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks \n     that intoxicate are unlawful (to drink).\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْبِتْعِ وَهْوَ نَبِيذُ الْعَسَلِ، وَكَانَ أَهْلُ الْيَمَنِ يَشْرَبُونَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهْوَ حَرَامٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5586In-book reference : Book 74, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5587,
    "id": 5587,
    "url": "https://sunnah.com/bukhari:5587",
    "bookNumber": 74,
    "hadithNumber": 13,
    "narrator": "Anas bin Malik said:",
    "english": "Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in \n     Al-Muzaffat.  Abu Huraira used to add to them Al-Hantam and An-Naqir.",
    "arabic": "وَعَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَنْتَبِذُوا فِي الدُّبَّاءِ، وَلاَ فِي الْمُزَفَّتِ ‏\"‏‏.‏ وَكَانَ أَبُو هُرَيْرَةَ يُلْحِقُ مَعَهَا الْحَنْتَمَ وَالنَّقِيرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5587In-book reference : Book 74, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5588,
    "id": 5588,
    "url": "https://sunnah.com/bukhari:5588",
    "bookNumber": 74,
    "hadithNumber": 14,
    "narrator": "Narrated Ibn `Umar:",
    "english": "`Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited \nby Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, \nbarley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's \nApostle had not left us before he had given us definite verdicts concerning three matters, i.e., how \nmuch a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person \namong whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي حَيَّانَ التَّيْمِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ خَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّهُ قَدْ نَزَلَ تَحْرِيمُ الْخَمْرِ، وَهْىَ مِنْ خَمْسَةِ أَشْيَاءَ الْعِنَبِ وَالتَّمْرِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْعَسَلِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ، وَثَلاَثٌ وَدِدْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يُفَارِقْنَا حَتَّى يَعْهَدَ إِلَيْنَا عَهْدًا الْجَدُّ وَالْكَلاَلَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا‏.‏ قَالَ قُلْتُ يَا أَبَا عَمْرٍو فَشَىْءٌ يُصْنَعُ بِالسِّنْدِ مِنَ الرُّزِّ‏.‏ قَالَ ذَاكَ لَمْ يَكُنْ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم أَوْ قَالَ عَلَى عَهْدِ عُمَرَ‏.‏ وَقَالَ حَجَّاجُ عَنْ حَمَّادٍ عَنْ أَبِي حَيَّانَ مَكَانَ الْعِنَبِ الزَّبِيبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5588In-book reference : Book 74, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 493   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5589,
    "id": 5589,
    "url": "https://sunnah.com/bukhari:5589",
    "bookNumber": 74,
    "hadithNumber": 15,
    "narrator": "Narrated 'Umar:",
    "english": "\"Alcoholic drinks are prepared from five things, i.e., raisins, dates.\n     wheat, barley and honey.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ الْخَمْرُ يُصْنَعُ مِنْ خَمْسَةٍ مِنَ الزَّبِيبِ وَالتَّمْرِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْعَسَلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5589In-book reference : Book 74, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5590,
    "id": 5590,
    "url": "https://sunnah.com/bukhari:5590",
    "bookNumber": 74,
    "hadithNumber": 16,
    "narrator": "Narrated Abu 'Amir or Abu Malik Al-Ash'ari:",
    "english": "that he heard the Prophet (ﷺ) saying, \"From among my followers there will \n     be some people who will consider illegal sexual intercourse, the \n     wearing of silk, the drinking of alcoholic drinks and the use of \n     musical instruments, as lawful. And there will be some people who will\n     stay near the side of a mountain and in the evening their shepherd \n     will come to them with their sheep and ask them for something, but \n     they will say to him, 'Return to us tomorrow.' Allah will destroy them\n     during the night and will let the mountain fall on them, and He will \n     transform the rest of them into monkeys and pigs and they will remain \n     so till the Day of Resurrection.\"",
    "arabic": "وَقَالَ هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنَا عَطِيَّةُ بْنُ قَيْسٍ الْكِلاَبِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ غَنْمٍ الأَشْعَرِيُّ، قَالَ حَدَّثَنِي أَبُو عَامِرٍ ـ أَوْ أَبُو مَالِكٍ ـ الأَشْعَرِيُّ وَاللَّهِ مَا كَذَبَنِي سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَيَكُونَنَّ مِنْ أُمَّتِي أَقْوَامٌ يَسْتَحِلُّونَ الْحِرَ وَالْحَرِيرَ وَالْخَمْرَ وَالْمَعَازِفَ، وَلَيَنْزِلَنَّ أَقْوَامٌ إِلَى جَنْبِ عَلَمٍ يَرُوحُ عَلَيْهِمْ بِسَارِحَةٍ لَهُمْ، يَأْتِيهِمْ ـ يَعْنِي الْفَقِيرَ ـ لِحَاجَةٍ فَيَقُولُوا ارْجِعْ إِلَيْنَا غَدًا‏.‏ فَيُبَيِّتُهُمُ اللَّهُ وَيَضَعُ الْعَلَمَ، وَيَمْسَخُ آخَرِينَ قِرَدَةً وَخَنَازِيرَ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5590In-book reference : Book 74, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5591,
    "id": 5591,
    "url": "https://sunnah.com/bukhari:5591",
    "bookNumber": 74,
    "hadithNumber": 17,
    "narrator": "Narrated Sahl:",
    "english": "Abu Usaid As-Sa`idi came and invited Allah's Messenger (ﷺ) on the occasion of his wedding. His wife who \nwas the bride, was serving them. Do you know what drink she prepared for Allah's Messenger (ﷺ) ? She had \nsoaked some dates in water in a Tur overnight.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلاً، يَقُولُ أَتَى أَبُو أُسَيْدٍ السَّاعِدِيُّ فَدَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم فِي عُرْسِهِ، فَكَانَتِ امْرَأَتُهُ خَادِمَهُمْ وَهْىَ الْعَرُوسُ‏.‏ قَالَتْ أَتَدْرُونَ مَا سَقَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْقَعْتُ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ فِي تَوْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5591In-book reference : Book 74, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5592,
    "id": 5592,
    "url": "https://sunnah.com/bukhari:5592",
    "bookNumber": 74,
    "hadithNumber": 18,
    "narrator": "Narrated Jabir:",
    "english": "Allah's Messenger (ﷺ) forbade the use of (certain) containers, but the Ansar said, \"We cannot dispense with \nthem.\" The Prophet (ﷺ) then said, \"If so, then use them.\"",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الظُّرُوفِ فَقَالَتِ الأَنْصَارُ إِنَّهُ لاَ بُدَّ لَنَا مِنْهَا‏.‏ قَالَ ‏\n\"‏ فَلاَ إِذًا ‏\"‏‏.‏ \nوَقَالَ خَلِيفَةُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرٍ بِهَذَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ بِهَذَا وَقَالَ فِيهِ لَمَّا نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْأَوْعِيَةِ",
    "reference": "Reference : Sahih al-Bukhari 5592In-book reference : Book 74, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5593,
    "id": 5593,
    "url": "https://sunnah.com/bukhari:5593",
    "bookNumber": 74,
    "hadithNumber": 19,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "When the Prophet (ﷺ) forbade the use of certain containers (that were used for preparing alcoholic drinks), \nsomebody said to the Prophet (ﷺ) . \"But not all the people can find skins.\" So he allowed them to use clay \njars not covered with pitch.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ بْنِ أَبِي مُسْلِمٍ الأَحْوَلِ، عَنْ مُجَاهِدٍ، عَنْ أَبِي عِيَاضٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لَمَّا نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الأَسْقِيَةِ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم لَيْسَ كُلُّ النَّاسِ يَجِدُ سِقَاءً فَرَخَّصَ لَهُمْ فِي الْجَرِّ غَيْرِ الْمُزَفَّتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5593In-book reference : Book 74, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 497   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5594,
    "id": 5594,
    "url": "https://sunnah.com/bukhari:5594",
    "bookNumber": 74,
    "hadithNumber": 20,
    "narrator": "Narrated `Ali:",
    "english": "the Prophet (ﷺ) forbade the use of Ad-Dubba' and Al Muzaffat.\n\nA'mash also narrated this.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي سُلَيْمَانُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ‏.‏\nحَدَّثَنَا عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنِ الأَعْمَشِ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5594In-book reference : Book 74, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 498   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5595,
    "id": 5595,
    "url": "https://sunnah.com/bukhari:5595",
    "bookNumber": 74,
    "hadithNumber": 21,
    "narrator": "Narrated Ibrahim:",
    "english": "I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is \ndisliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! \nWhat containers did the Prophet (ﷺ) forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The \nProphet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I \nasked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you \nwhat I have not heard?' \"",
    "arabic": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، قُلْتُ لِلأَسْوَدِ هَلْ سَأَلْتَ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ عَمَّا يُكْرَهُ أَنْ يُنْتَبَذَ فِيهِ فَقَالَ نَعَمْ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ عَمَّا نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُنْتَبَذَ فِيهِ قَالَتْ نَهَانَا فِي ذَلِكَ أَهْلَ الْبَيْتِ أَنْ نَنْتَبِذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ‏.‏ قُلْتُ أَمَا ذَكَرْتِ الْجَرَّ وَالْحَنْتَمَ قَالَ إِنَّمَا أُحَدِّثُكَ مَا سَمِعْتُ، أَفَأُحَدِّثُ مَا لَمْ أَسْمَعْ",
    "reference": "Reference : Sahih al-Bukhari 5595In-book reference : Book 74, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 500   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5596,
    "id": 5596,
    "url": "https://sunnah.com/bukhari:5596",
    "bookNumber": 74,
    "hadithNumber": 22,
    "narrator": "Narrated Ash-Shaibani:",
    "english": "I heard `Abdullah bin Abi `Aufa saying, \"The Prophet (ﷺ) forbade the use of green jars.\" I said, \"Shall we \ndrink out of white jars?\" He said, \"No.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الْجَرِّ الأَخْضَرِ‏.‏ قُلْتُ أَنَشْرَبُ فِي الأَبْيَضِ قَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5596In-book reference : Book 74, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 501   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5597,
    "id": 5597,
    "url": "https://sunnah.com/bukhari:5597",
    "bookNumber": 74,
    "hadithNumber": 23,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "Abu Usaid As Sa`idi invited the Prophet (ﷺ) to his wedding banquet. At that time his wife was serving \nthem and she was the bride. She said, ''Do you know what (kind of syrup) I soaked (made) for Allah's \nApostle? I soaked some dates in water in a Tur (bowl) overnight. '",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ السَّاعِدِيَّ، دَعَا النَّبِيَّ صلى الله عليه وسلم لِعُرْسِهِ، فَكَانَتِ امْرَأَتُهُ خَادِمَهُمْ يَوْمَئِذٍ وَهْىَ الْعَرُوسُ‏.‏ فَقَالَتْ مَا تَدْرُونَ مَا أَنْقَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنْقَعْتُ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ فِي تَوْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5597In-book reference : Book 74, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 502   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5598,
    "id": 5598,
    "url": "https://sunnah.com/bukhari:5598",
    "bookNumber": 74,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Al-Juwairiyya:",
    "english": "I asked Ibn `Abbas about Al-Badhaq. He said, \"Muhammad prohibited alcoholic drinks before It was \ncalled Al-Badhaq (by saying), 'Any drink that intoxicates is unlawful.' I said, 'What about good lawful \ndrinks?' He said,'Apart from what is lawful and good, all other things are unlawful and not good \n(unclean Al-Khabith).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي الْجُوَيْرِيَةِ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الْبَاذَقِ،‏.‏ فَقَالَ سَبَقَ مُحَمَّدٌ صلى الله عليه وسلم الْبَاذَقَ، فَمَا أَسْكَرَ فَهْوَ حَرَامٌ‏.‏ قَالَ الشَّرَابُ الْحَلاَلُ الطَّيِّبُ‏.‏ قَالَ لَيْسَ بَعْدَ الْحَلاَلِ الطَّيِّبِ إِلاَّ الْحَرَامُ الْخَبِيثُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5598In-book reference : Book 74, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 503   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5599,
    "id": 5599,
    "url": "https://sunnah.com/bukhari:5599",
    "bookNumber": 74,
    "hadithNumber": 25,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to like sweet edible things and honey.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5599In-book reference : Book 74, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 504   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5600,
    "id": 5600,
    "url": "https://sunnah.com/bukhari:5600",
    "bookNumber": 74,
    "hadithNumber": 26,
    "narrator": "Narrated Anas:",
    "english": "While I was serving Abu Talha. Abu Dujana and Abu Suhail bin Al-Baida' with a drink made from a \nmixture of unripe and ripe dates, alcoholic drinks, were made unlawful, whereupon I threw it away, \nand I was their butler and the youngest of them, and we used to consider that drink as an alcoholic \ndrink in those days.",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ إِنِّي لأَسْقِي أَبَا طَلْحَةَ وَأَبَا دُجَانَةَ وَسُهَيْلَ ابْنَ الْبَيْضَاءِ خَلِيطَ بُسْرٍ وَتَمْرٍ إِذْ حُرِّمَتِ الْخَمْرُ، فَقَذَفْتُهَا وَأَنَا سَاقِيهِمْ وَأَصْغَرُهُمْ، وَإِنَّا نَعُدُّهَا يَوْمَئِذٍ الْخَمْرَ‏.‏ وَقَالَ عَمْرُو بْنُ الْحَارِثِ حَدَّثَنَا قَتَادَةُ سَمِعَ أَنَسًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5600In-book reference : Book 74, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 505   (deprecated numbering scheme)"
  }
]