[
  {
    "hadithGlobalNumber": 2201,
    "id": 2201,
    "url": "https://sunnah.com/bukhari:2201",
    "bookNumber": 34,
    "hadithNumber": 148,
    "narrator": "Narrated Abu Sa`id Al-Khudri and Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) appointed somebody as a governor of Khaibar. That governor brought to him an \nexcellent kind of dates (from Khaibar). The Prophet (ﷺ) asked, \"Are all the dates of Khaibar like this?\" He \nreplied, \"By Allah, no, O Allah's Messenger (ﷺ)! But we barter one Sa of this (type of dates) for two Sas of \ndates of ours and two Sas of it for three of ours.\" Allah's Messenger (ﷺ) said, \"Do not do so (as that is a kind \nof usury) but sell the mixed dates (of inferior quality) for money, and then buy good dates with that \nmoney.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ، فَجَاءَهُ بِتَمْرٍ جَنِيبٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ، إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ، وَالصَّاعَيْنِ بِالثَّلاَثَةِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ، بِعِ الْجَمْعَ بِالدَّرَاهِمِ، ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2201, 2202In-book reference : Book 34, Hadith 148USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 405   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2202,
    "id": 2202,
    "url": "https://sunnah.com/bukhari:2202",
    "bookNumber": 34,
    "hadithNumber": 148,
    "narrator": "Narrated Abu Sa`id Al-Khudri and Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) appointed somebody as a governor of Khaibar. That governor brought to him an \nexcellent kind of dates (from Khaibar). The Prophet (ﷺ) asked, \"Are all the dates of Khaibar like this?\" He \nreplied, \"By Allah, no, O Allah's Messenger (ﷺ)! But we barter one Sa of this (type of dates) for two Sas of \ndates of ours and two Sas of it for three of ours.\" Allah's Messenger (ﷺ) said, \"Do not do so (as that is a kind \nof usury) but sell the mixed dates (of inferior quality) for money, and then buy good dates with that \nmoney.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ، فَجَاءَهُ بِتَمْرٍ جَنِيبٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ، إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ، وَالصَّاعَيْنِ بِالثَّلاَثَةِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ، بِعِ الْجَمْعَ بِالدَّرَاهِمِ، ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2201, 2202In-book reference : Book 34, Hadith 148USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 405   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2203,
    "id": 2203,
    "url": "https://sunnah.com/bukhari:2203",
    "bookNumber": 34,
    "hadithNumber": 149,
    "narrator": "Narrated Nafi', the freed slave of Ibn 'Umar:",
    "english": "If pollinated date-palms are sold and nothing is mentioned (in the contract) about their fruits, the fruits will go to the person who has pollinated them, and so will be the case with the slave and the cultivator. Nafi' mentioned those three things.",
    "arabic": "قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ لِي إِبْرَاهِيمُ أَخْبَرَنَا هِشَامٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يُخْبِرُ عَنْ نَافِعٍ، مَوْلَى ابْنِ عُمَرَ أَنَّ أَيُّمَا، نَخْلٍ بِيعَتْ قَدْ أُبِّرَتْ لَمْ يُذْكَرِ الثَّمَرُ، فَالثَّمَرُ لِلَّذِي أَبَّرَهَا، وَكَذَلِكَ الْعَبْدُ وَالْحَرْثُ‏.‏ سَمَّى لَهُ نَافِعٌ هَؤُلاَءِ الثَّلاَثَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2203In-book reference : Book 34, Hadith 149USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 406   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2204,
    "id": 2204,
    "url": "https://sunnah.com/bukhari:2204",
    "bookNumber": 34,
    "hadithNumber": 150,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"If somebody sells pollinated date palms, the fruits will be for the seller unless \nthe buyer stipulates that they will be for himself (and the seller agrees).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرُهَا لِلْبَائِعِ، إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2204In-book reference : Book 34, Hadith 150USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 406   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2205,
    "id": 2205,
    "url": "https://sunnah.com/bukhari:2205",
    "bookNumber": 34,
    "hadithNumber": 151,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) forbade Al-Muzabana, i.e. to sell ungathered dates of one's garden for measured dried \ndates or fresh ungathered grapes for measured dried grapes; or standing crops for measured quantity \nof foodstuff. He forbade all such bargains.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ إِنْ كَانَ نَخْلاً بِتَمْرٍ كَيْلاً، وَإِنْ كَانَ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً أَوْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ، وَنَهَى عَنْ ذَلِكَ كُلِّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2205In-book reference : Book 34, Hadith 151USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 407   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2206,
    "id": 2206,
    "url": "https://sunnah.com/bukhari:2206",
    "bookNumber": 34,
    "hadithNumber": 152,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"Whoever pollinates date palms and then sells them, the fruits will belong to him \nunless the buyer stipulates that the fruits should belong to him (and the seller agrees).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا امْرِئٍ أَبَّرَ نَخْلاً ثُمَّ بَاعَ أَصْلَهَا، فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ، إِلاَّ أَنْ يَشْتَرِطَهُ الْمُبْتَاعُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2206In-book reference : Book 34, Hadith 152USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 408   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2207,
    "id": 2207,
    "url": "https://sunnah.com/bukhari:2207",
    "bookNumber": 34,
    "hadithNumber": 153,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) forbade Muhaqala, Mukhadara, Mulamasa, Munabadha and Muzabana. (See glossary \nand previous Hadiths for the meanings of these terms.)",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ وَهْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِسْحَاقُ بْنُ أَبِي طَلْحَةَ الأَنْصَارِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ، وَالْمُخَاضَرَةِ، وَالْمُلاَمَسَةِ، وَالْمُنَابَذَةِ، وَالْمُزَابَنَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2207In-book reference : Book 34, Hadith 153USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 409   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2208,
    "id": 2208,
    "url": "https://sunnah.com/bukhari:2208",
    "bookNumber": 34,
    "hadithNumber": 154,
    "narrator": "Narrated Humaid:",
    "english": "Anas said, \"The Prophet (ﷺ) forbade the selling of dates till they were almost ripe.\" We asked Anas, \n\"What does 'almost ripe' mean?\" He replied, \"They get red and yellow. The Prophet (ﷺ) added, 'If Allah \ndestroyed the fruits present on the trees, what right would the seller have to take the money of his \nbrother (somebody else)?' \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ ثَمَرِ التَّمْرِ حَتَّى تَزْهُوَ‏.‏ فَقُلْنَا لأَنَسٍ مَا زَهْوُهَا قَالَ تَحْمَرُّ وَتَصْفَرُّ، أَرَأَيْتَ إِنْ مَنَعَ اللَّهُ الثَّمَرَةَ بِمَ تَسْتَحِلُّ مَالَ أَخِيكَ",
    "reference": "Reference : Sahih al-Bukhari 2208In-book reference : Book 34, Hadith 154USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 410   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2209,
    "id": 2209,
    "url": "https://sunnah.com/bukhari:2209",
    "bookNumber": 34,
    "hadithNumber": 155,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I was with the Prophet (ﷺ) while he was eating fresh dates. He said, \"From the trees there is a tree which \nresembles a faithful believer.\" I wanted to say that it was the date palm, but I was the youngest among \nthem (so I kept quiet). He added, \"It is the date palm.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ يَأْكُلُ جُمَّارًا، فَقَالَ ‏\"‏ مِنَ الشَّجَرِ شَجَرَةٌ كَالرَّجُلِ الْمُؤْمِنِ ‏\"‏‏.‏ فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ‏.‏ فَإِذَا أَنَا أَحْدَثُهُمْ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2209In-book reference : Book 34, Hadith 155USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 411   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2210,
    "id": 2210,
    "url": "https://sunnah.com/bukhari:2210",
    "bookNumber": 34,
    "hadithNumber": 156,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Taiba cupped Allah's Messenger (ﷺ) and so Allah's Messenger (ﷺ) ordered that a Sa of dates be paid to him and \nordered his masters (for he was a slave) to reduce his tax.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ حَجَمَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَبُو طَيْبَةَ، فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَاعٍ مِنْ تَمْرٍ، وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2210In-book reference : Book 34, Hadith 156USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 412   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2211,
    "id": 2211,
    "url": "https://sunnah.com/bukhari:2211",
    "bookNumber": 34,
    "hadithNumber": 157,
    "narrator": "Narrated `Aisha:",
    "english": "Hind, the mother of Mu'awiya said to Allah's Messenger (ﷺ), \"Abu Sufyan (her husband) is a miser. Am I \nallowed to take from his money secretly?\" The Prophet (ﷺ) said to her, \"You and your sons may take what \nis sufficient reasonably and fairly.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هِنْدٌ أُمُّ مُعَاوِيَةَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، فَهَلْ عَلَىَّ جُنَاحٌ أَنْ آخُذَ مِنْ مَالِهِ سِرًّا قَالَ ‏\n\"‏ خُذِي أَنْتِ وَبَنُوكِ مَا يَكْفِيكِ بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2211In-book reference : Book 34, Hadith 157USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 413   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2212,
    "id": 2212,
    "url": "https://sunnah.com/bukhari:2212",
    "bookNumber": 34,
    "hadithNumber": 158,
    "narrator": "Narrated Hisham bin `Urwa from his father:",
    "english": "who heard Aisha saying, \"The Holy Verse; 'Whoever amongst the guardians is rich, he should take no \nwages (from the property of the orphans) but If he is poor, let him have for himself what is just and \nreasonable (according to his labors)' (4.6) was revealed concerning the guardian of the orphans who \nlooks after them and manages favorably their financial affairs; If the guardian Is poor, he could have \nfrom It what Is just and reasonable, (according to his labors).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا ابْنُ نُمَيْرٍ، أَخْبَرَنَا هِشَامٌ، وَحَدَّثَنِي مُحَمَّدٌ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ فَرْقَدٍ، قَالَ سَمِعْتُ هِشَامَ بْنَ عُرْوَةَ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ ‏{‏وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏ أُنْزِلَتْ فِي وَالِي الْيَتِيمِ الَّذِي يُقِيمُ عَلَيْهِ، وَيُصْلِحُ فِي مَالِهِ، إِنْ كَانَ فَقِيرًا أَكَلَ مِنْهُ بِالْمَعْرُوفِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2212In-book reference : Book 34, Hadith 158USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 414   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2213,
    "id": 2213,
    "url": "https://sunnah.com/bukhari:2213",
    "bookNumber": 34,
    "hadithNumber": 159,
    "narrator": "Narrated Jabir:",
    "english": "Allah's Messenger (ﷺ) gave preemption (to the partner) in every joint property, but if the boundaries of the \nproperty were demarcated or the ways and streets were fixed, then there was no pre-emption.",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ ـ رضى الله عنه ـ جَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَالٍ لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2213In-book reference : Book 34, Hadith 159USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 415   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2214,
    "id": 2214,
    "url": "https://sunnah.com/bukhari:2214",
    "bookNumber": 34,
    "hadithNumber": 160,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) decided the validity of preemption in every joint undivided property, but if the \nboundaries were well marked or the ways and streets were fixed, then there was no pre-emption.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَالٍ لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2214In-book reference : Book 34, Hadith 160USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 416   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2215,
    "id": 2215,
    "url": "https://sunnah.com/bukhari:2215",
    "bookNumber": 34,
    "hadithNumber": 162,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"While three persons were walking, rain began to fall and they had to enter a cave in \na mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, \n'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them \nsaid, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I \nwould milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk \nfrom it, I would give it to my children, family and wife. One day I was delayed and on my return I \nfound my parents sleeping, and I disliked to wake them up. The children were crying at my feet \n(because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did \nit for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a \nbit. \nThe second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a \nman may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her \none-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I \nsat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except \nrightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, \nkindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! \nNo doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I \nwanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a \nshepherd. After a time that man came and demanded his money. I said to him: Go to those cows and \nthe shepherd and take them for they are for you. He asked me whether I was joking with him. I told \nhim that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it \nsincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the \nmouth of the cave.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَرَجَ ثَلاَثَةٌ يَمْشُونَ فَأَصَابَهُمُ الْمَطَرُ، فَدَخَلُوا فِي غَارٍ فِي جَبَلٍ، فَانْحَطَّتْ عَلَيْهِمْ صَخْرَةٌ‏.‏ قَالَ فَقَالَ بَعْضُهُمْ لِبَعْضٍ ادْعُوا اللَّهَ بِأَفْضَلِ عَمَلٍ عَمِلْتُمُوهُ‏.‏ فَقَالَ أَحَدُهُمُ اللَّهُمَّ، إِنِّي كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، فَكُنْتُ أَخْرُجُ فَأَرْعَى، ثُمَّ أَجِيءُ فَأَحْلُبُ، فَأَجِيءُ بِالْحِلاَبِ فَآتِي بِهِ أَبَوَىَّ فَيَشْرَبَانِ، ثُمَّ أَسْقِي الصِّبْيَةَ وَأَهْلِي وَامْرَأَتِي، فَاحْتَبَسْتُ لَيْلَةً‏.‏ فَجِئْتُ فَإِذَا هُمَا نَائِمَانِ ـ قَالَ ـ فَكَرِهْتُ أَنْ أُوقِظَهُمَا، وَالصِّبِيْةُ يَتَضَاغَوْنَ عِنْدَ رِجْلَىَّ، فَلَمْ يَزَلْ ذَلِكَ دَأْبِي وَدَأْبَهُمَا، حَتَّى طَلَعَ الْفَجْرُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا فُرْجَةً نَرَى مِنْهَا السَّمَاءَ‏.‏ قَالَ فَفُرِجَ عَنْهُمْ‏.‏ وَقَالَ الآخَرُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنِّي كُنْتُ أُحِبُّ امْرَأَةً مِنْ بَنَاتِ عَمِّي كَأَشَدِّ مَا يُحِبُّ الرَّجُلُ النِّسَاءَ، فَقَالَتْ لاَ تَنَالُ ذَلِكَ مِنْهَا حَتَّى تُعْطِيَهَا مِائَةَ دِينَارٍ‏.‏ فَسَعَيْتُ فِيهَا حَتَّى جَمَعْتُهَا، فَلَمَّا قَعَدْتُ بَيْنَ رِجْلَيْهَا قَالَتِ اتَّقِ اللَّهَ، وَلاَ تَفُضَّ الْخَاتَمَ إِلاَّ بِحَقِّهِ‏.‏ فَقُمْتُ وَتَرَكْتُهَا، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا فُرْجَةً، قَالَ فَفَرَجَ عَنْهُمُ الثُّلُثَيْنِ‏.‏ وَقَالَ الآخَرُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنِّي اسْتَأْجَرْتُ أَجِيرًا بِفَرَقٍ مِنْ ذُرَةٍ فَأَعْطَيْتُهُ، وَأَبَى ذَاكَ أَنْ يَأْخُذَ، فَعَمَدْتُ إِلَى ذَلِكَ الْفَرَقِ، فَزَرَعْتُهُ حَتَّى اشْتَرَيْتُ مِنْهُ بَقَرًا وَرَاعِيَهَا، ثُمَّ جَاءَ فَقَالَ يَا عَبْدَ اللَّهِ أَعْطِنِي حَقِّي‏.‏ فَقُلْتُ انْطَلِقْ إِلَى تِلْكَ الْبَقَرِ وَرَاعِيهَا، فَإِنَّهَا لَكَ‏.‏ فَقَالَ أَتَسْتَهْزِئُ بِي‏.‏ قَالَ فَقُلْتُ مَا أَسْتَهْزِئُ بِكَ وَلَكِنَّهَا لَكَ‏.‏ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا‏.‏ فَكُشِفَ عَنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2215In-book reference : Book 34, Hadith 162USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 418   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2216,
    "id": 2216,
    "url": "https://sunnah.com/bukhari:2216",
    "bookNumber": 34,
    "hadithNumber": 163,
    "narrator": "Narrated `Abdur-Rahman bin Abu Bakr:",
    "english": "We were with the Prophet (ﷺ) when a tall pagan with long matted unkempt hair came driving his sheep. \nThe Prophet (ﷺ) asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" \nThe Prophet (ﷺ) bought one sheep from him.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ بَيْعًا أَمْ عَطِيَّةً أَوْ قَالَ أَمْ هِبَةً ‏\"‏‏.‏ قَالَ لاَ بَلْ بَيْعٌ‏.‏ فَاشْتَرَى مِنْهُ شَاةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2216In-book reference : Book 34, Hadith 163USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 419   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2217,
    "id": 2217,
    "url": "https://sunnah.com/bukhari:2217",
    "bookNumber": 34,
    "hadithNumber": 164,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Prophet (ﷺ) Abraham emigrated with Sarah and entered a village where there was \na king or a tyrant. (The king) was told that Abraham had entered (the village) accompanied by a \nwoman who was one of the most charming women. So, the king sent for Abraham and asked, 'O \nAbraham! Who is this lady accompanying you?' Abraham replied, 'She is my sister (i.e. in religion).' \nThen Abraham returned to her and said, 'Do not contradict my statement, for I have informed them \nthat you are my sister. By Allah, there are no true believers on this land except you and 1.' Then \nAbraham sent her to the king. When the king got to her, she got up and performed ablution, prayed \nand said, 'O Allah! If I have believed in You and Your Apostle, and have saved my private parts from \neverybody except my husband, then please do not let this pagan overpower me.' On that the king fell \nin a mood of agitation and started moving his legs. Seeing the condition of the king, Sarah said, 'O \nAllah! If he should die, the people will say that I have killed him.' The king regained his power, and \nproceeded towards her but she got up again and performed ablution, prayed and said, 'O Allah! If I \nhave believed in You and Your Apostle and have kept my private parts safe from all except my \nhusband, then please do not let this pagan overpower me.' The king again fell in a mood of agitation \nand started moving his legs. On seeing that state of the king, Sarah said, 'O Allah! If he should die, the \npeople will say that I have killed him.' The king got either two or three attacks, and after recovering \nfrom the last attack he said, 'By Allah! You have sent a satan to me. Take her to Abraham and give her \nAjar.' So she came back to Abraham and said, 'Allah humiliated the pagan and gave us a slave-girl for \nservice.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ هَاجَرَ إِبْرَاهِيمُ ـ عَلَيْهِ السَّلاَمُ ـ بِسَارَةَ، فَدَخَلَ بِهَا قَرْيَةً فِيهَا مَلِكٌ مِنَ الْمُلُوكِ، أَوْ جَبَّارٌ مِنَ الْجَبَابِرَةِ، فَقِيلَ دَخَلَ إِبْرَاهِيمُ بِامْرَأَةٍ، هِيَ مِنْ أَحْسَنِ النِّسَاءِ‏.‏ فَأَرْسَلَ إِلَيْهِ أَنْ يَا إِبْرَاهِيمُ، مَنْ هَذِهِ الَّتِي مَعَكَ قَالَ أُخْتِي‏.‏ ثُمَّ رَجَعَ إِلَيْهَا، فَقَالَ لاَ تُكَذِّبِي حَدِيثِي فَإِنِّي أَخْبَرْتُهُمْ أَنَّكِ أُخْتِي، وَاللَّهِ إِنْ عَلَى الأَرْضِ مُؤْمِنٌ غَيْرِي وَغَيْرُكِ‏.‏ فَأَرْسَلَ بِهَا إِلَيْهِ، فَقَامَ إِلَيْهَا، فَقَامَتْ تَوَضَّأُ وَتُصَلِّي فَقَالَتِ اللَّهُمَّ إِنْ كُنْتُ آمَنْتُ بِكَ وَبِرَسُولِكَ وَأَحْصَنْتُ فَرْجِي، إِلاَّ عَلَى زَوْجِي فَلاَ تُسَلِّطْ عَلَىَّ الْكَافِرَ‏.‏ فَغُطَّ حَتَّى رَكَضَ بِرِجْلِهِ ‏\"‏‏.‏ قَالَ الأَعْرَجُ قَالَ أَبُو سَلَمَةَ بْنُ عَبْدُ الرَّحْمَنِ إِنَّ أَبَا هُرَيْرَةَ قَالَ قَالَتِ اللَّهُمَّ إِنْ يَمُتْ يُقَالُ هِيَ قَتَلَتْهُ‏.‏ فَأُرْسِلَ ثُمَّ قَامَ إِلَيْهَا، فَقَامَتْ تَوَضَّأُ تُصَلِّي، وَتَقُولُ اللَّهُمَّ إِنْ كُنْتُ آمَنْتُ بِكَ وَبِرَسُولِكَ، وَأَحْصَنْتُ فَرْجِي، إِلاَّ عَلَى زَوْجِي، فَلاَ تُسَلِّطْ عَلَىَّ هَذَا الْكَافِرَ، فَغُطَّ حَتَّى رَكَضَ بِرِجْلِهِ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ قَالَ أَبُو سَلَمَةَ قَالَ أَبُو هُرَيْرَةَ فَقَالَتِ اللَّهُمَّ إِنْ يَمُتْ فَيُقَالُ هِيَ قَتَلَتْهُ، فَأُرْسِلَ فِي الثَّانِيَةِ، أَوْ فِي الثَّالِثَةِ، فَقَالَ وَاللَّهِ مَا أَرْسَلْتُمْ إِلَىَّ إِلاَّ شَيْطَانًا، ارْجِعُوهَا إِلَى إِبْرَاهِيمَ، وَأَعْطُوهَا آجَرَ‏.‏ فَرَجَعَتْ إِلَى إِبْرَاهِيمَ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَتْ أَشَعَرْتَ أَنَّ اللَّهَ كَبَتَ الْكَافِرَ وَأَخْدَمَ وَلِيدَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2217In-book reference : Book 34, Hadith 164USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 420   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2218,
    "id": 2218,
    "url": "https://sunnah.com/bukhari:2218",
    "bookNumber": 34,
    "hadithNumber": 165,
    "narrator": "Narrated `Aisha:",
    "english": "Sa`d bin Abi Waqqas and 'Abu bin Zam`a quarreled over a boy. Sa`d said, \"O Allah's Messenger (ﷺ)! This \nboy is the son of my brother (`Utba bin Abi Waqqas) who took a promise from me that I would take \nhim as he was his (illegal) son. Look at him and see whom he resembles.\" 'Abu bin Zam`a said, \"O \nAllah's Messenger (ﷺ)! This is my brother and was born on my father's bed from his slave-girl.\" Allah's \nApostle cast a look at the boy and found definite resemblance to `Utba and then said, \"The boy is for \nyou, O 'Abu bin Zam`a. The child goes to the owner of the bed and the adulterer gets nothing but the \nstones (despair, i.e. to be stoned to death). Then the Prophet (ﷺ) said, \"O Sauda bint Zama! Screen \nyourself from this boy.\" So, Sauda never saw him again.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ، فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ، عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِي يَا رَسُولَ اللَّهِ وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ، فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ، فَقَالَ ‏\n\"‏ هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ فَلَمْ تَرَهُ سَوْدَةُ قَطُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2218In-book reference : Book 34, Hadith 165USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 421   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2219,
    "id": 2219,
    "url": "https://sunnah.com/bukhari:2219",
    "bookNumber": 34,
    "hadithNumber": 166,
    "narrator": "Narrated Sa`d that his father said:",
    "english": "`Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other \nthan your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of \nmoney, but I say I was kidnapped in my childhood.' \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ أَبِيهِ، قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ لِصُهَيْبٍ اتَّقِ اللَّهَ وَلاَ تَدَّعِ إِلَى غَيْرِ أَبِيكَ‏.‏ فَقَالَ صُهَيْبٌ مَا يَسُرُّنِي أَنَّ لِي كَذَا وَكَذَا، وَأَنِّي قُلْتُ ذَلِكَ، وَلَكِنِّي سُرِقْتُ وَأَنَا صَبِيٌّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2219In-book reference : Book 34, Hadith 166USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 422   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2220,
    "id": 2220,
    "url": "https://sunnah.com/bukhari:2220",
    "bookNumber": 34,
    "hadithNumber": 167,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "Hakim bin Hizam said, \"O Allah's Messenger (ﷺ)! I used to do good deeds in the Pre-Islamic period of \nIgnorance, e.g., keeping good relations with my Kith and kin, manumitting slaves and giving alms. \nShall I receive a reward for all that?\" Allah's Messenger (ﷺ) replied, \"You embraced Islam with all the good \ndeeds which you did in the past.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، أَخْبَرَهُ أَنَّهُ، قَالَ يَا رَسُولَ اللَّهِ، أَرَأَيْتَ أُمُورًا كُنْتُ أَتَحَنَّثُ ـ أَوْ أَتَحَنَّتُ بِهَا ـ فِي الْجَاهِلِيَّةِ مِنْ صِلَةٍ وَعَتَاقَةٍ وَصَدَقَةٍ، هَلْ لِي فِيهَا أَجْرٌ قَالَ حَكِيمٌ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَسْلَمْتَ عَلَى مَا سَلَفَ لَكَ مِنْ خَيْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2220In-book reference : Book 34, Hadith 167USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 423   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2221,
    "id": 2221,
    "url": "https://sunnah.com/bukhari:2221",
    "bookNumber": 34,
    "hadithNumber": 168,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Once Allah's Messenger (ﷺ) passed by a dead sheep and said to the people, \"Wouldn't you benefit by its \nskin?\" The people replied that it was dead. The Prophet (ﷺ) said, \"But its eating only is illegal.\"",
    "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِشَاةٍ مَيِّتَةٍ فَقَالَ ‏\"‏ هَلاَّ اسْتَمْتَعْتُمْ بِإِهَابِهَا ‏\"‏‏.‏ قَالُوا إِنَّهَا مَيِّتَةٌ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2221In-book reference : Book 34, Hadith 168USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 424   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2222,
    "id": 2222,
    "url": "https://sunnah.com/bukhari:2222",
    "bookNumber": 34,
    "hadithNumber": 169,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, son of Mary (Jesus) will shortly descend \namongst you people (Muslims) as a just ruler and will break the Cross and kill the pig and abolish the \nJizya (a tax taken from the non-Muslims, who are in the protection, of the Muslim government). Then \nthere will be abundance of money and nobody will accept charitable gifts.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمُ ابْنُ مَرْيَمَ حَكَمًا مُقْسِطًا فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الْخِنْزِيرَ، وَيَضَعَ الْجِزْيَةَ، وَيَفِيضَ الْمَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2222In-book reference : Book 34, Hadith 169USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 425   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2223,
    "id": 2223,
    "url": "https://sunnah.com/bukhari:2223",
    "bookNumber": 34,
    "hadithNumber": 170,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once `Umar was informed that a certain man sold alcohol. `Umar said, \"May Allah curse him! \nDoesn't he know that Allah's Messenger (ﷺ) said, 'May Allah curse the Jews, for Allah had forbidden them to \neat the fat of animals but they melted it and sold it.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ أَخْبَرَنِي طَاوُسٌ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ بَلَغَ عُمَرَ أَنَّ فُلاَنًا بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ فُلاَنًا، أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ، حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2223In-book reference : Book 34, Hadith 170USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 426   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2224,
    "id": 2224,
    "url": "https://sunnah.com/bukhari:2224",
    "bookNumber": 34,
    "hadithNumber": 171,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"May Allah curse the Jews, because Allah made fat illegal for them but they sold \nit and ate its price. \"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ يَهُودًا حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَبَاعُوهَا، وَأَكَلُوا أَثْمَانَهَا ‏\"‏‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ  قَاتَلَهُمْ اللَّهُ  لَعَنَهُمْ  قُتِلَ  لُعِنَ  الْخَرَّاصُونَ  الْكَذَّابُونَ",
    "reference": "Reference : Sahih al-Bukhari 2224In-book reference : Book 34, Hadith 171USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 427   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2225,
    "id": 2225,
    "url": "https://sunnah.com/bukhari:2225",
    "bookNumber": 34,
    "hadithNumber": 172,
    "narrator": "Narrated Sa`id bin Abu Al-Hasan:",
    "english": "While I was with Ibn `Abbas a man came and said, \"O father of `Abbas! My sustenance is from my \nmanual profession and I make these pictures.\" Ibn `Abbas said, \"I will tell you only what I heard from \nAllah's Messenger (ﷺ) . I heard him saying, 'Whoever makes a picture will be punished by Allah till he puts \nlife in it, and he will never be able to put life in it.' \" Hearing this, that man heaved a sigh and his face \nturned pale. Ibn `Abbas said to him, \"What a pity! If you insist on making pictures I advise you to \nmake pictures of trees and any other unanimated objects.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا عَوْفٌ، عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ إِذْ أَتَاهُ رَجُلٌ فَقَالَ يَا أَبَا عَبَّاسٍ إِنِّي إِنْسَانٌ، إِنَّمَا مَعِيشَتِي مِنْ صَنْعَةِ يَدِي، وَإِنِّي أَصْنَعُ هَذِهِ التَّصَاوِيرَ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ أُحَدِّثُكَ إِلاَّ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ سَمِعْتُهُ يَقُولُ ‏\n\"‏ مَنْ صَوَّرَ صُورَةً فَإِنَّ اللَّهَ مُعَذِّبُهُ، حَتَّى يَنْفُخَ فِيهَا الرُّوحَ، وَلَيْسَ بِنَافِخٍ فِيهَا أَبَدًا ‏\"‏‏.‏ فَرَبَا الرَّجُلُ رَبْوَةً شَدِيدَةً وَاصْفَرَّ وَجْهُهُ‏.‏ فَقَالَ وَيْحَكَ إِنْ أَبَيْتَ إِلاَّ أَنْ تَصْنَعَ، فَعَلَيْكَ بِهَذَا الشَّجَرِ، كُلِّ شَىْءٍ لَيْسَ فِيهِ رُوحٌ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ سَمِعَ سَعِيدُ بْنُ أَبِي عَرُوبَةَ مِنَ النَّضْرِ بْنِ أَنَسٍ هَذَا الْوَاحِدَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2225In-book reference : Book 34, Hadith 172USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 428   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2226,
    "id": 2226,
    "url": "https://sunnah.com/bukhari:2226",
    "bookNumber": 34,
    "hadithNumber": 173,
    "narrator": "Narrated `Aisha:",
    "english": "When the last verses of Surat-al-Baqara were revealed, the Prophet (ﷺ) went out (of his house to the \nMosque) and said, \"The trade of alcohol has become illegal.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ لَمَّا نَزَلَتْ آيَاتُ سُورَةِ الْبَقَرَةِ عَنْ آخِرِهَا خَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ حُرِّمَتِ التِّجَارَةُ فِي الْخَمْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2226In-book reference : Book 34, Hadith 173USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 429   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2227,
    "id": 2227,
    "url": "https://sunnah.com/bukhari:2227",
    "bookNumber": 34,
    "hadithNumber": 174,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah says, 'I will be against three persons on the Day of Resurrection: \n-1. One who makes a covenant in My Name, but he proves treacherous. \n-2. One who sells a free person (as a slave) and eats the price, \n-3. And one who employs a laborer and gets the full work done by him but does not pay him his \nwages.' \"",
    "arabic": "حَدَّثَنِي بِشْرُ بْنُ مَرْحُومٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ ثَلاَثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ، رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ، وَلَمْ يُعْطِ أَجْرَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2227In-book reference : Book 34, Hadith 174USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2228,
    "id": 2228,
    "url": "https://sunnah.com/bukhari:2228",
    "bookNumber": 34,
    "hadithNumber": 175,
    "narrator": "Narrated Anas:",
    "english": "Amongst the captives was Safiya. First she was given to Dihya Al-Kalbi and then to the Prophet.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ فِي السَّبْىِ صَفِيَّةُ، فَصَارَتْ إِلَى دَحْيَةَ الْكَلْبِيِّ، ثُمَّ صَارَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2228In-book reference : Book 34, Hadith 175USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 431   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2229,
    "id": 2229,
    "url": "https://sunnah.com/bukhari:2229",
    "bookNumber": 34,
    "hadithNumber": 176,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "that while he was sitting with Allah's Messenger (ﷺ) he said, \"O Allah's Messenger (ﷺ)! We get female captives as \nour share of booty, and we are interested in their prices, what is your opinion about coitus interrupt \nus?\" The Prophet (ﷺ) said, \"Do you really do that? It is better for you not to do it. No soul that which \nAllah has destined to exist, but will surely come into existence.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ مُحَيْرِيزٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ أَخْبَرَهُ أَنَّهُ، بَيْنَمَا هُوَ جَالِسٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ إِنَّا نُصِيبُ سَبْيًا، فَنُحِبُّ الأَثْمَانَ، فَكَيْفَ تَرَى فِي الْعَزْلِ فَقَالَ ‏\n\"‏ أَوَإِنَّكُمْ تَفْعَلُونَ ذَلِكَ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا ذَلِكُمْ، فَإِنَّهَا لَيْسَتْ نَسَمَةٌ كَتَبَ اللَّهُ أَنْ تَخْرُجَ إِلاَّ هِيَ خَارِجَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2229In-book reference : Book 34, Hadith 176USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2230,
    "id": 2230,
    "url": "https://sunnah.com/bukhari:2230",
    "bookNumber": 34,
    "hadithNumber": 177,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) sold a Mudabbar (on behalf of his master who was still living and in need of money).",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ بَاعَ النَّبِيُّ صلى الله عليه وسلم الْمُدَبَّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2230In-book reference : Book 34, Hadith 177USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 433   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2231,
    "id": 2231,
    "url": "https://sunnah.com/bukhari:2231",
    "bookNumber": 34,
    "hadithNumber": 178,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) sold a Mudabbar.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ بَاعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2231In-book reference : Book 34, Hadith 178USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2232,
    "id": 2232,
    "url": "https://sunnah.com/bukhari:2232",
    "bookNumber": 34,
    "hadithNumber": 179,
    "narrator": "Narrated Zaid bin Khalid and Abu Huraira:",
    "english": "that Allah's Messenger (ﷺ) was asked about an unmarried slave-girl who committed illegal sexual \nintercourse. They heard him saying, \"Flog her, and if she commits illegal sexual intercourse after that, \nflog her again, and on the third (or the fourth) offense, sell her.\"",
    "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ حَدَّثَ ابْنُ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ وَأَبَا هُرَيْرَةَ رضى الله عنهما أَخْبَرَاهُ أَنَّهُمَا، سَمِعَا رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنِ الأَمَةِ تَزْنِي وَلَمْ تُحْصَنْ قَالَ ‏\n\"‏ اجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ بِيعُوهَا بَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2232, 2233In-book reference : Book 34, Hadith 179USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2233,
    "id": 2233,
    "url": "https://sunnah.com/bukhari:2233",
    "bookNumber": 34,
    "hadithNumber": 179,
    "narrator": "Narrated Zaid bin Khalid and Abu Huraira:",
    "english": "that Allah's Messenger (ﷺ) was asked about an unmarried slave-girl who committed illegal sexual \nintercourse. They heard him saying, \"Flog her, and if she commits illegal sexual intercourse after that, \nflog her again, and on the third (or the fourth) offense, sell her.\"",
    "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ حَدَّثَ ابْنُ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ وَأَبَا هُرَيْرَةَ رضى الله عنهما أَخْبَرَاهُ أَنَّهُمَا، سَمِعَا رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنِ الأَمَةِ تَزْنِي وَلَمْ تُحْصَنْ قَالَ ‏\n\"‏ اجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ بِيعُوهَا بَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2232, 2233In-book reference : Book 34, Hadith 179USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2234,
    "id": 2234,
    "url": "https://sunnah.com/bukhari:2234",
    "bookNumber": 34,
    "hadithNumber": 180,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard the Prophet (ﷺ) saying, \"If a slave-girl of yours commits illegal sexual intercourse and her illegal \nsexual intercourse is proved, she should be lashed, and after that nobody should blame her, and if she \ncommits illegal sexual intercourse the second time, she should be lashed and nobody should blame her \nafter that, and if she does the offense for the third time and her illegal sexual intercourse is proved, she \nshould be sold even for a hair rope.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي اللَّيْثُ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ، فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الْحَدَّ، وَلاَ يُثَرِّبْ عَلَيْهَا، ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا الْحَدَّ وَلاَ يُثَرِّبْ، ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2234In-book reference : Book 34, Hadith 180USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 436   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2235,
    "id": 2235,
    "url": "https://sunnah.com/bukhari:2235",
    "bookNumber": 34,
    "hadithNumber": 181,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) came to Khaibar and when Allah made him victorious and he conquered the town by \nbreaking the enemy's defense, the beauty of Safiya bint Huyai bin Akhtab was mentioned to him and \nher husband had been killed while she was a bride. Allah's Messenger (ﷺ) selected her for himself and he set \nout in her company till he reached Sadd-ar-Rawha' where her menses were over and he married her. \nThen Hais (a kind of meal) was prepared and served on a small leather sheet (used for serving meals). \nAllah's Messenger (ﷺ) then said to me, \"Inform those who are around you (about the wedding banquet).\" So \nthat was the marriage banquet given by Allah's Messenger (ﷺ) for (his marriage with) Safiya. After that we \nproceeded to Medina and I saw that Allah's Messenger (ﷺ) was covering her with a cloak while she was \nbehind him. Then he would sit beside his camel and let Safiya put her feet on his knees to ride (the \ncamel).",
    "arabic": "حَدَّثَنَا عَبْدُ الْغَفَّارِ بْنُ دَاوُدَ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم خَيْبَرَ، فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْحِصْنَ ذُكِرَ لَهُ جَمَالُ صَفِيَّةَ بِنْتِ حُيَىِّ بْنِ أَخْطَبَ، وَقَدْ قُتِلَ زَوْجُهَا، وَكَانَتْ عَرُوسًا، فَاصْطَفَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ فَخَرَجَ بِهَا، حَتَّى بَلَغْنَا سَدَّ الرَّوْحَاءِ حَلَّتْ، فَبَنَى بِهَا، ثُمَّ صَنَعَ حَيْسًا فِي نِطَعٍ صَغِيرٍ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ آذِنْ مَنْ حَوْلَكَ ‏\"‏‏.‏ فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى صَفِيَّةَ، ثُمَّ خَرَجْنَا إِلَى الْمَدِينَةِ، قَالَ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُحَوِّي لَهَا وَرَاءَهُ بِعَبَاءَةٍ، ثُمَّ يَجْلِسُ عِنْدَ بَعِيرِهِ فَيَضَعُ رُكْبَتَهُ، فَتَضَعُ صَفِيَّةُ رِجْلَهَا عَلَى رُكْبَتِهِ، حَتَّى تَرْكَبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2235In-book reference : Book 34, Hadith 181USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 437   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2236,
    "id": 2236,
    "url": "https://sunnah.com/bukhari:2236",
    "bookNumber": 34,
    "hadithNumber": 182,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I heard Allah's Messenger (ﷺ), in the year of the Conquest of Mecca, saying, \"Allah and His Apostle made \nillegal the trade of alcohol, dead animals, pigs and idols.\" The people asked, \"O Allah's Messenger (ﷺ)! What \nabout the fat of dead animals, for it was used for greasing the boats and the hides; and people use it for \nlights?\" He said, \"No, it is illegal.\" Allah's Messenger (ﷺ) further said, \"May Allah curse the Jews, for Allah \nmade the fat (of animals) illegal for them, yet they melted the fat and sold it and ate its price.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَامَ الْفَتْحِ، وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ، أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهَا يُطْلَى بِهَا السُّفُنُ، وَيُدْهَنُ بِهَا الْجُلُودُ، وَيَسْتَصْبِحُ بِهَا النَّاسُ‏.‏ فَقَالَ ‏\"‏ لاَ، هُوَ حَرَامٌ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ، إِنَّ اللَّهَ لَمَّا حَرَّمَ شُحُومَهَا جَمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏‏.‏   قَالَ أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ، حَدَّثَنَا يَزِيدُ، كَتَبَ إِلَىَّ عَطَاءٌ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2236In-book reference : Book 34, Hadith 182USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 438   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2237,
    "id": 2237,
    "url": "https://sunnah.com/bukhari:2237",
    "bookNumber": 34,
    "hadithNumber": 183,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "Allah's Messenger (ﷺ) forbade taking the price of a dog, money earned by prostitution and the earnings of a \nsoothsayer.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2237In-book reference : Book 34, Hadith 183USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 439   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2238,
    "id": 2238,
    "url": "https://sunnah.com/bukhari:2238",
    "bookNumber": 34,
    "hadithNumber": 184,
    "narrator": "Narrated `Aun bin Abu Juhaifa:",
    "english": "I saw my father buying a slave whose profession was cupping, and ordered that his instruments (of \ncupping) be broken. I asked him the reason for doing so. He replied, \"Allah's Messenger (ﷺ) prohibited \ntaking money for blood, the price of a dog, and the earnings of a slave-girl by prostitution; he cursed \nher who tattoos and her who gets tattooed, the eater of Riba (usury), and the maker of pictures.\"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَوْنُ بْنُ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ أَبِي اشْتَرَى حَجَّامًا، فَسَأَلْتُهُ عَنْ ذَلِكَ،‏.‏ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَكَسْبِ الأَمَةِ، وَلَعَنَ الْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ، وَآكِلَ الرِّبَا، وَمُوكِلَهُ، وَلَعَنَ الْمُصَوِّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2238In-book reference : Book 34, Hadith 184USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 440   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2239,
    "id": 2239,
    "url": "https://sunnah.com/bukhari:2239",
    "bookNumber": 35,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) came to Medina and the people used to pay in advance the price of fruits to be \ndelivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or \ntwo to three years.) The Prophet (ﷺ) said, \"Whoever pays money in advance for dates (to be delivered \nlater) should pay it for known specified weight and measure (of the dates).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، وَالنَّاسُ يُسْلِفُونَ فِي الثَّمَرِ الْعَامَ وَالْعَامَيْنِ ـ أَوْ قَالَ عَامَيْنِ أَوْ ثَلاَثَةً‏.‏ شَكَّ إِسْمَاعِيلُ ـ فَقَالَ ‏\n\"‏ مَنْ سَلَّفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ، وَوَزْنٍ مَعْلُومٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2239In-book reference : Book 35, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 441   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2240,
    "id": 2240,
    "url": "https://sunnah.com/bukhari:2240",
    "bookNumber": 35,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) came to Medina and the people used to pay in advance the price of dates to be delivered \nwithin two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be \ndelivered later should pay it for a specified measure at specified weight for a specified period.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، أَخْبَرَنَا ابْنُ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ، وَهُمْ يُسْلِفُونَ بِالتَّمْرِ السَّنَتَيْنِ وَالثَّلاَثَ، فَقَالَ ‏\n\"‏ مَنْ أَسْلَفَ فِي شَىْءٍ فَفِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ، إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2240In-book reference : Book 35, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 443   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2241,
    "id": 2241,
    "url": "https://sunnah.com/bukhari:2241",
    "bookNumber": 35,
    "hadithNumber": 5,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) came (to Medina) and he told the people (regarding the payment of money in advance \nthat they should pay it) for a known specified measure and a known specified weight and a known \nspecified period.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2241In-book reference : Book 35, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 445   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2242,
    "id": 2242,
    "url": "https://sunnah.com/bukhari:2242",
    "bookNumber": 35,
    "hadithNumber": 6,
    "narrator": "Narrated Shu`ba:",
    "english": "Muhammad or `Abdullah bin Abu Al-Mujalid said, \"Abdullah bin Shaddad and Abu Burda differed \nregarding As-Salam, so they sent me to Ibn Abi `Aufa and I asked him about it. He replied, 'In the \nlifetime of Allah's Messenger (ﷺ), Abu Bakr and `Umar, we used to pay in advance the prices of wheat, \nbarley, dried grapes and dates to be delivered later. I also asked Ibn Abza and he, too, replied as \nabove.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ أَبِي الْمُجَالِدِ،‏.‏ وَحَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي الْمُجَالِدِ، حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُحَمَّدٌ،، أَوْ عَبْدُ اللَّهِ بْنُ أَبِي الْمُجَالِدِ قَالَ اخْتَلَفَ عَبْدُ اللَّهِ بْنُ شَدَّادِ بْنِ الْهَادِ وَأَبُو بُرْدَةَ فِي السَّلَفِ، فَبَعَثُونِي إِلَى ابْنِ أَبِي أَوْفَى ـ رضى الله عنه ـ فَسَأَلْتُهُ فَقَالَ إِنَّا كُنَّا نُسْلِفُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ، فِي الْحِنْطَةِ، وَالشَّعِيرِ وَالزَّبِيبِ، وَالتَّمْرِ‏.‏ وَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2242, 2243In-book reference : Book 35, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2243,
    "id": 2243,
    "url": "https://sunnah.com/bukhari:2243",
    "bookNumber": 35,
    "hadithNumber": 6,
    "narrator": "Narrated Shu`ba:",
    "english": "Muhammad or `Abdullah bin Abu Al-Mujalid said, \"Abdullah bin Shaddad and Abu Burda differed \nregarding As-Salam, so they sent me to Ibn Abi `Aufa and I asked him about it. He replied, 'In the \nlifetime of Allah's Messenger (ﷺ), Abu Bakr and `Umar, we used to pay in advance the prices of wheat, \nbarley, dried grapes and dates to be delivered later. I also asked Ibn Abza and he, too, replied as \nabove.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ أَبِي الْمُجَالِدِ،‏.‏ وَحَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي الْمُجَالِدِ، حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُحَمَّدٌ،، أَوْ عَبْدُ اللَّهِ بْنُ أَبِي الْمُجَالِدِ قَالَ اخْتَلَفَ عَبْدُ اللَّهِ بْنُ شَدَّادِ بْنِ الْهَادِ وَأَبُو بُرْدَةَ فِي السَّلَفِ، فَبَعَثُونِي إِلَى ابْنِ أَبِي أَوْفَى ـ رضى الله عنه ـ فَسَأَلْتُهُ فَقَالَ إِنَّا كُنَّا نُسْلِفُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ، فِي الْحِنْطَةِ، وَالشَّعِيرِ وَالزَّبِيبِ، وَالتَّمْرِ‏.‏ وَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2242, 2243In-book reference : Book 35, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2244,
    "id": 2244,
    "url": "https://sunnah.com/bukhari:2244",
    "bookNumber": 35,
    "hadithNumber": 7,
    "narrator": "Narrated Muhammad bin Al-Mujalid:",
    "english": "`Abdullah bin Shaddad and Abu Burda sent me to `Abdullah bin Abi `Aufa and told me to ask \n`Abdullah whether the people in the lifetime of the Prophet (ﷺ) used to pay in advance for wheat (to be \ndelivered later). `Abdullah replied, \"We used to pay in advance to the peasants of Sham for wheat, \nbarley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \n\"Was the price paid (in advance) to those who had the things to be delivered later?\" `Abdullah bin \n`Aufa replied, \"We did not use to ask them about that.\" Then they sent me to `Abdur Rahman bin \nAbza and I asked him. He replied, \"The companions of the Prophet (ﷺ) used to practice Salam in the \nlifetime of the Prophet; and we did not use to ask them whether they had standing crops or not.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْمُجَالِدِ، قَالَ بَعَثَنِي عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ إِلَى عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ـ رضى الله عنهما ـ فَقَالاَ سَلْهُ هَلْ كَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم يُسْلِفُونَ فِي الْحِنْطَةِ قَالَ عَبْدُ اللَّهِ كُنَّا نُسْلِفُ نَبِيطَ أَهْلِ الشَّأْمِ فِي الْحِنْطَةِ، وَالشَّعِيرِ، وَالزَّيْتِ، فِي كَيْلٍ مَعْلُومٍ، إِلَى أَجَلٍ مَعْلُومٍ‏.‏ قُلْتُ إِلَى مَنْ كَانَ أَصْلُهُ عِنْدَهُ قَالَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ‏.‏ ثُمَّ بَعَثَانِي إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى فَسَأَلْتُهُ فَقَالَ كَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم يُسْلِفُونَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ نَسْأَلْهُمْ أَلَهُمْ حَرْثٌ أَمْ لاَ",
    "reference": "Reference : Sahih al-Bukhari 2244In-book reference : Book 35, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2245,
    "id": 2245,
    "url": "https://sunnah.com/bukhari:2245",
    "bookNumber": 35,
    "hadithNumber": 8,
    "narrator": "Narrated Muhammad bin Abi Al-Mujalid:",
    "english": "as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). \nNarrated Ash-Shaibani--\"And also for oil.\"\nNarrated Ash-Shaibani:\n\nwho said \"We used to pay in advance for wheat barley and dried grapes.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنِ الشَّيْبَانِيِّ، عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ، بِهَذَا وَقَالَ فَنُسْلِفُهُمْ فِي الْحِنْطَةِ وَالشَّعِيرِ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ عَنْ سُفْيَانَ حَدَّثَنَا الشَّيْبَانِيُّ وَقَالَ وَالزَّيْتِ‏.‏ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنِ الشَّيْبَانِيِّ وَقَالَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2245In-book reference : Book 35, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 448   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2246,
    "id": 2246,
    "url": "https://sunnah.com/bukhari:2246",
    "bookNumber": 35,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Bakhtari at-Tai:",
    "english": "I asked Ibn `Abbas about Salam for (the fruits of) date-palms. He replied \"The Prophet (ﷺ) forbade the \nsale a dates on the trees till they became fit for eating and could be weighed.\" A man asked what to be \nweighed (as the dates were still on the trees). Another man sitting beside Ibn `Abbas replied, \"Till they \nare cut and stored.\" Narrated Abu Al-Bakhtari: I heard Ibn `Abbas (saying) that the Prophet (ﷺ) forbade ... \netc. as above.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا عَمْرٌو، قَالَ سَمِعْتُ أَبَا الْبَخْتَرِيِّ الطَّائِيَّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ‏.‏ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ، حَتَّى يُؤْكَلَ مِنْهُ وَحَتَّى يُوزَنَ‏.‏ فَقَالَ الرَّجُلُ وَأَىُّ شَىْءٍ يُوزَنُ قَالَ رَجُلٌ إِلَى جَانِبِهِ حَتَّى يُحْرَزَ‏.‏ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، قَالَ أَبُو الْبَخْتَرِيِّ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ نَهَى النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2246In-book reference : Book 35, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 450   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2247,
    "id": 2247,
    "url": "https://sunnah.com/bukhari:2247",
    "bookNumber": 35,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Al-Bakhtari:",
    "english": "I asked Ibn `Umar about Salam (the fruits of) date-palms. He replied, \"The Prophet (ﷺ) forbade the sale of \ndates till their benefit becomes evident and fit for eating and also the sale of silver (for gold) on \ncredit.\" I asked Ibn `Abbas about Salam for dates and he replied, \"The Prophet (ﷺ) forbade the sale of \ndates till they were fit for eating and could be estimated.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نُهِيَ عَنْ بَيْعِ النَّخْلِ، حَتَّى يَصْلُحَ، وَعَنْ بَيْعِ الْوَرِقِ، نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ عَنِ السَّلَمِ، فِي النَّخْلِ، فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يُؤْكَلَ مِنْهُ، أَوْ يَأْكُلَ مِنْهُ، وَحَتَّى يُوزَنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2247, 2248In-book reference : Book 35, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2248,
    "id": 2248,
    "url": "https://sunnah.com/bukhari:2248",
    "bookNumber": 35,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Al-Bakhtari:",
    "english": "I asked Ibn `Umar about Salam (the fruits of) date-palms. He replied, \"The Prophet (ﷺ) forbade the sale of \ndates till their benefit becomes evident and fit for eating and also the sale of silver (for gold) on \ncredit.\" I asked Ibn `Abbas about Salam for dates and he replied, \"The Prophet (ﷺ) forbade the sale of \ndates till they were fit for eating and could be estimated.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نُهِيَ عَنْ بَيْعِ النَّخْلِ، حَتَّى يَصْلُحَ، وَعَنْ بَيْعِ الْوَرِقِ، نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ عَنِ السَّلَمِ، فِي النَّخْلِ، فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يُؤْكَلَ مِنْهُ، أَوْ يَأْكُلَ مِنْهُ، وَحَتَّى يُوزَنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2247, 2248In-book reference : Book 35, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2249,
    "id": 2249,
    "url": "https://sunnah.com/bukhari:2249",
    "bookNumber": 35,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Al-Bakhtari:",
    "english": "I asked Ibn `Umar about Salam for dates. Ibn `Umar replied, \"The Prophet (ﷺ) forbade the sale (the fruits) \nof date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also \nasked Ibn `Abbas about it. Ibn `Abbas replied, \"The Prophet (ﷺ) forbade the sale of dates till they were fit \nfor eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the \ntrees)?\" A man sitting by Ibn `Abbas said, \"It means till they are cut and stored.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَصْلُحَ، وَنَهَى عَنِ الْوَرِقِ بِالذَّهَبِ نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ أَوْ يُؤْكَلَ، وَحَتَّى يُوزَنَ‏.‏ قُلْتُ وَمَا يُوزَنُ قَالَ رَجُلٌ عِنْدَهُ حَتَّى يُحْرَزَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2249, 2250In-book reference : Book 35, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2250,
    "id": 2250,
    "url": "https://sunnah.com/bukhari:2250",
    "bookNumber": 35,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Al-Bakhtari:",
    "english": "I asked Ibn `Umar about Salam for dates. Ibn `Umar replied, \"The Prophet (ﷺ) forbade the sale (the fruits) \nof date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also \nasked Ibn `Abbas about it. Ibn `Abbas replied, \"The Prophet (ﷺ) forbade the sale of dates till they were fit \nfor eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the \ntrees)?\" A man sitting by Ibn `Abbas said, \"It means till they are cut and stored.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَصْلُحَ، وَنَهَى عَنِ الْوَرِقِ بِالذَّهَبِ نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ أَوْ يُؤْكَلَ، وَحَتَّى يُوزَنَ‏.‏ قُلْتُ وَمَا يُوزَنُ قَالَ رَجُلٌ عِنْدَهُ حَتَّى يُحْرَزَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2249, 2250In-book reference : Book 35, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2251,
    "id": 2251,
    "url": "https://sunnah.com/bukhari:2251",
    "bookNumber": 35,
    "hadithNumber": 12,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to \nhim (the armor stands for a guarantor).",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا يَعْلَى، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم طَعَامًا مِنْ يَهُودِيٍّ بِنَسِيئَةٍ، وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2251In-book reference : Book 35, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 453   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2252,
    "id": 2252,
    "url": "https://sunnah.com/bukhari:2252",
    "bookNumber": 35,
    "hadithNumber": 13,
    "narrator": "Narrated Al-A`mash:",
    "english": "We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet (ﷺ) \nbought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and \nhe mortgaged his iron armor to him.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ تَذَاكَرْنَا عِنْدَ إِبْرَاهِيمَ الرَّهْنَ فِي السَّلَفِ فَقَالَ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ مَعْلُومٍ، وَارْتَهَنَ مِنْهُ دِرْعًا مِنْ حَدِيدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2252In-book reference : Book 35, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 454   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2253,
    "id": 2253,
    "url": "https://sunnah.com/bukhari:2253",
    "bookNumber": 35,
    "hadithNumber": 14,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) came to Medina and the people used to pay in advance the prices of fruits to be delivered \nwithin two to three years. The Prophet (ﷺ) said (to them), \"Buy fruits by paying their prices in advance on \ncondition that the fruits are to be delivered to you according to a fixed specified measure within a \nfixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَتَيْنِ وَالثَّلاَثَ، فَقَالَ ‏\"‏ أَسْلِفُوا فِي الثِّمَارِ فِي كَيْلٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ، وَقَالَ، ‏\"‏ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2253In-book reference : Book 35, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2254,
    "id": 2254,
    "url": "https://sunnah.com/bukhari:2254",
    "bookNumber": 35,
    "hadithNumber": 15,
    "narrator": "Narrated Muhammad bin Abi Al-Mujalid:",
    "english": "Abu Burda and `Abdullah bin Shaddad sent me to `Abdur Rahman bin Abza and `Abdullah bin Abi \n`Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with \nAllah's Messenger (ﷺ) and when the peasants of Sham came to us we used to pay them in advance for wheat, \nbarley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing \ncrops or not?\" They replied, \"We never asked them about it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ، قَالَ أَرْسَلَنِي أَبُو بُرْدَةَ وَعَبْدُ اللَّهِ بْنُ شَدَّادٍ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى وَعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُمَا عَنِ السَّلَفِ،‏.‏ فَقَالاَ كُنَّا نُصِيبُ الْمَغَانِمَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ الشَّأْمِ فَنُسْلِفُهُمْ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ إِلَى أَجَلٍ مُسَمًّى‏.‏ قَالَ قُلْتُ أَكَانَ لَهُمْ زَرْعٌ، أَوْ لَمْ يَكُنْ لَهُمْ زَرْعٌ قَالاَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2254, 2255In-book reference : Book 35, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2255,
    "id": 2255,
    "url": "https://sunnah.com/bukhari:2255",
    "bookNumber": 35,
    "hadithNumber": 15,
    "narrator": "Narrated Muhammad bin Abi Al-Mujalid:",
    "english": "Abu Burda and `Abdullah bin Shaddad sent me to `Abdur Rahman bin Abza and `Abdullah bin Abi \n`Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with \nAllah's Messenger (ﷺ) and when the peasants of Sham came to us we used to pay them in advance for wheat, \nbarley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing \ncrops or not?\" They replied, \"We never asked them about it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ، قَالَ أَرْسَلَنِي أَبُو بُرْدَةَ وَعَبْدُ اللَّهِ بْنُ شَدَّادٍ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى وَعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُمَا عَنِ السَّلَفِ،‏.‏ فَقَالاَ كُنَّا نُصِيبُ الْمَغَانِمَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ الشَّأْمِ فَنُسْلِفُهُمْ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ إِلَى أَجَلٍ مُسَمًّى‏.‏ قَالَ قُلْتُ أَكَانَ لَهُمْ زَرْعٌ، أَوْ لَمْ يَكُنْ لَهُمْ زَرْعٌ قَالاَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2254, 2255In-book reference : Book 35, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2256,
    "id": 2256,
    "url": "https://sunnah.com/bukhari:2256",
    "bookNumber": 35,
    "hadithNumber": 16,
    "narrator": "Narrated `Abdullah:",
    "english": "The people used to sell camels on the basis of Habal-al-Habala. The Prophet (ﷺ) forbade such sale. Nafi` \nexplained Habal-al-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel \ngives birth.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، أَخْبَرَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كَانُوا يَتَبَايَعُونَ الْجَزُورَ إِلَى حَبَلِ الْحَبَلَةِ، فَنَهَى النَّبِيُّ صلى الله عليه وسلم عَنْهُ‏.‏ فَسَّرَهُ نَافِعٌ أَنْ تُنْتَجَ النَّاقَةُ مَا فِي بَطْنِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2256In-book reference : Book 35, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 457   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2257,
    "id": 2257,
    "url": "https://sunnah.com/bukhari:2257",
    "bookNumber": 36,
    "hadithNumber": 1,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the \nlimits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2257In-book reference : Book 36, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2258,
    "id": 2258,
    "url": "https://sunnah.com/bukhari:2258",
    "bookNumber": 36,
    "hadithNumber": 2,
    "narrator": "Narrated `Amr bin Ash-Sharid:",
    "english": "While I was standing with Sa`d bin Abi Waqqas, Al-Miswar bin Makhrama came and put his hand on \nmy shoulder. Meanwhile Abu Rafi`, the freed slave of the Prophet (ﷺ) came and asked Sa`d to buy from \nhim the (two) dwellings which were in his house. Sa`d said, \"By Allah I will not buy them.\" Al- \nMiswar said, \"By Allah, you shall buy them.\" Sa`d replied, \"By Allah, I will not pay more than four \nthousand (Dirhams) by installments.\" Abu Rafi` said, \"I have been offered five hundred Dinars (for it) \nand had I not heard the Prophet (ﷺ) saying, 'The neighbor has more right than anyone else because of his \nnearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred \nDinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sa`d.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، قَالَ وَقَفْتُ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ، فَجَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى إِحْدَى مَنْكِبَىَّ إِذْ جَاءَ أَبُو رَافِعٍ مَوْلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا سَعْدُ ابْتَعْ مِنِّي بَيْتَىَّ فِي دَارِكَ‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ مَا أَبْتَاعُهُمَا‏.‏ فَقَالَ الْمِسْوَرُ وَاللَّهِ لَتَبْتَاعَنَّهُمَا‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ لاَ أَزِيدُكَ عَلَى أَرْبَعَةِ آلاَفٍ، مُنَجَّمَةٍ أَوْ مُقَطَّعَةٍ‏.‏ قَالَ أَبُو رَافِعٍ لَقَدْ أُعْطِيتُ بِهَا خَمْسَمِائَةِ دِينَارٍ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَهَا بِأَرْبَعَةِ آلاَفٍ، وَأَنَا أُعْطَى بِهَا خَمْسَمِائَةِ دِينَارٍ‏.‏ فَأَعْطَاهَا إِيَّاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2258In-book reference : Book 36, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2259,
    "id": 2259,
    "url": "https://sunnah.com/bukhari:2259",
    "bookNumber": 36,
    "hadithNumber": 3,
    "narrator": "Narrated Aisha:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! I have two neighbors and would like to know to which of them I should \ngive presents.\" He replied, \"To the one whose door is nearer to you.\"",
    "arabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو عِمْرَانَ، قَالَ سَمِعْتُ طَلْحَةَ بْنَ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏\n\"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2259In-book reference : Book 36, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 35, Hadith 460   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2260,
    "id": 2260,
    "url": "https://sunnah.com/bukhari:2260",
    "bookNumber": 37,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ الْخَازِنُ الأَمِينُ الَّذِي يُؤَدِّي مَا أُمِرَ بِهِ طَيِّبَةً نَفْسُهُ أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2260In-book reference : Book 37, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 461   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2261,
    "id": 2261,
    "url": "https://sunnah.com/bukhari:2261",
    "bookNumber": 37,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Musa:",
    "english": "I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، فَقُلْتُ مَا عَلِمْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَقَالَ ‏\n\"‏ لَنْ أَوْ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2261In-book reference : Book 37, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 462   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2262,
    "id": 2262,
    "url": "https://sunnah.com/bukhari:2262",
    "bookNumber": 37,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَعَى الْغَنَمَ ‏\"‏‏.‏ فَقَالَ أَصْحَابُهُ وَأَنْتَ فَقَالَ ‏\"‏ نَعَمْ كُنْتُ أَرْعَاهَا عَلَى قَرَارِيطَ لأَهْلِ مَكَّةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2262In-book reference : Book 37, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 463   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2263,
    "id": 2263,
    "url": "https://sunnah.com/bukhari:2263",
    "bookNumber": 37,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ وَاسْتَأْجَرَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ ثُمَّ مِنْ بَنِي عَبْدِ بْنِ عَدِيٍّ هَادِيًا خِرِّيتًا ـ الْخِرِّيتُ الْمَاهِرُ بِالْهِدَايَةِ ـ قَدْ غَمَسَ يَمِينَ حِلْفٍ فِي آلِ الْعَاصِ بْنِ وَائِلٍ، وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَأَمِنَاهُ فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ، فَأَتَاهُمَا بِرَاحِلَتَيْهِمَا، صَبِيحَةَ لَيَالٍ ثَلاَثٍ، فَارْتَحَلاَ، وَانْطَلَقَ مَعَهُمَا عَامِرُ بْنُ فُهَيْرَةَ، وَالدَّلِيلُ الدِّيلِيُّ فَأَخَذَ بِهِمْ أَسْفَلَ مَكَّةَ وَهْوَ طَرِيقُ السَّاحِلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2263In-book reference : Book 37, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 464   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2264,
    "id": 2264,
    "url": "https://sunnah.com/bukhari:2264",
    "bookNumber": 37,
    "hadithNumber": 5,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَاسْتَأْجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ، هَادِيًا خِرِّيتًا وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَاعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ بِرَاحِلَتَيْهِمَا صُبْحَ ثَلاَثٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2264In-book reference : Book 37, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 465   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2265,
    "id": 2265,
    "url": "https://sunnah.com/bukhari:2265",
    "bookNumber": 37,
    "hadithNumber": 6,
    "narrator": "Narrated Ya`la bin Umaiya:",
    "english": "I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ فَكَانَ مِنْ أَوْثَقِ أَعْمَالِي فِي نَفْسِي، فَكَانَ لِي أَجِيرٌ، فَقَاتَلَ إِنْسَانًا، فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ، فَانْتَزَعَ إِصْبَعَهُ، فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ، فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏\n\"‏ أَفَيَدَعُ إِصْبَعَهُ فِي فِيكَ تَقْضَمُهَا ـ قَالَ أَحْسِبُهُ قَالَ ـ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ جَدِّهِ، بِمِثْلِ هَذِهِ الصِّفَةِ أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ، فَأَنْدَرَ ثَنِيَّتَهُ، فَأَهْدَرَهَا أَبُو بَكْرٍ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2265, 2266In-book reference : Book 37, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2266,
    "id": 2266,
    "url": "https://sunnah.com/bukhari:2266",
    "bookNumber": 37,
    "hadithNumber": 6,
    "narrator": "Narrated Ya`la bin Umaiya:",
    "english": "I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ فَكَانَ مِنْ أَوْثَقِ أَعْمَالِي فِي نَفْسِي، فَكَانَ لِي أَجِيرٌ، فَقَاتَلَ إِنْسَانًا، فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ، فَانْتَزَعَ إِصْبَعَهُ، فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ، فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏\n\"‏ أَفَيَدَعُ إِصْبَعَهُ فِي فِيكَ تَقْضَمُهَا ـ قَالَ أَحْسِبُهُ قَالَ ـ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ جَدِّهِ، بِمِثْلِ هَذِهِ الصِّفَةِ أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ، فَأَنْدَرَ ثَنِيَّتَهُ، فَأَهْدَرَهَا أَبُو بَكْرٍ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2265, 2266In-book reference : Book 37, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2267,
    "id": 2267,
    "url": "https://sunnah.com/bukhari:2267",
    "bookNumber": 37,
    "hadithNumber": 7,
    "narrator": "Narrated Ubai bin Ka`b:",
    "english": "Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to \nbuy food . \"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ، وَغَيْرُهُمَا قَالَ قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ قَالَ لِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ‏\"‏‏.‏ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا، وَرَفَعَ يَدَيْهِ فَاسْتَقَامَ، قَالَ يَعْلَى حَسِبْتُ أَنَّ سَعِيدًا قَالَ‏.‏ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ ‏{‏قَالَ‏}‏ ‏\"‏لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ‏\"‏‏.‏ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2267In-book reference : Book 37, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 467   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2268,
    "id": 2268,
    "url": "https://sunnah.com/bukhari:2268",
    "bookNumber": 37,
    "hadithNumber": 8,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُكُمْ وَمَثَلُ أَهْلِ الْكِتَابَيْنِ كَمَثَلِ رَجُلٍ اسْتَأْجَرَ أُجَرَاءَ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ غُدْوَةَ إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ عَلَى قِيرَاطٍ فَعَمِلَتِ النَّصَارَى ثُمَّ، قَالَ مَنْ يَعْمَلُ لِي مِنَ الْعَصْرِ إِلَى أَنْ تَغِيبَ الشَّمْسُ عَلَى قِيرَاطَيْنِ فَأَنْتُمْ هُمْ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى، فَقَالُوا مَا لَنَا أَكْثَرَ عَمَلاً، وَأَقَلَّ عَطَاءً قَالَ هَلْ نَقَصْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ‏.‏ قَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2268In-book reference : Book 37, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 468   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2269,
    "id": 2269,
    "url": "https://sunnah.com/bukhari:2269",
    "bookNumber": 37,
    "hadithNumber": 9,
    "narrator": "Narrated `Abdullah bin `Umar bin Al-Khattab:",
    "english": "Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا مَثَلُكُمْ وَالْيَهُودُ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ عَمِلَتِ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ أَنْتُمُ الَّذِينَ تَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ فَقَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2269In-book reference : Book 37, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 469   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2270,
    "id": 2270,
    "url": "https://sunnah.com/bukhari:2270",
    "bookNumber": 37,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ تَعَالَى ثَلاَثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2270In-book reference : Book 37, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 470   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2271,
    "id": 2271,
    "url": "https://sunnah.com/bukhari:2271",
    "bookNumber": 37,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً يَوْمًا إِلَى اللَّيْلِ عَلَى أَجْرٍ مَعْلُومٍ، فَعَمِلُوا لَهُ إِلَى نِصْفِ النَّهَارِ فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ الَّذِي شَرَطْتَ لَنَا، وَمَا عَمِلْنَا بَاطِلٌ، فَقَالَ لَهُمْ لاَ تَفْعَلُوا أَكْمِلُوا بَقِيَّةَ عَمَلِكُمْ، وَخُذُوا أَجْرَكُمْ كَامِلاً، فَأَبَوْا وَتَرَكُوا، وَاسْتَأْجَرَ أَجِيرَيْنِ بَعْدَهُمْ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ يَوْمِكُمَا هَذَا، وَلَكُمَا الَّذِي شَرَطْتُ لَهُمْ مِنَ الأَجْرِ‏.‏ فَعَمِلُوا حَتَّى إِذَا كَانَ حِينُ صَلاَةِ الْعَصْرِ قَالاَ لَكَ مَا عَمِلْنَا بَاطِلٌ، وَلَكَ الأَجْرُ الَّذِي جَعَلْتَ لَنَا فِيهِ‏.‏ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ عَمَلِكُمَا، فَإِنَّ مَا بَقِيَ مِنَ النَّهَارِ شَىْءٌ يَسِيرٌ‏.‏ فَأَبَيَا، وَاسْتَأْجَرَ قَوْمًا أَنْ يَعْمَلُوا لَهُ بَقِيَّةَ يَوْمِهِمْ، فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ كِلَيْهِمَا، فَذَلِكَ مَثَلُهُمْ وَمَثَلُ مَا قَبِلُوا مِنْ هَذَا النُّورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2271In-book reference : Book 37, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 471   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2272,
    "id": 2272,
    "url": "https://sunnah.com/bukhari:2272",
    "bookNumber": 37,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى أَوَوُا الْمَبِيتَ إِلَى غَارٍ فَدَخَلُوهُ، فَانْحَدَرَتْ صَخْرَةٌ مِنَ الْجَبَلِ فَسَدَّتْ عَلَيْهِمُ الْغَارَ فَقَالُوا إِنَّهُ لاَ يُنْجِيكُمْ مِنْ هَذِهِ الصَّخْرَةِ إِلاَّ أَنْ تَدْعُوا اللَّهَ بِصَالِحِ أَعْمَالِكُمْ‏.‏ فَقَالَ رَجُلٌ مِنْهُمُ اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، وَكُنْتُ لاَ أَغْبِقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً، فَنَأَى بِي فِي طَلَبِ شَىْءٍ يَوْمًا، فَلَمْ أُرِحْ عَلَيْهِمَا حَتَّى نَامَا، فَحَلَبْتُ لَهُمَا غَبُوقَهُمَا فَوَجَدْتُهُمَا نَائِمَيْنِ وَكَرِهْتُ أَنْ أَغْبِقَ قَبْلَهُمَا أَهْلاً أَوْ مَالاً، فَلَبِثْتُ وَالْقَدَحُ عَلَى يَدَىَّ أَنْتَظِرُ اسْتِيقَاظَهُمَا حَتَّى بَرَقَ الْفَجْرُ، فَاسْتَيْقَظَا فَشَرِبَا غَبُوقَهُمَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَفَرِّجْ عَنَّا مَا نَحْنُ فِيهِ مِنْ هَذِهِ الصَّخْرَةِ، فَانْفَرَجَتْ شَيْئًا لاَ يَسْتَطِيعُونَ الْخُرُوجَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَقَالَ الآخَرُ اللَّهُمَّ كَانَتْ لِي بِنْتُ عَمٍّ كَانَتْ أَحَبَّ النَّاسِ إِلَىَّ، فَأَرَدْتُهَا عَنْ نَفْسِهَا، فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ، فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ عَلَى أَنْ تُخَلِّيَ بَيْنِي وَبَيْنَ نَفْسِهَا، فَفَعَلَتْ حَتَّى إِذَا قَدَرْتُ عَلَيْهَا قَالَتْ لاَ أُحِلُّ لَكَ أَنْ تَفُضَّ الْخَاتَمَ إِلاَّ بِحَقِّهِ‏.‏ فَتَحَرَّجْتُ مِنَ الْوُقُوعِ عَلَيْهَا، فَانْصَرَفْتُ عَنْهَا وَهْىَ أَحَبُّ النَّاسِ إِلَىَّ وَتَرَكْتُ الذَّهَبَ الَّذِي أَعْطَيْتُهَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ، غَيْرَ أَنَّهُمْ لاَ يَسْتَطِيعُونَ الْخُرُوجَ مِنْهَا‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ الثَّالِثُ اللَّهُمَّ إِنِّي اسْتَأْجَرْتُ أُجَرَاءَ فَأَعْطَيْتُهُمْ أَجْرَهُمْ، غَيْرَ رَجُلٍ وَاحِدٍ تَرَكَ الَّذِي لَهُ وَذَهَبَ فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ، فَجَاءَنِي بَعْدَ حِينٍ فَقَالَ يَا عَبْدَ اللَّهِ أَدِّ إِلَىَّ أَجْرِي‏.‏ فَقُلْتُ لَهُ كُلُّ مَا تَرَى مِنْ أَجْرِكَ مِنَ الإِبِلِ وَالْبَقَرِ وَالْغَنَمِ وَالرَّقِيقِ‏.‏ فَقَالَ يَا عَبْدَ اللَّهِ لاَ تَسْتَهْزِئْ بِي‏.‏ فَقُلْتُ إِنِّي لاَ أَسْتَهْزِئُ بِكَ‏.‏ فَأَخَذَهُ كُلَّهُ فَاسْتَاقَهُ فَلَمْ يَتْرُكْ مِنْهُ شَيْئًا، اللَّهُمَّ فَإِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ فَخَرَجُوا يَمْشُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2272In-book reference : Book 37, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 472   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2273,
    "id": 2273,
    "url": "https://sunnah.com/bukhari:2273",
    "bookNumber": 37,
    "hadithNumber": 13,
    "narrator": "Narrated Abu May' id Al-Ansari:",
    "english": "Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمَرَ بِالصَّدَقَةِ انْطَلَقَ أَحَدُنَا إِلَى السُّوقِ فَيُحَامِلُ فَيُصِيبُ الْمُدَّ، وَإِنَّ لِبَعْضِهِمْ لَمِائَةَ أَلْفٍ، قَالَ مَا نُرَاهُ إِلاَّ نَفْسَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2273In-book reference : Book 37, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 473   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2274,
    "id": 2274,
    "url": "https://sunnah.com/bukhari:2274",
    "bookNumber": 37,
    "hadithNumber": 14,
    "narrator": "Narrated Tawus:",
    "english": "Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الرُّكْبَانُ، وَلاَ يَبِيعَ حَاضِرٌ لِبَادٍ‏.‏ قُلْتُ يَا ابْنَ عَبَّاسٍ مَا قَوْلُهُ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2274In-book reference : Book 37, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 474   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2275,
    "id": 2275,
    "url": "https://sunnah.com/bukhari:2275",
    "bookNumber": 37,
    "hadithNumber": 15,
    "narrator": "Narrated Khabbab:",
    "english": "I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، حَدَّثَنَا خَبَّابٌ، قَالَ كُنْتُ رَجُلاً قَيْنًا فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ فَاجْتَمَعَ لِي عِنْدَهُ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لاَ وَاللَّهِ لاَ أَقْضِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ‏.‏ فَقُلْتُ أَمَا وَاللَّهِ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ فَلاَ‏.‏ قَالَ وَإِنِّي لَمَيِّتٌ ثُمَّ مَبْعُوثٌ قُلْتُ نَعَمْ‏.‏ قَالَ فَإِنَّهُ سَيَكُونُ لِي ثَمَّ مَالٌ وَوَلَدٌ فَأَقْضِيكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 2275In-book reference : Book 37, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2276,
    "id": 2276,
    "url": "https://sunnah.com/bukhari:2276",
    "bookNumber": 37,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Sa`id:",
    "english": "Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ انْطَلَقَ نَفَرٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرُوهَا حَتَّى نَزَلُوا عَلَى حَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ، فَأَبَوْا أَنْ يُضَيِّفُوهُمْ، فَلُدِغَ سَيِّدُ ذَلِكَ الْحَىِّ، فَسَعَوْا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ شَىْءٌ، فَقَالَ بَعْضُهُمْ لَوْ أَتَيْتُمْ هَؤُلاَءِ الرَّهْطَ الَّذِينَ نَزَلُوا لَعَلَّهُ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَىْءٌ، فَأَتَوْهُمْ، فَقَالُوا يَا أَيُّهَا الرَّهْطُ، إِنَّ سَيِّدَنَا لُدِغَ، وَسَعَيْنَا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ، فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ مِنْ شَىْءٍ فَقَالَ بَعْضُهُمْ نَعَمْ وَاللَّهِ إِنِّي لأَرْقِي، وَلَكِنْ وَاللَّهِ لَقَدِ اسْتَضَفْنَاكُمْ فَلَمْ تُضِيِّفُونَا، فَمَا أَنَا بِرَاقٍ لَكُمْ حَتَّى تَجْعَلُوا لَنَا جُعْلاً‏.‏ فَصَالَحُوهُمْ عَلَى قَطِيعٍ مِنَ الْغَنَمِ، فَانْطَلَقَ يَتْفِلُ عَلَيْهِ وَيَقْرَأُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ فَكَأَنَّمَا نُشِطَ مِنْ عِقَالٍ، فَانْطَلَقَ يَمْشِي وَمَا بِهِ قَلَبَةٌ، قَالَ فَأَوْفَوْهُمْ جُعْلَهُمُ الَّذِي صَالَحُوهُمْ عَلَيْهِ، فَقَالَ بَعْضُهُمُ اقْسِمُوا‏.‏ فَقَالَ الَّذِي رَقَى لاَ تَفْعَلُوا، حَتَّى نَأْتِيَ النَّبِيَّ صلى الله عليه وسلم فَنَذْكُرَ لَهُ الَّذِي كَانَ، فَنَنْظُرَ مَا يَأْمُرُنَا‏.‏ فَقَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ، فَقَالَ ‏\"‏ وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ ـ ثُمَّ قَالَ ـ قَدْ أَصَبْتُمُ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا ‏\"‏‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ شُعْبَةُ حَدَّثَنَا أَبُو بِشْرٍ سَمِعْتُ أَبَا الْمُتَوَكِّلِ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2276In-book reference : Book 37, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 476   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2277,
    "id": 2277,
    "url": "https://sunnah.com/bukhari:2277",
    "bookNumber": 37,
    "hadithNumber": 17,
    "narrator": "Narrated Anas bin Malik:",
    "english": "When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ حَجَمَ أَبُو طَيْبَةَ النَّبِيَّ صلى الله عليه وسلم، فَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفَ عَنْ غَلَّتِهِ أَوْ ضَرِيبَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2277In-book reference : Book 37, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2278,
    "id": 2278,
    "url": "https://sunnah.com/bukhari:2278",
    "bookNumber": 37,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم، وَأَعْطَى الْحَجَّامَ أَجْرَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2278In-book reference : Book 37, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2279,
    "id": 2279,
    "url": "https://sunnah.com/bukhari:2279",
    "bookNumber": 37,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَأَعْطَى الْحَجَّامَ أَجْرَهُ، وَلَوْ عَلِمَ كَرَاهِيَةً لَمْ يُعْطِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2279In-book reference : Book 37, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2280,
    "id": 2280,
    "url": "https://sunnah.com/bukhari:2280",
    "bookNumber": 37,
    "hadithNumber": 20,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَمْرِو بْنِ عَامِرٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَحْتَجِمُ، وَلَمْ يَكُنْ يَظْلِمُ أَحَدًا أَجْرَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2280In-book reference : Book 37, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 480   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2281,
    "id": 2281,
    "url": "https://sunnah.com/bukhari:2281",
    "bookNumber": 37,
    "hadithNumber": 21,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم غُلاَمًا حَجَّامًا فَحَجَمَهُ، وَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ، أَوْ مُدٍّ أَوْ مُدَّيْنِ، وَكَلَّمَ فِيهِ فَخُفِّفَ مِنْ ضَرِيبَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2281In-book reference : Book 37, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 481   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2282,
    "id": 2282,
    "url": "https://sunnah.com/bukhari:2282",
    "bookNumber": 37,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2282In-book reference : Book 37, Hadith 22USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 482   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2283,
    "id": 2283,
    "url": "https://sunnah.com/bukhari:2283",
    "bookNumber": 37,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَسْبِ الإِمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2283In-book reference : Book 37, Hadith 23USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 483   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2284,
    "id": 2284,
    "url": "https://sunnah.com/bukhari:2284",
    "bookNumber": 37,
    "hadithNumber": 24,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) forbade taking a price for animal copulation.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ عَسْبِ الْفَحْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2284In-book reference : Book 37, Hadith 24USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 484   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2285,
    "id": 2285,
    "url": "https://sunnah.com/bukhari:2285",
    "bookNumber": 37,
    "hadithNumber": 25,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا، وَأَنَّ ابْنَ عُمَرَ حَدَّثَهُ أَنَّ الْمَزَارِعَ كَانَتْ تُكْرَى عَلَى شَىْءٍ سَمَّاهُ نَافِعٌ لاَ أَحْفَظُهُ‏.‏ وَأَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ حَتَّى أَجْلاَهُمْ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2285, 2286In-book reference : Book 37, Hadith 25USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2286,
    "id": 2286,
    "url": "https://sunnah.com/bukhari:2286",
    "bookNumber": 37,
    "hadithNumber": 25,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا، وَأَنَّ ابْنَ عُمَرَ حَدَّثَهُ أَنَّ الْمَزَارِعَ كَانَتْ تُكْرَى عَلَى شَىْءٍ سَمَّاهُ نَافِعٌ لاَ أَحْفَظُهُ‏.‏ وَأَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ حَتَّى أَجْلاَهُمْ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2285, 2286In-book reference : Book 37, Hadith 25USC-MSA web (English) reference : Vol. 3, Book 36, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2287,
    "id": 2287,
    "url": "https://sunnah.com/bukhari:2287",
    "bookNumber": 38,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy man is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، فَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيٍّ فَلْيَتْبَعْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2287In-book reference : Book 38, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 486   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2288,
    "id": 2288,
    "url": "https://sunnah.com/bukhari:2288",
    "bookNumber": 38,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy person is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، وَمَنْ أُتْبِعَ عَلَى مَلِيٍّ فَلْيَتَّبِعْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2288In-book reference : Book 38, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 487   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2289,
    "id": 2289,
    "url": "https://sunnah.com/bukhari:2289",
    "bookNumber": 38,
    "hadithNumber": 3,
    "narrator": "Narrated Salama bin Al-Akwa:",
    "english": "Once, while we were sitting in the company of Prophet, a dead man was \n     brought. The Prophet (ﷺ) was requested to lead the funeral prayer for the \n     deceased. He said, \"Is he in debt?\" The people replied in the \n     negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he \n     led his funeral prayer. Another dead man was brought and the people \n     said, \"O Allah's Messenger (ﷺ)! Lead his funeral prayer.\" The Prophet (ﷺ) said, \n     \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\" \n     They said, ''Three Dinars.\" So, he led the prayer. Then a third dead \n     man was brought and the people said (to the Prophet (ﷺ) ), Please lead his\n     funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\" \n     He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three \n     Diners.', He (refused to pray and) said, \"Then pray for your (dead) \n     companion.\" Abu Qatada said, \"O Allah's Messenger (ﷺ)! Lead his funeral \n     prayer, and I will pay his debt.\" So, he led the prayer.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أُتِيَ بِجَنَازَةٍ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ فَقَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ فَصَلَّى عَلَيْهِ ثُمَّ أُتِيَ بِجَنَازَةٍ أُخْرَى، فَقَالُوا يَا رَسُولَ اللَّهِ، صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا ثَلاَثَةَ دَنَانِيرَ‏.‏ فَصَلَّى عَلَيْهَا، ثُمَّ أُتِيَ بِالثَّالِثَةِ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا ثَلاَثَةُ دَنَانِيرَ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ قَالَ أَبُو قَتَادَةَ صَلِّ عَلَيْهِ يَا رَسُولَ اللَّهِ، وَعَلَىَّ دَيْنُهُ‏.‏ فَصَلَّى عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2289In-book reference : Book 38, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2290,
    "id": 2290,
    "url": "https://sunnah.com/bukhari:2290",
    "bookNumber": 39,
    "hadithNumber": 1,
    "narrator": "Narrated Muhammad bin 'Amr Al-Aslami that his father Hamza said:",
    "english": "'Umar (ra) sent him (i.e. Hamza) as a Sadaqa / Zakat collector. A man had committed illegal sexual intercourse with the slave girl of his wife. Hamza took (personal) sureties for the adulterer till they came to 'Umar. 'Umar had lashed the adulterer one hundred lashes. 'Umar confirmed their claim (that the adulterer had already been punished) and excused him because of being Ignorant.\n\nJarir Al-Ash'ath said to Ibn Mas'ud regarding renegades (i.e., those who became infidels after embracing Islam), \"Let them repent and take (personal) sureties for them.\" They repented and their relatives stood sureties for them.\n\nAccording to Hammad, if somebody stands surety for another person and that person dies, the person giving surety will be released from responsibility. According to Al-Hakam, his responsibilities continues.",
    "arabic": "وَقَالَ أَبُو الزِّنَادِ عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ عَمْرٍو الأَسْلَمِيِّ، عَنْ أَبِيهِ، أَنَّ عُمَرَ ـ رضى الله عنه ـ بَعَثَهُ مُصَدِّقًا، فَوَقَعَ رَجُلٌ عَلَى جَارِيَةِ امْرَأَتِهِ، فَأَخَذَ حَمْزَةُ مِنَ الرَّجُلِ كَفِيلاً حَتَّى قَدِمَ عَلَى عُمَرَ، وَكَانَ عُمَرُ قَدْ جَلَدَهُ مِائَةَ جَلْدَةٍ، فَصَدَّقَهُمْ، وَعَذَرَهُ بِالْجَهَالَةِ‏.‏ وَقَالَ جَرِيرٌ وَالأَشْعَثُ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي الْمُرْتَدِّينَ اسْتَتِبْهُمْ، وَكَفِّلْهُمْ‏.‏ فَتَابُوا وَكَفَلَهُمْ عَشَائِرُهُمْ‏.‏ وَقَالَ حَمَّادٌ إِذَا تَكَفَّلَ بِنَفْسٍ فَمَاتَ فَلاَ شَىْءَ عَلَيْهِ‏.‏ وَقَالَ الْحَكَمُ يَضْمَنُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2290In-book reference : Book 39, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2291,
    "id": 2291,
    "url": "https://sunnah.com/bukhari:2291",
    "bookNumber": 39,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"An Israeli man asked another Israeli to lend him \n     one thousand Dinars. The second man required witnesses. The former \n     replied, 'Allah is sufficient as a witness.' The second said, 'I want \n     a surety.' The former replied, 'Allah is sufficient as a surety.' The \n     second said, 'You are right,' and lent him the money for a certain \n     period. The debtor went across the sea. When he finished his job, he \n     searched for a conveyance so that he might reach in time for the \n     repayment of the debt, but he could not find any. So, he took a piece \n     of wood and made a hole in it, inserted in it one thousand Dinars and \n     a letter to the lender and then closed (i.e. sealed) the hole tightly.\n     He took the piece of wood to the sea and said. 'O Allah! You know well\n     that I took a loan of one thousand Dinars from so-and-so. He demanded \n     a surety from me but I told him that Allah's Guarantee was sufficient \n     and he accepted Your guarantee. He then asked for a witness and I told\n     him that Allah was sufficient as a Witness, and he accepted You as a \n     Witness. No doubt, I tried hard to find a conveyance so that I could \n     pay his money but could not find, so I hand over this money to You.' \n     Saying that, he threw the piece of wood into the sea till it went out \n     far into it, and then he went away. Meanwhile he started searching for\n     a conveyance in order to reach the creditor's country. \n\n\n     One day the lender came out of his house to see whether a ship had \n     arrived bringing his money, and all of a sudden he saw the piece of \n     wood in which his money had been deposited. He took it home to use for\n     fire. When he sawed it, he found his money and the letter inside it. \n     Shortly after that, the debtor came bringing one thousand Dinars to \n     him and said, 'By Allah, I had been trying hard to get a boat so that \n     I could bring you your money, but failed to get one before the one I \n     have come by.' The lender asked, 'Have you sent something to me?' The \n     debtor replied, 'I have told you I could not get a boat other than the\n     one I have come by.' The lender said, 'Allah has delivered on your \n     behalf the money you sent in the piece of wood. So, you may keep your \n     one thousand Dinars and depart guided on the right path.' \"",
    "arabic": "قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ أَنْ يُسْلِفَهُ أَلْفَ دِينَارٍ، فَقَالَ ائْتِنِي بِالشُّهَدَاءِ أُشْهِدُهُمْ‏.‏ فَقَالَ كَفَى بِاللَّهِ شَهِيدًا‏.‏ قَالَ فَأْتِنِي بِالْكَفِيلِ‏.‏ قَالَ كَفَى بِاللَّهِ كَفِيلاً‏.‏ قَالَ صَدَقْتَ‏.‏ فَدَفَعَهَا إِلَيْهِ إِلَى أَجَلٍ مُسَمًّى، فَخَرَجَ فِي الْبَحْرِ، فَقَضَى حَاجَتَهُ، ثُمَّ الْتَمَسَ مَرْكَبًا يَرْكَبُهَا، يَقْدَمُ عَلَيْهِ لِلأَجَلِ الَّذِي أَجَّلَهُ، فَلَمْ يَجِدْ مَرْكَبًا، فَأَخَذَ خَشَبَةً، فَنَقَرَهَا فَأَدْخَلَ فِيهَا أَلْفَ دِينَارٍ، وَصَحِيفَةً مِنْهُ إِلَى صَاحِبِهِ، ثُمَّ زَجَّجَ مَوْضِعَهَا، ثُمَّ أَتَى بِهَا إِلَى الْبَحْرِ، فَقَالَ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنِّي كُنْتُ تَسَلَّفْتُ فُلاَنًا أَلْفَ دِينَارٍ، فَسَأَلَنِي كَفِيلاً، فَقُلْتُ كَفَى بِاللَّهِ كَفِيلاً، فَرَضِيَ بِكَ، وَسَأَلَنِي شَهِيدًا، فَقُلْتُ كَفَى بِاللَّهِ شَهِيدًا، فَرَضِيَ بِكَ، وَأَنِّي جَهَدْتُ أَنْ أَجِدَ مَرْكَبًا، أَبْعَثُ إِلَيْهِ الَّذِي لَهُ فَلَمْ أَقْدِرْ، وَإِنِّي أَسْتَوْدِعُكَهَا‏.‏ فَرَمَى بِهَا فِي الْبَحْرِ حَتَّى وَلَجَتْ فِيهِ، ثُمَّ انْصَرَفَ، وَهْوَ فِي ذَلِكَ يَلْتَمِسُ مَرْكَبًا، يَخْرُجُ إِلَى بَلَدِهِ، فَخَرَجَ الرَّجُلُ الَّذِي كَانَ أَسْلَفَهُ، يَنْظُرُ لَعَلَّ مَرْكَبًا قَدْ جَاءَ بِمَالِهِ، فَإِذَا بِالْخَشَبَةِ الَّتِي فِيهَا الْمَالُ، فَأَخَذَهَا لأَهْلِهِ حَطَبًا، فَلَمَّا نَشَرَهَا وَجَدَ الْمَالَ وَالصَّحِيفَةَ، ثُمَّ قَدِمَ الَّذِي كَانَ أَسْلَفَهُ، فَأَتَى بِالأَلْفِ دِينَارٍ، فَقَالَ وَاللَّهِ مَا زِلْتُ جَاهِدًا فِي طَلَبِ مَرْكَبٍ لآتِيَكَ بِمَالِكَ، فَمَا وَجَدْتُ مَرْكَبًا قَبْلَ الَّذِي أَتَيْتُ فِيهِ‏.‏ قَالَ هَلْ كُنْتَ بَعَثْتَ إِلَىَّ بِشَىْءٍ قَالَ أُخْبِرُكَ أَنِّي لَمْ أَجِدْ مَرْكَبًا قَبْلَ الَّذِي جِئْتُ فِيهِ‏.‏ قَالَ فَإِنَّ اللَّهَ قَدْ أَدَّى عَنْكَ الَّذِي بَعَثْتَ فِي الْخَشَبَةِ فَانْصَرِفْ بِالأَلْفِ الدِّينَارِ رَاشِدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2291In-book reference : Book 39, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2292,
    "id": 2292,
    "url": "https://sunnah.com/bukhari:2292",
    "bookNumber": 39,
    "hadithNumber": 3,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Abbas said, \"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) \nheirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' \nIbn `Abbas said, \"When the emigrants came to the Prophet (ﷺ) in Medina, the emigrant would inherit the \nAnsari while the latter's relatives would not inherit him because of the bond of brotherhood which the \nProphet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to \neveryone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of \nbrotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right \nhands have pledged, remained valid regarding cooperation and mutual advice, while the matter of \ninheritance was excluded and it became permissible to assign something in one's testament to the \nperson who had the right of inheriting before.",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ إِدْرِيسَ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما – ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ قَالَ وَرَثَةً ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ لَمَّا قَدِمُوا الْمَدِينَةَ يَرِثُ الْمُهَاجِرُ الأَنْصَارِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ، فَلَمَّا نَزَلَتْ ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ نَسَخَتْ، ثُمَّ قَالَ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ ‏}‏ إِلاَّ النَّصْرَ وَالرِّفَادَةَ وَالنَّصِيحَةَ، وَقَدْ ذَهَبَ الْمِيرَاثُ وَيُوصِي لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2292In-book reference : Book 39, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 489   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2293,
    "id": 2293,
    "url": "https://sunnah.com/bukhari:2293",
    "bookNumber": 39,
    "hadithNumber": 4,
    "narrator": "Narrated Anas:",
    "english": "`Abdur-Rahman bin `Auf came to us and Allah's Messenger (ﷺ) established a bond of brotherhood between \nhim and Sa`d bin Rabi`a.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَلَيْنَا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَآخَى رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2293In-book reference : Book 39, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 490   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2294,
    "id": 2294,
    "url": "https://sunnah.com/bukhari:2294",
    "bookNumber": 39,
    "hadithNumber": 5,
    "narrator": "Narrated `Asim:",
    "english": "I heard Anas bin Malik, \"Have you ever heard that the Prophet (ﷺ) said, 'There is no alliance in Islam?' \" \nHe replied, \"The Prophet (ﷺ) made alliance between Quraish and the Ansar in my house.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسٍ رضى الله عنه أَبَلَغَكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ حِلْفَ فِي الإِسْلاَمِ ‏\"‏‏.‏ فَقَالَ قَدْ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2294In-book reference : Book 39, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2295,
    "id": 2295,
    "url": "https://sunnah.com/bukhari:2295",
    "bookNumber": 39,
    "hadithNumber": 6,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "A dead person was brought to the Prophet (ﷺ) so that he might lead the funeral prayer for him. He asked, \n\"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead \nperson was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer \nand) said, \"Lead the prayer of your friend.\" Abu Qatada said, \"O Allah's Messenger (ﷺ)! I undertake to pay \nhis debt.\" Allah's Messenger (ﷺ) then led his funeral prayer.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِجَنَازَةٍ، لِيُصَلِّيَ عَلَيْهَا، فَقَالَ ‏\"‏ هَلْ عَلَيْهِ مِنْ دَيْنٍ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ فَصَلَّى عَلَيْهِ، ثُمَّ أُتِيَ بِجَنَازَةٍ أُخْرَى، فَقَالَ ‏\"‏ هَلْ عَلَيْهِ مَنْ دَيْنٍ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ قَالَ أَبُو قَتَادَةَ عَلَىَّ دَيْنُهُ يَا رَسُولَ اللَّهِ‏.‏ فَصَلَّى عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2295In-book reference : Book 39, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2296,
    "id": 2296,
    "url": "https://sunnah.com/bukhari:2296",
    "bookNumber": 39,
    "hadithNumber": 7,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Once the Prophet (ﷺ) said (to me), \"If the money of Bahrain comes, I will give you a certain amount of \nit.\" The Prophet (ﷺ) had breathed his last before the money of Bahrain arrived. When the money of \nBahrain reached, Abu Bakr announced, \"Whoever was promised by the Prophet (ﷺ) should come to us.\" I \nwent to Abu Bakr and said, \"The Prophet (ﷺ) promised me so and so.\" Abu Bakr gave me a handful of \ncoins and when I counted them, they were five-hundred in number. Abu Bakr then said, \"Take twice \nthe amount you have taken (besides).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، سَمِعَ مُحَمَّدَ بْنَ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهم ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَوْ قَدْ جَاءَ مَالُ الْبَحْرَيْنِ، قَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ فَلَمْ يَجِئْ مَالُ الْبَحْرَيْنِ حَتَّى قُبِضَ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا جَاءَ مَالُ الْبَحْرَيْنِ أَمَرَ أَبُو بَكْرٍ فَنَادَى مَنْ كَانَ لَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم عِدَةٌ أَوْ دَيْنٌ فَلْيَأْتِنَا‏.‏ فَأَتَيْتُهُ، فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِي كَذَا وَكَذَا، فَحَثَى لِي حَثْيَةً فَعَدَدْتُهَا فَإِذَا هِيَ خَمْسُمِائَةٍ، وَقَالَ خُذْ مِثْلَيْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2296In-book reference : Book 39, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 493   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2297,
    "id": 2297,
    "url": "https://sunnah.com/bukhari:2297",
    "bookNumber": 39,
    "hadithNumber": 8,
    "narrator": "Narrated Aisha:",
    "english": "(wife of the Prophet) Since I reached the age when I could remember things, I have seen my parents \nworshipping according to the right faith of Islam. Not a single day passed but Allah's Messenger (ﷺ) visited \nus both in the morning and in the evening. When the Muslims were persecuted, Abu Bakr set out for \nEthiopia as an emigrant. When he reached a place called Bark-al-Ghimad, he met Ibn Ad-Daghna, the \nchief of the Qara tribe, who asked Abu Bakr, \"Where are you going?\" Abu Bakr said, \"My people \nhave turned me out of the country and I would like to tour the world and worship my Lord.\" Ibn Ad- \nDaghna said, \"A man like you will not go out, nor will he be turned out as you help the poor earn their \nliving, keep good relation with your Kith and kin, help the disabled (or the dependents), provide \nguests with food and shelter, and help people during their troubles. I am your protector. So, go back \nand worship your Lord at your home.\" Ibn Ad-Daghna went along with Abu Bakr and took him to the \nchiefs of Quraish saying to them, \"A man like Abu Bakr will not go out, nor will he be turned out. Do \nyou turn out a man who helps the poor earn their living, keeps good relations with Kith and kin, helps \nthe disabled, provides guests with food and shelter, and helps the people during their troubles?\" \nSo, Quraish allowed Ibn Ad-Daghna's guarantee of protection and told Abu- Bakr that he was secure, \nand said to Ibn Ad-Daghna, \"Advise Abu Bakr to worship his Lord in his house and to pray and read \nwhat he liked and not to hurt us and not to do these things publicly, for we fear that our sons and \nwomen may follow him.\" Ibn Ad-Daghna told Abu Bakr of all that, so Abu- Bakr continued \nworshipping his Lord in his house and did not pray or recite Qur'an aloud except in his house. Later \non Abu Bakr had an idea of building a mosque in the court yard of his house. He fulfilled that idea and \nstarted praying and reciting Qur'an there publicly. The women and the offspring of the pagans started \ngathering around him and looking at him astonishingly. Abu Bakr was a softhearted person and could \nnot help weeping while reciting Qur'an. This horrified the pagan chiefs of Quraish. They sent for Ibn \nAd-Daghna and when he came, they said, \"We have given Abu Bakr protection on condition that he \nwill worship his Lord in his house, but he has transgressed that condition and has built a mosque in \nthe court yard of his house and offered his prayer and recited Qur'an in public. We are afraid lest he \nmislead our women and offspring. So, go to him and tell him that if he wishes he can worship his \nLord in his house only, and if not, then tell him to return your pledge of protection as we do not like to \nbetray you by revoking your pledge, nor can we tolerate Abu Bakr's public declaration of Islam (his \nworshipping). \n`Aisha added: Ibn Ad-Daghna came to Abu Bakr and said, \"You know the conditions on which I gave \nyou protection, so you should either abide by those conditions or revoke my protection, as I do not \nlike to hear the 'Arabs saying that Ibn Ad-Daghna gave the pledge of protection to a person and his \npeople did not respect it.\" Abu Bakr said, \"I revoke your pledge of protection and am satisfied with \nAllah's protection.\" At that time Allah's Messenger (ﷺ) was still in Mecca and he said to his companions, \n\"Your place of emigration has been shown to me. I have seen salty land, planted with date-palms and \nsituated between two mountains which are the two ,Harras.\" So, when the Prophet (ﷺ) told it, some of the \ncompanions migrated to Medina, and some of those who had migrated to Ethiopia returned to Medina. \nWhen Abu Bakr prepared for emigration, Allah's Messenger (ﷺ) said to him, \"Wait, for I expect to be \npermitted to emigrate.\" Abu Bakr asked, \"May my father be sacrificed for your sake, do you really \nexpect that?\" Allah's Messenger (ﷺ) replied in the affirmative. So, Abu Bakr postponed his departure in order \nto accompany Allah's Messenger (ﷺ) and fed two camels which he had, with the leaves of Samor trees for \nfour months.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ‏.‏ وَقَالَ أَبُو صَالِحٍ حَدَّثَنِي عَبْدُ اللَّهِ عَنْ يُونُسَ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ قَطُّ، إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ، وَلَمْ يَمُرَّ عَلَيْنَا يَوْمٌ إِلاَّ يَأْتِينَا فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم طَرَفَىِ النَّهَارِ بُكْرَةً وَعَشِيَّةً، فَلَمَّا ابْتُلِيَ الْمُسْلِمُونَ خَرَجَ أَبُو بَكْرٍ مُهَاجِرًا قِبَلَ الْحَبَشَةِ، حَتَّى إِذَا بَلَغَ بَرْكَ الْغِمَادِ لَقِيَهُ ابْنُ الدَّغِنَةِ ـ وَهْوَ سَيِّدُ الْقَارَةِ ـ فَقَالَ أَيْنَ تُرِيدُ يَا أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَخْرَجَنِي قَوْمِي فَأَنَا أُرِيدُ أَنْ أَسِيحَ فِي الأَرْضِ فَأَعْبُدَ رَبِّي‏.‏ قَالَ ابْنُ الدَّغِنَةِ إِنَّ مِثْلَكَ لاَ يَخْرُجُ وَلاَ يُخْرَجُ، فَإِنَّكَ تَكْسِبُ الْمَعْدُومَ، وَتَصِلُ الرَّحِمَ، وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ، وَأَنَا لَكَ جَارٌ فَارْجِعْ فَاعْبُدْ رَبَّكَ بِبِلاَدِكَ‏.‏ فَارْتَحَلَ ابْنُ الدَّغِنَةِ، فَرَجَعَ مَعَ أَبِي بَكْرٍ، فَطَافَ فِي أَشْرَافِ كُفَّارِ قُرَيْشٍ، فَقَالَ لَهُمْ إِنَّ أَبَا بَكْرٍ لاَ يَخْرُجُ مِثْلُهُ، وَلاَ يُخْرَجُ، أَتُخْرِجُونَ رَجُلاً يُكْسِبُ الْمَعْدُومَ، وَيَصِلُ الرَّحِمَ، وَيَحْمِلُ الْكَلَّ، وَيَقْرِي الضَّيْفَ، وَيُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ فَأَنْفَذَتْ قُرَيْشٌ جِوَارَ ابْنِ الدَّغِنَةِ وَآمَنُوا أَبَا بَكْرٍ وَقَالُوا لاِبْنِ الدَّغِنَةِ مُرْ أَبَا بَكْرٍ فَلْيَعْبُدْ رَبَّهُ فِي دَارِهِ، فَلْيُصَلِّ وَلْيَقْرَأْ مَا شَاءَ، وَلاَ يُؤْذِينَا بِذَلِكَ، وَلاَ يَسْتَعْلِنْ بِهِ، فَإِنَّا قَدْ خَشِينَا أَنْ يَفْتِنَ أَبْنَاءَنَا وَنِسَاءَنَا‏.‏ قَالَ ذَلِكَ ابْنُ الدَّغِنَةِ لأَبِي بَكْرٍ، فَطَفِقَ أَبُو بَكْرٍ يَعْبُدُ رَبَّهُ فِي دَارِهِ، وَلاَ يَسْتَعْلِنُ بِالصَّلاَةِ وَلاَ الْقِرَاءَةِ فِي غَيْرِ دَارِهِ، ثُمَّ بَدَا لأَبِي بَكْرٍ فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، وَبَرَزَ فَكَانَ يُصَلِّي فِيهِ، وَيَقْرَأُ الْقُرْآنَ، فَيَتَقَصَّفُ عَلَيْهِ نِسَاءُ الْمُشْرِكِينَ وَأَبْنَاؤُهُمْ، يَعْجَبُونَ وَيَنْظُرُونَ إِلَيْهِ، وَكَانَ أَبُو بَكْرٍ رَجُلاً بَكَّاءً لاَ يَمْلِكُ دَمْعَهُ حِينَ يَقْرَأُ الْقُرْآنَ، فَأَفْزَعَ ذَلِكَ أَشْرَافَ قُرَيْشٍ مِنَ الْمُشْرِكِينَ، فَأَرْسَلُوا إِلَى ابْنِ الدَّغِنَةِ فَقَدِمَ عَلَيْهِمْ، فَقَالُوا لَهُ إِنَّا كُنَّا أَجَرْنَا أَبَا بَكْرٍ عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ، وَإِنَّهُ جَاوَزَ ذَلِكَ، فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، وَأَعْلَنَ الصَّلاَةَ وَالْقِرَاءَةَ، وَقَدْ خَشِينَا أَنْ يَفْتِنَ أَبْنَاءَنَا وَنِسَاءَنَا، فَأْتِهِ فَإِنْ أَحَبَّ أَنْ يَقْتَصِرَ عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ فَعَلَ، وَإِنْ أَبَى إِلاَّ أَنْ يُعْلِنَ ذَلِكَ فَسَلْهُ أَنْ يَرُدَّ إِلَيْكَ ذِمَّتَكَ، فَإِنَّا كَرِهْنَا أَنْ نُخْفِرَكَ، وَلَسْنَا مُقِرِّينَ لأَبِي بَكْرٍ الاِسْتِعْلاَنَ‏.‏ قَالَتْ عَائِشَةُ فَأَتَى ابْنُ الدَّغِنَةِ أَبَا بَكْرٍ، فَقَالَ قَدْ عَلِمْتَ الَّذِي عَقَدْتُ لَكَ عَلَيْهِ، فَإِمَّا أَنْ تَقْتَصِرَ عَلَى ذَلِكَ وَإِمَّا أَنْ تَرُدَّ إِلَىَّ ذِمَّتِي، فَإِنِّي لاَ أُحِبُّ أَنْ تَسْمَعَ الْعَرَبُ أَنِّي أُخْفِرْتُ فِي رَجُلٍ عَقَدْتُ لَهُ‏.‏ قَالَ أَبُو بَكْرٍ إِنِّي أَرُدُّ إِلَيْكَ جِوَارَكَ، وَأَرْضَى بِجِوَارِ اللَّهِ‏.‏ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ بِمَكَّةَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أُرِيتُ دَارَ هِجْرَتِكُمْ، رَأَيْتُ سَبْخَةً ذَاتَ نَخْلٍ بَيْنَ لاَبَتَيْنِ ‏\"‏‏.‏ وَهُمَا الْحَرَّتَانِ، فَهَاجَرَ مَنْ هَاجَرَ قِبَلَ الْمَدِينَةِ حِينَ ذَكَرَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَرَجَعَ إِلَى الْمَدِينَةِ بَعْضُ مَنْ كَانَ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ، وَتَجَهَّزَ أَبُو بَكْرٍ مُهَاجِرًا، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكَ فَإِنِّي أَرْجُو أَنْ يُؤْذَنَ لِي ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ هَلْ تَرْجُو ذَلِكَ بِأَبِي أَنْتَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَحَبَسَ أَبُو بَكْرٍ نَفْسَهُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِيَصْحَبَهُ وَعَلَفَ رَاحِلَتَيْنِ كَانَتَا عِنْدَهُ وَرَقَ السَّمُرِ أَرْبَعَةَ أَشْهُرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2297In-book reference : Book 39, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2298,
    "id": 2298,
    "url": "https://sunnah.com/bukhari:2298",
    "bookNumber": 39,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "Whenever a dead man in debt was brought to Allah's Messenger (ﷺ) he would ask, \"Has he left anything to \nrepay his debt?\" If he was informed that he had left something to repay his debts, he would offer his \nfuneral prayer, otherwise he would tell the Muslims to offer their friend's funeral prayer. When Allah \nmade the Prophet (ﷺ) wealthy through conquests, he said, \"I am more rightful than other believers to be \nthe guardian of the believers, so if a Muslim dies while in debt, I am responsible for the repayment of \nhis debt, and whoever leaves wealth (after his death) it will belong to his heirs. \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدَّيْنُ فَيَسْأَلُ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ فَضْلاً ‏\"‏‏.‏ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ لِدَيْنِهِ وَفَاءً صَلَّى، وَإِلاَّ قَالَ لِلْمُسْلِمِينَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ تُوُفِّيَ مِنَ الْمُؤْمِنِينَ فَتَرَكَ دَيْنًا فَعَلَىَّ قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2298In-book reference : Book 39, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 37, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2299,
    "id": 2299,
    "url": "https://sunnah.com/bukhari:2299",
    "bookNumber": 40,
    "hadithNumber": 1,
    "narrator": "Narrated `Ali:",
    "english": "Allah's Messenger (ﷺ) ordered me to distribute the saddles and skins of the Budn which I had slaughtered.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَتَصَدَّقَ بِجِلاَلِ الْبُدْنِ الَّتِي نُحِرَتْ وَبِجُلُودِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2299In-book reference : Book 40, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 38, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2300,
    "id": 2300,
    "url": "https://sunnah.com/bukhari:2300",
    "bookNumber": 40,
    "hadithNumber": 2,
    "narrator": "Narrated `Uqba bin Amir:",
    "english": "that the Prophet (ﷺ) had given him sheep to distribute among his companions and a male kid was left \n(after the distribution). When he informed the Prophet (ﷺ) of it, he said (to him), \"Offer it as a sacrifice on \nyour behalf.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"ضَحِّ بِهِ أَنْتَ.\"",
    "reference": "Reference : Sahih al-Bukhari 2300In-book reference : Book 40, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 38, Hadith 497   (deprecated numbering scheme)"
  }
]