[
  {
    "hadithGlobalNumber": 2001,
    "id": 2001,
    "url": "https://sunnah.com/bukhari:2001",
    "bookNumber": 30,
    "hadithNumber": 106,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) ordered (the Muslims) to fast on the day of 'Ashura', and when fasting in the month of \nRamadan was prescribed, it became optional for one to fast on that day ('Ashura') or not.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَمَرَ بِصِيَامِ يَوْمِ عَاشُورَاءَ، فَلَمَّا فُرِضَ رَمَضَانُ كَانَ مَنْ شَاءَ صَامَ، وَمَنْ شَاءَ أَفْطَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2001In-book reference : Book 30, Hadith 106USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2002,
    "id": 2002,
    "url": "https://sunnah.com/bukhari:2002",
    "bookNumber": 30,
    "hadithNumber": 107,
    "narrator": "Narrated Aisha:",
    "english": "Quraish used to fast on the day of 'Ashura' in the Pre-Islamic period, and Allah's Messenger (ﷺ) too, used to \nfast on that day. When he came to Medina, he fasted on that day and ordered others to fast, too. Later \nwhen the fasting of the month of Ramadan was prescribed, he gave up fasting on the day of 'Ashura' \nand it became optional for one to fast on it or not.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ، فَلَمَّا قَدِمَ الْمَدِينَةَ صَامَهُ، وَأَمَرَ بِصِيَامِهِ، فَلَمَّا فُرِضَ رَمَضَانُ تَرَكَ يَوْمَ عَاشُورَاءَ، فَمَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ تَرَكَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2002In-book reference : Book 30, Hadith 107USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2003,
    "id": 2003,
    "url": "https://sunnah.com/bukhari:2003",
    "bookNumber": 30,
    "hadithNumber": 108,
    "narrator": "Narrated Humaid bin `Abdur Rahman:",
    "english": "That he heard Muawiya bin Abi Sufyan on the day of 'Ashura' during the year he performed the Hajj, \nsaying on the pulpit, \"O the people of Medina! Where are your Religious Scholars? I heard Allah's \nApostle saying, 'This is the day of 'Ashura'. Allah has not enjoined its fasting on you but I am fasting \nit. You have the choice either to fast or not to fast (on this day).' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ ـ رضى الله عنهما ـ يَوْمَ عَاشُورَاءَ عَامَ حَجَّ عَلَى الْمِنْبَرِ يَقُولُ يَا أَهْلَ الْمَدِينَةِ، أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ هَذَا يَوْمُ عَاشُورَاءَ، وَلَمْ يُكْتَبْ عَلَيْكُمْ صِيَامُهُ، وَأَنَا صَائِمٌ، فَمَنْ شَاءَ فَلْيَصُمْ وَمَنْ شَاءَ فَلْيُفْطِرْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2003In-book reference : Book 30, Hadith 108USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2004,
    "id": 2004,
    "url": "https://sunnah.com/bukhari:2004",
    "bookNumber": 30,
    "hadithNumber": 109,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) came to Medina and saw the Jews fasting on the day of Ashura. He asked them about \nthat. They replied, \"This is a good day, the day on which Allah rescued Bani Israel from their enemy. \nSo, Moses fasted this day.\" The Prophet (ﷺ) said, \"We have more claim over Moses than you.\" So, the \nProphet fasted on that day and ordered (the Muslims) to fast (on that day).",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ، فَرَأَى الْيَهُودَ تَصُومُ يَوْمَ عَاشُورَاءَ، فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالُوا هَذَا يَوْمٌ صَالِحٌ، هَذَا يَوْمٌ نَجَّى اللَّهُ بَنِي إِسْرَائِيلَ مِنْ عَدُوِّهِمْ، فَصَامَهُ مُوسَى‏.‏ قَالَ ‏\"‏ فَأَنَا أَحَقُّ بِمُوسَى مِنْكُمْ ‏\"‏‏.‏ فَصَامَهُ وَأَمَرَ بِصِيَامِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2004In-book reference : Book 30, Hadith 109USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2005,
    "id": 2005,
    "url": "https://sunnah.com/bukhari:2005",
    "bookNumber": 30,
    "hadithNumber": 110,
    "narrator": "Narrated Abu Musa:",
    "english": "The day of 'Ashura' was considered as `Id day by the Jews. So the Prophet (ﷺ) ordered, \"I recommend you \n(Muslims) to fast on this day.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي عُمَيْسٍ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كَانَ يَوْمُ عَاشُورَاءَ تَعُدُّهُ الْيَهُودُ عِيدًا، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فَصُومُوهُ أَنْتُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2005In-book reference : Book 30, Hadith 110USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2006,
    "id": 2006,
    "url": "https://sunnah.com/bukhari:2006",
    "bookNumber": 30,
    "hadithNumber": 111,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I never saw the Prophet (ﷺ) seeking to fast on a day that he favored more than another except this day, the day of 'Ashura', and this month, meaning the month of Ramadan.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنِ ابْنِ عُيَيْنَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَحَرَّى صِيَامَ يَوْمٍ فَضَّلَهُ عَلَى غَيْرِهِ، إِلاَّ هَذَا الْيَوْمَ يَوْمَ عَاشُورَاءَ وَهَذَا الشَّهْرَ‏.‏ يَعْنِي شَهْرَ رَمَضَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2006In-book reference : Book 30, Hadith 111USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2007,
    "id": 2007,
    "url": "https://sunnah.com/bukhari:2007",
    "bookNumber": 30,
    "hadithNumber": 112,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "The Prophet (ﷺ) ordered a man from the tribe of Bani Aslam to announce amongst the people that \nwhoever had eaten should fast the rest of the day, and whoever had not eaten should continue his fast, \nas that day was the day of 'Ashura' .",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً مِنْ أَسْلَمَ أَنْ أَذِّنْ فِي النَّاسِ ‏\n\"‏ أَنَّ مَنْ كَانَ أَكَلَ فَلْيَصُمْ بَقِيَّةَ يَوْمِهِ، وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ، فَإِنَّ الْيَوْمَ يَوْمُ عَاشُورَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2007In-book reference : Book 30, Hadith 112USC-MSA web (English) reference : Vol. 3, Book 31, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2008,
    "id": 2008,
    "url": "https://sunnah.com/bukhari:2008",
    "bookNumber": 31,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying regarding Ramadan, \"Whoever prayed at night in it (the month of \nRamadan) out of sincere Faith and hoping for a reward from Allah, then all his previous sins will be \nforgiven.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِرَمَضَانَ ‏\n\"‏ مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2008In-book reference : Book 31, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2009,
    "id": 2009,
    "url": "https://sunnah.com/bukhari:2009",
    "bookNumber": 31,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever prayed at night the whole month of Ramadan out of sincere Faith and hoping for a reward from Allah, then all his previous sins will be forgiven.\" Ibn Shihab (a sub-narrator) said, \"Allah's Messenger (ﷺ) died and the people continued observing that (i.e. Nawafil offered individually, not in congregation), and it remained as it was during the Caliphate of Abu Bakr and in the early days of 'Umar's Caliphate.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ، ثُمَّ كَانَ الأَمْرُ عَلَى ذَلِكَ فِي خِلاَفَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ ـ رضى الله عنهما.‏",
    "reference": "Reference : Sahih al-Bukhari 2009In-book reference : Book 31, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2010,
    "id": 2010,
    "url": "https://sunnah.com/bukhari:2010",
    "bookNumber": 31,
    "hadithNumber": 3,
    "narrator": "",
    "english": "'Abdur Rahman bin 'Abdul Qari said,\n\n\"I went out in the company of 'Umar bin Al-Khattab one night in Ramadan to the mosque and found the people praying in different groups. A man praying alone or a man praying with a little group behind him. So, 'Umar said, 'In my opinion I would better collect these (people) under the leadership of one Qari (Reciter) (i.e. let them pray in congregation!)'. So, he made up his mind to congregate them behind Ubai bin Ka'b. Then on another night I went again in his company and the people were praying behind their reciter. On that, 'Umar remarked, 'What an excellent Bid'a (i.e. innovation in religion) this is; but the prayer which they do not perform, but sleep at its time is better than the one they are offering.' He meant the prayer in the last part of the night. (In those days) people used to pray in the early part of the night.\"",
    "arabic": "وَعَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ لَيْلَةً فِي رَمَضَانَ، إِلَى الْمَسْجِدِ، فَإِذَا النَّاسُ أَوْزَاعٌ مُتَفَرِّقُونَ يُصَلِّي الرَّجُلُ لِنَفْسِهِ، وَيُصَلِّي الرَّجُلُ فَيُصَلِّي بِصَلاَتِهِ الرَّهْطُ فَقَالَ عُمَرُ إِنِّي أَرَى لَوْ جَمَعْتُ هَؤُلاَءِ عَلَى قَارِئٍ وَاحِدٍ لَكَانَ أَمْثَلَ‏.‏ ثُمَّ عَزَمَ فَجَمَعَهُمْ عَلَى أُبَىِّ بْنِ كَعْبٍ، ثُمَّ خَرَجْتُ مَعَهُ لَيْلَةً أُخْرَى، وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ قَارِئِهِمْ، قَالَ عُمَرُ نِعْمَ الْبِدْعَةُ هَذِهِ، وَالَّتِي يَنَامُونَ عَنْهَا أَفْضَلُ مِنَ الَّتِي يَقُومُونَ‏.‏ يُرِيدُ آخِرَ اللَّيْلِ، وَكَانَ النَّاسُ يَقُومُونَ أَوَّلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2010In-book reference : Book 31, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2011,
    "id": 2011,
    "url": "https://sunnah.com/bukhari:2011",
    "bookNumber": 31,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) used to pray (at night) in Ramadan.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، رضى الله عنها زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى وَذَلِكَ فِي رَمَضَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2011In-book reference : Book 31, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2012,
    "id": 2012,
    "url": "https://sunnah.com/bukhari:2012",
    "bookNumber": 31,
    "hadithNumber": 5,
    "narrator": "Narrated 'Urwa:",
    "english": "That he was informed by `Aisha, \"Allah's Messenger (ﷺ) went out in the middle of the night and prayed in \nthe mosque and some men prayed behind him. In the morning, the people spoke about it and then a \nlarge number of them gathered and prayed behind him (on the second night). In the next morning the \npeople again talked about it and on the third night the mosque was full with a large number of people. \nAllah's Messenger (ﷺ) came out and the people prayed behind him. On the fourth night the Mosque was \noverwhelmed with people and could not accommodate them, but the Prophet (ﷺ) came out (only) for the \nmorning prayer. When the morning prayer was finished he recited Tashah-hud and (addressing the \npeople) said, \"Amma ba'du, your presence was not hidden from me but I was afraid lest the night \nprayer (Qiyam) should be enjoined on you and you might not be able to carry it on.\" So, Allah's \nApostle died and the situation remained like that (i.e. people prayed individually). \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ لَيْلَةً مِنْ جَوْفِ اللَّيْلِ، فَصَلَّى فِي الْمَسْجِدِ، وَصَلَّى رِجَالٌ بِصَلاَتِهِ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ، فَصَلَّوْا مَعَهُ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى، فَصَلَّوْا بِصَلاَتِهِ، فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ، حَتَّى خَرَجَ لِصَلاَةِ الصُّبْحِ، فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ، فَتَشَهَّدَ ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ، فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ مَكَانُكُمْ، وَلَكِنِّي خَشِيتُ أَنْ تُفْتَرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَا ‏\"‏‏.‏ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ",
    "reference": "Reference : Sahih al-Bukhari 2012In-book reference : Book 31, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2013,
    "id": 2013,
    "url": "https://sunnah.com/bukhari:2013",
    "bookNumber": 31,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Salama bin `Abdur Rahman:",
    "english": "that he asked `Aisha \"How was the prayer of Allah's Messenger (ﷺ) in Ramadan?\" She replied, \"He did not \npray more than eleven rak`at in Ramadan or in any other month. He used to pray four rak`at ---- let \nalone their beauty and length----and then he would pray four ----let alone their beauty and length ---- \nand then he would pray three rak`at (witr).\" She added, \"I asked, 'O Allah's Messenger (ﷺ)! Do you sleep \nbefore praying the witr?' He replied, 'O `Aisha! My eyes sleep but my heart does not sleep.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ مَا كَانَ يَزِيدُ فِي رَمَضَانَ، وَلاَ فِي غَيْرِهَا عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاَثًا‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ ‏\n\"‏ يَا عَائِشَةُ إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2013In-book reference : Book 31, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2014,
    "id": 2014,
    "url": "https://sunnah.com/bukhari:2014",
    "bookNumber": 32,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Whoever fasted the month of Ramadan out of sincere Faith (i.e. belief) and hoping \nfor a reward from Allah, then all his past sins will be forgiven, and whoever stood for the prayers in \nthe night of Qadr out of sincere Faith and hoping for a reward from Allah, then all his previous sins \nwill be forgiven .\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ وَإِنَّمَا حَفِظَ مِنَ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ، وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ تَابَعَهُ سُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2014In-book reference : Book 32, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2015,
    "id": 2015,
    "url": "https://sunnah.com/bukhari:2015",
    "bookNumber": 32,
    "hadithNumber": 2,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Some men amongst the companions of the Prophet (ﷺ) were shown in their dreams that the night of Qadr \nwas in the last seven nights of Ramadan. Allah's Messenger (ﷺ) said, \"It seems that all your dreams agree \nthat (the Night of Qadr) is in the last seven nights, and whoever wants to search for it (i.e. the Night of \nQadr) should search in the last seven (nights of Ramadan).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رِجَالاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ فِي السَّبْعِ الأَوَاخِرِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرِّيَهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2015In-book reference : Book 32, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2016,
    "id": 2016,
    "url": "https://sunnah.com/bukhari:2016",
    "bookNumber": 32,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Salama:",
    "english": "I asked Abu Sa`id, and he was a friend of mine, (about the Night of Qadr) and he said, \"We practiced \nI`tikaf (seclusion in the mosque) in the middle third of the month of Ramadan with the Prophet (ﷺ) . In the \nmorning of the 20th of Ramadan, the Prophet (ﷺ) came and addressed us and said, 'I was informed of (the \ndate of the Night of Qadr) but I was caused to forget it; so search for it in the odd nights of the last ten \nnights of the month of Ramadan. (In the dream) I saw myself prostrating in mud and water (as a sign). \nSo, whoever was in I`tikaf with me should return to it with me (for another 10-day's period)', and we \nreturned. At that time there was no sign of clouds in the sky but suddenly a cloud came and it rained \ntill rainwater started leaking through the roof of the mosque which was made of date-palm leaf stalks. \nThen the prayer was established and I saw Allah's Messenger (ﷺ) prostrating in mud and water and I saw the \ntraces of mud on his forehead.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ أَبَا سَعِيدٍ وَكَانَ لِي صَدِيقًا فَقَالَ اعْتَكَفْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ مِنْ رَمَضَانَ، فَخَرَجَ صَبِيحَةَ عِشْرِينَ، فَخَطَبَنَا وَقَالَ ‏\n\"‏ إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ، ثُمَّ أُنْسِيتُهَا أَوْ نُسِّيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي الْوَتْرِ، وَإِنِّي رَأَيْتُ أَنِّي أَسْجُدُ فِي مَاءٍ وَطِينٍ، فَمَنْ كَانَ اعْتَكَفَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْيَرْجِعْ ‏\"‏‏.‏ فَرَجَعْنَا وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً، فَجَاءَتْ سَحَابَةٌ فَمَطَرَتْ حَتَّى سَالَ سَقْفُ الْمَسْجِدِ وَكَانَ مِنْ جَرِيدِ النَّخْلِ، وَأُقِيمَتِ الصَّلاَةُ، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْجُدُ فِي الْمَاءِ وَالطِّينِ، حَتَّى رَأَيْتُ أَثَرَ الطِّينِ فِي جَبْهَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2016In-book reference : Book 32, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 233   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2017,
    "id": 2017,
    "url": "https://sunnah.com/bukhari:2017",
    "bookNumber": 32,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"Search for the Night of Qadr in the odd nights of the last ten days of Ramadan.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْوِتْرِ مِنَ الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2017In-book reference : Book 32, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2018,
    "id": 2018,
    "url": "https://sunnah.com/bukhari:2018",
    "bookNumber": 32,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after \npassing the twenty nights he used to go back to his house on the 21st, and the people who were in \nI`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, \nhe established the night prayers at the night in which he used to return home, and then he addressed \nthe people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf \nfor these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the \nmonth); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been \nshown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the \nlast ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the \nnight of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking \nthrough the roof of the mosque at the praying place of the Prophet (ﷺ) . I saw with my own eyes the \nProphet at the completion of the morning prayer leaving with his face covered with mud and water.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ‏.‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُجَاوِرُ فِي رَمَضَانَ الْعَشْرَ الَّتِي فِي وَسَطِ الشَّهْرِ، فَإِذَا كَانَ حِينَ يُمْسِي مِنْ عِشْرِينَ لَيْلَةً تَمْضِي، وَيَسْتَقْبِلُ إِحْدَى وَعِشْرِينَ، رَجَعَ إِلَى مَسْكَنِهِ وَرَجَعَ مَنْ كَانَ يُجَاوِرُ مَعَهُ‏.‏ وَأَنَّهُ أَقَامَ فِي شَهْرٍ جَاوَرَ فِيهِ اللَّيْلَةَ الَّتِي كَانَ يَرْجِعُ فِيهَا، فَخَطَبَ النَّاسَ، فَأَمَرَهُمْ مَا شَاءَ اللَّهُ، ثُمَّ قَالَ ‏\n\"‏ كُنْتُ أُجَاوِرُ هَذِهِ الْعَشْرَ، ثُمَّ قَدْ بَدَا لِي أَنْ أُجَاوِرَ هَذِهِ الْعَشْرَ الأَوَاخِرَ، فَمَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَثْبُتْ فِي مُعْتَكَفِهِ، وَقَدْ أُرِيتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا فَابْتَغُوهَا فِي الْعَشْرِ الأَوَاخِرِ وَابْتَغُوهَا فِي كُلِّ وِتْرٍ، وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏‏.‏ فَاسْتَهَلَّتِ السَّمَاءُ فِي تِلْكَ اللَّيْلَةِ، فَأَمْطَرَتْ، فَوَكَفَ الْمَسْجِدُ فِي مُصَلَّى النَّبِيِّ صلى الله عليه وسلم لَيْلَةَ إِحْدَى وَعِشْرِينَ، فَبَصُرَتْ عَيْنِي رَسُولَ اللَّهِ صلى الله عليه وسلم وَنَظَرْتُ إِلَيْهِ انْصَرَفَ مِنَ الصُّبْحِ، وَوَجْهُهُ مُمْتَلِئٌ طِينًا وَمَاءً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2018In-book reference : Book 32, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2019,
    "id": 2019,
    "url": "https://sunnah.com/bukhari:2019",
    "bookNumber": 32,
    "hadithNumber": 6,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"Look for (the Night of Qadr).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْتَمِسُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2019In-book reference : Book 32, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2020,
    "id": 2020,
    "url": "https://sunnah.com/bukhari:2020",
    "bookNumber": 32,
    "hadithNumber": 7,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten nights of Ramadan and used to say, \"Look for \nthe Night of Qadr in the last ten nights of the month of Ramadan.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُجَاوِرُ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، وَيَقُولُ ‏\n\"‏ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2020In-book reference : Book 32, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 237   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2021,
    "id": 2021,
    "url": "https://sunnah.com/bukhari:2021",
    "bookNumber": 32,
    "hadithNumber": 8,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"Look for the Night of Qadr in the last ten nights of Ramadan ,' on the night when \nnine or seven or five nights remain out of the last ten nights of Ramadan (i.e. 21, 23, 25, respectively).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ لَيْلَةَ الْقَدْرِ فِي تَاسِعَةٍ تَبْقَى، فِي سَابِعَةٍ تَبْقَى، فِي خَامِسَةٍ تَبْقَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2021In-book reference : Book 32, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2022,
    "id": 2022,
    "url": "https://sunnah.com/bukhari:2022",
    "bookNumber": 32,
    "hadithNumber": 9,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on \nthe first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it \non the twenty-fourth (of Ramadan).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي مِجْلَزٍ، وَعِكْرِمَةَ، قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هِيَ فِي الْعَشْرِ، هِيَ فِي تِسْعٍ يَمْضِينَ أَوْ فِي سَبْعٍ يَبْقَيْنَ ‏\"‏‏.‏ يَعْنِي لَيْلَةَ الْقَدْرِ‏.‏ قَالَ عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ‏.‏ وَعَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ الْتَمِسُوا فِي أَرْبَعٍ وَعِشْرِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2022In-book reference : Book 32, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2023,
    "id": 2023,
    "url": "https://sunnah.com/bukhari:2023",
    "bookNumber": 32,
    "hadithNumber": 10,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "The Prophet (ﷺ) came out to inform us about the Night of Qadr but two Muslims were quarreling with \neach other. So, the Prophet (ﷺ) said, \"I came out to inform you about the Night of Qadr but such-and-such \npersons were quarreling, so the news about it had been taken away; yet that might be for your own \ngood, so search for it on the 29th, 27th and 25th (of Ramadan).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا أَنَسٌ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم لِيُخْبِرَنَا بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى رَجُلاَنِ مِنَ الْمُسْلِمِينَ، فَقَالَ ‏\n\"‏ خَرَجْتُ لأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى فُلاَنٌ وَفُلاَنٌ، فَرُفِعَتْ، وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ، فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2023In-book reference : Book 32, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2024,
    "id": 2024,
    "url": "https://sunnah.com/bukhari:2024",
    "bookNumber": 32,
    "hadithNumber": 11,
    "narrator": "Narrated Aisha:",
    "english": "With the start of the last ten days of Ramadan, the Prophet (ﷺ) used to tighten his waist belt (i.e. work \nhard) and used to pray all the night, and used to keep his family awake for the prayers.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي يَعْفُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ، وَأَحْيَا لَيْلَهُ، وَأَيْقَظَ أَهْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2024In-book reference : Book 32, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 32, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2025,
    "id": 2025,
    "url": "https://sunnah.com/bukhari:2025",
    "bookNumber": 33,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten days of the month of Ramadan.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، أَنَّ نَافِعًا، أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2025In-book reference : Book 33, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2026,
    "id": 2026,
    "url": "https://sunnah.com/bukhari:2026",
    "bookNumber": 33,
    "hadithNumber": 2,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) The Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan till he \ndied and then his wives used to practice I`tikaf after him.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2026In-book reference : Book 33, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2027,
    "id": 2027,
    "url": "https://sunnah.com/bukhari:2027",
    "bookNumber": 33,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in \nI`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come \nout of his I`tikaf. The Prophet (ﷺ) said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last \nten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In \nthe dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in \nthe last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque \ndribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and \nwater on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَعْتَكِفُ فِي الْعَشْرِ الأَوْسَطِ مِنْ رَمَضَانَ، فَاعْتَكَفَ عَامًا حَتَّى إِذَا كَانَ لَيْلَةَ إِحْدَى وَعِشْرِينَ، وَهِيَ اللَّيْلَةُ الَّتِي يَخْرُجُ مِنْ صَبِيحَتِهَا مِنِ اعْتِكَافِهِ قَالَ ‏\n\"‏ مَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَعْتَكِفِ الْعَشْرَ الأَوَاخِرَ، وَقَدْ أُرِيتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا، وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ مِنْ صَبِيحَتِهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ، وَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ ‏\"‏‏.‏ فَمَطَرَتِ السَّمَاءُ تِلْكَ اللَّيْلَةَ، وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ، فَبَصُرَتْ عَيْنَاىَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى جَبْهَتِهِ أَثَرُ الْمَاءِ وَالطِّينِ، مِنْ صُبْحِ إِحْدَى وَعِشْرِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2027In-book reference : Book 33, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2028,
    "id": 2028,
    "url": "https://sunnah.com/bukhari:2028",
    "bookNumber": 33,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my \nmonthly periods and I would comb and oil his hair.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصْغِي إِلَىَّ رَأْسَهُ وَهْوَ مُجَاوِرٌ فِي الْمَسْجِدِ، فَأُرَجِّلُهُ وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2028In-book reference : Book 33, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2029,
    "id": 2029,
    "url": "https://sunnah.com/bukhari:2029",
    "bookNumber": 33,
    "hadithNumber": 5,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) used to let his head in (the house) while he was in the \nmosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a \nneed.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُدْخِلُ عَلَىَّ رَأْسَهُ وَهْوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ، وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةٍ، إِذَا كَانَ مُعْتَكِفًا",
    "reference": "Reference : Sahih al-Bukhari 2029In-book reference : Book 33, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2030,
    "id": 2030,
    "url": "https://sunnah.com/bukhari:2030",
    "bookNumber": 33,
    "hadithNumber": 6,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏ وَكَانَ يُخْرِجُ رَأْسَهُ مِنَ الْمَسْجِدِ وَهْوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2030, 2031In-book reference : Book 33, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2031,
    "id": 2031,
    "url": "https://sunnah.com/bukhari:2031",
    "bookNumber": 33,
    "hadithNumber": 6,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to embrace me during my menses. He also used to put his head out of the mosque \nwhile he was in I`tikaf, and I would wash it during my menses.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏ وَكَانَ يُخْرِجُ رَأْسَهُ مِنَ الْمَسْجِدِ وَهْوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2030, 2031In-book reference : Book 33, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2032,
    "id": 2032,
    "url": "https://sunnah.com/bukhari:2032",
    "bookNumber": 33,
    "hadithNumber": 7,
    "narrator": "Narrated Ibn `Umar:",
    "english": "`Umar asked the Prophet (ﷺ) \"I vowed in the Pre-Islamic period of ignorance to stay in I`tikaf for one \nnight in Al-Masjid al-Haram.\" The Prophet (ﷺ) said to him, \"Fulfill your vow.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم قَالَ كُنْتُ نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ، قَالَ ‏\n\"‏ فَأَوْفِ بِنَذْرِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2032In-book reference : Book 33, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2033,
    "id": 2033,
    "url": "https://sunnah.com/bukhari:2033",
    "bookNumber": 33,
    "hadithNumber": 8,
    "narrator": "Narrated `Amra:",
    "english": "Aisha said, \"the Prophet (ﷺ) used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a \ntent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the \npermission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab \nbint Jahsh saw it, she pitched another tent. In the morning the Prophet (ﷺ) noticed the tents. He said, \n'What is this?\" He was told of the whole situation. Then the Prophet (ﷺ) said, \"Do you think that they \nintended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and \npracticed I`tikaf for ten days in the month of Shawwal.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، فَكُنْتُ أَضْرِبُ لَهُ خِبَاءً فَيُصَلِّي الصُّبْحَ ثُمَّ يَدْخُلُهُ، فَاسْتَأْذَنَتْ حَفْصَةُ عَائِشَةَ أَنْ تَضْرِبَ خِبَاءً فَأَذِنَتْ لَهَا، فَضَرَبَتْ خِبَاءً، فَلَمَّا رَأَتْهُ زَيْنَبُ ابْنَةُ جَحْشٍ ضَرَبَتْ خِبَاءً آخَرَ، فَلَمَّا أَصْبَحَ النَّبِيُّ صلى الله عليه وسلم رَأَى الأَخْبِيَةَ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَأُخْبِرَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ آلْبِرُّ تُرَوْنَ بِهِنَّ ‏\"‏‏.‏ فَتَرَكَ الاِعْتِكَافَ ذَلِكَ الشَّهْرَ، ثُمَّ اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2033In-book reference : Book 33, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2034,
    "id": 2034,
    "url": "https://sunnah.com/bukhari:2034",
    "bookNumber": 33,
    "hadithNumber": 9,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform \nI`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that \nthey intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf \n(in Ramadan) but performed it in the month of Shawwal for ten days.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرَادَ أَنْ يَعْتَكِفَ، فَلَمَّا انْصَرَفَ إِلَى الْمَكَانِ الَّذِي أَرَادَ أَنْ يَعْتَكِفَ إِذَا أَخْبِيَةٌ خِبَاءُ عَائِشَةَ، وَخِبَاءُ حَفْصَةَ، وَخِبَاءُ زَيْنَبَ، فَقَالَ ‏\n\"‏ آلْبِرَّ تَقُولُونَ بِهِنَّ ‏\"‏‏.‏ ثُمَّ انْصَرَفَ، فَلَمْ يَعْتَكِفْ، حَتَّى اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2034In-book reference : Book 33, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2035,
    "id": 2035,
    "url": "https://sunnah.com/bukhari:2035",
    "bookNumber": 33,
    "hadithNumber": 10,
    "narrator": "Narrated `Ali bin Al-Husain:",
    "english": "Safiya, the wife of the Prophet (ﷺ) told me that she went to Allah's Messenger (ﷺ) to visit him in the mosque \nwhile he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she \ngot up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the \nmosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's \nApostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai.\" Both of \nthem said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The \nProphet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, \n(everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ، فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً، ثُمَّ قَامَتْ تَنْقَلِبُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا يَقْلِبُهَا، حَتَّى إِذَا بَلَغَتْ باب الْمَسْجِدِ عِنْدَ باب أُمِّ سَلَمَةَ مَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ، فَسَلَّمَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّمَا هِيَ صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ فَقَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ وَكَبُرَ عَلَيْهِمَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّيْطَانَ يَبْلُغُ مِنَ الإِنْسَانِ مَبْلَغَ الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَيْئًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2035In-book reference : Book 33, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2036,
    "id": 2036,
    "url": "https://sunnah.com/bukhari:2036",
    "bookNumber": 33,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Salama bin `Abdur-Rahman:",
    "english": "I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He \nreplied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten \ndays of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered \na sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of \nQadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the \nmonth of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of \nQadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned \nto the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came \nand it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) \nprostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ هَارُونَ بْنَ إِسْمَاعِيلَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قُلْتُ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ لَيْلَةَ الْقَدْرِ قَالَ نَعَمِ، اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ مِنْ رَمَضَانَ ـ قَالَ ـ فَخَرَجْنَا صَبِيحَةَ عِشْرِينَ، قَالَ فَخَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَبِيحَةَ عِشْرِينَ فَقَالَ ‏\n\"‏ إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ، وَإِنِّي نُسِّيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي وِتْرٍ، فَإِنِّي رَأَيْتُ أَنِّي أَسْجُدُ فِي مَاءٍ وَطِينٍ، وَمَنْ كَانَ اعْتَكَفَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْيَرْجِعْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ إِلَى الْمَسْجِدِ، وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً ـ قَالَ ـ فَجَاءَتْ سَحَابَةٌ فَمَطَرَتْ، وَأُقِيمَتِ الصَّلاَةُ، فَسَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الطِّينِ وَالْمَاءِ، حَتَّى رَأَيْتُ الطِّينَ فِي أَرْنَبَتِهِ وَجَبْهَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2036In-book reference : Book 33, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2037,
    "id": 2037,
    "url": "https://sunnah.com/bukhari:2037",
    "bookNumber": 33,
    "hadithNumber": 12,
    "narrator": "Narrated `Aisha:",
    "english": "One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her \nperiods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her \nwhen she offered the prayer.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اعْتَكَفَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ مُسْتَحَاضَةٌ، فَكَانَتْ تَرَى الْحُمْرَةَ وَالصُّفْرَةَ، فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا وَهْىَ تُصَلِّي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2037In-book reference : Book 33, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2038,
    "id": 2038,
    "url": "https://sunnah.com/bukhari:2038",
    "bookNumber": 33,
    "hadithNumber": 13,
    "narrator": "Narrated `Ali bin Al-Husain (from Safiya the Prophet's wife):",
    "english": "The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they \ndeparted and the Prophet (ﷺ) said to Safiya bint Huyai, \"Don't hurry up, for I shall accompany you,\" (and \nher dwelling was in the house of Usama). The Prophet (ﷺ) went out and in the meantime two Ansari men \nmet him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is \n(my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's \nApostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the \nhuman being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in \nyour minds.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامٌ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي الْمَسْجِدِ، وَعِنْدَهُ أَزْوَاجُهُ، فَرُحْنَ، فَقَالَ لِصَفِيَّةَ بِنْتِ حُيَىٍّ ‏\"‏ لاَ تَعْجَلِي حَتَّى أَنْصَرِفَ مَعَكِ ‏\"‏‏.‏ وَكَانَ بَيْتُهَا فِي دَارِ أُسَامَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا، فَلَقِيَهُ رَجُلاَنِ مِنَ الأَنْصَارِ، فَنَظَرَا إِلَى النَّبِيِّ صلى الله عليه وسلم ثُمَّ أَجَازَا وَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَعَالَيَا، إِنَّهَا صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يُلْقِيَ فِي أَنْفُسِكُمَا شَيْئًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2038In-book reference : Book 33, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2039,
    "id": 2039,
    "url": "https://sunnah.com/bukhari:2039",
    "bookNumber": 33,
    "hadithNumber": 14,
    "narrator": "Narrated `Ali bin Al-Husain from Safiya:",
    "english": "Safiya went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her \nwalking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come \nhere. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). \nAnd Satan circulates in the body of Adam's offspring as his blood circulates in it.\" \n(A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يُخْبِرُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّ صَفِيَّةَ ـ رضى الله عنها ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُعْتَكِفٌ، فَلَمَّا رَجَعَتْ مَشَى مَعَهَا، فَأَبْصَرَهُ رَجُلٌ مِنَ الأَنْصَارِ، فَلَمَّا أَبْصَرَهُ دَعَاهُ فَقَالَ ‏\n\"‏ تَعَالَ هِيَ صَفِيَّةُ ـ وَرُبَّمَا قَالَ سُفْيَانُ هَذِهِ صَفِيَّةُ ـ فَإِنَّ الشَّيْطَانَ يَجْرِي مِنَ ابْنِ آدَمَ مَجْرَى الدَّمِ ‏\"‏‏.‏ قُلْتُ لِسُفْيَانَ أَتَتْهُ لَيْلاً قَالَ وَهَلْ هُوَ إِلاَّ لَيْلٌ",
    "reference": "Reference : Sahih al-Bukhari 2039In-book reference : Book 33, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2040,
    "id": 2040,
    "url": "https://sunnah.com/bukhari:2040",
    "bookNumber": 33,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Sa`id:",
    "english": "We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the \ntwentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever \nwas m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this \nNight (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky \nwas overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was \ncovered with clouds from the end of that day, and the mosque which was roofed with leafstalks of \ndate palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) \nand its tip.",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، خَالِ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ سُفْيَانُ وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ وَأَظُنُّ أَنَّ ابْنَ أَبِي لَبِيدٍ، حَدَّثَنَا عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ، فَلَمَّا كَانَ صَبِيحَةَ عِشْرِينَ نَقَلْنَا مَتَاعَنَا فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ اعْتَكَفَ فَلْيَرْجِعْ إِلَى مُعْتَكَفِهِ فَإِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ، وَرَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏‏.‏ فَلَمَّا رَجَعَ إِلَى مُعْتَكَفِهِ، وَهَاجَتِ السَّمَاءُ، فَمُطِرْنَا فَوَالَّذِي بَعَثَهُ بِالْحَقِّ لَقَدْ هَاجَتِ السَّمَاءُ مِنْ آخِرِ ذَلِكَ الْيَوْمِ، وَكَانَ الْمَسْجِدُ عَرِيشًا، فَلَقَدْ رَأَيْتُ عَلَى أَنْفِهِ وَأَرْنَبَتِهِ أَثَرَ الْمَاءِ وَالطِّينِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2040In-book reference : Book 33, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2041,
    "id": 2041,
    "url": "https://sunnah.com/bukhari:2041",
    "bookNumber": 33,
    "hadithNumber": 16,
    "narrator": "Narrated `Amra bint `Abdur-Rahman from `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the \nmorning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice \nI`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also \npitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the \nmorning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is \nthis?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove \nthe tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform \nI`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ، وَإِذَا صَلَّى الْغَدَاةَ دَخَلَ مَكَانَهُ الَّذِي اعْتَكَفَ فِيهِ ـ قَالَ ـ فَاسْتَأْذَنَتْهُ عَائِشَةُ أَنْ تَعْتَكِفَ فَأَذِنَ لَهَا فَضَرَبَتْ فِيهِ قُبَّةً، فَسَمِعَتْ بِهَا حَفْصَةُ، فَضَرَبَتْ قُبَّةً، وَسَمِعَتْ زَيْنَبُ بِهَا، فَضَرَبَتْ قُبَّةً أُخْرَى، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْغَدِ أَبْصَرَ أَرْبَعَ قِبَابٍ، فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَأُخْبِرَ خَبَرَهُنَّ، فَقَالَ ‏\"‏ مَا حَمَلَهُنَّ عَلَى هَذَا آلْبِرُّ انْزِعُوهَا فَلاَ أَرَاهَا ‏\"‏‏.‏ فَنُزِعَتْ، فَلَمْ يَعْتَكِفْ فِي رَمَضَانَ حَتَّى اعْتَكَفَ فِي آخِرِ الْعَشْرِ مِنْ شَوَّالٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2041In-book reference : Book 33, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2042,
    "id": 2042,
    "url": "https://sunnah.com/bukhari:2042",
    "bookNumber": 33,
    "hadithNumber": 17,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in \nAl-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for \none night.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَوْفِ نَذْرَكَ ‏\"‏‏.‏ فَاعْتَكَفَ لَيْلَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2042In-book reference : Book 33, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2043,
    "id": 2043,
    "url": "https://sunnah.com/bukhari:2043",
    "bookNumber": 33,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Umar:",
    "english": "that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator \nthinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \n\"Fulfill your vow.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ ـ رضى الله عنه ـ نَذَرَ فِي الْجَاهِلِيَّةِ أَنْ يَعْتَكِفَ فِي الْمَسْجِدِ الْحَرَامِ ـ قَالَ أُرَاهُ قَالَ ـ لَيْلَةً قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2043In-book reference : Book 33, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2044,
    "id": 2044,
    "url": "https://sunnah.com/bukhari:2044",
    "bookNumber": 33,
    "hadithNumber": 19,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was \nthe year of his death, he stayed in I`tikaf for twenty days.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ عَشْرَةَ أَيَّامٍ، فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2044In-book reference : Book 33, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2045,
    "id": 2045,
    "url": "https://sunnah.com/bukhari:2045",
    "bookNumber": 33,
    "hadithNumber": 20,
    "narrator": "Narrated `Amra bint `Abdur-Rahman from `Aisha:",
    "english": "Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَتْنِي عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ أَنْ يَعْتَكِفَ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ، فَاسْتَأْذَنَتْهُ عَائِشَةُ فَأَذِنَ لَهَا، وَسَأَلَتْ حَفْصَةُ عَائِشَةَ أَنْ تَسْتَأْذِنَ لَهَا فَفَعَلَتْ فَلَمَّا رَأَتْ ذَلِكَ زَيْنَبُ ابْنَةُ جَحْشٍ أَمَرَتْ بِبِنَاءٍ فَبُنِيَ لَهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى انْصَرَفَ إِلَى بِنَائِهِ فَبَصُرَ بِالأَبْنِيَةِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالُوا بِنَاءُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آلْبِرَّ أَرَدْنَ بِهَذَا مَا أَنَا بِمُعْتَكِفٍ ‏\"‏‏.‏ فَرَجَعَ، فَلَمَّا أَفْطَرَ اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2045In-book reference : Book 33, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2046,
    "id": 2046,
    "url": "https://sunnah.com/bukhari:2046",
    "bookNumber": 33,
    "hadithNumber": 21,
    "narrator": "Narrated `Urwa:",
    "english": "Aisha during her menses used to comb and oil the hair of the Prophet (ﷺ) while he used to be in I`tikaf in \nthe mosque. He would stretch out his head towards her while she was in her chamber.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تُرَجِّلُ النَّبِيَّ صلى الله عليه وسلم وَهِيَ حَائِضٌ وَهْوَ مُعْتَكِفٌ فِي الْمَسْجِدِ وَهْىَ فِي حُجْرَتِهَا، يُنَاوِلُهَا رَأْسَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2046In-book reference : Book 33, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 33, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2047,
    "id": 2047,
    "url": "https://sunnah.com/bukhari:2047",
    "bookNumber": 34,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "You people say that Abu Huraira tells many narrations from Allah's Messenger (ﷺ) and you also wonder why \nthe emigrants and Ansar do not narrate from Allah's Messenger (ﷺ) as Abu Huraira does. My emigrant \nbrothers were busy in the market while I used to stick to Allah's Messenger (ﷺ) content with what fills my \nstomach; so I used to be present when they were absent and I used to remember when they used to \nforget, and my Ansari brothers used to be busy with their properties and I was one of the poor men of \nSuffa. I used to remember the narrations when they used to forget. No doubt, Allah's Messenger (ﷺ) once \nsaid, \"Whoever spreads his garment till I have finished my present speech and then gathers it to \nhimself, will remember whatever I will say.\" So, I spread my colored garment which I was wearing \ntill Allah's Messenger (ﷺ) had finished his saying, and then I gathered it to my chest. So, I did not forget any \nof that narrations.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ تَقُولُونَ إِنَّ أَبَا هُرَيْرَةَ يُكْثِرُ الْحَدِيثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَتَقُولُونَ مَا بَالُ الْمُهَاجِرِينَ وَالأَنْصَارِ لاَ يُحَدِّثُونَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي هُرَيْرَةَ وَإِنَّ إِخْوَتِي مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمْ صَفْقٌ بِالأَسْوَاقِ، وَكُنْتُ أَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى مِلْءِ بَطْنِي، فَأَشْهَدُ إِذَا غَابُوا وَأَحْفَظُ إِذَا نَسُوا، وَكَانَ يَشْغَلُ إِخْوَتِي مِنَ الأَنْصَارِ عَمَلُ أَمْوَالِهِمْ، وَكُنْتُ امْرَأً مِسْكِينًا مِنْ مَسَاكِينِ الصُّفَّةِ أَعِي حِينَ يَنْسَوْنَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَدِيثٍ يُحَدِّثُهُ ‏\n\"‏ إِنَّهُ لَنْ يَبْسُطَ أَحَدٌ ثَوْبَهُ حَتَّى أَقْضِيَ مَقَالَتِي هَذِهِ، ثُمَّ يَجْمَعَ إِلَيْهِ ثَوْبَهُ إِلاَّ وَعَى مَا أَقُولُ ‏\"‏‏.‏ فَبَسَطْتُ نَمِرَةً عَلَىَّ، حَتَّى إِذَا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَقَالَتَهُ جَمَعْتُهَا إِلَى صَدْرِي، فَمَا نَسِيتُ مِنْ مَقَالَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم تِلْكَ مِنْ شَىْءٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2047In-book reference : Book 34, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2048,
    "id": 2048,
    "url": "https://sunnah.com/bukhari:2048",
    "bookNumber": 34,
    "hadithNumber": 2,
    "narrator": "Narrated Ibrahim bin Sa`d from his father from his grandfather:",
    "english": "`Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Messenger (ﷺ) established a \nbond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the \nrichest among the Ansar, so I will give you half of my wealth and you may look at my two wives and \nwhichever of the two you may choose I will divorce her, and when she has completed the prescribed \nperiod (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is \nthere any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- \nRahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, \nand then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of \nyellow (scent) on his body. Allah's Messenger (ﷺ) asked him whether he had got married. He replied in the \naffirmative. The Prophet (ﷺ) said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then \nthe Prophet (ﷺ) asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh \nto a date stone (or a date stone of gold)! The Prophet (ﷺ) said, 'Give a Walima (wedding banquet) even if \nwith one sheep .' \"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ لَمَّا قَدِمْنَا الْمَدِينَةَ آخَى رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنِي وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ فَقَالَ سَعْدُ بْنُ الرَّبِيعِ إِنِّي أَكْثَرُ الأَنْصَارِ مَالاً، فَأَقْسِمُ لَكَ نِصْفَ مَالِي، وَانْظُرْ أَىَّ زَوْجَتَىَّ هَوِيتَ نَزَلْتُ لَكَ عَنْهَا، فَإِذَا حَلَّتْ تَزَوَّجْتَهَا‏.‏ قَالَ فَقَالَ عَبْدُ الرَّحْمَنِ لاَ حَاجَةَ لِي فِي ذَلِكَ، هَلْ مِنْ سُوقٍ فِيهِ تِجَارَةٌ قَالَ سُوقُ قَيْنُقَاعَ‏.‏ قَالَ فَغَدَا إِلَيْهِ عَبْدُ الرَّحْمَنِ، فَأَتَى بِأَقِطٍ وَسَمْنٍ ـ قَالَ ـ ثُمَّ تَابَعَ الْغُدُوَّ، فَمَا لَبِثَ أَنْ جَاءَ عَبْدُ الرَّحْمَنِ عَلَيْهِ أَثَرُ صُفْرَةٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ وَمَنْ ‏\"‏‏.‏ قَالَ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ كَمْ سُقْتَ ‏\"‏‏.‏ قَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ أَوْ نَوَاةً مِنْ ذَهَبٍ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2048In-book reference : Book 34, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2049,
    "id": 2049,
    "url": "https://sunnah.com/bukhari:2049",
    "bookNumber": 34,
    "hadithNumber": 3,
    "narrator": "Narrated Anas:",
    "english": "When `Abdur-Rahman bin `Auf came to Medina, the Prophet (ﷺ) established a bond of brotherhood \nbetween him and Sa`d bin Ar-Rabi al-Ansari. Sa`d was a rich man, so he said to `Abdur-Rahman, \"I \nwill give you half of my property and will help you marry.\" `Abdur-Rahman said (to him), \"May \nAllah bless you in your family and property. Show me the market.\" So `Abdur-Rahman did not return \nfrom the market) till he gained some dried buttermilk (yogurt) and butter (through trading). He \nbrought that to his house-hold. We stayed for sometime (or as long as Allah wished), and then \n`Abdur-Rahman came, scented with yellowish perfume. The Prophet (ﷺ) said (to him) \"What is this?\" He \nreplied, \"I got married to an Ansari woman.\" The Prophet (ﷺ) asked, \"What did you pay her?\" He replied, \n\"A gold stone or gold equal to the weight of a date stone.\" The Prophet (ﷺ) said (to him), \"Give a wedding \nbanquet even if with one sheep.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْمَدِينَةَ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، وَكَانَ سَعْدٌ ذَا غِنًى، فَقَالَ لِعَبْدِ الرَّحْمَنِ أُقَاسِمُكَ مَالِي نِصْفَيْنِ، وَأُزَوِّجُكَ‏.‏ قَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، دُلُّونِي عَلَى السُّوقِ‏.‏ فَمَا رَجَعَ حَتَّى اسْتَفْضَلَ أَقِطًا وَسَمْنًا، فَأَتَى بِهِ أَهْلَ مَنْزِلِهِ، فَمَكَثْنَا يَسِيرًا ـ أَوْ مَا شَاءَ اللَّهُ ـ فَجَاءَ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْيَمْ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ مَا سُقْتَ إِلَيْهَا ‏\"‏‏.‏ قَالَ نَوَاةً مِنْ ذَهَبٍ، أَوْ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2049In-book reference : Book 34, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2050,
    "id": 2050,
    "url": "https://sunnah.com/bukhari:2050",
    "bookNumber": 34,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Ukaz, Majanna and Dhul-Majaz were marketplaces in the Pre-Islamic period of ignorance. When \nIslam came, Muslims felt that marketing there might be a sin. So, the Divine Inspiration came: \"There \nis no harm for you to seek the bounty of your Lord (in the seasons of Hajj).\" (2.198) Ibn `Abbas \nrecited the Verse in this way.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَتْ عُكَاظٌ وَمِجَنَّةُ وَذُو الْمَجَازِ أَسْوَاقًا فِي الْجَاهِلِيَّةِ، فَلَمَّا كَانَ الإِسْلاَمُ فَكَأَنَّهُمْ تَأَثَّمُوا فِيهِ فَنَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ ‏}‏ فِي مَوَاسِمِ الْحَجِّ، قَرَأَهَا ابْنُ عَبَّاسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2050In-book reference : Book 34, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2051,
    "id": 2051,
    "url": "https://sunnah.com/bukhari:2051",
    "bookNumber": 34,
    "hadithNumber": 5,
    "narrator": "Narrated An-Nu`man bin Bashir:",
    "english": "The Prophet (ﷺ) said \"Both legal and illegal things are obvious, and in between them are (suspicious) \ndoubtful matters. So whoever forsakes those doubtful things lest he may commit a sin, will definitely \navoid what is clearly illegal; and whoever indulges in these (suspicious) doubtful things bravely, is \nlikely to commit what is clearly illegal. Sins are Allah's Hima (i.e. private pasture) and whoever \npastures (his sheep) near it, is likely to get in it at any moment.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنِ الشَّعْبِيِّ، سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ أَبِي فَرْوَةَ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ النُّعْمَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ أَبِي فَرْوَةَ، سَمِعْتُ الشَّعْبِيَّ، سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي فَرْوَةَ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْحَلاَلُ بَيِّنٌ، وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَةٌ، فَمَنْ تَرَكَ مَا شُبِّهَ عَلَيْهِ مِنَ الإِثْمِ كَانَ لِمَا اسْتَبَانَ أَتْرَكَ، وَمَنِ اجْتَرَأَ عَلَى مَا يَشُكُّ فِيهِ مِنَ الإِثْمِ أَوْشَكَ أَنْ يُوَاقِعَ مَا اسْتَبَانَ، وَالْمَعَاصِي حِمَى اللَّهِ، مَنْ يَرْتَعْ حَوْلَ الْحِمَى يُوشِكْ أَنْ يُوَاقِعَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2051In-book reference : Book 34, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 267   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2052,
    "id": 2052,
    "url": "https://sunnah.com/bukhari:2052",
    "bookNumber": 34,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah bin Abu Mulaika:",
    "english": "`Uqba bin Al-Harith said that a black woman came and claimed that she had suckled both of them (i.e. \n`Uqba and his wife). So, he mentioned that to the Prophet (ﷺ) who turned his face from him and smiled \nand said, \"How (can you keep your wife), and it was said (that both of you were suckled by the same \nwoman)?\" His wife was the daughter of Abu Ihab-al-Tamimi.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ أَنَّ امْرَأَةً، سَوْدَاءَ جَاءَتْ، فَزَعَمَتْ أَنَّهَا أَرْضَعَتْهُمَا، فَذَكَرَ لِلنَّبِيِّ فَأَعْرَضَ عَنْهُ، وَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ ‏\n\"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ وَقَدْ كَانَتْ تَحْتَهُ ابْنَةُ أَبِي إِهَابٍ التَّمِيمِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2052In-book reference : Book 34, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2053,
    "id": 2053,
    "url": "https://sunnah.com/bukhari:2053",
    "bookNumber": 34,
    "hadithNumber": 7,
    "narrator": "Narrated Aisha:",
    "english": "`Utba bin Abu Waqqas took a firm promise from his brother Sa`d bin Abu Waqqas to take the son of \nthe slave-girl of Zam`a into his custody as he was his (i.e. `Utba's) son. In the year of the Conquest (of \nMecca) Sa`d bin Abu Waqqas took him, and said that he was his brother's son, and his brother took a \npromise from him to that effect. 'Abu bin Zam`a got up and said, \"He is my brother and the son of the \nslave-girl of my father and was born on my father's bed.\" Then they both went to the Prophet (ﷺ) Sa`d \nsaid, \"O Allah's Messenger (ﷺ)! He is the son of my brother and he has taken a promise from me that I will \ntake him.\" 'Abu bin Zam`a said, \"(He is) my brother and the son of my father's slave-girl and was born \non my father's bed.\" Allah's Messenger (ﷺ) said, \"The boy is for you. O 'Abu bin Zam`a.\" Then the Prophet (ﷺ) \nsaid, \"The son is for the bed (i.e. the man on whose bed he was born) and stones (disappointment and \ndeprivation) for the one who has done illegal sexual intercourse.\" The Prophet (ﷺ) told his wife Sauda bint \nZam`a to screen herself from that boy as he noticed a similarity between the boy and `Utba. So, the \nboy did not see her till he died.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ‏.‏ قَالَتْ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَقَالَ ابْنُ أَخِي، قَدْ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ، فَقَالَ أَخِي، وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ، ابْنُ أَخِي، كَانَ قَدْ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2053In-book reference : Book 34, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2054,
    "id": 2054,
    "url": "https://sunnah.com/bukhari:2054",
    "bookNumber": 34,
    "hadithNumber": 8,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "I asked Allah's Messenger (ﷺ) about Al Mirad (i.e. a sharp-edged piece of wood or a piece of wood provided \nwith a piece of iron used for hunting). He replied, \"If the game is hit by its sharp edge, eat it, and if it \nis hit by its broad side, do not eat it, for it has been beaten to death.\" I asked, \"O Allah's Messenger (ﷺ)! I \nrelease my dog by the name of Allah and find with it at the game, another dog on which I have not \nmentioned the name of Allah, and I do not know which one of them caught the game.\" Allah's Messenger (ﷺ) \nsaid (to him), 'Don't eat it as you have mentioned the name of Allah on your dog and not on the other \ndog.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الْمِعْرَاضِ فَقَالَ ‏\"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ، وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ، فَإِنَّهُ وَقِيذٌ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كَلْبِي وَأُسَمِّي، فَأَجِدُ مَعَهُ عَلَى الصَّيْدِ كَلْبًا آخَرَ لَمْ أُسَمِّ عَلَيْهِ، وَلاَ أَدْرِي أَيُّهُمَا أَخَذَ‏.‏ قَالَ ‏\"‏ لاَ تَأْكُلْ، إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى الآخَرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2054In-book reference : Book 34, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2055,
    "id": 2055,
    "url": "https://sunnah.com/bukhari:2055",
    "bookNumber": 34,
    "hadithNumber": 9,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) passed by a fallen date and said, \"Were it not for my doubt that this might have been \ngiven in charity, I would have eaten it.\" And narrated Abu Huraira the Prophet (ﷺ) said, \"I found a datefruit \nfallen on my bed.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِتَمْرَةٍ مَسْقُوطَةٍ فَقَالَ ‏\"‏ لَوْلاَ أَنْ تَكُونَ صَدَقَةً لأَكَلْتُهَا ‏\"‏‏.‏ وَقَالَ هَمَّامٌ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَجِدُ تَمْرَةً سَاقِطَةً عَلَى فِرَاشِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2055In-book reference : Book 34, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2056,
    "id": 2056,
    "url": "https://sunnah.com/bukhari:2056",
    "bookNumber": 34,
    "hadithNumber": 10,
    "narrator": "Narrated `Abbas bin Tamim:",
    "english": "that his uncle said: \"The Prophet (ﷺ) was asked: If a person feels something during his prayer; should one \ninterrupt his prayer?\" The Prophet (ﷺ) said: No! You should not give it up unless you hear a sound or \nsmell something.\" Narrated Ibn Abi Hafsa: Az-Zuhri said, \"There is no need of repeating ablution \nunless you detect a smell or hear a sound.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ شُكِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم الرَّجُلُ يَجِدُ فِي الصَّلاَةِ شَيْئًا، أَيَقْطَعُ الصَّلاَةَ قَالَ ‏\n\"‏ لاَ، حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏‏.‏ وَقَالَ ابْنُ أَبِي حَفْصَةَ عَنِ الزُّهْرِيِّ لاَ وُضُوءَ إِلاَّ فِيمَا وَجَدْتَ الرِّيحَ أَوْ سَمِعْتَ الصَّوْتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2056In-book reference : Book 34, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2057,
    "id": 2057,
    "url": "https://sunnah.com/bukhari:2057",
    "bookNumber": 34,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "Some people said, \"O Allah's Messenger (ﷺ)! Meat is brought to us by some people and we are not sure \nwhether the name of Allah has been mentioned on it or not (at the time of slaughtering the animals).\" \nAllah's Messenger (ﷺ) said (to them), \"Mention the name of Allah and eat it.\"",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ قَوْمًا، قَالُوا يَا رَسُولَ اللَّهِ، إِنَّ قَوْمًا يَأْتُونَنَا بِاللَّحْمِ لاَ نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهِ أَمْ لاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَمُّوا اللَّهَ عَلَيْهِ وَكُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2057In-book reference : Book 34, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2058,
    "id": 2058,
    "url": "https://sunnah.com/bukhari:2058",
    "bookNumber": 34,
    "hadithNumber": 12,
    "narrator": "Narrated Jabir:",
    "english": "While we were offering the prayer with the Prophet (ﷺ) a caravan carrying food came from Sham. The \npeople looked towards the caravan (and went to it) and only twelve persons remained with the \nProphet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they \ndisperse headlong to it.\" (62.11)",
    "arabic": "حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، حَدَّثَنَا زَائِدَةُ، عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، قَالَ حَدَّثَنِي جَابِرٌ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَتْ مِنَ الشَّأْمِ عِيرٌ، تَحْمِلُ طَعَامًا، فَالْتَفَتُوا إِلَيْهَا، حَتَّى مَا بَقِيَ مَعَ النَّبِيِّ صلى الله عليه وسلم إِلاَّ اثْنَا عَشَرَ رَجُلاً فَنَزَلَتْ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 2058In-book reference : Book 34, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2059,
    "id": 2059,
    "url": "https://sunnah.com/bukhari:2059",
    "bookNumber": 34,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A time will come when one will not care how one gains one's money, legally or \nillegally.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ، لاَ يُبَالِي الْمَرْءُ مَا أَخَذَ مِنْهُ أَمِنَ الْحَلاَلِ أَمْ مِنَ الْحَرَامِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2059In-book reference : Book 34, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2060,
    "id": 2060,
    "url": "https://sunnah.com/bukhari:2060",
    "bookNumber": 34,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Al-Minhal:",
    "english": "I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the \nProphet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam \nabout practicing money exchange. They replied, 'We were traders in the time of Allah's Messenger (ﷺ) and I \nasked Allah's Messenger (ﷺ) about money exchange. He replied, 'If it is from hand to hand, there is no harm \nin it; otherwise it is not permissible.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ أَبِي الْمِنْهَالِ، قَالَ كُنْتُ أَتَّجِرُ فِي الصَّرْفِ، فَسَأَلْتُ زَيْدَ بْنَ أَرْقَمَ ـ رضى الله عنه ـ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏    وَحَدَّثَنِي الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، وَعَامِرُ بْنُ مُصْعَبٍ، أَنَّهُمَا سَمِعَا أَبَا الْمِنْهَالِ، يَقُولُ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ وَزَيْدَ بْنَ أَرْقَمَ عَنِ الصَّرْفِ، فَقَالاَ كُنَّا تَاجِرَيْنِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّرْفِ فَقَالَ ‏\n\"‏ إِنْ كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ، وَإِنْ كَانَ نَسَاءً فَلاَ يَصْلُحُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2060, 2061In-book reference : Book 34, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2061,
    "id": 2061,
    "url": "https://sunnah.com/bukhari:2061",
    "bookNumber": 34,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Al-Minhal:",
    "english": "I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the \nProphet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam \nabout practicing money exchange. They replied, 'We were traders in the time of Allah's Messenger (ﷺ) and I \nasked Allah's Messenger (ﷺ) about money exchange. He replied, 'If it is from hand to hand, there is no harm \nin it; otherwise it is not permissible.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ أَبِي الْمِنْهَالِ، قَالَ كُنْتُ أَتَّجِرُ فِي الصَّرْفِ، فَسَأَلْتُ زَيْدَ بْنَ أَرْقَمَ ـ رضى الله عنه ـ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏    وَحَدَّثَنِي الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، وَعَامِرُ بْنُ مُصْعَبٍ، أَنَّهُمَا سَمِعَا أَبَا الْمِنْهَالِ، يَقُولُ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ وَزَيْدَ بْنَ أَرْقَمَ عَنِ الصَّرْفِ، فَقَالاَ كُنَّا تَاجِرَيْنِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّرْفِ فَقَالَ ‏\n\"‏ إِنْ كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ، وَإِنْ كَانَ نَسَاءً فَلاَ يَصْلُحُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2060, 2061In-book reference : Book 34, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2062,
    "id": 2062,
    "url": "https://sunnah.com/bukhari:2062",
    "bookNumber": 34,
    "hadithNumber": 15,
    "narrator": "Narrated 'Ubaid bin `Umair:",
    "english": "Abu Musa asked `Umar to admit him but he was not admitted as `Umar was busy, so Abu Musa went \nback. When `Umar finished his job he said, \"Didn't I hear the voice of `Abdullah bin Qais? Let him \ncome in.\" `Umar was told that he had left. So, he sent for him and on his arrival, he (Abu Musa) said, \n\"We were ordered to do so (i.e. to leave if not admitted after asking permission thrice). `Umar told \nhim, \"Bring witness in proof of your statement.\" Abu Musa went to the Ansar's meeting places and \nasked them. They said, \"None amongst us will give this witness except the youngest of us, Abu Sa`id \nAl-Khudri. Abu Musa then took Abu Sa`id Al-Khudri (to `Umar) and `Umar said, surprisingly, \"Has \nthis order of Allah's Messenger (ﷺ) been hidden from me?\" (Then he added), \"I used to be busy trading in \nmarkets.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ، اسْتَأْذَنَ عَلَى عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ فَلَمْ يُؤْذَنْ لَهُ، وَكَأَنَّهُ كَانَ مَشْغُولاً فَرَجَعَ أَبُو مُوسَى، فَفَرَغَ عُمَرُ فَقَالَ أَلَمْ أَسْمَعْ صَوْتَ عَبْدِ اللَّهِ بْنِ قَيْسٍ ائْذَنُوا لَهُ قِيلَ قَدْ رَجَعَ‏.‏ فَدَعَاهُ‏.‏ فَقَالَ كُنَّا نُؤْمَرُ بِذَلِكَ‏.‏ فَقَالَ تَأْتِينِي عَلَى ذَلِكَ بِالْبَيِّنَةِ‏.‏ فَانْطَلَقَ إِلَى مَجْلِسِ الأَنْصَارِ، فَسَأَلَهُمْ‏.‏ فَقَالُوا لاَ يَشْهَدُ لَكَ عَلَى هَذَا إِلاَّ أَصْغَرُنَا أَبُو سَعِيدٍ الْخُدْرِيُّ‏.‏ فَذَهَبَ بِأَبِي سَعِيدٍ الْخُدْرِيِّ‏.‏ فَقَالَ عُمَرُ أَخَفِيَ عَلَىَّ مِنْ أَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَلْهَانِي الصَّفْقُ بِالأَسْوَاقِ‏.‏ يَعْنِي الْخُرُوجَ إِلَى تِجَارَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2062In-book reference : Book 34, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2063,
    "id": 2063,
    "url": "https://sunnah.com/bukhari:2063",
    "bookNumber": 34,
    "hadithNumber": 16,
    "narrator": "",
    "english": "Abu Hurairah (ra) said, \"Allah's Messenger (ﷺ) mentioned a person from Bani Israel who travelled by sea and carried out his needs.\" Then he narrated the whole story. (See Hadith no. 2291)",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ، خَرَجَ فِي الْبَحْرِ فَقَضَى حَاجَتَهُ‏.‏ وَسَاقَ الْحَدِيثَ‏.‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ صَالِحٍ قَالَ حَدَّثَنِي اللَّيْثُ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2063In-book reference : Book 34, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2064,
    "id": 2064,
    "url": "https://sunnah.com/bukhari:2064",
    "bookNumber": 34,
    "hadithNumber": 17,
    "narrator": "Narrated Jabir:",
    "english": "A caravan arrived (at Medina) while we were offering the Jumua prayer with the Prophet. The people \nleft out for the caravan, with the exception of twelve persons. Then this Verse was revealed: 'But \nwhen they see some bargain or some amusement, they disperse headlong to it and leave you \nstanding.\" (62.11)",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ أَقْبَلَتْ عِيرٌ، وَنَحْنُ نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْجُمُعَةَ، فَانْفَضَّ النَّاسُ إِلاَّ اثْنَىْ عَشَرَ رَجُلاً، فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 2064In-book reference : Book 34, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2065,
    "id": 2065,
    "url": "https://sunnah.com/bukhari:2065",
    "bookNumber": 34,
    "hadithNumber": 18,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"If a woman gives in charity from her house meals without wasting (i.e. being \nextravagant), she will get the reward for her giving, and her husband will also get the reward for his \nearning and the storekeeper will also get a similar reward. The acquisition of the reward of none of \nthem will reduce the reward of the others.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا، غَيْرَ مُفْسِدَةٍ، كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ، وَلِزَوْجِهَا بِمَا كَسَبَ، وَلِلْخَازِنِ مِثْلُ ذَلِكَ، لاَ يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2065In-book reference : Book 34, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2066,
    "id": 2066,
    "url": "https://sunnah.com/bukhari:2066",
    "bookNumber": 34,
    "hadithNumber": 19,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"If a woman gives something (i.e. in charity) from her husband's earnings without \nhis permission, she will get half his reward.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ جَعْفَرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا عَنْ غَيْرِ أَمْرِهِ، فَلَهُ نِصْفُ أَجْرِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2066In-book reference : Book 34, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2067,
    "id": 2067,
    "url": "https://sunnah.com/bukhari:2067",
    "bookNumber": 34,
    "hadithNumber": 20,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"whoever desires an expansion in his sustenance and age, should keep \ngood relations with his Kith and kin.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ الْكِرْمَانِيُّ، حَدَّثَنَا حَسَّانُ، حَدَّثَنَا يُونُسُ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ سَرَّهُ أَنْ يُبْسَطَ لَهُ رِزْقُهُ أَوْ يُنْسَأَ لَهُ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2067In-book reference : Book 34, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2068,
    "id": 2068,
    "url": "https://sunnah.com/bukhari:2068",
    "bookNumber": 34,
    "hadithNumber": 21,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) purchased food grains from a Jew on credit and mortgaged his iron armor to him.",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ ذَكَرْنَا عِنْدَ إِبْرَاهِيمَ الرَّهْنَ فِي السَّلَمِ فَقَالَ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى طَعَامًا مِنْ يَهُودِيٍّ إِلَى أَجَلٍ، وَرَهَنَهُ دِرْعًا مِنْ حَدِيدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2068In-book reference : Book 34, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2069,
    "id": 2069,
    "url": "https://sunnah.com/bukhari:2069",
    "bookNumber": 34,
    "hadithNumber": 22,
    "narrator": "Narrated Qatada:",
    "english": "Anas went to the Prophet (ﷺ) with barley bread having some dissolved fat on it. The Prophet (ﷺ) had \nmortgaged his armor to a Jew in Medina and took from him some barley for his family. Anas heard \nhim saying, \"The household of Muhammad did not possess even a single Sa of wheat or food grains \nfor the evening meal, although he has nine wives to look after.\" (See Hadith No. 685)",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، ح‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا أَسْبَاطٌ أَبُو الْيَسَعِ الْبَصْرِيُّ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّهُ مَشَى إِلَى النَّبِيِّ صلى الله عليه وسلم بِخُبْزِ شَعِيرٍ، وَإِهَالَةٍ سَنِخَةٍ، وَلَقَدْ رَهَنَ النَّبِيُّ صلى الله عليه وسلم دِرْعًا لَهُ بِالْمَدِينَةِ عِنْدَ يَهُودِيٍّ، وَأَخَذَ مِنْهُ شَعِيرًا لأَهْلِهِ، وَلَقَدْ سَمِعْتُهُ يَقُولُ ‏\n\"‏ مَا أَمْسَى عِنْدَ آلِ مُحَمَّدٍ صلى الله عليه وسلم صَاعُ بُرٍّ وَلاَ صَاعُ حَبٍّ، وَإِنَّ عِنْدَهُ لَتِسْعَ نِسْوَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2069In-book reference : Book 34, Hadith 22USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2070,
    "id": 2070,
    "url": "https://sunnah.com/bukhari:2070",
    "bookNumber": 34,
    "hadithNumber": 23,
    "narrator": "Narrated `Aisha:",
    "english": "When Abu Bakr As-Siddiq was chosen Caliph, he said, \"My people know that my profession was not \nincapable of providing substance to my family. And as I will be busy serving the Muslim nation, my \nfamily will eat from the National Treasury of Muslims, and I will practice the profession of serving \nthe Muslims.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا اسْتُخْلِفَ أَبُو بَكْرٍ الصِّدِّيقُ قَالَ لَقَدْ عَلِمَ قَوْمِي أَنَّ حِرْفَتِي لَمْ تَكُنْ تَعْجِزُ عَنْ مَئُونَةِ أَهْلِي، وَشُغِلْتُ بِأَمْرِ الْمُسْلِمِينَ، فَسَيَأْكُلُ آلُ أَبِي بَكْرٍ مِنْ هَذَا الْمَالِ وَيَحْتَرِفُ لِلْمُسْلِمِينَ فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2070In-book reference : Book 34, Hadith 23USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2071,
    "id": 2071,
    "url": "https://sunnah.com/bukhari:2071",
    "bookNumber": 34,
    "hadithNumber": 24,
    "narrator": "Narrated Aisha:",
    "english": "The companions of Allah's Messenger (ﷺ) used to practice manual labor, so their sweat used to smell, and \nthey were advised to take a bath.",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدٌ، قَالَ حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم عُمَّالَ أَنْفُسِهِمْ، وَكَانَ يَكُونُ لَهُمْ أَرْوَاحٌ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ‏.‏ رَوَاهُ هَمَّامٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2071In-book reference : Book 34, Hadith 24USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2072,
    "id": 2072,
    "url": "https://sunnah.com/bukhari:2072",
    "bookNumber": 34,
    "hadithNumber": 25,
    "narrator": "Narrated Al-Miqdam:",
    "english": "The Prophet (ﷺ) said, \"Nobody has ever eaten a better meal than that which one has earned by working \nwith one's own hands. The Prophet (ﷺ) of Allah, David used to eat from the earnings of his manual labor.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَأْكُلَ مِنْ عَمَلِ يَدِهِ، وَإِنَّ نَبِيَّ اللَّهِ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ كَانَ يَأْكُلُ مِنْ عَمَلِ يَدِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2072In-book reference : Book 34, Hadith 25USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2073,
    "id": 2073,
    "url": "https://sunnah.com/bukhari:2073",
    "bookNumber": 34,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Prophet (ﷺ) David used not to eat except from the earnings of his manual \nlabor.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ كَانَ لاَ يَأْكُلُ إِلاَّ مِنْ عَمَلِ يَدِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2073In-book reference : Book 34, Hadith 26USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2074,
    "id": 2074,
    "url": "https://sunnah.com/bukhari:2074",
    "bookNumber": 34,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"No doubt, it is\nbetter for any one of you to cut a bundle of\nwood and carry it over his back rather than to\nask someone who may or may not give\nhim.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأَنْ يَحْتَطِبَ أَحَدُكُمْ حُزْمَةً عَلَى ظَهْرِهِ خَيْرٌ مِنْ أَنْ يَسْأَلَ أَحَدًا، فَيُعْطِيَهُ أَوْ يَمْنَعَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2074In-book reference : Book 34, Hadith 27USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2075,
    "id": 2075,
    "url": "https://sunnah.com/bukhari:2075",
    "bookNumber": 34,
    "hadithNumber": 28,
    "narrator": "Narrated Az-Zubair bin Al-Awwam:",
    "english": "The Prophet (ﷺ) said, \"One would rather take a rope and cut wood and carry it than ask others).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لأَنْ يَأْخُذَ أَحَدُكُمْ أَحْبُلَهُ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2075In-book reference : Book 34, Hadith 28USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2076,
    "id": 2076,
    "url": "https://sunnah.com/bukhari:2076",
    "bookNumber": 34,
    "hadithNumber": 29,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"May Allah's mercy be on him who is lenient in his buying, selling, and in \ndemanding back his money.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ مُطَرِّفٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَحِمَ اللَّهُ رَجُلاً سَمْحًا إِذَا بَاعَ، وَإِذَا اشْتَرَى، وَإِذَا اقْتَضَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2076In-book reference : Book 34, Hadith 29USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 290   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2077,
    "id": 2077,
    "url": "https://sunnah.com/bukhari:2077",
    "bookNumber": 34,
    "hadithNumber": 30,
    "narrator": "Narrated Hudhaifa:",
    "english": "The Prophet (ﷺ) said, \"Before your time the angels received the soul of a man and asked him, 'Did you do \nany good deeds (in your life)?' He replied, 'I used to order my employees to grant time to the rich \nperson to pay his debts at his convenience.' So Allah said to the angels; \"Excuse him.\" Rabi said that \n(the dead man said), 'I used to be easy to the rich and grant time to the poor.' Or, in another narration, \n'grant time to the well-off and forgive the needy,' or, 'accept from the well-off and forgive the needy.'",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، أَنَّ رِبْعِيَّ بْنَ حِرَاشٍ، حَدَّثَهُ أَنَّ حُذَيْفَةَ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَلَقَّتِ الْمَلاَئِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ قَالُوا أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا قَالَ كُنْتُ آمُرُ فِتْيَانِي أَنْ يُنْظِرُوا وَيَتَجَاوَزُوا عَنِ الْمُوسِرِ قَالَ قَالَ فَتَجَاوَزُوا عَنْهُ ‏\"‏‏.‏ وَقَالَ أَبُو مَالِكٍ عَنْ رِبْعِيٍّ ‏\"‏ كُنْتُ أُيَسِّرُ عَلَى الْمُوسِرِ وَأُنْظِرُ الْمُعْسِرَ ‏\"‏‏.‏ وَتَابَعَهُ شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ رِبْعِيٍّ‏.‏ وَقَالَ أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ عَنْ رِبْعِيٍّ ‏\"‏ أُنْظِرُ الْمُوسِرَ، وَأَتَجَاوَزُ عَنِ الْمُعْسِرِ ‏\"‏‏.‏ وَقَالَ نُعَيْمُ بْنُ أَبِي هِنْدٍ عَنْ رِبْعِيٍّ ‏\"‏ فَأَقْبَلُ مِنَ الْمُوسِرِ، وَأَتَجَاوَزُ عَنِ الْمُعْسِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2077In-book reference : Book 34, Hadith 30USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 291   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2078,
    "id": 2078,
    "url": "https://sunnah.com/bukhari:2078",
    "bookNumber": 34,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"There was a merchant who used to lend the people, and whenever his debtor was in \nstraitened circumstances, he would say to his employees, 'Forgive him so that Allah may forgive us.' \nSo, Allah forgave him.\"",
    "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ تَاجِرٌ يُدَايِنُ النَّاسَ، فَإِذَا رَأَى مُعْسِرًا قَالَ لِفِتْيَانِهِ تَجَاوَزُوا عَنْهُ، لَعَلَّ اللَّهَ أَنْ يَتَجَاوَزَ عَنَّا، فَتَجَاوَزَ اللَّهُ عَنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2078In-book reference : Book 34, Hadith 31USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 292   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2079,
    "id": 2079,
    "url": "https://sunnah.com/bukhari:2079",
    "bookNumber": 34,
    "hadithNumber": 32,
    "narrator": "Narrated Hakim bin Hizam:",
    "english": "Allah's Messenger (ﷺ) said, \"The seller and the buyer have the right to keep or return goods as long as they \nhave not parted or till they part; and if both the parties spoke the truth and described the defects and \nqualities (of the goods), then they would be blessed in their transaction, and if they told lies or hid \nsomething, then the blessings of their transaction would be lost.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، رَفَعَهُ إِلَى حَكِيمِ بْنِ حِزَامٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ـ أَوْ قَالَ حَتَّى يَتَفَرَّقَا ـ فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا، وَإِنْ كَتَمَا وَكَذَبَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2079In-book reference : Book 34, Hadith 32USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2080,
    "id": 2080,
    "url": "https://sunnah.com/bukhari:2080",
    "bookNumber": 34,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Sa`id:",
    "english": "We used to be given mixed dates (from the booty) and used to sell (barter) two Sas of those dates) for \none Sa (of good dates). The Prophet (ﷺ) said (to us), \"No (bartering of) two Sas for one Sa nor two \nDirhams for one Dirham is permissible\", (as that is a kind of usury). (See Hadith No. 405).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ، وَهْوَ الْخِلْطُ مِنَ التَّمْرِ، وَكُنَّا نَبِيعُ صَاعَيْنِ بِصَاعٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ صَاعَيْنِ بِصَاعٍ، وَلاَ دِرْهَمَيْنِ بِدِرْهَمٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2080In-book reference : Book 34, Hadith 33USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 294   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2081,
    "id": 2081,
    "url": "https://sunnah.com/bukhari:2081",
    "bookNumber": 34,
    "hadithNumber": 34,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "An Ansari man, called Abu Shu'aib, came and told his butcher slave, \"Prepare meals sufficient for five \npersons, for I want to invite the Prophet (ﷺ) along with four other persons as I saw signs of hunger on his \nface.\" Abu Shu'aib invited them and another person came along with them. The Prophet (ﷺ) said (to Abu \nShu'aib), This man followed us, so if you allow him, he will join us, and if you want him to return, he \nwill go back.\" Abu Shu'aib said, \"No, I have allowed him (i.e. he, too, is welcomed to the meal).",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ أَبِي مَسْعُودٍ، قَالَ جَاءَ رَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ فَقَالَ لِغُلاَمٍ لَهُ قَصَّابٍ اجْعَلْ لِي طَعَامًا يَكْفِي خَمْسَةً، فَإِنِّي أُرِيدُ أَنْ أَدْعُوَ النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَإِنِّي قَدْ عَرَفْتُ فِي وَجْهِهِ الْجُوعَ‏.‏ فَدَعَاهُمْ، فَجَاءَ مَعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ هَذَا قَدْ تَبِعَنَا، فَإِنْ شِئْتَ أَنْ تَأْذَنَ لَهُ فَأْذَنْ لَهُ، وَإِنْ شِئْتَ أَنْ يَرْجِعَ رَجَعَ ‏\"‏‏.‏ فَقَالَ لاَ، بَلْ قَدْ أَذِنْتُ لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2081In-book reference : Book 34, Hadith 34USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 295   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2082,
    "id": 2082,
    "url": "https://sunnah.com/bukhari:2082",
    "bookNumber": 34,
    "hadithNumber": 35,
    "narrator": "Narrated Hakim bin Hizam:",
    "english": "The Prophet (ﷺ) aid, \"The buyer and the seller have the option to cancel or to confirm the deal, as long as \nthey have not parted or till they part, and if they spoke the truth and told each other the defects of the \nthings, then blessings would be in their deal, and if they hid something and told lies, the blessing of \nthe deal would be lost.\"",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْخَلِيلِ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ـ أَوْ قَالَ حَتَّى يَتَفَرَّقَا ـ فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا، وَإِنْ كَتَمَا وَكَذَبَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2082In-book reference : Book 34, Hadith 35USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2083,
    "id": 2083,
    "url": "https://sunnah.com/bukhari:2083",
    "bookNumber": 34,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Hurairah (ra):",
    "english": "The Prophet (ﷺ) said \"Certainly a time will come when people will not bother to know from where they earned the money, by lawful means or unlawful means.\" (See Hadith no. 2050)",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لاَ يُبَالِي الْمَرْءُ بِمَا أَخَذَ الْمَالَ، أَمِنْ حَلاَلٍ أَمْ مِنْ حَرَامٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2083In-book reference : Book 34, Hadith 36USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2084,
    "id": 2084,
    "url": "https://sunnah.com/bukhari:2084",
    "bookNumber": 34,
    "hadithNumber": 37,
    "narrator": "Narrated Aisha:",
    "english": "When the last Verses of Surat al- Baqara were revealed, the Prophet (ﷺ) recited them in the mosque and \nproclaimed the trade of alcohol as illegal.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا نَزَلَتْ آخِرُ الْبَقَرَةِ قَرَأَهُنَّ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِمْ فِي الْمَسْجِدِ، ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2084In-book reference : Book 34, Hadith 37USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2085,
    "id": 2085,
    "url": "https://sunnah.com/bukhari:2085",
    "bookNumber": 34,
    "hadithNumber": 38,
    "narrator": "Narrated Samura bin Jundab:",
    "english": "The Prophet (ﷺ) said, \"This night I dreamt that two men came and took me to a Holy land whence we \nproceeded on till we reached a river of blood, where a man was standing, and on its bank was standing \nanother man with stones in his hands. The man in the middle of the river tried to come out, but the \nother threw a stone in his mouth and forced him to go back to his original place. So, whenever he tried \nto come out, the other man would throw a stone in his mouth and force him to go back to his former \nplace. I asked, 'Who is this?' I was told, 'The person in the river was a Riba-eater.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ اللَّيْلَةَ رَجُلَيْنِ أَتَيَانِي، فَأَخْرَجَانِي إِلَى أَرْضٍ مُقَدَّسَةٍ، فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى نَهَرٍ مِنْ دَمٍ فِيهِ رَجُلٌ قَائِمٌ، وَعَلَى وَسَطِ النَّهْرِ رَجُلٌ بَيْنَ يَدَيْهِ حِجَارَةٌ، فَأَقْبَلَ الرَّجُلُ الَّذِي فِي النَّهَرِ فَإِذَا أَرَادَ الرَّجُلُ أَنْ يَخْرُجَ رَمَى الرَّجُلُ بِحَجَرٍ فِي فِيهِ فَرَدَّهُ حَيْثُ كَانَ، فَجَعَلَ كُلَّمَا جَاءَ لِيَخْرُجَ رَمَى فِي فِيهِ بِحَجَرٍ، فَيَرْجِعُ كَمَا كَانَ، فَقُلْتُ مَا هَذَا فَقَالَ الَّذِي رَأَيْتَهُ فِي النَّهَرِ آكِلُ الرِّبَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2085In-book reference : Book 34, Hadith 38USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 298   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2086,
    "id": 2086,
    "url": "https://sunnah.com/bukhari:2086",
    "bookNumber": 34,
    "hadithNumber": 39,
    "narrator": "Narrated `Aun bin Abu Juhaifa:",
    "english": "My father bought a slave who practiced the profession of cupping. (My father broke the slave's \ninstruments of cupping). I asked my father why he had done so. He replied, \"The Prophet (ﷺ) forbade the \nacceptance of the price of a dog or blood, and also forbade the profession of tattooing, getting tattooed \nand receiving or giving Riba, (usury), and cursed the picture-makers.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ أَبِي اشْتَرَى عَبْدًا حَجَّامًا، فَسَأَلْتُهُ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ، وَثَمَنِ الدَّمِ، وَنَهَى عَنِ الْوَاشِمَةِ وَالْمَوْشُومَةِ، وَآكِلِ الرِّبَا، وَمُوكِلِهِ، وَلَعَنَ الْمُصَوِّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2086In-book reference : Book 34, Hadith 39USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 299   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2087,
    "id": 2087,
    "url": "https://sunnah.com/bukhari:2087",
    "bookNumber": 34,
    "hadithNumber": 40,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The swearing (by the seller) may persuade the buyer to purchase the \ngoods but that will be deprived of Allah's blessing.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ ابْنُ الْمُسَيَّبِ إِنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْحَلِفُ مُنَفِّقَةٌ لِلسِّلْعَةِ مُمْحِقَةٌ لِلْبَرَكَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2087In-book reference : Book 34, Hadith 40USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 300   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2088,
    "id": 2088,
    "url": "https://sunnah.com/bukhari:2088",
    "bookNumber": 34,
    "hadithNumber": 41,
    "narrator": "Narrated `Abdullah bin Abu `Aufa:",
    "english": "A man displayed some goods in the market and swore by Allah that he had been offered so much for \nthat, that which was not offered, and he said so, so as to cheat a Muslim. On that occasion the \nfollowing Verse was revealed: \"Verily! Those who purchase a small gain at the cost of Allah's \ncovenant and their oaths (They shall have no portion in the Hereafter ..etc.)' (3.77)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا الْعَوَّامُ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ـ رضى الله عنه ـ أَنَّ رَجُلاً، أَقَامَ سِلْعَةً، وَهُوَ فِي السُّوقِ، فَحَلَفَ بِاللَّهِ لَقَدْ أَعْطَى بِهَا مَا لَمْ يُعْطَ، لِيُوقِعَ فِيهَا رَجُلاً مِنَ الْمُسْلِمِينَ، فَنَزَلَتْ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 2088In-book reference : Book 34, Hadith 41USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 301   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2089,
    "id": 2089,
    "url": "https://sunnah.com/bukhari:2089",
    "bookNumber": 34,
    "hadithNumber": 42,
    "narrator": "Narrated `Ali:",
    "english": "I got an old she-camel as my share from the booty, and the Prophet (ﷺ) had given me another from Al- \nKhumus. And when I intended to marry Fatima (daughter of the Prophet), I arranged that a goldsmith \nfrom the tribe of Bani Qainuqa' would accompany me in order to bring Idhkhir and then sell it to the \ngoldsmiths and use its price for my marriage banquet.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ عَلِيًّا ـ عَلَيْهِ السَّلاَمُ ـ قَالَ كَانَتْ لِي شَارِفٌ مِنْ نَصِيبِي مِنَ الْمَغْنَمِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم أَعْطَانِي شَارِفًا مِنَ الْخُمْسِ، فَلَمَّا أَرَدْتُ أَنْ أَبْتَنِيَ بِفَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاعَدْتُ رَجُلاً صَوَّاغًا مِنْ بَنِي قَيْنُقَاعَ أَنْ يَرْتَحِلَ مَعِي فَنَأْتِيَ بِإِذْخِرٍ أَرَدْتُ أَنْ أَبِيعَهُ مِنَ الصَّوَّاغِينَ، وَأَسْتَعِينَ بِهِ فِي وَلِيمَةِ عُرُسِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2089In-book reference : Book 34, Hadith 42USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 302   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2090,
    "id": 2090,
    "url": "https://sunnah.com/bukhari:2090",
    "bookNumber": 34,
    "hadithNumber": 43,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah made Mecca a sanctuary and it was neither permitted for anyone before, \nnor will it be permitted for anyone after me (to fight in it). And fighting in it was made legal for me \nfor a few hours of a day only. None is allowed to uproot its thorny shrubs or to cut down its trees or to \nchase its game or to pick up its Luqata (fallen things) except by a person who would announce it \npublicly.\" `Abbas bin `Abdul-Muttalib requested the Prophet, \"Except Al-Idhkhir, for our goldsmiths \nand for the roofs of our houses.\" The Prophet (ﷺ) said, \"Except Al-Idhkhir.\" `Ikrima said, \"Do you know \nwhat is meant by chasing its game? It is to drive it out of the shade and sit in its place.\" Khalid said, \n\"(`Abbas said: Al-Idhkhir) for our goldsmiths and our graves.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ، وَلَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ لأَحَدٍ بَعْدِي، وَإِنَّمَا حَلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، وَلاَ يُخْتَلَى خَلاَهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ يُنَفَّرُ صَيْدُهَا وَلاَ يُلْتَقَطُ لُقَطَتُهَا إِلاَّ لِمُعَرِّفٍ ‏\"‏‏.‏ وَقَالَ عَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ إِلاَّ الإِذْخِرَ لِصَاغَتِنَا وَلِسُقُفِ بُيُوتِنَا‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ فَقَالَ عِكْرِمَةُ هَلْ تَدْرِي مَا يُنَفَّرُ صَيْدُهَا هُوَ أَنْ تُنَحِّيَهُ مِنَ الظِّلِّ، وَتَنْزِلَ مَكَانَهُ‏.‏ قَالَ عَبْدُ الْوَهَّابِ عَنْ خَالِدٍ لِصَاغَتِنَا وَقُبُورِنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2090In-book reference : Book 34, Hadith 43USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 303   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2091,
    "id": 2091,
    "url": "https://sunnah.com/bukhari:2091",
    "bookNumber": 34,
    "hadithNumber": 44,
    "narrator": "Narrated Khabbab:",
    "english": "I was a blacksmith in the Pre-Islamic period, and 'Asi bin Wail owed me some money, so I went to \nhim to demand it. He said (to me), \"I will not pay you unless you disbelieve Muhammad.\" I said, \"I \nwill not disbelieve till Allah kills you and then you get resurrected.\" He said, \"Leave me till I die and \nget resurrected, then I will be given wealth and children and I will pay you your debt.\" On that \noccasion it was revealed to the Prophet: \n'Have you seen him who disbelieved in Our signs and says: Surely I will be given wealth and \nchildren? Has he known the unseen, or has he taken a covenant from the Beneficent (Allah)? (19.77- \n78)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ، وَكَانَ لِي عَلَى الْعَاصِ بْنِ وَائِلٍ دَيْنٌ، فَأَتَيْتُهُ أَتَقَاضَاهُ قَالَ لاَ أُعْطِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ صلى الله عليه وسلم‏.‏ فَقُلْتُ لاَ أَكْفُرُ حَتَّى يُمِيتَكَ اللَّهُ، ثُمَّ تُبْعَثَ‏.‏ قَالَ دَعْنِي حَتَّى أَمُوتَ وَأُبْعَثَ، فَسَأُوتَى مَالاً وَوَلَدًا فَأَقْضِيَكَ فَنَزَلَتْ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا * أَطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِنْدَ الرَّحْمَنِ عَهْدًا ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 2091In-book reference : Book 34, Hadith 44USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 304   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2092,
    "id": 2092,
    "url": "https://sunnah.com/bukhari:2092",
    "bookNumber": 34,
    "hadithNumber": 45,
    "narrator": "Narrated 'Is-haq bin `Abdullah bin Abu Talha:",
    "english": "I heard Anas bin Malik saying, \"A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. \" \nAnas bin Malik said, \"I accompanied Allah's Messenger (ﷺ) to that meal. He served the Prophet (ﷺ) with bread \nand soup made with gourd and dried meat. I saw the Prophet (ﷺ) taking the pieces of gourd from the \ndish.\" Anas added, \"Since that day I have continued to like gourd.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ، قَالَ أَنَسُ بْنُ مَالِكٍ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ، فَقَرَّبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم خُبْزًا وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ ـ قَالَ ـ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2092In-book reference : Book 34, Hadith 45USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 305   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2093,
    "id": 2093,
    "url": "https://sunnah.com/bukhari:2093",
    "bookNumber": 34,
    "hadithNumber": 46,
    "narrator": "Narrated Abu Hazim:",
    "english": "I heard Sahl bin Sa`d saying, \"A woman brought a Burda (i.e. a square piece of cloth having edging). I \nasked, 'Do you know what a Burda is?' They replied in the affirmative and said, \"It is a cloth sheet \nwith woven margins.\" Sahl went on, \"She addressed the Prophet (ﷺ) and said, 'I have woven it with my \nhands for you to wear.' The Prophet (ﷺ) took it as he was in need of it, and came to us wearing it as a \nwaist sheet. One of us said, 'O Allah's Messenger (ﷺ)! Give it to me to wear.' The Prophet (ﷺ) agreed to give it to \nhim. The Prophet (ﷺ) sat with the people for a while and then returned (home), wrapped that waist sheet \nand sent it to him. The people said to that man, 'You haven't done well by asking him for it when you \nknow that he never turns down anybody's request.' The man replied, 'By Allah, I have not asked him \nfor it except to use it as my shroud when I die.\" Sahl added; \"Later it (i.e. that sheet) was his shroud.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ ـ رضى الله عنه ـ قَالَ جَاءَتِ امْرَأَةٌ بِبُرْدَةٍ ـ قَالَ أَتَدْرُونَ مَا الْبُرْدَةُ فَقِيلَ لَهُ نَعَمْ، هِيَ الشَّمْلَةُ، مَنْسُوجٌ فِي حَاشِيَتِهَا ـ قَالَتْ يَا رَسُولَ اللَّهِ، إِنِّي نَسَجْتُ هَذِهِ بِيَدِي أَكْسُوكَهَا‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا‏.‏ فَخَرَجَ إِلَيْنَا وَإِنَّهَا إِزَارُهُ‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا رَسُولَ اللَّهِ، اكْسُنِيهَا، فَقَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم فِي الْمَجْلِسِ، ثُمَّ رَجَعَ فَطَوَاهَا، ثُمَّ أَرْسَلَ بِهَا إِلَيْهِ‏.‏ فَقَالَ لَهُ الْقَوْمُ مَا أَحْسَنْتَ، سَأَلْتَهَا إِيَّاهُ، لَقَدْ عَلِمْتَ أَنَّهُ لاَ يَرُدُّ سَائِلاً‏.‏ فَقَالَ الرَّجُلُ وَاللَّهِ مَا سَأَلْتُهُ إِلاَّ لِتَكُونَ كَفَنِي يَوْمَ أَمُوتُ‏.‏ قَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2093In-book reference : Book 34, Hadith 46USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 306   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2094,
    "id": 2094,
    "url": "https://sunnah.com/bukhari:2094",
    "bookNumber": 34,
    "hadithNumber": 47,
    "narrator": "Narrated Abu Hazim:",
    "english": "Some men came to Sahl bin Sa`d to ask him about the pulpit. He replied, \"Allah's Messenger (ﷺ) sent for a \nwoman (Sahl named her) (this message): 'Order your slave carpenter to make pieces of wood (i.e. a \npulpit) for me so that I may sit on it while addressing the people.' So, she ordered him to make it from \nthe tamarisk of the forest. He brought it to her and she sent it to Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) \nordered it to be placed in the mosque: so, it was put and he sat on it.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، قَالَ أَتَى رِجَالٌ إِلَى سَهْلِ بْنِ سَعْدٍ يَسْأَلُونَهُ عَنِ الْمِنْبَرِ، فَقَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فُلاَنَةَ ـ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ ـ ‏\n\"‏ أَنْ مُرِي غُلاَمَكِ النَّجَّارَ، يَعْمَلُ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ ‏\"‏‏.‏ فَأَمَرَتْهُ يَعْمَلُهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا، فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِهَا، فَأَمَرَ بِهَا فَوُضِعَتْ، فَجَلَسَ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2094In-book reference : Book 34, Hadith 47USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 307   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2095,
    "id": 2095,
    "url": "https://sunnah.com/bukhari:2095",
    "bookNumber": 34,
    "hadithNumber": 48,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "An Ansari woman said to Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! Shall I make something for you to sit \non, as I have a slave who is a carpenter?\" He replied, \"If you wish.\" So, she got a pulpit made for him. \nWhen it was Friday the Prophet (ﷺ) sat on that pulpit. The date-palm stem near which the Prophet (ﷺ) used to \ndeliver his sermons cried so much so that it was about to burst. The Prophet (ﷺ) came down from the \npulpit to the stem and embraced it and it started groaning like a child being persuaded to stop crying \nand then it stopped crying. The Prophet (ﷺ) said,\"It has cried because of (missing) what it use to hear of \nthe religions knowledge.\"",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً مِنَ الأَنْصَارِ قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ، أَلاَ أَجْعَلُ لَكَ شَيْئًا تَقْعُدُ عَلَيْهِ فَإِنَّ لِي غُلاَمًا نَجَّارًا‏.‏ قَالَ ‏\"‏ إِنْ شِئْتِ ‏\"‏‏.‏ قَالَ فَعَمِلَتْ لَهُ الْمِنْبَرَ، فَلَمَّا كَانَ يَوْمُ الْجُمُعَةِ قَعَدَ النَّبِيُّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ الَّذِي صُنِعَ، فَصَاحَتِ النَّخْلَةُ الَّتِي كَانَ يَخْطُبُ عِنْدَهَا حَتَّى كَادَتْ أَنْ تَنْشَقَّ، فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم حَتَّى أَخَذَهَا فَضَمَّهَا إِلَيْهِ، فَجَعَلَتْ تَئِنُّ أَنِينَ الصَّبِيِّ الَّذِي يُسَكَّتُ حَتَّى اسْتَقَرَّتْ‏.‏ قَالَ ‏\"‏ بَكَتْ عَلَى مَا كَانَتْ تَسْمَعُ مِنَ الذِّكْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2095In-book reference : Book 34, Hadith 48USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 308   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2096,
    "id": 2096,
    "url": "https://sunnah.com/bukhari:2096",
    "bookNumber": 34,
    "hadithNumber": 49,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) bought food grains from a Jew on credit and mortgaged his armor to him.",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ، وَرَهَنَهُ دِرْعَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2096In-book reference : Book 34, Hadith 49USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 309   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2097,
    "id": 2097,
    "url": "https://sunnah.com/bukhari:2097",
    "bookNumber": 34,
    "hadithNumber": 50,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I was with the Prophet (ﷺ) in a Ghazwa (Military Expedition) and my camel was slow and exhausted. The \nProphet came up to me and said, \"O Jabir.\" I replied, \"Yes?\" He said, \"What is the matter with you?\" I \nreplied, \"My camel is slow and tired, so I am left behind.\" So, he got down and poked the camel with \nhis stick and then ordered me to ride. I rode the camel and it became so fast that I had to hold it from \ngoing ahead of Allah's Messenger (ﷺ) . He then asked me, have you got married?\" I replied in the \naffirmative. He asked, \"A virgin or a matron?\" I replied, \"I married a matron.\" The Prophet (ﷺ) said, \n\"Why have you not married a virgin, so that you may play with her and she may play with you?\" Jabir \nreplied, \"I have sisters (young in age) so I liked to marry a matron who could collect them all and \ncomb their hair and look after them.\" The Prophet (ﷺ) said, \"You will reach, so when you have arrived (at \nhome), I advise you to associate with your wife (that you may have an intelligent son).\" Then he asked \nme, \"Would you like to sell your camel?\" I replied in the affirmative and the Prophet (ﷺ) purchased it for \none Uqiya of gold. Allah's Messenger (ﷺ) reached before me and I reached in the morning, and when I went \nto the mosque, I found him at the door of the mosque. He asked me, \"Have you arrived just now?\" I \nreplied in the affirmative. He said, \"Leave your camel and come into (the mosque) and pray two \nrak`at.\" I entered and offered the prayer. He told Bilal to weigh and give me one Uqiya of gold. So \nBilal weighed for me fairly and I went away. The Prophet (ﷺ) sent for me and I thought that he would \nreturn to me my camel which I hated more than anything else. But the Prophet (ﷺ) said to me, \"Take your \ncamel as well as its price.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَزَاةٍ، فَأَبْطَأَ بِي جَمَلِي وَأَعْيَا، فَأَتَى عَلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ جَابِرٌ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ مَا شَأْنُكَ ‏\"‏‏.‏ قُلْتُ أَبْطَأَ عَلَىَّ جَمَلِي وَأَعْيَا، فَتَخَلَّفْتُ‏.‏ فَنَزَلَ يَحْجُنُهُ بِمِحْجَنِهِ، ثُمَّ قَالَ ‏\"‏ ارْكَبْ ‏\"‏‏.‏ فَرَكِبْتُ، فَلَقَدْ رَأَيْتُهُ أَكُفُّهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تَزَوَّجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ بَلْ ثَيِّبًا‏.‏ قَالَ ‏\"‏ أَفَلاَ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قُلْتُ إِنَّ لِي أَخَوَاتٍ، فَأَحْبَبْتُ أَنْ أَتَزَوَّجَ امْرَأَةً تَجْمَعُهُنَّ، وَتَمْشُطُهُنَّ، وَتَقُومُ عَلَيْهِنَّ‏.‏ قَالَ ‏\"‏ أَمَّا إِنَّكَ قَادِمٌ، فَإِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ أَتَبِيعُ جَمَلَكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَاشْتَرَاهُ مِنِّي بِأُوقِيَّةٍ، ثُمَّ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلِي، وَقَدِمْتُ بِالْغَدَاةِ، فَجِئْنَا إِلَى الْمَسْجِدِ، فَوَجَدْتُهُ عَلَى باب الْمَسْجِدِ، قَالَ ‏\"‏ الآنَ قَدِمْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَدَعْ جَمَلَكَ، فَادْخُلْ فَصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏ فَدَخَلْتُ فَصَلَّيْتُ، فَأَمَرَ بِلاَلاً أَنْ يَزِنَ لَهُ أُوقِيَّةً‏.‏ فَوَزَنَ لِي بِلاَلٌ، فَأَرْجَحَ فِي الْمِيزَانِ، فَانْطَلَقْتُ حَتَّى وَلَّيْتُ فَقَالَ ‏\"‏ ادْعُ لِي جَابِرًا ‏\"‏‏.‏ قُلْتُ الآنَ يَرُدُّ عَلَىَّ الْجَمَلَ، وَلَمْ يَكُنْ شَىْءٌ أَبْغَضَ إِلَىَّ مِنْهُ‏.‏ قَالَ ‏\"‏ خُذْ جَمَلَكَ وَلَكَ ثَمَنُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2097In-book reference : Book 34, Hadith 50USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 310   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2098,
    "id": 2098,
    "url": "https://sunnah.com/bukhari:2098",
    "bookNumber": 34,
    "hadithNumber": 51,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Ukaz, Majanna and Dhul-Majaz were markets in the Pre-Islamic period. When the people embraced \nIslam they considered it a sin to trade there. So, the following Holy Verse came:-- 'There is no harm \nfor you if you seek of the bounty of your Lord (Allah) in the Hajj season.\" (2.198) Ibn `Abbas recited \nit like this.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَتْ عُكَاظٌ وَمَجَنَّةُ وَذُو الْمَجَازِ أَسْوَاقًا فِي الْجَاهِلِيَّةِ، فَلَمَّا كَانَ الإِسْلاَمُ تَأَثَّمُوا مِنَ التِّجَارَةِ فِيهَا، فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ‏}‏ فِي مَوَاسِمِ الْحَجِّ، قَرَأَ ابْنُ عَبَّاسٍ كَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2098In-book reference : Book 34, Hadith 51USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 311   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2099,
    "id": 2099,
    "url": "https://sunnah.com/bukhari:2099",
    "bookNumber": 34,
    "hadithNumber": 52,
    "narrator": "Narrated `Amr:",
    "english": "Here (i.e. in Mecca) there was a man called Nawwas and he had camels suffering from the disease of \nexcessive and unquenchable thirst. Ibn `Umar went to the partner of Nawwas and bought those \ncamels. The man returned to Nawwas and told him that he had sold those camels. Nawwas asked him, \n\"To whom have you sold them?\" He replied, \"To such and such Sheikh.\" Nawwas said, \"Woe to you; \nBy Allah, that Sheikh was Ibn `Umar.\" Nawwas then went to Ibn `Umar and said to him, \"My partner \nsold you camels suffering from the disease of excessive thirst and he had not known you.\" Ibn `Umar \ntold him to take them back. When Nawwas went to take them, Ibn `Umar said to him, \"Leave them \nthere as I am happy with the decision of Allah's Messenger (ﷺ) that there is no oppression . \"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو كَانَ هَا هُنَا رَجُلٌ اسْمُهُ نَوَّاسٌ، وَكَانَتْ عِنْدَهُ إِبِلٌ هِيمٌ، فَذَهَبَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ فَاشْتَرَى تِلْكَ الإِبِلَ مِنْ شَرِيكٍ لَهُ، فَجَاءَ إِلَيْهِ شَرِيكُهُ فَقَالَ بِعْنَا تِلْكَ الإِبِلَ‏.‏ فَقَالَ مِمَّنْ بِعْتَهَا قَالَ مِنْ شَيْخٍ، كَذَا وَكَذَا‏.‏ فَقَالَ وَيْحَكَ ذَاكَ ـ وَاللَّهِ ـ ابْنُ عُمَرَ‏.‏ فَجَاءَهُ فَقَالَ إِنَّ شَرِيكِي بَاعَكَ إِبِلاً هِيمًا، وَلَمْ يَعْرِفْكَ‏.‏ قَالَ فَاسْتَقْهَا‏.‏ قَالَ فَلَمَّا ذَهَبَ يَسْتَاقُهَا فَقَالَ دَعْهَا، رَضِينَا بِقَضَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ عَدْوَى‏.‏ سَمِعَ سُفْيَانُ عَمْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2099In-book reference : Book 34, Hadith 52USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 312   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2100,
    "id": 2100,
    "url": "https://sunnah.com/bukhari:2100",
    "bookNumber": 34,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Qatada:",
    "english": "We set out with Allah's Messenger (ﷺ) in the year of Hunain, (the Prophet (ﷺ) gave me an armor). I sold that \narmor and bought a garden in the region of the tribe of Bani Salama and that was the first property I \ngot after embracing Islam.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ ابْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ ـ رضى الله عنه ـ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حُنَيْنٍ، فَأَعْطَاهُ ـ يَعْنِي دِرْعًا ـ فَبِعْتُ الدِّرْعَ، فَابْتَعْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ، فَإِنَّهُ لأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2100In-book reference : Book 34, Hadith 53USC-MSA web (English) reference : Vol. 3, Book 34, Hadith 313   (deprecated numbering scheme)"
  }
]