[
  {
    "hadithGlobalNumber": 4401,
    "id": 4401,
    "url": "https://sunnah.com/bukhari:4401",
    "bookNumber": 64,
    "hadithNumber": 424,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Safiya bin Huyai, the wife of the Prophet (ﷺ) menstruated during Hajjat-ul- \nWada` The Prophet (ﷺ) said, \"Is she going to detain us?\" I said to him, \"She has already come to Mecca \nand performed the Tawaf (ul-ifada) around the Ka`ba, O Allah's Messenger (ﷺ).\" The Prophet (ﷺ) said, \" Let her \nthen proceed on (to Medina).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُمَا أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَاضَتْ فِي حَجَّةِ الْوَدَاعِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏‏.‏ فَقُلْتُ إِنَّهَا قَدْ أَفَاضَتْ يَا رَسُولَ اللَّهِ وَطَافَتْ بِالْبَيْتِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَلْتَنْفِرْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4401In-book reference : Book 64, Hadith 424USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 684   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4402,
    "id": 4402,
    "url": "https://sunnah.com/bukhari:4402",
    "bookNumber": 64,
    "hadithNumber": 425,
    "narrator": "Narrated Ibn `Umar:",
    "english": "We were talking about Hajjat-ul-Wada`, while the Prophet (ﷺ) was amongst us. We did not know what \nHajjat-ul-Wada` signified. The Prophet (ﷺ) praised Allah and then mentioned Al-Masih Ad-Dajjal and \ndescribed him extensively, saying, \"Allah did not send any prophet but that prophet warned his nation \nof Al-Masih Ad-Dajjal. Noah and the prophets following him warned (their people) of him. He will \nappear amongst you (O Muhammad's followers), and if it happens that some of his qualities may be \nhidden from you, but your Lord's State is clear to you and not hidden from you. The Prophet (ﷺ) said it \nthrice. Verily, your Lord is not blind in one eye, while he (i.e. Ad-Dajjal) is blind in the right eye \nwhich looks like a grape bulging out (of its cluster). No doubt,! Allah has made your blood and your \nproperties sacred to one another like the sanctity of this day of yours, in this town of yours, in this \nmonth of yours.\" The Prophet (ﷺ) added: No doubt! Haven't I conveyed Allah's Message to you? \" They \nreplied, \"Yes,\" The Prophet (ﷺ) said thrice, \"O Allah! Be witness for it.\" The Prophet (ﷺ) added, \"Woe to \nyou!\" (or said), \"May Allah be merciful to you! Do not become infidels after me (i.e. my death) by \ncutting the necks (throats) of one another.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَحَدَّثُ بِحَجَّةِ الْوَدَاعِ وَالنَّبِيُّ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا، وَلاَ نَدْرِي مَا حَجَّةُ الْوَدَاعِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ ذَكَرَ الْمَسِيحَ الدَّجَّالَ فَأَطْنَبَ فِي ذِكْرِهِ وَقَالَ ‏\"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ إِلاَّ أَنْذَرَ أُمَّتَهُ، أَنْذَرَهُ نُوحٌ وَالنَّبِيُّونَ مِنْ بَعْدِهِ، وَإِنَّهُ يَخْرُجُ فِيكُمْ، فَمَا خَفِيَ عَلَيْكُمْ مِنْ شَأْنِهِ فَلَيْسَ يَخْفَى عَلَيْكُمْ أَنَّ رَبَّكُمْ لَيْسَ عَلَى مَا يَخْفَى عَلَيْكُمْ ثَلاَثًا، إِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ، وَإِنَّهُ أَعْوَرُ عَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏   ‏\"‏ أَلاَ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ، ثَلاَثًا، وَيْلَكُمْ، أَوْ وَيْحَكُمُ، انْظُرُوا لاَ تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4402, 4403In-book reference : Book 64, Hadith 425USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 685   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4403,
    "id": 4403,
    "url": "https://sunnah.com/bukhari:4403",
    "bookNumber": 64,
    "hadithNumber": 425,
    "narrator": "Narrated Ibn `Umar:",
    "english": "We were talking about Hajjat-ul-Wada`, while the Prophet (ﷺ) was amongst us. We did not know what \nHajjat-ul-Wada` signified. The Prophet (ﷺ) praised Allah and then mentioned Al-Masih Ad-Dajjal and \ndescribed him extensively, saying, \"Allah did not send any prophet but that prophet warned his nation \nof Al-Masih Ad-Dajjal. Noah and the prophets following him warned (their people) of him. He will \nappear amongst you (O Muhammad's followers), and if it happens that some of his qualities may be \nhidden from you, but your Lord's State is clear to you and not hidden from you. The Prophet (ﷺ) said it \nthrice. Verily, your Lord is not blind in one eye, while he (i.e. Ad-Dajjal) is blind in the right eye \nwhich looks like a grape bulging out (of its cluster). No doubt,! Allah has made your blood and your \nproperties sacred to one another like the sanctity of this day of yours, in this town of yours, in this \nmonth of yours.\" The Prophet (ﷺ) added: No doubt! Haven't I conveyed Allah's Message to you? \" They \nreplied, \"Yes,\" The Prophet (ﷺ) said thrice, \"O Allah! Be witness for it.\" The Prophet (ﷺ) added, \"Woe to \nyou!\" (or said), \"May Allah be merciful to you! Do not become infidels after me (i.e. my death) by \ncutting the necks (throats) of one another.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَحَدَّثُ بِحَجَّةِ الْوَدَاعِ وَالنَّبِيُّ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا، وَلاَ نَدْرِي مَا حَجَّةُ الْوَدَاعِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ ذَكَرَ الْمَسِيحَ الدَّجَّالَ فَأَطْنَبَ فِي ذِكْرِهِ وَقَالَ ‏\"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ إِلاَّ أَنْذَرَ أُمَّتَهُ، أَنْذَرَهُ نُوحٌ وَالنَّبِيُّونَ مِنْ بَعْدِهِ، وَإِنَّهُ يَخْرُجُ فِيكُمْ، فَمَا خَفِيَ عَلَيْكُمْ مِنْ شَأْنِهِ فَلَيْسَ يَخْفَى عَلَيْكُمْ أَنَّ رَبَّكُمْ لَيْسَ عَلَى مَا يَخْفَى عَلَيْكُمْ ثَلاَثًا، إِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ، وَإِنَّهُ أَعْوَرُ عَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏   ‏\"‏ أَلاَ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ، ثَلاَثًا، وَيْلَكُمْ، أَوْ وَيْحَكُمُ، انْظُرُوا لاَ تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4402, 4403In-book reference : Book 64, Hadith 425USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 685   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4404,
    "id": 4404,
    "url": "https://sunnah.com/bukhari:4404",
    "bookNumber": 64,
    "hadithNumber": 426,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "The Prophet (ﷺ) fought nineteen Ghazwas and performed only one Hajj after he migrated (to Medina), \nand did not perform another Hajj after it, and that was Hajj-ul-Wada`,' Abu 'Is-haq said, \"He \nperformed when he was in Mecca.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَرْقَمَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم غَزَا تِسْعَ عَشْرَةَ غَزْوَةً، وَأَنَّهُ حَجَّ بَعْدَ مَا هَاجَرَ حَجَّةً وَاحِدَةً لَمْ يَحُجَّ بَعْدَهَا حَجَّةَ الْوَدَاعِ‏.‏ قَالَ أَبُو إِسْحَاقَ وَبِمَكَّةَ أُخْرَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4404In-book reference : Book 64, Hadith 426USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 686   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4405,
    "id": 4405,
    "url": "https://sunnah.com/bukhari:4405",
    "bookNumber": 64,
    "hadithNumber": 427,
    "narrator": "Narrated Jarir:",
    "english": "The Prophet (ﷺ) ordered me during Hajjatul-Wada`. \"Ask the people to listen.\" He then said, \"Do not \nbecome infidels after me by cutting the necks (throats) of one another. \"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي حَجَّةِ الْوَدَاعِ لِجَرِيرٍ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4405In-book reference : Book 64, Hadith 427USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 687   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4406,
    "id": 4406,
    "url": "https://sunnah.com/bukhari:4406",
    "bookNumber": 64,
    "hadithNumber": 428,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) said, \"Time has taken its original shape which it had when Allah created the Heavens and \nthe Earth. The year is of twelve months, four of which are sacred, and out of these (four) three are in \nsuccession, i.e. Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and the fourth is Rajab which is named \nafter the Mudar tribe, between (the month of) Jumaida (ath-thania) and Sha'ban.\" Then the Prophet (ﷺ) \nasked, \"Which is this month?\" We said, \"Allah and His Apostle know better.\" On that the Prophet (ﷺ) \nkept quiet so long that we thought that he might name it with another name. Then the Prophet (ﷺ) said, \n\"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" Then he said, \"Which town is this?\" \"We \nreplied, \"Allah and His Apostle know better.\" On that he kept quiet so long that we thought that he \nmight name it with another name. Then he said, \"Isn't it the town of Mecca?\" We replied, \"Yes, \" \nThen he said, \"Which day is today?\" We replied, \"Allah and His Apostle know better.\" He kept quiet \nso long that we thought that he might name it with another name. Then he said, \"Isn't it the day of An- \nNahr (i.e. sacrifice)?\" We replied, \"Yes.\" He said, \"So your blood, your properties, (The sub-narrator \nMuhammad said, 'I think the Prophet (ﷺ) also said: And your honor..) are sacred to one another like the \nsanctity of this day of yours, in this city of yours, in this month of yours; and surely, you will meet \nyour Lord, and He will ask you about your deeds. Beware! Do not become infidels after me, cutting \nthe throats of one another. It is incumbent on those who are present to convey this message (of mine) \nto those who are absent. May be that some of those to whom it will be conveyed will understand it \nbetter than those who have actually heard it.\" (The sub-narrator, Muhammad, on remembering that \nnarration, used to say, \"Muhammad spoke the truth!\") He (i.e. Prophet) then added twice, \"No doubt! \nHaven't I conveyed (Allah's Message) to you?\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَةِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلاَثَةٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ، أَىُّ شَهْرٍ هَذَا ‏\"‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ ذُو الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ الْبَلْدَةَ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ يَوْمٍ هَذَا ‏\"‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا وَسَتَلْقَوْنَ رَبَّكُمْ، فَسَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ، أَلاَ فَلاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَلَعَلَّ بَعْضَ مَنْ يُبَلَّغُهُ أَنْ يَكُونَ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ ـ فَكَانَ مُحَمَّدٌ إِذَا ذَكَرَهُ يَقُولُ صَدَقَ مُحَمَّدٌ صلى الله عليه وسلم ثُمَّ قَالَ ـ أَلاَ هَلْ بَلَّغْتُ‏.‏ مَرَّتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4406In-book reference : Book 64, Hadith 428USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 688   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4407,
    "id": 4407,
    "url": "https://sunnah.com/bukhari:4407",
    "bookNumber": 64,
    "hadithNumber": 429,
    "narrator": "Narrated Tariq bin Shibab:",
    "english": "Some Jews said, \"Had this Verse been revealed to us, we would have taken that day as `Id (festival).\" \n`Umar said, \"What Verse?\" They said:-- \"This day I have Perfected your religion for you, Completed \nMy Favor upon you And have chosen for you Islam as your religion\" (5.3) `Umar said, \"I know the \nplace where it was revealed; It was revealed while Allah's Messenger (ﷺ) was staying at `Arafat.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، أَنَّ أُنَاسًا، مِنَ الْيَهُودِ قَالُوا لَوْ نَزَلَتْ هَذِهِ الآيَةُ فِينَا لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا‏.‏ فَقَالَ عُمَرُ أَيَّةُ آيَةٍ فَقَالُوا ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي‏}‏‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ أَىَّ مَكَانٍ أُنْزِلَتْ، أُنْزِلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاقِفٌ بِعَرَفَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4407In-book reference : Book 64, Hadith 429USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 689   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4408,
    "id": 4408,
    "url": "https://sunnah.com/bukhari:4408",
    "bookNumber": 64,
    "hadithNumber": 430,
    "narrator": "Narrated `Aisha:",
    "english": "We set out with Allah's Messenger (ﷺ), and some of us assumed the lhram for `Umra, some assumed it for \nHajj, and some assumed it for both Hajj and `Umra. Allah's Messenger (ﷺ) assumed the Ihram for Hajj. So \nthose who had assumed the Ihram for Hajj or for both Hajj and `Umra, did not finish their Ihram till \nthe day of An-Nahr (i.e. slaughter of sacrifices).\n\n\nMalik also narrated as above, saying, \"(We set out) with Allah's Messenger (ﷺ) in Hajjat-ul-Wada`...)\"\n\n\nThis hadith also reaches us through another chain.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ، وَأَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحَجِّ، فَأَمَّا مَنْ أَهَلَّ بِالْحَجِّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى يَوْمَ النَّحْرِ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ وَقَالَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ‏.‏ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مَالِكٌ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4408In-book reference : Book 64, Hadith 430USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 690   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4409,
    "id": 4409,
    "url": "https://sunnah.com/bukhari:4409",
    "bookNumber": 64,
    "hadithNumber": 431,
    "narrator": "Narrated Sa`d:",
    "english": "The Prophet (ﷺ) visited me during Hajjat ul-Wada` while I was suffering from a disease which brought \nme to the verge of death. I said, \"O Allah's Messenger (ﷺ)! My ailment has reached such a (bad) state as you \nsee, and I have much wealth, but I have no-one to inherit from me except my only daughter. Shall I \ngive 2/3 of my property as alms (in charity)?\" The Prophet (ﷺ) said, \"No,\" I said, \"Shall I give half of my \nproperty as alms?\" He said, \"No.\" I said, \"(Shall I give) 1/3 of it? \" He replied, \" 1/3, and even 1/3 is \ntoo much. It is better for you to leave your inheritors wealthy rather than to leave them poor, begging \npeople (for their sustenance); and whatever you spend for Allah's Sake, you will get reward for it even \nfor the morsel of food which you put in your wives mouth.\" I said, \"O Allah's Messenger (ﷺ)! Should I \nremain (in Mecca) behind my companions (who are going with you to Medina)?\" The Prophet (ﷺ) said, \n\"If you remain behind, any good deed which you will do for Allah's Sake, will upgrade and elevate \nyou. May be you will live longer so that some people may benefit by you and some other (i.e. infidels) \nmay get harmed by you.\" The Prophet (ﷺ) then added, \"O Allah! Complete the Migration of my \ncompanions and do not turn them on their heels. But the poor Sa`d bin Khaula (not the above \nmentioned Sa`d) (died in Mecca) .\" Allah's Messenger (ﷺ) pitied Sa`d for he died in Mecca.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ ـ هُوَ ابْنُ سَعْدٍ ـ حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ عَادَنِي النَّبِيُّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ، أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى، وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ أَفَأَتَصَدَّقُ بِشَطْرِهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثِ قَالَ ‏\"‏ وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَلَسْتَ تُنْفِقُ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ بِهَا، حَتَّى اللُّقْمَةَ تَجْعَلُهَا فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ آأُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ‏.‏ لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ رَثَى لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُوُفِّيَ بِمَكَّةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4409In-book reference : Book 64, Hadith 431USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 693   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4410,
    "id": 4410,
    "url": "https://sunnah.com/bukhari:4410",
    "bookNumber": 64,
    "hadithNumber": 432,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) got his head shaved during Hajjat-ul-Wada`.'",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4410In-book reference : Book 64, Hadith 432USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 694   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4411,
    "id": 4411,
    "url": "https://sunnah.com/bukhari:4411",
    "bookNumber": 64,
    "hadithNumber": 433,
    "narrator": "Narrated Ibn `Umar:",
    "english": "During Hajjat-ul-Wada`, the Prophet (ﷺ) and some of his companions got their heads shaved while some \nof his companions got their head-hair cut short.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَخْبَرَهُ ابْنُ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَلَقَ فِي حَجَّةِ الْوَدَاعِ وَأُنَاسٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4411In-book reference : Book 64, Hadith 433USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 695   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4412,
    "id": 4412,
    "url": "https://sunnah.com/bukhari:4412",
    "bookNumber": 64,
    "hadithNumber": 434,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "That he came riding a donkey when Allah 's Apostle was standing at Mina during Hajjat-ul-Wada`, \nleading the people in prayer. The donkey passed in front of a part of the row (of the people offering \nthe prayer). Then he dismounted from it and took his position in the row with the people.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، أَقْبَلَ يَسِيرُ عَلَى حِمَارٍ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ بِمِنًى فِي حَجَّةِ الْوَدَاعِ يُصَلِّي بِالنَّاسِ، فَسَارَ الْحِمَارُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ، ثُمَّ نَزَلَ عَنْهُ، فَصَفَّ مَعَ النَّاسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4412In-book reference : Book 64, Hadith 434USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 696   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4413,
    "id": 4413,
    "url": "https://sunnah.com/bukhari:4413",
    "bookNumber": 64,
    "hadithNumber": 435,
    "narrator": "Narrated Hisham's father:",
    "english": "In my presence, Usama was asked about the speed of the Prophet (ﷺ) during his Hajj. He replied, \"It was \nAl-`Anaq (i.e. moderate easy speed) and if he encountered an open space, he used to increase his \nspeed.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، سُئِلَ أُسَامَةُ وَأَنَا شَاهِدٌ، عَنْ سَيْرِ النَّبِيِّ، صلى الله عليه وسلم فِي حَجَّتِهِ‏.‏ فَقَالَ الْعَنَقَ، فَإِذَا وَجَدَ فَجْوَةً نَصَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4413In-book reference : Book 64, Hadith 435USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 697   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4414,
    "id": 4414,
    "url": "https://sunnah.com/bukhari:4414",
    "bookNumber": 64,
    "hadithNumber": 436,
    "narrator": "Narrated `Abdullah bin Yazid Al-Khatmi:",
    "english": "That Abu Aiyub informed him that he offered the Maghrib and `Isha' prayers together with the \nProphet during Hajjat-ul-Wada`.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، أَنَّ أَبَا أَيُّوبَ، أَخْبَرَهُ أَنَّهُ، صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4414In-book reference : Book 64, Hadith 436USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 698   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4415,
    "id": 4415,
    "url": "https://sunnah.com/bukhari:4415",
    "bookNumber": 64,
    "hadithNumber": 437,
    "narrator": "Narrated Abu Musa:",
    "english": "My Companions sent me to Allah's Messenger (ﷺ) to ask him for some animals to ride on as they were \naccompanying him in the army of Al-Usra, and that was the Ghazwa (Battle) of Tabuk, I said, \"O \nAllah's Prophet! My companions have sent me to you to provide them with means of transportation.\" \nHe said, \"By Allah! I will not make you ride anything.\" It happened that when I reached him, he was \nin an angry mood, and I didn't notice it. So I returned in a sad mood because of the refusal the Prophet (ﷺ) \nand for the fear that the Prophet (ﷺ) might have become 'angry with me. So I returned to my companions \nand informed them of what the Prophet (ﷺ) had said. Only a short while had passed when I heard Bilal \ncalling, \"O `Abdullah bin Qais!\" I replied to his call. Bilal said, \"Respond to Allah's Messenger (ﷺ) who is \ncalling you.\" When I went to him (i.e. the Prophet), he said, \"Take these two camels tied together and \nalso these two camels tied together,\"' referring to six camels he had brought them from Sa`d at that \ntime. The Prophet (ﷺ) added, \"Take them to your companions and say, 'Allah (or Allah's Messenger (ﷺ) ) allows \nyou to ride on these,' so ride on them.\" So I took those camels to them and said, \"The Prophet (ﷺ) allows \nyou to ride on these (camels) but by Allah, I will not leave you till some of you proceed with me to \nsomebody who heard the statement of Allah's Messenger (ﷺ). Do not think that I narrate to you a thing which \nAllah's Messenger (ﷺ) has not said.\" They said to me, \"We consider you truthful, and we will do what you \nlike.\" The sub-narrator added: So Abu Musa proceeded along with some of them till they came to \nthose who have heard the statement of Allah's Messenger (ﷺ) wherein he denied them (some animals to ride \non) and (his statement) whereby he gave them the same. So these people told them the same \ninformation as Abu Musa had told them.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَرْسَلَنِي أَصْحَابِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَسْأَلُهُ الْحُمْلاَنَ لَهُمْ، إِذْ هُمْ مَعَهُ فِي جَيْشِ الْعُسْرَةِ وَهْىَ غَزْوَةُ تَبُوكَ فَقُلْتُ يَا نَبِيَّ اللَّهِ، إِنَّ أَصْحَابِي أَرْسَلُونِي إِلَيْكَ لِتَحْمِلَهُمْ‏.‏ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ عَلَى شَىْءٍ ‏\"‏‏.‏ وَوَافَقْتُهُ، وَهْوَ غَضْبَانُ وَلاَ أَشْعُرُ، وَرَجَعْتُ حَزِينًا مِنْ مَنْعِ النَّبِيِّ صلى الله عليه وسلم، وَمِنْ مَخَافَةِ أَنْ يَكُونَ النَّبِيُّ صلى الله عليه وسلم وَجَدَ فِي نَفْسِهِ عَلَىَّ، فَرَجَعْتُ إِلَى أَصْحَابِي فَأَخْبَرْتُهُمُ الَّذِي قَالَ النَّبِيُّ صلى الله عليه وسلم، فَلَمْ أَلْبَثْ إِلاَّ سُوَيْعَةً إِذْ سَمِعْتُ بِلاَلاً يُنَادِي أَىْ عَبْدَ اللَّهِ بْنَ قَيْسٍ‏.‏ فَأَجَبْتُهُ، فَقَالَ أَجِبْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَدْعُوكَ، فَلَمَّا أَتَيْتُهُ، قَالَ ‏\"‏ خُذْ هَذَيْنِ الْقَرِينَيْنِ ـ وَهَذَيْنِ الْقَرِينَيْنِ لِسِتَّةِ أَبْعِرَةٍ ابْتَاعَهُنَّ حِينَئِذٍ مِنْ سَعْدٍ ـ فَانْطَلِقْ بِهِنَّ إِلَى أَصْحَابِكَ فَقُلْ إِنَّ اللَّهَ ـ أَوْ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ يَحْمِلُكُمْ عَلَى هَؤُلاَءِ فَارْكَبُوهُنَّ ‏\"‏‏.‏ فَانْطَلَقْتُ إِلَيْهِمْ بِهِنَّ، فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم يَحْمِلُكُمْ عَلَى هَؤُلاَءِ وَلَكِنِّي وَاللَّهِ لاَ أَدَعُكُمْ حَتَّى يَنْطَلِقَ مَعِي بَعْضُكُمْ إِلَى مَنْ سَمِعَ مَقَالَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ تَظُنُّوا أَنِّي حَدَّثْتُكُمْ شَيْئًا لَمْ يَقُلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالُوا لِي إِنَّكَ عِنْدَنَا لَمُصَدَّقٌ، وَلَنَفْعَلَنَّ مَا أَحْبَبْتَ‏.‏ فَانْطَلَقَ أَبُو مُوسَى بِنَفَرٍ مِنْهُمْ حَتَّى أَتَوُا الَّذِينَ سَمِعُوا قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنْعَهُ إِيَّاهُمْ، ثُمَّ إِعْطَاءَهُمْ بَعْدُ، فَحَدَّثُوهُمْ بِمِثْلِ مَا حَدَّثَهُمْ بِهِ أَبُو مُوسَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4415In-book reference : Book 64, Hadith 437USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 699   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4416,
    "id": 4416,
    "url": "https://sunnah.com/bukhari:4416",
    "bookNumber": 64,
    "hadithNumber": 438,
    "narrator": "Narrated Sa`d:",
    "english": "Allah's Messenger (ﷺ) set out for Tabuk. appointing `Ali as his deputy (in Medina). `Ali said, \"Do you want \nto leave me with the children and women?\" The Prophet (ﷺ) said, \"Will you not be pleased that you will \nbe to me like Aaron to Moses? But there will be no prophet after me.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى تَبُوكَ، وَاسْتَخْلَفَ عَلِيًّا فَقَالَ أَتُخَلِّفُنِي فِي الصِّبْيَانِ وَالنِّسَاءِ قَالَ ‏\n\"‏ أَلاَ تَرْضَى أَنْ تَكُونَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلاَّ أَنَّهُ لَيْسَ نَبِيٌّ بَعْدِي ‏\"‏‏.‏ وَقَالَ أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ سَمِعْتُ مُصْعَبًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4416In-book reference : Book 64, Hadith 438USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 700   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4417,
    "id": 4417,
    "url": "https://sunnah.com/bukhari:4417",
    "bookNumber": 64,
    "hadithNumber": 439,
    "narrator": "Narrated Safwan bin Ya`la bin Umaiya:",
    "english": "that his father said, \"I participated in Al-Usra (i.e. Tabuk) along with the Prophet.\" Ya`la added, \"(My \nparticipation in) that Ghazwa was the best of my deeds to me.\" Ya`la said, \"I had a laborer who \nquarrelled with somebody, and one of the two bit the hand of the other (`Ata', the sub-narrator, said, \n\"Safwan told me who bit whom but I forgot it\"), and the one who was bitten, pulled his hand out of \nthe mouth of the biter, so one of the incisors of the biter was broken. So we came to the Prophet (ﷺ) and \nhe considered the biter's claim as invalid (i.e. the biter did not get a recompense for his broken \nincisor). The Prophet (ﷺ) said, \"Should he leave his hand in your mouth so that you might snap it as if it \nwere in the mouth of a male camel to snap it?\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يُخْبِرُ قَالَ أَخْبَرَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعُسْرَةَ قَالَ كَانَ يَعْلَى يَقُولُ تِلْكَ الْغَزْوَةُ أَوْثَقُ أَعْمَالِي عِنْدِي‏.‏ قَالَ عَطَاءٌ فَقَالَ صَفْوَانُ قَالَ يَعْلَى فَكَانَ لِي أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا يَدَ الآخَرِ، قَالَ عَطَاءٌ فَلَقَدْ أَخْبَرَنِي صَفْوَانُ أَيُّهُمَا عَضَّ الآخَرَ فَنَسِيتُهُ، قَالَ فَانْتَزَعَ الْمَعْضُوضُ يَدَهُ مِنْ فِي الْعَاضِّ، فَانْتَزَعَ إِحْدَى ثَنِيَّتَيْهِ، فَأَتَيَا النَّبِيَّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ‏.‏ قَالَ عَطَاءٌ وَحَسِبْتُ أَنَّهُ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَفَيَدَعُ يَدَهُ فِي فِيكَ تَقْضَمُهَا، كَأَنَّهَا فِي فِي فَحْلٍ يَقْضَمُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4417In-book reference : Book 64, Hadith 439USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 701   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4418,
    "id": 4418,
    "url": "https://sunnah.com/bukhari:4418",
    "bookNumber": 64,
    "hadithNumber": 440,
    "narrator": "Narrated `Abdullah bin Ka`b bin Malik:",
    "english": "Who, from among Ka`b's sons, was the guide of Ka`b when he became blind: I heard Ka`b bin Malik \nnarrating the story of (the Ghazwa of) Tabuk in which he failed to take part. Ka`b said, \"I did not \nremain behind Allah's Messenger (ﷺ) in any Ghazwa that he fought except the Ghazwa of Tabuk, and I failed \nto take part in the Ghazwa of Badr, but Allah did not admonish anyone who had not participated in it, \nfor in fact, Allah's Messenger (ﷺ) had gone out in search of the caravan of Quraish till Allah made them (i.e. \nthe Muslims) and their enemy meet without any appointment. I witnessed the night of Al-`Aqaba \n(pledge) with Allah's Messenger (ﷺ) when we pledged for Islam, and I would not exchange it for the Badr \nbattle although the Badr battle is more popular amongst the people than it (i.e. Al-`Aqaba pledge). As \nfor my news (in this battle of Tabuk), I had never been stronger or wealthier than I was when I \nremained behind the Prophet (ﷺ) in that Ghazwa. \nBy Allah, never had I two she-camels before, but I had then at the time of this Ghazwa. Whenever \nAllah's Messenger (ﷺ) wanted to make a Ghazwa, he used to hide his intention by apparently referring to \ndifferent Ghazwa till it was the time of that Ghazwa (of Tabuk) which Allah's Messenger (ﷺ) fought in \nsevere heat, facing, a long journey, desert, and the great number of enemy. So the Prophet (ﷺ) announced \nto the Muslims clearly (their destination) so that they might get prepared for their Ghazwa. So he \ninformed them clearly of the destination he was going to. Allah's Messenger (ﷺ) was accompanied by a large \nnumber of Muslims who could not be listed in a book namely, a register.\" Ka`b added, \"Any man who \nintended to be absent would think that the matter would remain hidden unless Allah revealed it \nthrough Divine Revelation. So Allah's Messenger (ﷺ) fought that Ghazwa at the time when the fruits had \nripened and the shade looked pleasant. Allah's Messenger (ﷺ) and his companions prepared for the battle and \nI started to go out in order to get myself ready along with them, but I returned without doing anything. \nI would say to myself, 'I can do that.' So I kept on delaying it every now and then till the people got \nready and Allah's Messenger (ﷺ) and the Muslims along with him departed, and I had not prepared anything \nfor my departure, and I said, I will prepare myself (for departure) one or two days after him, and then \njoin them.' In the morning following their departure, I went out to get myself ready but returned \nhaving done nothing. Then again in the next morning, I went out to get ready but returned without \ndoing anything. \nSuch was the case with me till they hurried away and the battle was missed (by me). Even then I \nintended to depart to take them over. I wish I had done so! But it was not in my luck. So, after the \ndeparture of Allah's Messenger (ﷺ), whenever I went out and walked amongst the people (i.e, the remaining \npersons), it grieved me that I could see none around me, but one accused of hypocrisy or one of those \nweak men whom Allah had excused. Allah's Messenger (ﷺ) did not remember me till he reached Tabuk. \nSo while he was sitting amongst the people in Tabuk, he said, 'What did Ka`b do?' A man from Banu \nSalama said, 'O Allah's Messenger (ﷺ)! He has been stopped by his two Burdas (i.e. garments) and his \nlooking at his own flanks with pride.' Then Mu`adh bin Jabal said, 'What a bad thing you have said! \nBy Allah! O Allahs Apostle! We know nothing about him but good.' Allah's Messenger (ﷺ) kept silent.\" Ka`b \nbin Malik added, \"When I heard that he (i.e. the Prophet (ﷺ) ) was on his way back to Medina. I got \ndipped in my concern, and began to think of false excuses, saying to myself, 'How can I avoid his \nanger tomorrow?' And I took the advice of wise member of my family in this matter. \nWhen it was said that Allah's Messenger (ﷺ), had come near all the evil false excuses abandoned from my \nmind and I knew well that I could never come out of this problem by forging a false statement. Then I \ndecided firmly to speak the truth. So Allah's Messenger (ﷺ) arrived in the morning, and whenever he returned \nfrom a journey., he used to visit the Mosque first of all and offer a two-rak`at prayer therein and then \nsit for the people. So when he had done all that (this time), those who had failed to join the battle (of \nTabuk) came and started offering (false) excuses and taking oaths before him. They were something \nover eighty men; Allah's Messenger (ﷺ) accepted the excuses they had expressed, took their pledge of \nallegiance asked for Allah's Forgiveness for them, and left the secrets of their hearts for Allah to \njudge. \nThen I came to him, and when I greeted him, he smiled a smile of an angry person and then said, \n'Come on.' So I came walking till I sat before him. He said to me, 'What stopped you from joining us. \nHad you not purchased an animal For carrying you?' I answered, \"Yes, O Allah's Messenger (ﷺ)! But by \nAllah, if I were sitting before any person from among the people of the world other than you, I would \nhave avoided his anger with an excuse. \nBy Allah, I have been bestowed with the power of speaking fluently and eloquently, but by Allah, I \nknew well that if today I tell you a lie to seek your favor, Allah would surely make you angry with me \nin the near future, but if I tell you the truth, though you will get angry because of it, I hope for Allah's \nForgiveness. Really, by Allah, there was no excuse for me. By Allah, I had never been stronger or \nwealthier than I was when I remained behind you.' Then Allah's Messenger (ﷺ) said, 'As regards this man, he \nhas surely told the truth. So get up till Allah decides your case.' I got up, and many men of Banu \nSalama followed me and said to me. 'By Allah, we never witnessed you doing any sin before this. \nSurely, you failed to offer excuse to Allah's Messenger (ﷺ) as the others who did not join him, have offered. \nThe prayer of Allah's Messenger (ﷺ) to Allah to forgive you would have been sufficient for you.' By Allah, \nthey continued blaming me so much that I intended to return (to the Prophet) and accuse myself of \nhaving told a lie, but I said to them, 'Is there anybody else who has met the same fate as I have?' They \nreplied, 'Yes, there are two men who have said the same thing as you have, and to both of them was \ngiven the same order as given to you.' I said, 'Who are they?' They replied, Murara bin Ar-Rabi Al- \nAmri and Hilal bin Umaiya Al-Waqifi.' By that they mentioned to me two pious men who had \nattended the Ghazwa (Battle) of Badr, and in whom there was an example for me. So I did not change \nmy mind when they mentioned them to me. Allah's Messenger (ﷺ) forbade all the Muslims to talk to us, the \nthree aforesaid persons out of all those who had remained behind in that Ghazwa. So we kept away \nfrom the people and they changed their attitude towards us till the very land (where I lived) appeared \nstrange to me as if I did not know it. \nWe remained in that condition for fifty nights. As regards my two fellows, they remained in their \nhouses and kept on weeping, but I was the youngest of them and the firmest of them, so I used to go \nout and witness the prayers along with the Muslims and roam about in the markets, but none would \ntalk to me, and I would come to Allah's Messenger (ﷺ) and greet him while he was sitting In his gathering \nafter the prayer, and I would wonder whether the Prophet (ﷺ) did move his lips in return to my greetings \nor not. Then I would offer my prayer near to him and look at him stealthily. When I was busy with my \nprayer, he would turn his face towards me, but when I turned my face to him, he would turn his face \naway from me. When this harsh attitude of the people lasted long, I walked till I scaled the wall of the \ngarden of Abu Qatada who was my cousin and dearest person to me, and I offered my greetings to \nhim. By Allah, he did not return my greetings. I said, 'O Abu Qatada! I beseech you by Allah! Do you \nknow that I love Allah and His Apostle?' He kept quiet. I asked him again, beseeching him by Allah, \nbut he remained silent. Then I asked him again in the Name of Allah. He said, \"Allah and His Apostle \nknow it better.' Thereupon my eyes flowed with tears and I returned and jumped over the wall.\" Ka`b \nadded, \"While I was walking in the market of Medina, suddenly I saw a Nabati (i.e. a Christian \nfarmer) from the Nabatis of Sham who came to sell his grains in Medina, saying, 'Who will lead me to \nKa`b bin Malik?' The people began to point (me) out for him till he came to me and handed me a letter \nfrom the king of Ghassan in which the following was written: \n\"To proceed, I have been informed that your friend (i.e. the Prophet (ﷺ) ) has treated you harshly. \nAnyhow, Allah does not let you live at a place where you feel inferior and your right is lost. So join \nus, and we will console you.\" \nWhen I read it, I said to myself, 'This is also a sort of a test.' Then I took the letter to the oven and \nmade a fire therein by burning it. When forty out of the fifty nights elapsed, behold ! There came to \nme the messenger of Allah's Messenger (ﷺ) and said, 'Allah's Messenger (ﷺ) orders you to keep away from your \nwife,' I said, 'Should I divorce her; or else! what should I do?' He said, 'No, only keep aloof from her \nand do not cohabit her.' The Prophet (ﷺ) sent the same message to my two fellows. Then I said to my \nwife. 'Go to your parents and remain with them till Allah gives His Verdict in this matter.\" Ka`b \nadded, \"The wife of Hilal bin Umaiya came to Apostle and said, 'O Allah's Messenger (ﷺ)! Hilal bin Umaiya \nis a helpless old man who has no servant to attend on him. Do you dislike that I should serve him? ' \nHe said, 'No (you can serve him) but he should not come near you.' She said, 'By Allah, he has no \ndesire for anything. By, Allah, he has never ceased weeping till his case began till this day of his.' \n(continued...) \n(continuing... 1): -5.702:... ... \nOn that, some of my family members said to me, 'Will you also ask Allah's Messenger (ﷺ) to permit your \nwife (to serve you) as he has permitted the wife of Hilal bin Umaiya to serve him?' I said, 'By Allah, I \nwill not ask the permission of Allah's Messenger (ﷺ) regarding her, for I do not know What Allah's Messenger (ﷺ) \nwould say if I asked him to permit her (to serve me) while I am a young man.' Then I remained in that \nstate for ten more nights after that till the period of fifty nights was completed starting from the time \nwhen Allah's Messenger (ﷺ) prohibited the people from talking to us. When I had offered the Fajr prayer on \nthe 50th morning on the roof of one of our houses and while I was sitting in the condition which Allah \ndescribed (in the Qur'an) i.e. my very soul seemed straitened to me and even the earth seemed narrow \nto me for all its spaciousness, there I heard the voice of one who had ascended the mountain of Sala' \ncalling with his loudest voice, 'O Ka`b bin Malik! Be happy (by receiving good tidings).' I fell down \nin prostration before Allah, realizing that relief has come. Allah's Messenger (ﷺ) had announced the \nacceptance of our repentance by Allah when he had offered the Fajr prayer. The people then went out \nto congratulate us. Some bringers of good tidings went out to my two fellows, and a horseman came to \nme in haste, and a man of Banu Aslam came running and ascended the mountain and his voice was \nswifter than the horse. When he (i.e. the man) whose voice I had heard, came to me conveying the \ngood tidings, I took off my garments and dressed him with them; and by Allah, I owned no other \ngarments than them on that day. Then I borrowed two garments and wore them and went to Allah's \nApostle. \nThe people started receiving me in batches, congratulating me on Allah's Acceptance of my \nrepentance, saying, 'We congratulate you on Allah's Acceptance of your repentance.\" Ka`b further \nsaid, \"When I entered the Mosque. I saw Allah's Messenger (ﷺ) sitting with the people around him. Talha bin \nUbaidullah swiftly came to me, shook hands with me and congratulated me. By Allah, none of the \nMuhajirin (i.e. Emigrants) got up for me except him (i.e. Talha), and I will never forget this for \nTalha.\" Ka`b added, \"When I greeted Allah's Messenger (ﷺ) he, his face being bright with joy, said \"Be \nhappy with the best day that you have got ever since your mother delivered you.\" Ka`b added, \"I said \nto the Prophet (ﷺ) 'Is this forgiveness from you or from Allah?' He said, 'No, it is from Allah.' Whenever \nAllah's Messenger (ﷺ) became happy, his face would shine as if it were a piece of moon, and we all knew \nthat characteristic of him. When I sat before him, I said, 'O Allah's Messenger (ﷺ)! Because of the acceptance \nof my repentance I will give up all my wealth as alms for the Sake of Allah and His Apostle. Allah's \nApostle said, 'Keep some of your wealth, as it will be better for you.' I said, 'So I will keep my share \nfrom Khaibar with me,' and added, 'O Allah's Messenger (ﷺ)! Allah has saved me for telling the truth; so it is \na part of my repentance not to tell but the truth as long as I am alive. By Allah, I do not know anyone \nof the Muslims whom Allah has helped fortelling the truth more than me. Since I have mentioned that \ntruth to Allah's Messenger (ﷺ) till today, I have never intended to tell a lie. I hope that Allah will also save \nme (from telling lies) the rest of my life. So Allah revealed to His Apostle the Verse:-- \n\"Verily, Allah has forgiven the Prophet, the Muhajirin (i.e. Emigrants (up to His Saying) And be with \nthose who are true (in word and deed).\" (9.117-119) \nBy Allah, Allah has never bestowed upon me, apart from His guiding me to Islam, a Greater blessing \nthan the fact that I did not tell a lie to Allah's Messenger (ﷺ) which would have caused me to perish as those \nwho have told a lie perished, for Allah described those who told lies with the worst description He \never attributed to anybody else. Allah said:-- \"They (i.e. the hypocrites) will swear by Allah to you \nwhen you return to them (up to His Saying) Certainly Allah is not pleased with the rebellious people-- \n\" (9.95-96) Ka`b added, \"We, the three persons, differed altogether from those whose excuses Allah's \nApostle accepted when they swore to him. He took their pledge of allegiance and asked Allah to \nforgive them, but Allah's Messenger (ﷺ) left our case pending till Allah gave His Judgment about it. As for \nthat Allah said):-- And to the three (He did for give also) who remained behind.\" (9.118) \nWhat Allah said (in this Verse) does not indicate our failure to take part in the Ghazwa, but it refers to \nthe deferment of making a decision by the Prophet (ﷺ) about our case in contrast to the case of those who \nhad taken an oath before him and he excused them by accepting their excuses.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ قِصَّةِ، تَبُوكَ قَالَ كَعْبٌ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا إِلاَّ فِي غَزْوَةِ تَبُوكَ، غَيْرَ أَنِّي كُنْتُ تَخَلَّفْتُ فِي غَزْوَةِ بَدْرٍ، وَلَمْ يُعَاتِبْ أَحَدًا تَخَلَّفَ، عَنْهَا إِنَّمَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ عِيرَ قُرَيْشٍ، حَتَّى جَمَعَ اللَّهُ بَيْنَهُمْ وَبَيْنَ عَدُوِّهِمْ عَلَى غَيْرِ مِيعَادٍ وَلَقَدْ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْعَقَبَةِ حِينَ تَوَاثَقْنَا عَلَى الإِسْلاَمِ، وَمَا أُحِبُّ أَنَّ لِي بِهَا مَشْهَدَ بَدْرٍ، وَإِنْ كَانَتْ بَدْرٌ أَذْكَرَ فِي النَّاسِ مِنْهَا، كَانَ مِنْ خَبَرِي أَنِّي لَمْ أَكُنْ قَطُّ أَقْوَى وَلاَ أَيْسَرَ حِينَ تَخَلَّفْتُ عَنْهُ فِي تِلْكَ الْغَزْوَةِ، وَاللَّهِ مَا اجْتَمَعَتْ عِنْدِي قَبْلَهُ رَاحِلَتَانِ قَطُّ حَتَّى جَمَعْتُهُمَا فِي تِلْكَ الْغَزْوَةِ، وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ غَزْوَةً إِلاَّ وَرَّى بِغَيْرِهَا، حَتَّى كَانَتْ تِلْكَ الْغَزْوَةُ، غَزَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَرٍّ شَدِيدٍ، وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا وَعَدُوًّا كَثِيرًا، فَجَلَّى لِلْمُسْلِمِينَ أَمْرَهُمْ لِيَتَأَهَّبُوا أُهْبَةَ غَزْوِهِمْ، فَأَخْبَرَهُمْ بِوَجْهِهِ الَّذِي يُرِيدُ، وَالْمُسْلِمُونَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم كَثِيرٌ، وَلاَ يَجْمَعُهُمْ كِتَابٌ حَافِظٌ ـ يُرِيدُ الدِّيوَانَ ـ قَالَ كَعْبٌ فَمَا رَجُلٌ يُرِيدُ أَنْ يَتَغَيَّبَ إِلاَّ ظَنَّ أَنْ سَيَخْفَى لَهُ مَا لَمْ يَنْزِلْ فِيهِ وَحْىُ اللَّهِ، وَغَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم تِلْكَ الْغَزْوَةَ حِينَ طَابَتِ الثِّمَارُ وَالظِّلاَلُ، وَتَجَهَّزَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ مَعَهُ، فَطَفِقْتُ أَغْدُو لِكَىْ أَتَجَهَّزَ مَعَهُمْ فَأَرْجِعُ وَلَمْ أَقْضِ شَيْئًا، فَأَقُولُ فِي نَفْسِي أَنَا قَادِرٌ عَلَيْهِ‏.‏ فَلَمْ يَزَلْ يَتَمَادَى بِي حَتَّى اشْتَدَّ بِالنَّاسِ الْجِدُّ، فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ مَعَهُ وَلَمْ أَقْضِ مِنْ جَهَازِي شَيْئًا، فَقُلْتُ أَتَجَهَّزُ بَعْدَهُ بِيَوْمٍ أَوْ يَوْمَيْنِ ثُمَّ أَلْحَقُهُمْ، فَغَدَوْتُ بَعْدَ أَنْ فَصَلُوا لأَتَجَهَّزَ، فَرَجَعْتُ وَلَمْ أَقْضِ شَيْئًا، ثُمَّ غَدَوْتُ ثُمَّ رَجَعْتُ وَلَمْ أَقْضِ شَيْئًا، فَلَمْ يَزَلْ بِي حَتَّى أَسْرَعُوا وَتَفَارَطَ الْغَزْوُ، وَهَمَمْتُ أَنْ أَرْتَحِلَ فَأُدْرِكَهُمْ، وَلَيْتَنِي فَعَلْتُ، فَلَمْ يُقَدَّرْ لِي ذَلِكَ، فَكُنْتُ إِذَا خَرَجْتُ فِي النَّاسِ بَعْدَ خُرُوجِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَطُفْتُ فِيهِمْ، أَحْزَنَنِي أَنِّي لاَ أَرَى إِلاَّ رَجُلاً مَغْمُوصًا عَلَيْهِ النِّفَاقُ أَوْ رَجُلاً مِمَّنْ عَذَرَ اللَّهُ مِنَ الضُّعَفَاءِ، وَلَمْ يَذْكُرْنِي رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَلَغَ تَبُوكَ، فَقَالَ وَهْوَ جَالِسٌ فِي الْقَوْمِ بِتَبُوكَ ‏\"‏ مَا فَعَلَ كَعْبٌ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ بَنِي سَلِمَةَ يَا رَسُولَ اللَّهِ، حَبَسَهُ بُرْدَاهُ وَنَظَرُهُ فِي عِطْفِهِ‏.‏ فَقَالَ مُعَاذُ بْنُ جَبَلٍ بِئْسَ مَا قُلْتَ، وَاللَّهِ يَا رَسُولَ اللَّهِ، مَا عَلِمْنَا عَلَيْهِ إِلاَّ خَيْرًا‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ كَعْبُ بْنُ مَالِكٍ فَلَمَّا بَلَغَنِي أَنَّهُ تَوَجَّهَ قَافِلاً حَضَرَنِي هَمِّي، وَطَفِقْتُ أَتَذَكَّرُ الْكَذِبَ وَأَقُولُ بِمَاذَا أَخْرُجُ مِنْ سَخَطِهِ غَدًا وَاسْتَعَنْتُ عَلَى ذَلِكَ بِكُلِّ ذِي رَأْىٍ مِنْ أَهْلِي، فَلَمَّا قِيلَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَظَلَّ قَادِمًا زَاحَ عَنِّي الْبَاطِلُ، وَعَرَفْتُ أَنِّي لَنْ أَخْرُجَ مِنْهُ أَبَدًا بِشَىْءٍ فِيهِ كَذِبٌ، فَأَجْمَعْتُ صِدْقَهُ، وَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَادِمًا، وَكَانَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَيَرْكَعُ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ، فَلَمَّا فَعَلَ ذَلِكَ جَاءَهُ الْمُخَلَّفُونَ، فَطَفِقُوا يَعْتَذِرُونَ إِلَيْهِ، وَيَحْلِفُونَ لَهُ، وَكَانُوا بِضْعَةً وَثَمَانِينَ رَجُلاً فَقَبِلَ مِنْهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلاَنِيَتَهُمْ، وَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ، وَوَكَلَ سَرَائِرَهُمْ إِلَى اللَّهِ، فَجِئْتُهُ فَلَمَّا سَلَّمْتُ عَلَيْهِ تَبَسَّمَ تَبَسُّمَ الْمُغْضَبِ، ثُمَّ قَالَ ‏\"‏ تَعَالَ ‏\"‏‏.‏ فَجِئْتُ أَمْشِي حَتَّى جَلَسْتُ بَيْنَ يَدَيْهِ، فَقَالَ لِي ‏\"‏ مَا خَلَّفَكَ أَلَمْ تَكُنْ قَدِ ابْتَعْتَ ظَهْرَكَ ‏\"‏‏.‏ فَقُلْتُ بَلَى، إِنِّي وَاللَّهِ لَوْ جَلَسْتُ عِنْدَ غَيْرِكَ مِنْ أَهْلِ الدُّنْيَا، لَرَأَيْتُ أَنْ سَأَخْرُجُ مِنْ سَخَطِهِ بِعُذْرٍ، وَلَقَدْ أُعْطِيتُ جَدَلاً، وَلَكِنِّي وَاللَّهِ لَقَدْ عَلِمْتُ لَئِنْ حَدَّثْتُكَ الْيَوْمَ حَدِيثَ كَذِبٍ تَرْضَى بِهِ عَنِّي لَيُوشِكَنَّ اللَّهُ أَنْ يُسْخِطَكَ عَلَىَّ، وَلَئِنْ حَدَّثْتُكَ حَدِيثَ صِدْقٍ تَجِدُ عَلَىَّ فِيهِ إِنِّي لأَرْجُو فِيهِ عَفْوَ اللَّهِ، لاَ وَاللَّهِ مَا كَانَ لِي مِنْ عُذْرٍ، وَاللَّهِ مَا كُنْتُ قَطُّ أَقْوَى وَلاَ أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ عَنْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا هَذَا فَقَدْ صَدَقَ، فَقُمْ حَتَّى يَقْضِيَ اللَّهُ فِيكَ ‏\"‏‏.‏ فَقُمْتُ وَثَارَ رِجَالٌ مِنْ بَنِي سَلِمَةَ فَاتَّبَعُونِي، فَقَالُوا لِي وَاللَّهِ مَا عَلِمْنَاكَ كُنْتَ أَذْنَبْتَ ذَنْبًا قَبْلَ هَذَا، وَلَقَدْ عَجَزْتَ أَنْ لاَ تَكُونَ اعْتَذَرْتَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَا اعْتَذَرَ إِلَيْهِ الْمُتَخَلِّفُونَ، قَدْ كَانَ كَافِيَكَ ذَنْبَكَ اسْتِغْفَارُ رَسُولِ اللَّهِ صلى الله عليه وسلم لَكَ، فَوَاللَّهِ مَا زَالُوا يُؤَنِّبُونِي حَتَّى أَرَدْتُ أَنْ أَرْجِعَ فَأُكَذِّبُ نَفْسِي، ثُمَّ قُلْتُ لَهُمْ هَلْ لَقِيَ هَذَا مَعِي أَحَدٌ قَالُوا نَعَمْ، رَجُلاَنِ قَالاَ مِثْلَ مَا قُلْتَ، فَقِيلَ لَهُمَا مِثْلُ مَا قِيلَ لَكَ‏.‏ فَقُلْتُ مَنْ هُمَا قَالُوا مُرَارَةُ بْنُ الرَّبِيعِ الْعَمْرِيُّ وَهِلاَلُ بْنُ أُمَيَّةَ الْوَاقِفِيُّ‏.‏ فَذَكَرُوا لِي رَجُلَيْنِ صَالِحَيْنِ قَدْ شَهِدَا بَدْرًا فِيهِمَا إِسْوَةٌ، فَمَضَيْتُ حِينَ ذَكَرُوهُمَا لِي، وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُسْلِمِينَ عَنْ كَلاَمِنَا أَيُّهَا الثَّلاَثَةُ مِنْ بَيْنِ مَنْ تَخَلَّفَ عَنْهُ، فَاجْتَنَبَنَا النَّاسُ وَتَغَيَّرُوا لَنَا حَتَّى تَنَكَّرَتْ فِي نَفْسِي الأَرْضُ، فَمَا هِيَ الَّتِي أَعْرِفُ، فَلَبِثْنَا عَلَى ذَلِكَ خَمْسِينَ لَيْلَةً، فَأَمَّا صَاحِبَاىَ فَاسْتَكَانَا وَقَعَدَا فِي بُيُوتِهِمَا يَبْكِيَانِ، وَأَمَّا أَنَا فَكُنْتُ أَشَبَّ الْقَوْمِ وَأَجْلَدَهُمْ، فَكُنْتُ أَخْرُجُ فَأَشْهَدُ الصَّلاَةَ مَعَ الْمُسْلِمِينَ وَأَطُوفُ فِي الأَسْوَاقِ، وَلاَ يُكَلِّمُنِي أَحَدٌ، وَآتِي رَسُولَ اللَّهِ صلى الله عليه وسلم فَأُسَلِّمُ عَلَيْهِ وَهْوَ فِي مَجْلِسِهِ بَعْدَ الصَّلاَةِ، فَأَقُولُ فِي نَفْسِي هَلْ حَرَّكَ شَفَتَيْهِ بِرَدِّ السَّلاَمِ عَلَىَّ أَمْ لاَ ثُمَّ أُصَلِّي قَرِيبًا مِنْهُ فَأُسَارِقُهُ النَّظَرَ، فَإِذَا أَقْبَلْتُ عَلَى صَلاَتِي أَقْبَلَ إِلَىَّ، وَإِذَا الْتَفَتُّ نَحْوَهُ أَعْرَضَ عَنِّي، حَتَّى إِذَا طَالَ عَلَىَّ ذَلِكَ مِنْ جَفْوَةِ النَّاسِ مَشَيْتُ حَتَّى تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهْوَ ابْنُ عَمِّي وَأَحَبُّ النَّاسِ إِلَىَّ، فَسَلَّمْتُ عَلَيْهِ، فَوَاللَّهِ مَا رَدَّ عَلَىَّ السَّلاَمَ، فَقُلْتُ يَا أَبَا قَتَادَةَ، أَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُنِي أُحِبُّ اللَّهَ وَرَسُولَهُ فَسَكَتَ، فَعُدْتُ لَهُ فَنَشَدْتُهُ فَسَكَتَ، فَعُدْتُ لَهُ فَنَشَدْتُهُ‏.‏ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَفَاضَتْ عَيْنَاىَ وَتَوَلَّيْتُ حَتَّى تَسَوَّرْتُ الْجِدَارَ، قَالَ فَبَيْنَا أَنَا أَمْشِي بِسُوقِ الْمَدِينَةِ إِذَا نَبَطِيٌّ مِنْ أَنْبَاطِ أَهْلِ الشَّأْمِ مِمَّنْ قَدِمَ بِالطَّعَامِ يَبِيعُهُ بِالْمَدِينَةِ يَقُولُ مَنْ يَدُلُّ عَلَى كَعْبِ بْنِ مَالِكٍ فَطَفِقَ النَّاسُ يُشِيرُونَ لَهُ، حَتَّى إِذَا جَاءَنِي دَفَعَ إِلَىَّ كِتَابًا مِنْ مَلِكِ غَسَّانَ، فَإِذَا فِيهِ أَمَّا بَعْدُ فَإِنَّهُ قَدْ بَلَغَنِي أَنَّ صَاحِبَكَ قَدْ جَفَاكَ، وَلَمْ يَجْعَلْكَ اللَّهُ بِدَارِ هَوَانٍ وَلاَ مَضْيَعَةٍ، فَالْحَقْ بِنَا نُوَاسِكَ‏.‏ فَقُلْتُ لَمَّا قَرَأْتُهَا وَهَذَا أَيْضًا مِنَ الْبَلاَءِ‏.‏ فَتَيَمَّمْتُ بِهَا التَّنُّورَ فَسَجَرْتُهُ بِهَا، حَتَّى إِذَا مَضَتْ أَرْبَعُونَ لَيْلَةً مِنَ الْخَمْسِينَ إِذَا رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِينِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تَعْتَزِلَ امْرَأَتَكَ فَقُلْتُ أُطَلِّقُهَا أَمْ مَاذَا أَفْعَلُ قَالَ لاَ بَلِ اعْتَزِلْهَا وَلاَ تَقْرَبْهَا‏.‏ وَأَرْسَلَ إِلَى صَاحِبَىَّ مِثْلَ ذَلِكَ، فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَتَكُونِي عِنْدَهُمْ حَتَّى يَقْضِيَ اللَّهُ فِي هَذَا الأَمْرِ‏.‏ قَالَ كَعْبٌ فَجَاءَتِ امْرَأَةُ هِلاَلِ بْنِ أُمَيَّةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ هِلاَلَ بْنَ أُمَيَّةَ شَيْخٌ ضَائِعٌ لَيْسَ لَهُ خَادِمٌ فَهَلْ تَكْرَهُ أَنْ أَخْدُمَهُ قَالَ ‏\"‏ لاَ وَلَكِنْ لاَ يَقْرَبْكِ ‏\"‏‏.‏ قَالَتْ إِنَّهُ وَاللَّهِ مَا بِهِ حَرَكَةٌ إِلَى شَىْءٍ، وَاللَّهِ مَا زَالَ يَبْكِي مُنْذُ كَانَ مِنْ أَمْرِهِ مَا كَانَ إِلَى يَوْمِهِ هَذَا‏.‏ فَقَالَ لِي بَعْضُ أَهْلِي لَوِ اسْتَأْذَنْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي امْرَأَتِكَ كَمَا أَذِنَ لاِمْرَأَةِ هِلاَلِ بْنِ أُمَيَّةَ أَنْ تَخْدُمَهُ فَقُلْتُ وَاللَّهِ لاَ أَسْتَأْذِنُ فِيهَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا يُدْرِينِي مَا يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اسْتَأْذَنْتُهُ فِيهَا وَأَنَا رَجُلٌ شَابٌّ فَلَبِثْتُ بَعْدَ ذَلِكَ عَشْرَ لَيَالٍ حَتَّى كَمَلَتْ لَنَا خَمْسُونَ لَيْلَةً مِنْ حِينِ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كَلاَمِنَا، فَلَمَّا صَلَّيْتُ صَلاَةَ الْفَجْرِ صُبْحَ خَمْسِينَ لَيْلَةً، وَأَنَا عَلَى ظَهْرِ بَيْتٍ مِنْ بُيُوتِنَا، فَبَيْنَا أَنَا جَالِسٌ عَلَى الْحَالِ الَّتِي ذَكَرَ اللَّهُ، قَدْ ضَاقَتْ عَلَىَّ نَفْسِي، وَضَاقَتْ عَلَىَّ الأَرْضُ بِمَا رَحُبَتْ، سَمِعْتُ صَوْتَ صَارِخٍ أَوْفَى عَلَى جَبَلِ سَلْعٍ بِأَعْلَى صَوْتِهِ يَا كَعْبُ بْنَ مَالِكٍ، أَبْشِرْ‏.‏ قَالَ فَخَرَرْتُ سَاجِدًا، وَعَرَفْتُ أَنْ قَدْ جَاءَ فَرَجٌ، وَآذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَوْبَةِ اللَّهِ عَلَيْنَا حِينَ صَلَّى صَلاَةَ الْفَجْرِ، فَذَهَبَ النَّاسُ يُبَشِّرُونَنَا، وَذَهَبَ قِبَلَ صَاحِبَىَّ مُبَشِّرُونَ، وَرَكَضَ إِلَىَّ رَجُلٌ فَرَسًا، وَسَعَى سَاعٍ مِنْ أَسْلَمَ فَأَوْفَى عَلَى الْجَبَلِ وَكَانَ الصَّوْتُ أَسْرَعَ مِنَ الْفَرَسِ، فَلَمَّا جَاءَنِي الَّذِي سَمِعْتُ صَوْتَهُ يُبَشِّرُنِي نَزَعْتُ لَهُ ثَوْبَىَّ، فَكَسَوْتُهُ إِيَّاهُمَا بِبُشْرَاهُ، وَاللَّهِ مَا أَمْلِكُ غَيْرَهُمَا يَوْمَئِذٍ، وَاسْتَعَرْتُ ثَوْبَيْنِ فَلَبِسْتُهُمَا، وَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَتَلَقَّانِي النَّاسُ فَوْجًا فَوْجًا يُهَنُّونِي بِالتَّوْبَةِ، يَقُولُونَ لِتَهْنِكَ تَوْبَةُ اللَّهِ عَلَيْكَ‏.‏ قَالَ كَعْبٌ حَتَّى دَخَلْتُ الْمَسْجِدَ، فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ حَوْلَهُ النَّاسُ فَقَامَ إِلَىَّ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ يُهَرْوِلُ حَتَّى صَافَحَنِي وَهَنَّانِي، وَاللَّهِ مَا قَامَ إِلَىَّ رَجُلٌ مِنَ الْمُهَاجِرِينَ غَيْرُهُ، وَلاَ أَنْسَاهَا لِطَلْحَةَ، قَالَ كَعْبٌ فَلَمَّا سَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ يَبْرُقُ وَجْهُهُ مِنَ السُّرُورِ ‏\"‏ أَبْشِرْ بِخَيْرِ يَوْمٍ مَرَّ عَلَيْكَ مُنْذُ وَلَدَتْكَ أُمُّكَ ‏\"‏‏.‏ قَالَ قُلْتُ أَمِنْ عِنْدِكَ يَا رَسُولَ اللَّهِ أَمْ مِنْ عِنْدِ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ مِنْ عِنْدِ اللَّهِ ‏\"‏‏.‏ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سُرَّ اسْتَنَارَ وَجْهُهُ حَتَّى كَأَنَّهُ قِطْعَةُ قَمَرٍ، وَكُنَّا نَعْرِفُ ذَلِكَ مِنْهُ، فَلَمَّا جَلَسْتُ بَيْنَ يَدَيْهِ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِ اللَّهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ، فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ إِنَّمَا نَجَّانِي بِالصِّدْقِ، وَإِنَّ مِنْ تَوْبَتِي أَنْ لاَ أُحَدِّثَ إِلاَّ صِدْقًا مَا بَقِيتُ، فَوَاللَّهِ مَا أَعْلَمُ أَحَدًا مِنَ الْمُسْلِمِينَ أَبْلاَهُ اللَّهُ فِي صِدْقِ الْحَدِيثِ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَحْسَنَ مِمَّا أَبْلاَنِي، مَا تَعَمَّدْتُ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى يَوْمِي هَذَا كَذِبًا، وَإِنِّي لأَرْجُو أَنْ يَحْفَظَنِي اللَّهُ فِيمَا بَقِيتُ وَأَنْزَلَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم ‏{‏لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ‏}‏ إِلَى قَوْلِهِ ‏{‏وَكُونُوا مَعَ الصَّادِقِينَ‏}‏ فَوَاللَّهِ مَا أَنْعَمَ اللَّهُ عَلَىَّ مِنْ نِعْمَةٍ قَطُّ بَعْدَ أَنْ هَدَانِي لِلإِسْلاَمِ أَعْظَمَ فِي نَفْسِي مِنْ صِدْقِي لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ لاَ أَكُونَ كَذَبْتُهُ، فَأَهْلِكَ كَمَا هَلَكَ الَّذِينَ كَذَبُوا، فَإِنَّ اللَّهَ قَالَ لِلَّذِينَ كَذَبُوا حِينَ أَنْزَلَ الْوَحْىَ شَرَّ مَا قَالَ لأَحَدٍ، فَقَالَ تَبَارَكَ وَتَعَالَى ‏{‏سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ‏}‏ إِلَى قَوْلِهِ ‏{‏فَإِنَّ اللَّهَ لاَ يَرْضَى عَنِ الْقَوْمِ الْفَاسِقِينَ‏}‏‏.‏ قَالَ كَعْبٌ وَكُنَّا تَخَلَّفْنَا أَيُّهَا الثَّلاَثَةُ عَنْ أَمْرِ أُولَئِكَ الَّذِينَ قَبِلَ مِنْهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ حَلَفُوا لَهُ، فَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَأَرْجَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَمْرَنَا حَتَّى قَضَى اللَّهُ فِيهِ، فَبِذَلِكَ قَالَ اللَّهُ ‏{‏وَعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا‏}‏ وَلَيْسَ الَّذِي ذَكَرَ اللَّهُ مِمَّا خُلِّفْنَا عَنِ الْغَزْوِ إِنَّمَا هُوَ تَخْلِيفُهُ إِيَّانَا وَإِرْجَاؤُهُ أَمْرَنَا عَمَّنْ حَلَفَ لَهُ وَاعْتَذَرَ إِلَيْهِ، فَقَبِلَ مِنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4418In-book reference : Book 64, Hadith 440USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 702   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4419,
    "id": 4419,
    "url": "https://sunnah.com/bukhari:4419",
    "bookNumber": 64,
    "hadithNumber": 441,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When the Prophet (ﷺ) passed by Al-Hijr, he said, \"Do not enter the dwelling places of those people who \nwere unjust to themselves unless you enter in a weeping state lest the same calamity as of theirs \nshould befall you.\" Then he covered his head and made his speed fast till he crossed the valley.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا مَرَّ النَّبِيُّ صلى الله عليه وسلم بِالْحِجْرِ قَالَ ‏\n\"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ، أَنْ يُصِيبَكُمْ مَا أَصَابَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏\"‏‏.‏ ثُمَّ قَنَّعَ رَأْسَهُ وَأَسْرَعَ السَّيْرَ حَتَّى أَجَازَ الْوَادِيَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4419In-book reference : Book 64, Hadith 441USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 703   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4420,
    "id": 4420,
    "url": "https://sunnah.com/bukhari:4420",
    "bookNumber": 64,
    "hadithNumber": 442,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said to his companions who were at Al-Hijr, \"Do not enter upon these people who are \nbeing punished, except in a weeping state, lest the same calamity as of theirs should befall you...\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِ الْحِجْرِ ‏\n\"‏ لاَ تَدْخُلُوا عَلَى هَؤُلاَءِ الْمُعَذَّبِينَ إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4420In-book reference : Book 64, Hadith 442USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 704   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4421,
    "id": 4421,
    "url": "https://sunnah.com/bukhari:4421",
    "bookNumber": 64,
    "hadithNumber": 443,
    "narrator": "Narrated `Urwa bin Al-Mughira:",
    "english": "Al-Mughira bin Shu`ba, said, \"The Prophet (ﷺ) went out to answer the call of nature and (when he had \nfinished) I got up to pour water for him.\" I think that he said that the event had taken place during the \nGhazwa of Tabuk. Al-Mughira added. \"The Prophet (ﷺ) washed his face, and when he wanted to wash his \nforearms, the sleeves of his cloak became tight over them, so he took them out from underneath the \ncloak and then he washed them (i.e. his forearms) and passed wet hands over his Khuffs (socks made \nfrom thick fabric or leather).\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي سَلَمَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ذَهَبَ النَّبِيُّ صلى الله عليه وسلم لِبَعْضِ حَاجَتِهِ، فَقُمْتُ أَسْكُبُ عَلَيْهِ الْمَاءَ ـ لاَ أَعْلَمُهُ إِلاَّ قَالَ فِي غَزْوَةِ تَبُوكَ ـ فَغَسَلَ وَجْهَهُ، وَذَهَبَ يَغْسِلُ ذِرَاعَيْهِ فَضَاقَ عَلَيْهِ كُمُّ الْجُبَّةِ، فَأَخْرَجَهُمَا مِنْ تَحْتِ جُبَّتِهِ فَغَسَلَهُمَا ثُمَّ مَسَحَ عَلَى خُفَّيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4421In-book reference : Book 64, Hadith 443USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 705   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4422,
    "id": 4422,
    "url": "https://sunnah.com/bukhari:4422",
    "bookNumber": 64,
    "hadithNumber": 444,
    "narrator": "Narrated Abu Humaid:",
    "english": "We returned in the company of the Prophet (ﷺ) from the Ghazwa of Tabuk, and when we looked upon \nMedina, the Prophet (ﷺ) said, \"This is Taba (i.e. Medina), and this is Uhud, a mountain that loves us and \nis loved by us.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِي حُمَيْدٍ، قَالَ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ غَزْوَةِ تَبُوكَ حَتَّى إِذَا أَشْرَفْنَا عَلَى الْمَدِينَةِ قَالَ ‏\n\"‏ هَذِهِ طَابَةُ، وَهَذَا أُحُدٌ، جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4422In-book reference : Book 64, Hadith 444USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 706   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4423,
    "id": 4423,
    "url": "https://sunnah.com/bukhari:4423",
    "bookNumber": 64,
    "hadithNumber": 445,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) returned from the Ghazwa of Tabuk, and when he approached Medina, he said, \"There \nare some people in Medina who were with you all the time, you did not travel any portion of the \njourney nor crossed any valley, but they were with you they (i.e. the people) said, \"O Allah's Messenger (ﷺ)! \nEven though they were at Medina?\" He said, \"Yes, because they were stopped by a genuine excuse.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَجَعَ مِنْ غَزْوَةِ تَبُوكَ فَدَنَا مِنَ الْمَدِينَةِ فَقَالَ ‏\"‏ إِنَّ بِالْمَدِينَةِ أَقْوَامًا مَا سِرْتُمْ مَسِيرًا وَلاَ قَطَعْتُمْ وَادِيًا إِلاَّ كَانُوا مَعَكُمْ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَهُمْ بِالْمَدِينَةِ قَالَ ‏\"‏ وَهُمْ بِالْمَدِينَةِ، حَبَسَهُمُ الْعُذْرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4423In-book reference : Book 64, Hadith 445USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 707   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4424,
    "id": 4424,
    "url": "https://sunnah.com/bukhari:4424",
    "bookNumber": 64,
    "hadithNumber": 446,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) sent a letter to Khosrau with `Abdullah bin Hudhafa As-Sahmi and told him to hand it \nover to the governor of Al-Bahrain. The governor of Al-Bahrain handed it over to Khosrau, and when \nhe read the latter, he tore it into pieces. (The sub-narrator added, \"I think that Ibn Al-Musaiyab said, \n'Allah 's Apostle invoked (Allah) to tear them all totally Khosrau and his companions) into pieces.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى مَعَ عَبْدِ اللَّهِ بْنِ حُذَافَةَ السَّهْمِيِّ، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ مَزَّقَهُ ـ فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ ـ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4424In-book reference : Book 64, Hadith 446USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 708   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4425,
    "id": 4425,
    "url": "https://sunnah.com/bukhari:4425",
    "bookNumber": 64,
    "hadithNumber": 447,
    "narrator": "Narrated Abu Bakra:",
    "english": "During the days (of the battle) of Al-Jamal, Allah benefited me with a word I had heard from Allah's \nApostle after I had been about to join the Companions of Al-Jamal (i.e. the camel) and fight along \nwith them. When Allah's Messenger (ﷺ) was informed that the Persians had crowned the daughter of \nKhosrau as their ruler, he said, \"Such people as ruled by a lady will never be successful.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ لَقَدْ نَفَعَنِي اللَّهُ بِكَلِمَةٍ سَمِعْتُهَا مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم أَيَّامَ الْجَمَلِ، بَعْدَ مَا كِدْتُ أَنْ أَلْحَقَ بِأَصْحَابِ الْجَمَلِ فَأُقَاتِلَ مَعَهُمْ قَالَ لَمَّا بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ أَهْلَ فَارِسَ قَدْ مَلَّكُوا عَلَيْهِمْ بِنْتَ كِسْرَى قَالَ ‏\n\"‏ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4425In-book reference : Book 64, Hadith 447USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 709   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4426,
    "id": 4426,
    "url": "https://sunnah.com/bukhari:4426",
    "bookNumber": 64,
    "hadithNumber": 448,
    "narrator": "Narrated As-Sa'ib bin Yazid:",
    "english": "I remember that I went out with the boys to (the place called) Thaniyat-ul-Wada` to receive Allah's \nApostle .",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، يَقُولُ أَذْكُرُ أَنِّي خَرَجْتُ مَعَ الْغِلْمَانِ إِلَى ثَنِيَّةِ الْوَدَاعِ نَتَلَقَّى رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ سُفْيَانُ مَرَّةً مَعَ الصِّبْيَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4426In-book reference : Book 64, Hadith 448USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 710   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4427,
    "id": 4427,
    "url": "https://sunnah.com/bukhari:4427",
    "bookNumber": 64,
    "hadithNumber": 449,
    "narrator": "Narrated As-Saib:",
    "english": "I remember I went out with the boys to Thaniyat-ul-Wada` to receive the Prophet (ﷺ) when he returned \nfrom the Ghazwa of Tabuk.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ، أَذْكُرُ أَنِّي خَرَجْتُ مَعَ الصِّبْيَانِ نَتَلَقَّى النَّبِيَّ صلى الله عليه وسلم إِلَى ثَنِيَّةِ الْوَدَاعِ مَقْدَمَهُ مِنْ غَزْوَةِ تَبُوكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4427In-book reference : Book 64, Hadith 449USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 711   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4428,
    "id": 4428,
    "url": "https://sunnah.com/bukhari:4428",
    "bookNumber": 64,
    "hadithNumber": 450,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) in his ailment in which he died, used to say, \"O `Aisha! I still feel the \npain caused by the food I ate at Khaibar, and at this time, I feel as if my aorta is being cut from that \npoison.\"",
    "arabic": "وَقَالَ يُونُسُ عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ ‏\n\"‏ يَا عَائِشَةُ مَا أَزَالُ أَجِدُ أَلَمَ الطَّعَامِ الَّذِي أَكَلْتُ بِخَيْبَرَ، فَهَذَا أَوَانُ وَجَدْتُ انْقِطَاعَ أَبْهَرِي مِنْ ذَلِكَ السَّمِّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4428In-book reference : Book 64, Hadith 450USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 713   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4429,
    "id": 4429,
    "url": "https://sunnah.com/bukhari:4429",
    "bookNumber": 64,
    "hadithNumber": 451,
    "narrator": "Narrated Um Al-Fadl bint Al-Harith:",
    "english": "I heard the Prophet (ﷺ) reciting Surat-al-Mursalat `Urfan (77) in the Maghrib prayer, and after that prayer \nhe did not lead us in any prayer till he died.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي الْمَغْرِبِ بِ ـ ‏{‏الْمُرْسَلاَتِ عُرْفًا‏}‏ ثُمَّ مَا صَلَّى لَنَا بَعْدَهَا حَتَّى قَبَضَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4429In-book reference : Book 64, Hadith 451USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 712   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4430,
    "id": 4430,
    "url": "https://sunnah.com/bukhari:4430",
    "bookNumber": 64,
    "hadithNumber": 452,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Umar bin Al-Khattab used to let Ibn `Abbas sit beside him, so `AbdurRahman bin `Auf said to \n`Umar, \"We have sons similar to him.\" `Umar replied, \"(I respect him) because of his status that you \nknow.\" `Umar then asked Ibn `Abbas about the meaning of this Holy Verse:-- \"When comes the help \nof Allah and the conquest of Mecca . . .\" (110.1) \nIbn `Abbas replied, \"That indicated the death of Allah's Messenger (ﷺ) which Allah informed him of.\" `Umar \nsaid, \"I do not understand of it except what you understand.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ يُدْنِي ابْنَ عَبَّاسٍ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنَّ لَنَا أَبْنَاءً مِثْلَهُ‏.‏ فَقَالَ إِنَّهُ مِنْ حَيْثُ تَعْلَمُ‏.‏ فَسَأَلَ عُمَرُ ابْنَ عَبَّاسٍ عَنْ هَذِهِ الآيَةِ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ فَقَالَ أَجَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْلَمَهُ إِيَّاهُ، فَقَالَ مَا أَعْلَمُ مِنْهَا إِلاَّ مَا تَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4430In-book reference : Book 64, Hadith 452USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 713   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4431,
    "id": 4431,
    "url": "https://sunnah.com/bukhari:4431",
    "bookNumber": 64,
    "hadithNumber": 453,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Thursday! And how great that Thursday was! The ailment of Allah's Messenger (ﷺ) became worse (on \nThursday) and he said, fetch me something so that I may write to you something after which you will \nnever go astray.\" The people (present there) differed in this matter, and it was not right to differ before \na prophet. Some said, \"What is wrong with him ? (Do you think ) he is delirious (seriously ill)? Ask \nhim ( to understand his state ).\" So they went to the Prophet (ﷺ) and asked him again. The Prophet (ﷺ) said, \n\"Leave me, for my present state is better than what you call me for.\" Then he ordered them to do three \nthings. He said, \"Turn the pagans out of the 'Arabian Peninsula; respect and give gifts to the foreign \ndelegations as you have seen me dealing with them.\" (Sa`id bin Jubair, the sub-narrator said that Ibn \n`Abbas kept quiet as rewards the third order, or he said, \"I forgot it.\") (See Hadith No. 116 Vol. 1)",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ يَوْمُ الْخَمِيسِ وَمَا يَوْمُ الْخَمِيسِ اشْتَدَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعُهُ فَقَالَ ‏\"‏ ائْتُونِي أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ أَبَدًا ‏\"‏‏.‏ فَتَنَازَعُوا، وَلاَ يَنْبَغِي عِنْدَ نَبِيٍّ تَنَازُعٌ، فَقَالُوا مَا شَأْنُهُ أَهَجَرَ اسْتَفْهِمُوهُ فَذَهَبُوا يَرُدُّونَ عَلَيْهِ‏.‏ فَقَالَ ‏\"‏ دَعُونِي فَالَّذِي أَنَا فِيهِ خَيْرٌ مِمَّا تَدْعُونِي إِلَيْهِ ‏\"‏‏.‏ وَأَوْصَاهُمْ بِثَلاَثٍ قَالَ ‏\"‏ أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ، وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ‏\"‏‏.‏ وَسَكَتَ عَنِ الثَّالِثَةِ، أَوْ قَالَ فَنَسِيتُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4431In-book reference : Book 64, Hadith 453USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 716   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4432,
    "id": 4432,
    "url": "https://sunnah.com/bukhari:4432",
    "bookNumber": 64,
    "hadithNumber": 454,
    "narrator": "Narrated Ubaidullah bin `Abdullah:",
    "english": "Ibn `Abbas said, \"When Allah's Messenger (ﷺ) was on his deathbed and there were some men in the house, \nhe said, 'Come near, I will write for you something after which you will not go astray.' Some of them ( \ni.e. his companions) said, 'Allah's Messenger (ﷺ) is seriously ill and you have the (Holy) Qur'an. Allah's \nBook is sufficient for us.' So the people in the house differed and started disputing. Some of them said, \n'Give him writing material so that he may write for you something after which you will not go astray.' \nwhile the others said the other way round. So when their talk and differences increased, Allah's \nApostle said, \"Get up.\" Ibn `Abbas used to say, \"No doubt, it was very unfortunate (a great disaster) \nthat Allah's Messenger (ﷺ) was prevented from writing for them that writing because of their differences and \nnoise.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلُمُّوا أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ فَقَالَ بَعْضُهُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ غَلَبَهُ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، حَسْبُنَا كِتَابُ اللَّهِ‏.‏ فَاخْتَلَفَ أَهْلُ الْبَيْتِ وَاخْتَصَمُوا، فَمِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبُ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ‏.‏ وَمِنْهُمْ مَنْ يَقُولُ غَيْرَ ذَلِكَ، فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ يَقُولُ ابْنُ عَبَّاسٍ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ لاِخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4432In-book reference : Book 64, Hadith 454USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 717   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4433,
    "id": 4433,
    "url": "https://sunnah.com/bukhari:4433",
    "bookNumber": 64,
    "hadithNumber": 455,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) called Fatima during his fatal illness and told her something secretly and she wept. Then \nhe called her again and told her something secretly, and she started laughing. When we asked her \nabout that, she said, \"The Prophet (ﷺ) first told me secretly that he would expire in that disease in which \nhe died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I \nlaughed ( at that time).",
    "arabic": "حَدَّثَنَا يَسَرَةُ بْنُ صَفْوَانَ بْنِ جَمِيلٍ اللَّخْمِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَعَا النَّبِيُّ صلى الله عليه وسلم فَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ، فَسَارَّهَا بِشَىْءٍ، فَبَكَتْ، ثُمَّ دَعَاهَا فَسَارَّهَا بِشَىْءٍ فَضَحِكَتْ فَسَأَلْنَا عَنْ ذَلِكَ‏.‏   فَقَالَتْ سَارَّنِي النَّبِيُّ صلى الله عليه وسلم أَنَّهُ يُقْبَضُ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَبَكَيْتُ، ثُمَّ سَارَّنِي فَأَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِهِ يَتْبَعُهُ فَضَحِكْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4433, 4434In-book reference : Book 64, Hadith 455USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 718   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4434,
    "id": 4434,
    "url": "https://sunnah.com/bukhari:4434",
    "bookNumber": 64,
    "hadithNumber": 455,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) called Fatima during his fatal illness and told her something secretly and she wept. Then \nhe called her again and told her something secretly, and she started laughing. When we asked her \nabout that, she said, \"The Prophet (ﷺ) first told me secretly that he would expire in that disease in which \nhe died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I \nlaughed ( at that time).",
    "arabic": "حَدَّثَنَا يَسَرَةُ بْنُ صَفْوَانَ بْنِ جَمِيلٍ اللَّخْمِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَعَا النَّبِيُّ صلى الله عليه وسلم فَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ، فَسَارَّهَا بِشَىْءٍ، فَبَكَتْ، ثُمَّ دَعَاهَا فَسَارَّهَا بِشَىْءٍ فَضَحِكَتْ فَسَأَلْنَا عَنْ ذَلِكَ‏.‏   فَقَالَتْ سَارَّنِي النَّبِيُّ صلى الله عليه وسلم أَنَّهُ يُقْبَضُ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَبَكَيْتُ، ثُمَّ سَارَّنِي فَأَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِهِ يَتْبَعُهُ فَضَحِكْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4433, 4434In-book reference : Book 64, Hadith 455USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 718   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4435,
    "id": 4435,
    "url": "https://sunnah.com/bukhari:4435",
    "bookNumber": 64,
    "hadithNumber": 456,
    "narrator": "Narrated `Aisha:",
    "english": "Used to hear (from the Prophet) that no Prophet dies till he is given the option to select either the \nworldly life or the life of the Hereafter. I heard the Prophet (ﷺ) in his fatal disease, with his voice \nbecoming hoarse, saying, \"In the company of those on whom is the grace of Allah ..( to the end of the \nVerse ).\" (4.69) Thereupon I thought that the Prophet (ﷺ) had been given the option.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَسْمَعُ أَنَّهُ لاَ يَمُوتُ نَبِيٌّ حَتَّى يُخَيَّرَ بَيْنَ الدُّنْيَا وَالآخِرَةِ، فَسَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ وَأَخَذَتْهُ بُحَّةٌ يَقُولُ ‏{‏مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ‏}‏ الآيَةَ، فَظَنَنْتُ أَنَّهُ خُيِّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4435In-book reference : Book 64, Hadith 456USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 719   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4436,
    "id": 4436,
    "url": "https://sunnah.com/bukhari:4436",
    "bookNumber": 64,
    "hadithNumber": 457,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) fell ill in his fatal illness, he started saying, \"With the highest companion.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا مَرِضَ النَّبِيُّ صلى الله عليه وسلم الْمَرَضَ الَّذِي مَاتَ فِيهِ جَعَلَ يَقُولُ ‏\n\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4436In-book reference : Book 64, Hadith 457USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 720   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4437,
    "id": 4437,
    "url": "https://sunnah.com/bukhari:4437",
    "bookNumber": 64,
    "hadithNumber": 458,
    "narrator": "Narrated Aisha:",
    "english": "When Allah 's Apostle was in good health, he used to say, \"Never does a prophet die unless he is \nshown his place in Paradise ( before his death ), and then he is made alive or given option.\" When the \nProphet became ill and his last moments came while his head was on my thigh, he became \nunconscious, and when he came to his senses, he looked towards the roof of the house and then said, \n\"O Allah! (Please let me be) with the highest companion.\" Thereupon I said, \"Hence he is not going to \nstay with us? \" Then I came to know that his state was the confirmation of the narration he used to \nmention to us while he was in good health.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ إِنَّ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ صَحِيحٌ يَقُولُ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُحَيَّا أَوْ يُخَيَّرَ ‏\"‏‏.‏ فَلَمَّا اشْتَكَى وَحَضَرَهُ الْقَبْضُ وَرَأْسُهُ عَلَى فَخِذِ عَائِشَةَ غُشِيَ عَلَيْهِ، فَلَمَّا أَفَاقَ شَخَصَ بَصَرُهُ نَحْوَ سَقْفِ الْبَيْتِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ فَقُلْتُ إِذًا لاَ يُجَاوِرُنَا‏.‏ فَعَرَفْتُ أَنَّهُ حَدِيثُهُ الَّذِي كَانَ يُحَدِّثُنَا وَهْوَ صَحِيحٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4437In-book reference : Book 64, Hadith 458USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 721   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4438,
    "id": 4438,
    "url": "https://sunnah.com/bukhari:4438",
    "bookNumber": 64,
    "hadithNumber": 459,
    "narrator": "Narrated Aisha:",
    "english": "`Abdur-Rahman bin Abu Bakr entered upon the Prophet (ﷺ) while I was supporting the Prophet (ﷺ) on my \nchest. `AbdurRahman had a fresh Siwak then and he was cleaning his teeth with it. Allah's Messenger (ﷺ) \nlooked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with \nwater), and then gave it to the Prophet (ﷺ) who cleaned his teeth with it. I had never seen Allah's Messenger (ﷺ) \ncleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his \nfinger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha used \nto say, \"He died while his head was resting between my chest and chin.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَفَّانُ، عَنْ صَخْرِ بْنِ جُوَيْرِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ عَلَى النَّبِيِّ صلى الله عليه وسلم وَأَنَا مُسْنِدَتُهُ إِلَى صَدْرِي، وَمَعَ عَبْدِ الرَّحْمَنِ سِوَاكٌ رَطْبٌ يَسْتَنُّ بِهِ، فَأَبَدَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بَصَرَهُ، فَأَخَذْتُ السِّوَاكَ فَقَصَمْتُهُ وَنَفَضْتُهُ وَطَيَّبْتُهُ، ثُمَّ دَفَعْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَاسْتَنَّ بِهِ، فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَنَّ اسْتِنَانًا قَطُّ أَحْسَنَ مِنْهُ، فَمَا عَدَا أَنْ فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَفَعَ يَدَهُ أَوْ إِصْبَعَهُ ثُمَّ قَالَ ‏\n\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ ثَلاَثًا ثُمَّ قَضَى، وَكَانَتْ تَقُولُ مَاتَ بَيْنَ حَاقِنَتِي وَذَاقِنَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4438In-book reference : Book 64, Hadith 459USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 722   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4439,
    "id": 4439,
    "url": "https://sunnah.com/bukhari:4439",
    "bookNumber": 64,
    "hadithNumber": 460,
    "narrator": "Narrated Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) became ill, he used to recite the Muawidhatan (i.e. the last two surahs of the Qur'an) and blow his breath over himself (after their recitation ) and rubbed his hands over his body. So when he was afflicted with his \nfatal illness. I started reciting the Muawidhatan and blowing my breath over him as he used to do and then I rubbed the hand of the Prophet (ﷺ) over his body.",
    "arabic": "حَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ فَلَمَّا اشْتَكَى وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ طَفِقْتُ أَنْفِثُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ، الَّتِي كَانَ يَنْفِثُ، وَأَمْسَحُ بِيَدِ النَّبِيِّ صلى الله عليه وسلم عَنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4439In-book reference : Book 64, Hadith 460USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 723   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4440,
    "id": 4440,
    "url": "https://sunnah.com/bukhari:4440",
    "bookNumber": 64,
    "hadithNumber": 461,
    "narrator": "Narrated `Aisha:",
    "english": "I heard the Prophet (ﷺ) and listened to him before his death while he was leaning his back on me and \nsaying, \"O Allah! Forgive me, and bestow Your Mercy on me, and let me meet the (highest) companions (of the Hereafter).\" \n\n\n(See the Qur'an (4:69) and Hadith #4435)",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّهَا، سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم وَأَصْغَتْ إِلَيْهِ قَبْلَ أَنْ يَمُوتَ، وَهْوَ مُسْنِدٌ إِلَىَّ ظَهْرَهُ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيقِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4440In-book reference : Book 64, Hadith 461USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 724   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4441,
    "id": 4441,
    "url": "https://sunnah.com/bukhari:4441",
    "bookNumber": 64,
    "hadithNumber": 462,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "`Aisha said, \"The Prophet (ﷺ) said during his fatal illness, \"Allah cursed the Jews for they took the graves \nof their prophets as places for worship.\" `Aisha added, \"Had it not been for that (statement of the \nProphet ) his grave would have been made conspicuous. But he was afraid that it might be taken as a \nplace for worship.\"",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ هِلاَلٍ الْوَزَّانِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي لَمْ يَقُمْ مِنْهُ ‏\n\"‏ لَعَنَ اللَّهُ الْيَهُودَ، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ لَوْلاَ ذَلِكَ لأُبْرِزَ قَبْرُهُ‏.‏ خَشِيَ أَنْ يُتَّخَذَ مَسْجِدًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4441In-book reference : Book 64, Hadith 462USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 725   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4442,
    "id": 4442,
    "url": "https://sunnah.com/bukhari:4442",
    "bookNumber": 64,
    "hadithNumber": 463,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet) \"When the ailment of Allah's Messenger (ﷺ) became aggravated, he requested his \nwives to permit him to be (treated) nursed in my house, and they gave him permission. He came out \n(to my house), walking between two men with his feet dragging on the ground, between `Abbas bin \n`Abdul--Muttalib and another man\" 'Ubaidullah said, \"I told `Abdullah of what `Aisha had said, \n`Abdullah bin `Abbas said to me, 'Do you know who is the other man whom `Aisha did not name?' I \nsaid, 'No.' Ibn `Abbas said, 'It was `Ali bin Abu Talib.\" `Aisha, the wife of the Prophet (ﷺ) used to narrate \nsaying, \"When Allah's Messenger (ﷺ) entered my house and his disease became aggravated, he said, \" Pour \non me the water of seven water skins, the mouths of which have not been untied, so that I may give \nadvice to the people.' So we let him sit in a big basin belonging to Hafsa, the wife of the Prophet (ﷺ) and \nthen started to pour water on him from these water skins till he started pointing to us with his hands \nintending to say, 'You have done your job.\" `Aisha added, \"Then he went out to the people and led \nthem in prayer and preached to them.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاشْتَدَّ بِهِ وَجَعُهُ اسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ لَهُ، فَخَرَجَ وَهْوَ بَيْنَ الرَّجُلَيْنِ تَخُطُّ رِجْلاَهُ فِي الأَرْضِ، بَيْنَ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَبَيْنَ رَجُلٍ آخَرَ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَأَخْبَرْتُ عَبْدَ اللَّهِ بِالَّذِي قَالَتْ عَائِشَةُ، فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ هَلْ تَدْرِي مَنِ الرَّجُلُ الآخَرُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ قَالَ قُلْتُ لاَ‏.‏ قَالَ ابْنُ عَبَّاسٍ هُوَ عَلِيٌّ‏.‏ وَكَانَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم تُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا دَخَلَ بَيْتِي وَاشْتَدَّ بِهِ وَجَعُهُ قَالَ ‏\n\"‏ هَرِيقُوا عَلَىَّ مِنْ سَبْعِ قِرَبٍ لَمْ تُحْلَلْ أَوْكِيَتُهُنَّ لَعَلِّي أَعْهَدُ إِلَى النَّاسِ ‏\"‏‏.‏ فَأَجْلَسْنَاهُ فِي مِخْضَبٍ لِحَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ طَفِقْنَا نَصُبُّ عَلَيْهِ مِنْ تِلْكَ الْقِرَبِ، حَتَّى طَفِقَ يُشِيرُ إِلَيْنَا بِيَدِهِ أَنْ قَدْ فَعَلْتُنَّ قَالَتْ ثُمَّ خَرَجَ إِلَى النَّاسِ فَصَلَّى لَهُمْ وَخَطَبَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4442In-book reference : Book 64, Hadith 463USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4443,
    "id": 4443,
    "url": "https://sunnah.com/bukhari:4443",
    "bookNumber": 64,
    "hadithNumber": 464,
    "narrator": "",
    "english": "`Aisha and `Abdullah bin `Abbas said, \"When Allah's Messenger (ﷺ) \nbecame ill seriously, he started covering his face with his woolen sheet, and when he felt short of \nbreath, he removed it from his face and said, 'That is so! Allah's curse be on the Jews and the \nChristians, as they took the graves of their prophets as (places of worship),' intending to warn (the \nMuslims) of what they had done.\"",
    "arabic": "وَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ وَهْوَ كَذَلِكَ يَقُولُ ‏\n\"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4443, 4444In-book reference : Book 64, Hadith 464USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4444,
    "id": 4444,
    "url": "https://sunnah.com/bukhari:4444",
    "bookNumber": 64,
    "hadithNumber": 464,
    "narrator": "",
    "english": "`Aisha and `Abdullah bin `Abbas said, \"When Allah's Messenger (ﷺ) \nbecame ill seriously, he started covering his face with his woolen sheet, and when he felt short of \nbreath, he removed it from his face and said, 'That is so! Allah's curse be on the Jews and the \nChristians, as they took the graves of their prophets as (places of worship),' intending to warn (the \nMuslims) of what they had done.\"",
    "arabic": "وَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ وَهْوَ كَذَلِكَ يَقُولُ ‏\n\"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4443, 4444In-book reference : Book 64, Hadith 464USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4445,
    "id": 4445,
    "url": "https://sunnah.com/bukhari:4445",
    "bookNumber": 64,
    "hadithNumber": 465,
    "narrator": "",
    "english": "`Aisha added, \"I argued with Allah's Messenger (ﷺ) repeatedly about that \nmatter (i.e. his order that Abu Bakr should lead the people in prayer in his place when he was ill), and \nwhat made me argue so much, was, that it never occurred to my mind that after the Prophet, the \npeople would ever love a man who had taken his place, and I felt that anybody standing in his place, \nwould be a bad omen to the people, so I wanted Allah's Messenger (ﷺ) to give up the idea of choosing Abu \nBakr (to lead the people in prayer).",
    "arabic": "أَخْبَرَنِي عُبَيْدُ اللَّهِ، أَنَّ عَائِشَةَ، قَالَتْ لَقَدْ رَاجَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ، وَمَا حَمَلَنِي عَلَى كَثْرَةِ مُرَاجَعَتِهِ إِلاَّ أَنَّهُ لَمْ يَقَعْ فِي قَلْبِي أَنْ يُحِبَّ النَّاسُ بَعْدَهُ رَجُلاً قَامَ مَقَامَهُ أَبَدًا، وَلاَ كُنْتُ أُرَى أَنَّهُ لَنْ يَقُومَ أَحَدٌ مَقَامَهُ إِلاَّ تَشَاءَمَ النَّاسُ بِهِ، فَأَرَدْتُ أَنْ يَعْدِلَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَبِي بَكْرٍ‏.‏ رَوَاهُ ابْنُ عُمَرَ وَأَبُو مُوسَى وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4445In-book reference : Book 64, Hadith 465USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 727   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4446,
    "id": 4446,
    "url": "https://sunnah.com/bukhari:4446",
    "bookNumber": 64,
    "hadithNumber": 466,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) died while he was between my chest and chin, so I never dislike the death agony for \nanyone after the Prophet.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَاتَ النَّبِيُّ صلى الله عليه وسلم وَإِنَّهُ لَبَيْنَ حَاقِنَتِي وَذَاقِنَتِي، فَلاَ أَكْرَهُ شِدَّةَ الْمَوْتِ لأَحَدٍ أَبَدًا بَعْدَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4446In-book reference : Book 64, Hadith 466USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 726   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4447,
    "id": 4447,
    "url": "https://sunnah.com/bukhari:4447",
    "bookNumber": 64,
    "hadithNumber": 467,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "`Ali bin Abu Talib came out of the house of Allah's Messenger (ﷺ) during his fatal illness. The people asked, \n\"O Abu Hasan (i.e. `Ali)! How is the health of Allah's Messenger (ﷺ) this morning?\" `Ali replied, \"He has \nrecovered with the Grace of Allah.\" `Abbas bin `Abdul Muttalib held him by the hand and said to him, \n\"In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah's \nApostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib \nlook at the time of their death. So let us go to Allah's Messenger (ﷺ) and ask him who will take over the \nCaliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform \nhim so that he may tell the new ruler to take care of us.\" `Ali said, \"By Allah, if we asked Allah's \nApostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And \nby Allah, I will not ask Allah's Messenger (ﷺ) for it.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، قَالَ حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيُّ ـ وَكَانَ كَعْبُ بْنُ مَالِكٍ أَحَدَ الثَّلاَثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ـ رضى الله عنه ـ خَرَجَ مِنْ عِنْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ، فَقَالَ النَّاسُ يَا أَبَا حَسَنٍ، كَيْفَ أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ أَصْبَحَ بِحَمْدِ اللَّهِ بَارِئًا، فَأَخَذَ بِيَدِهِ عَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ، فَقَالَ لَهُ أَنْتَ وَاللَّهِ بَعْدَ ثَلاَثٍ عَبْدُ الْعَصَا، وَإِنِّي وَاللَّهِ لأُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم سَوْفَ يُتَوَفَّى مِنْ وَجَعِهِ هَذَا، إِنِّي لأَعْرِفُ وُجُوهَ بَنِي عَبْدِ الْمُطَّلِبِ عِنْدَ الْمَوْتِ، اذْهَبْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْنَسْأَلْهُ فِيمَنْ هَذَا الأَمْرُ، إِنْ كَانَ فِينَا عَلِمْنَا ذَلِكَ، وَإِنْ كَانَ فِي غَيْرِنَا عَلِمْنَاهُ فَأَوْصَى بِنَا‏.‏ فَقَالَ عَلِيٌّ إِنَّا وَاللَّهِ لَئِنْ سَأَلْنَاهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَمَنَعَنَاهَا لاَ يُعْطِينَاهَا النَّاسُ بَعْدَهُ، وَإِنِّي وَاللَّهِ لاَ أَسْأَلُهَا رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4447In-book reference : Book 64, Hadith 467USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 728   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4448,
    "id": 4448,
    "url": "https://sunnah.com/bukhari:4448",
    "bookNumber": 64,
    "hadithNumber": 468,
    "narrator": "Narrated Anas bin Malik:",
    "english": "While the Muslims were offering the Fajr prayer on Monday and Abu Bakr was leading them in \nprayer, suddenly Allah's Messenger (ﷺ) lifted the curtain of `Aisha's dwelling and looked at them while they \nwere in the rows of the prayers and smiled. Abu Bakr retreated to join the row, thinking that Allah's \nApostle wanted to come out for the prayer. The Muslims were about to be put to trial in their prayer \n(i.e. were about to give up praying) because of being overjoyed at seeing Allah's Messenger (ﷺ). But Allah's \nApostle beckoned them with his hand to complete their prayer and then entered the dwelling and let \nfall the curtain.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ الْمُسْلِمِينَ، بَيْنَا هُمْ فِي صَلاَةِ الْفَجْرِ مِنْ يَوْمِ الاِثْنَيْنِ وَأَبُو بَكْرٍ يُصَلِّي لَهُمْ لَمْ يَفْجَأْهُمْ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ، فَنَظَرَ إِلَيْهِمْ وَهُمْ فِي صُفُوفِ الصَّلاَةِ‏.‏ ثُمَّ تَبَسَّمَ يَضْحَكُ، فَنَكَصَ أَبُو بَكْرٍ عَلَى عَقِبَيْهِ لِيَصِلَ الصَّفَّ، وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُرِيدُ أَنْ يَخْرُجَ إِلَى الصَّلاَةِ فَقَالَ أَنَسٌ وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ فَرَحًا بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِمْ بِيَدِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَتِمُّوا صَلاَتَكُمْ، ثُمَّ دَخَلَ الْحُجْرَةَ وَأَرْخَى السِّتْرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4448In-book reference : Book 64, Hadith 468USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 729   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4449,
    "id": 4449,
    "url": "https://sunnah.com/bukhari:4449",
    "bookNumber": 64,
    "hadithNumber": 469,
    "narrator": "Narrated Aisha:",
    "english": "It was one of the favors of Allah towards me that Allah's Messenger (ﷺ) expired in my house on the day of \nmy turn while he was leaning against my chest and Allah made my saliva mix with his saliva at his \ndeath. `Abdur-Rahman entered upon me with a Siwak in his hand and I was supporting (the back of) \nAllah's Messenger (ﷺ) (against my chest ). I saw the Prophet (ﷺ) looking at it (i.e. Siwak) and I knew that he \nloved the Siwak, so I said ( to him ), \"Shall I take it for you ? \" He nodded in agreement. So I took it \nand it was too stiff for him to use, so I said, \"Shall I soften it for you ?\" He nodded his approval. So I \nsoftened it and he cleaned his teeth with it. In front of him there was a jug or a tin, (The sub-narrator, \n`Umar is in doubt as to which was right) containing water. He started dipping his hand in the water \nand rubbing his face with it, he said, \"None has the right to be worshipped except Allah. Death has its \nagonies.\" He then lifted his hands (towards the sky) and started saying, \"With the highest companion,\" \ntill he expired and his hand dropped down.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ أَبَا عَمْرٍو، ذَكْوَانَ مَوْلَى عَائِشَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ كَانَتْ تَقُولُ إِنَّ مِنْ نِعَمِ اللَّهِ عَلَىَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ فِي بَيْتِي وَفِي يَوْمِي، وَبَيْنَ سَحْرِي وَنَحْرِي، وَأَنَّ اللَّهَ جَمَعَ بَيْنَ رِيقِي وَرِيقِهِ عِنْدَ مَوْتِهِ، دَخَلَ عَلَىَّ عَبْدُ الرَّحْمَنِ وَبِيَدِهِ السِّوَاكُ وَأَنَا مُسْنِدَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُهُ يَنْظُرُ إِلَيْهِ، وَعَرَفْتُ أَنَّهُ يُحِبُّ السِّوَاكَ فَقُلْتُ آخُذُهُ لَكَ فَأَشَارَ بِرَأْسِهِ أَنْ نَعَمْ، فَتَنَاوَلْتُهُ فَاشْتَدَّ عَلَيْهِ وَقُلْتُ أُلَيِّنُهُ لَكَ فَأَشَارَ بِرَأْسِهِ أَنْ نَعَمْ، فَلَيَّنْتُهُ، وَبَيْنَ يَدَيْهِ رَكْوَةٌ ـ أَوْ عُلْبَةٌ يَشُكُّ عُمَرُ ـ فِيهَا مَاءٌ، فَجَعَلَ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ فَيَمْسَحُ بِهِمَا وَجْهَهُ يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، إِنَّ لِلْمَوْتِ سَكَرَاتٍ ‏\"‏‏.‏ ثُمَّ نَصَبَ يَدَهُ فَجَعَلَ يَقُولُ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ حَتَّى قُبِضَ وَمَالَتْ يَدُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4449In-book reference : Book 64, Hadith 469USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 730   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4450,
    "id": 4450,
    "url": "https://sunnah.com/bukhari:4450",
    "bookNumber": 64,
    "hadithNumber": 470,
    "narrator": "Narrated `Urwa:",
    "english": "`Aisha said, \"Allah's Messenger (ﷺ) in his fatal illness, used to ask, 'Where will I be tomorrow? Where will I \nbe tomorrow?\", seeking `Aisha's turn. His wives allowed him to stay wherever he wished. So he \nstayed at `Aisha's house till he expired while he was with her.\" `Aisha added, \"The Prophet (ﷺ) expired on \nthe day of my turn in my house and he was taken unto Allah while his head was against my chest and \nhis saliva mixed with my saliva.\" `Aisha added, \"Abdur-Rahman bin Abu Bakr came in, carrying a \nSiwak he was cleaning his teeth with. Allah's Messenger (ﷺ) looked at it and I said to him, 'O \n`AbdurRahman! Give me this Siwak.' So he gave it to me and I cut it, chewed it (it's end) and gave it \nto Allah's Messenger (ﷺ) who cleaned his teeth with it while he was resting against my chest.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْأَلُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ يَقُولَ ‏\n\"‏ أَيْنَ أَنَا غَدًا أَيْنَ أَنَا غَدًا ‏\"‏ يُرِيدُ يَوْمَ عَائِشَةَ، فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ، فَكَانَ فِي بَيْتِ عَائِشَةَ حَتَّى مَاتَ عِنْدَهَا، قَالَتْ عَائِشَةُ فَمَاتَ فِي الْيَوْمِ الَّذِي كَانَ يَدُورُ عَلَىَّ فِيهِ فِي بَيْتِي، فَقَبَضَهُ اللَّهُ وَإِنَّ رَأْسَهُ لَبَيْنَ نَحْرِي وَسَحْرِي، وَخَالَطَ رِيقُهُ رِيقِي ـ ثُمَّ قَالَتْ ـ دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ وَمَعَهُ سِوَاكٌ يَسْتَنُّ بِهِ فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ أَعْطِنِي هَذَا السِّوَاكَ يَا عَبْدَ الرَّحْمَنِ‏.‏ فَأَعْطَانِيهِ فَقَضِمْتُهُ، ثُمَّ مَضَغْتُهُ فَأَعْطَيْتُهُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَنَّ بِهِ وَهْوَ مُسْتَنِدٌ إِلَى صَدْرِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4450In-book reference : Book 64, Hadith 470USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 731   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4451,
    "id": 4451,
    "url": "https://sunnah.com/bukhari:4451",
    "bookNumber": 64,
    "hadithNumber": 471,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) expired in my house and on the day of my turn, leaning against my chest. One of us (i.e. \nthe Prophet's wives ) used to recite a prayer asking Allah to protect him from all evils when he became \nsick. So I started asking Allah to protect him from all evils (by reciting a prayer ). He raised his head \ntowards the sky and said, \"With the highest companions, with the highest companions.\" `Abdur- \nRahman bin Abu Bakr passed carrying a fresh leaf-stalk of a date-palm and the Prophet (ﷺ) looked at it \nand I thought that the Prophet (ﷺ) was in need of it (for cleaning his teeth ). So I took it (from `Abdur \nRahman) and chewed its head and shook it and gave it to the Prophet (ﷺ) who cleaned his teeth with it, in \nthe best way he had ever cleaned his teeth, and then he gave it to me, and suddenly his hand dropped \ndown or it fell from his hand (i.e. he expired). So Allah made my saliva mix with his saliva on his last \nday on earth and his first day in the Hereafter.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِي وَفِي يَوْمِي، وَبَيْنَ سَحْرِي وَنَحْرِي، وَكَانَتْ إِحْدَانَا تُعَوِّذُهُ بِدُعَاءٍ إِذَا مَرِضَ، فَذَهَبْتُ أُعَوِّذُهُ، فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَقَالَ ‏\n\"‏ فِي الرَّفِيقِ الأَعْلَى فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ وَمَرَّ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ وَفِي يَدِهِ جَرِيدَةٌ رَطْبَةٌ، فَنَظَرَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَظَنَنْتُ أَنَّ لَهُ بِهَا حَاجَةً فَأَخَذْتُهَا، فَمَضَغْتُ رَأْسَهَا وَنَفَضْتُهَا فَدَفَعْتُهَا إِلَيْهِ، فَاسْتَنَّ بِهَا كَأَحْسَنِ مَا كَانَ مُسْتَنًّا ثُمَّ نَاوَلَنِيهَا فَسَقَطَتْ يَدُهُ ـ أَوْ سَقَطَتْ مِنْ يَدِهِ ـ فَجَمَعَ اللَّهُ بَيْنَ رِيقِي وَرِيقِهِ فِي آخِرِ يَوْمٍ مِنَ الدُّنْيَا وَأَوَّلِ يَوْمٍ مِنَ الآخِرَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4451In-book reference : Book 64, Hadith 471USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 732   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4452,
    "id": 4452,
    "url": "https://sunnah.com/bukhari:4452",
    "bookNumber": 64,
    "hadithNumber": 472,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Bakr came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but \ndid not speak to the people till he entered upon `Aisha and went straight to Allah's Messenger (ﷺ) who was \ncovered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and \nbowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By \nAllah, Allah will never cause you to die twice. As for the death which was written for you, has come \nupon you.\" \nNarrated Ibn `Abbas: Abu Bakr went out while `Umar bin Al-Khattab was talking to the people. Abu \nBakr said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr and \nleft `Umar. Abu Bakr said, \"To proceed, if anyone amongst you used to worship Muhammad , then \nMuhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never \ndie. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed \naway before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) \nBy Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr \nrecited it and all the people received it from him, and I heard everybody reciting it (then). \nNarrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu \nBakr reciting it, my legs could not support me and I fell down at the very moment of hearing him \nreciting it, declaring that the Prophet (ﷺ) had died.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ أَقْبَلَ عَلَى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ فَلَمْ يُكَلِّمِ النَّاسَ حَتَّى دَخَلَ عَلَى عَائِشَةَ، فَتَيَمَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ مُغَشًّى بِثَوْبِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ وَبَكَى‏.‏   ثُمَّ قَالَ بِأَبِي أَنْتَ وَأُمِّي، وَاللَّهِ لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ الزُّهْرِيُّ وَحَدَّثَنِي أَبُو سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ أَبَا بَكْرٍ، خَرَجَ وَعُمَرُ يُكَلِّمُ النَّاسَ فَقَالَ اجْلِسْ يَا عُمَرُ، فَأَبَى عُمَرُ أَنْ يَجْلِسَ‏.‏ فَأَقْبَلَ النَّاسُ إِلَيْهِ وَتَرَكُوا عُمَرَ، فَقَالَ أَبُو بَكْرٍ أَمَّا بَعْدُ مَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ مِنْكُمْ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى قَوْلِهِ ‏{‏الشَّاكِرِينَ‏}‏ وَقَالَ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا أَنَّ اللَّهَ أَنْزَلَ هَذِهِ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ، فَتَلَقَّاهَا مِنْهُ النَّاسُ كُلُّهُمْ فَمَا أَسْمَعُ بَشَرًا مِنَ النَّاسِ إِلاَّ يَتْلُوهَا‏.‏ فَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ عُمَرَ قَالَ وَاللَّهِ مَا هُوَ إِلاَّ أَنْ سَمِعْتُ أَبَا بَكْرٍ تَلاَهَا فَعَقِرْتُ حَتَّى مَا تُقِلُّنِي رِجْلاَىَ، وَحَتَّى أَهْوَيْتُ إِلَى الأَرْضِ حِينَ سَمِعْتُهُ تَلاَهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ مَاتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4452, 4453, 4454In-book reference : Book 64, Hadith 472USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 733   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4453,
    "id": 4453,
    "url": "https://sunnah.com/bukhari:4453",
    "bookNumber": 64,
    "hadithNumber": 472,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Bakr came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but \ndid not speak to the people till he entered upon `Aisha and went straight to Allah's Messenger (ﷺ) who was \ncovered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and \nbowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By \nAllah, Allah will never cause you to die twice. As for the death which was written for you, has come \nupon you.\" \nNarrated Ibn `Abbas: Abu Bakr went out while `Umar bin Al-Khattab was talking to the people. Abu \nBakr said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr and \nleft `Umar. Abu Bakr said, \"To proceed, if anyone amongst you used to worship Muhammad , then \nMuhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never \ndie. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed \naway before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) \nBy Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr \nrecited it and all the people received it from him, and I heard everybody reciting it (then). \nNarrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu \nBakr reciting it, my legs could not support me and I fell down at the very moment of hearing him \nreciting it, declaring that the Prophet (ﷺ) had died.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ أَقْبَلَ عَلَى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ فَلَمْ يُكَلِّمِ النَّاسَ حَتَّى دَخَلَ عَلَى عَائِشَةَ، فَتَيَمَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ مُغَشًّى بِثَوْبِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ وَبَكَى‏.‏   ثُمَّ قَالَ بِأَبِي أَنْتَ وَأُمِّي، وَاللَّهِ لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ الزُّهْرِيُّ وَحَدَّثَنِي أَبُو سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ أَبَا بَكْرٍ، خَرَجَ وَعُمَرُ يُكَلِّمُ النَّاسَ فَقَالَ اجْلِسْ يَا عُمَرُ، فَأَبَى عُمَرُ أَنْ يَجْلِسَ‏.‏ فَأَقْبَلَ النَّاسُ إِلَيْهِ وَتَرَكُوا عُمَرَ، فَقَالَ أَبُو بَكْرٍ أَمَّا بَعْدُ مَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ مِنْكُمْ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى قَوْلِهِ ‏{‏الشَّاكِرِينَ‏}‏ وَقَالَ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا أَنَّ اللَّهَ أَنْزَلَ هَذِهِ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ، فَتَلَقَّاهَا مِنْهُ النَّاسُ كُلُّهُمْ فَمَا أَسْمَعُ بَشَرًا مِنَ النَّاسِ إِلاَّ يَتْلُوهَا‏.‏ فَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ عُمَرَ قَالَ وَاللَّهِ مَا هُوَ إِلاَّ أَنْ سَمِعْتُ أَبَا بَكْرٍ تَلاَهَا فَعَقِرْتُ حَتَّى مَا تُقِلُّنِي رِجْلاَىَ، وَحَتَّى أَهْوَيْتُ إِلَى الأَرْضِ حِينَ سَمِعْتُهُ تَلاَهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ مَاتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4452, 4453, 4454In-book reference : Book 64, Hadith 472USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 733   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4454,
    "id": 4454,
    "url": "https://sunnah.com/bukhari:4454",
    "bookNumber": 64,
    "hadithNumber": 472,
    "narrator": "Narrated `Aisha:",
    "english": "Abu Bakr came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but \ndid not speak to the people till he entered upon `Aisha and went straight to Allah's Messenger (ﷺ) who was \ncovered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and \nbowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By \nAllah, Allah will never cause you to die twice. As for the death which was written for you, has come \nupon you.\" \nNarrated Ibn `Abbas: Abu Bakr went out while `Umar bin Al-Khattab was talking to the people. Abu \nBakr said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr and \nleft `Umar. Abu Bakr said, \"To proceed, if anyone amongst you used to worship Muhammad , then \nMuhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never \ndie. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed \naway before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) \nBy Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr \nrecited it and all the people received it from him, and I heard everybody reciting it (then). \nNarrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu \nBakr reciting it, my legs could not support me and I fell down at the very moment of hearing him \nreciting it, declaring that the Prophet (ﷺ) had died.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ أَقْبَلَ عَلَى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ فَلَمْ يُكَلِّمِ النَّاسَ حَتَّى دَخَلَ عَلَى عَائِشَةَ، فَتَيَمَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ مُغَشًّى بِثَوْبِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ وَبَكَى‏.‏   ثُمَّ قَالَ بِأَبِي أَنْتَ وَأُمِّي، وَاللَّهِ لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ الزُّهْرِيُّ وَحَدَّثَنِي أَبُو سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ أَبَا بَكْرٍ، خَرَجَ وَعُمَرُ يُكَلِّمُ النَّاسَ فَقَالَ اجْلِسْ يَا عُمَرُ، فَأَبَى عُمَرُ أَنْ يَجْلِسَ‏.‏ فَأَقْبَلَ النَّاسُ إِلَيْهِ وَتَرَكُوا عُمَرَ، فَقَالَ أَبُو بَكْرٍ أَمَّا بَعْدُ مَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ مِنْكُمْ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى قَوْلِهِ ‏{‏الشَّاكِرِينَ‏}‏ وَقَالَ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا أَنَّ اللَّهَ أَنْزَلَ هَذِهِ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ، فَتَلَقَّاهَا مِنْهُ النَّاسُ كُلُّهُمْ فَمَا أَسْمَعُ بَشَرًا مِنَ النَّاسِ إِلاَّ يَتْلُوهَا‏.‏ فَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ عُمَرَ قَالَ وَاللَّهِ مَا هُوَ إِلاَّ أَنْ سَمِعْتُ أَبَا بَكْرٍ تَلاَهَا فَعَقِرْتُ حَتَّى مَا تُقِلُّنِي رِجْلاَىَ، وَحَتَّى أَهْوَيْتُ إِلَى الأَرْضِ حِينَ سَمِعْتُهُ تَلاَهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ مَاتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4452, 4453, 4454In-book reference : Book 64, Hadith 472USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 733   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4455,
    "id": 4455,
    "url": "https://sunnah.com/bukhari:4455",
    "bookNumber": 64,
    "hadithNumber": 473,
    "narrator": "Narrated Aisha and Ibn `Abbas:",
    "english": "Abu Bakr kissed the Prophet (ﷺ) after his death.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ أَنَّ أَبَا بَكْر ٍ ـ رضى الله عنه ـ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم بَعْدَ مَوْتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4455, 4456, 4457In-book reference : Book 64, Hadith 473USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 734   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4456,
    "id": 4456,
    "url": "https://sunnah.com/bukhari:4456",
    "bookNumber": 64,
    "hadithNumber": 473,
    "narrator": "Narrated Aisha and Ibn `Abbas:",
    "english": "Abu Bakr kissed the Prophet (ﷺ) after his death.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ أَنَّ أَبَا بَكْر ٍ ـ رضى الله عنه ـ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم بَعْدَ مَوْتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4455, 4456, 4457In-book reference : Book 64, Hadith 473USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 734   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4457,
    "id": 4457,
    "url": "https://sunnah.com/bukhari:4457",
    "bookNumber": 64,
    "hadithNumber": 473,
    "narrator": "Narrated Aisha and Ibn `Abbas:",
    "english": "Abu Bakr kissed the Prophet (ﷺ) after his death.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ أَنَّ أَبَا بَكْر ٍ ـ رضى الله عنه ـ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم بَعْدَ مَوْتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4455, 4456, 4457In-book reference : Book 64, Hadith 473USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 734   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4458,
    "id": 4458,
    "url": "https://sunnah.com/bukhari:4458",
    "bookNumber": 64,
    "hadithNumber": 474,
    "narrator": "Narrated `Aisha:",
    "english": "We poured medicine in one side of the Prophet's mouth during his illness and he started pointing to us, \nmeaning to say, \"Don't pour medicine in my mouth.\" We said, \"(He says so) because a patient dislikes \nmedicines.\" When he improved and felt a little better, he said, \"Didn't I forbid you to pour medicine in \nmy mouth ?\" We said, \" ( We thought it was because of) the dislike, patients have for medicines. He \nsaid, \"Let everyone present in the house be given medicine by pouring it in his mouth while I am \nlooking at him, except `Abbas as he has not witnessed you (doing the same to me).",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا يَحْيَى، وَزَادَ، قَالَتْ عَائِشَةُ لَدَدْنَاهُ فِي مَرَضِهِ فَجَعَلَ يُشِيرُ إِلَيْنَا أَنْ لاَ تَلُدُّونِي فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَلَمَّا أَفَاقَ قَالَ ‏\"‏ أَلَمْ أَنْهَكُمْ أَنْ تَلُدُّونِي ‏\"‏‏.‏ قُلْنَا كَرَاهِيَةَ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَقَالَ ‏\"‏ لاَ يَبْقَى أَحَدٌ فِي الْبَيْتِ إِلاَّ لُدَّ ـ وَأَنَا أَنْظُرُ ـ إِلاَّ الْعَبَّاسَ، فَإِنَّهُ لَمْ يَشْهَدْكُمْ ‏\"‏‏.‏ رَوَاهُ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4458In-book reference : Book 64, Hadith 474USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 735   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4459,
    "id": 4459,
    "url": "https://sunnah.com/bukhari:4459",
    "bookNumber": 64,
    "hadithNumber": 475,
    "narrator": "Narrated Al-Aswad:",
    "english": "It was mentioned in the presence of `Aisha that the Prophet (ﷺ) had appointed `Ali as successor by will. \nThereupon she said, \"Who said so? I saw the Prophet, while I was supporting him against my chest. \nHe asked for a tray, and then fell on one side and expired, and I did not feel it. So how (do the people \nsay) he appointed `Ali as his successor?\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا أَزْهَرُ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَوْصَى إِلَى عَلِيٍّ، فَقَالَتْ مَنْ قَالَهُ لَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَإِنِّي لَمُسْنِدَتُهُ إِلَى صَدْرِي، فَدَعَا بِالطَّسْتِ فَانْخَنَثَ فَمَاتَ، فَمَا شَعَرْتُ، فَكَيْفَ أَوْصَى إِلَى عَلِيٍّ",
    "reference": "Reference : Sahih al-Bukhari 4459In-book reference : Book 64, Hadith 475USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 736   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4460,
    "id": 4460,
    "url": "https://sunnah.com/bukhari:4460",
    "bookNumber": 64,
    "hadithNumber": 476,
    "narrator": "Narrated Talha:",
    "english": "I asked `Abdullah bin Abu `Aufa \"Did the Prophet (ﷺ) make a will? ' He replied, \"No.\" I further asked, \n\"How comes it that the making of a will was enjoined on the people or that they were ordered to make \nit? \" He said, \"The Prophet (ﷺ) made a will concerning Allah's Book.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ طَلْحَةَ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ أَوْصَى النَّبِيُّ صلى الله عليه وسلم فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ أَوْ أُمِرُوا بِهَا قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4460In-book reference : Book 64, Hadith 476USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 737   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4461,
    "id": 4461,
    "url": "https://sunnah.com/bukhari:4461",
    "bookNumber": 64,
    "hadithNumber": 477,
    "narrator": "Narrated 'Amir bin Al-Harith:",
    "english": "Allah's Messenger (ﷺ) did not leave a Dinar or a Dirham or a male or a female slave. He left only his white \nmule on which he used to ride, and his weapons, and a piece of land which he gave in charity for the \nneedy travelers.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِينَارًا وَلاَ دِرْهَمًا وَلاَ عَبْدًا وَلاَ أَمَةً، إِلاَّ بَغْلَتَهُ الْبَيْضَاءَ الَّتِي كَانَ يَرْكَبُهَا، وَسِلاَحَهُ، وَأَرْضًا جَعَلَهَا لاِبْنِ السَّبِيلِ صَدَقَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4461In-book reference : Book 64, Hadith 477USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 738   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4462,
    "id": 4462,
    "url": "https://sunnah.com/bukhari:4462",
    "bookNumber": 64,
    "hadithNumber": 478,
    "narrator": "Narrated Anas:",
    "english": "When the ailment of the Prophet (ﷺ) got aggravated, he became unconscious whereupon Fatima said, \"Oh, \nhow distressed my father is!\" He said, \"Your father will have no more distress after today.\" When he \nexpired, she said, \"O Father! Who has responded to the call of the Lord Who has invited him! O \nFather, whose dwelling place is the Garden of Paradise (i.e. Al-Firdaus)! O Father! We convey this \nnews (of your death) to Gabriel.\" When he was buried, Fatima said, \"O Anas! Do you feel pleased to \nthrow earth over Allah's Messenger (ﷺ)?\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَمَّا ثَقُلَ النَّبِيُّ صلى الله عليه وسلم جَعَلَ يَتَغَشَّاهُ، فَقَالَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ وَاكَرْبَ أَبَاهُ‏.‏ فَقَالَ لَهَا ‏\n\"‏ لَيْسَ عَلَى أَبِيكِ كَرْبٌ بَعْدَ الْيَوْمِ ‏\"‏‏.‏ فَلَمَّا مَاتَ قَالَتْ يَا أَبَتَاهْ، أَجَابَ رَبًّا دَعَاهُ، يَا أَبَتَاهْ مَنْ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهُ، يَا أَبَتَاهْ إِلَى جِبْرِيلَ نَنْعَاهْ‏.‏ فَلَمَّا دُفِنَ قَالَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ يَا أَنَسُ، أَطَابَتْ أَنْفُسُكُمْ أَنْ تَحْثُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم التُّرَابَ",
    "reference": "Reference : Sahih al-Bukhari 4462In-book reference : Book 64, Hadith 478USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 739   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4463,
    "id": 4463,
    "url": "https://sunnah.com/bukhari:4463",
    "bookNumber": 64,
    "hadithNumber": 479,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) was healthy, he used to say, \"No soul of a prophet is captured till he is shown his \nplace in Paradise and then he is given the option.\" When death approached him while his head was on \nmy thigh, he became unconscious and then recovered his consciousness. He then looked at the ceiling \nof the house and said, \"O Allah! (with) the highest companions.\" I said (to myself), \"Hence, he is not \ngoing to choose us.\" Then I realized that what he had said was the application of the narration which \nhe used to mention to us when he was healthy. The last word he spoke was, \"O Allah! (with) the \nhighest companion.\"",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ يُونُسُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ وَهْوَ صَحِيحٌ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ، ثُمَّ يُخَيَّرَ ‏\"‏‏.‏ فَلَمَّا نَزَلَ بِهِ وَرَأْسُهُ عَلَى فَخِذِي غُشِيَ عَلَيْهِ، ثُمَّ أَفَاقَ، فَأَشْخَصَ بَصَرَهُ إِلَى سَقْفِ الْبَيْتِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏ فَقُلْتُ إِذًا لاَ يَخْتَارُنَا‏.‏ وَعَرَفْتُ أَنَّهُ الْحَدِيثُ الَّذِي كَانَ يُحَدِّثُنَا وَهْوَ صَحِيحٌ قَالَتْ فَكَانَتْ آخِرَ كَلِمَةٍ تَكَلَّمَ بِهَا ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4463In-book reference : Book 64, Hadith 479USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 740   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4464,
    "id": 4464,
    "url": "https://sunnah.com/bukhari:4464",
    "bookNumber": 64,
    "hadithNumber": 480,
    "narrator": "Narrated Aisha and Ibn `Abbas:",
    "english": "The Prophet (ﷺ) stayed for ten years in Mecca with the Qur'an being revealed to him and he stayed in \nMedina for ten years.'",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ رضى الله عنهم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَبِثَ بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ الْقُرْآنُ، وَبِالْمَدِينَةِ عَشْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4464, 4465In-book reference : Book 64, Hadith 480USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 741   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4465,
    "id": 4465,
    "url": "https://sunnah.com/bukhari:4465",
    "bookNumber": 64,
    "hadithNumber": 480,
    "narrator": "Narrated Aisha and Ibn `Abbas:",
    "english": "The Prophet (ﷺ) stayed for ten years in Mecca with the Qur'an being revealed to him and he stayed in \nMedina for ten years.'",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ رضى الله عنهم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَبِثَ بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ الْقُرْآنُ، وَبِالْمَدِينَةِ عَشْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4464, 4465In-book reference : Book 64, Hadith 480USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 741   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4466,
    "id": 4466,
    "url": "https://sunnah.com/bukhari:4466",
    "bookNumber": 64,
    "hadithNumber": 481,
    "narrator": "Narrated `Aisha:",
    "english": "Allah 's Apostle died when he was sixty-three years of age.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ وَهْوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4466In-book reference : Book 64, Hadith 481USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 742   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4467,
    "id": 4467,
    "url": "https://sunnah.com/bukhari:4467",
    "bookNumber": 64,
    "hadithNumber": 482,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) died while his armor was mortgaged to a Jew for thirty Sa's of barley.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلاَثِينَ‏.‏ ‏{‏يَعْنِي صَاعًا مِنْ شَعِيرٍ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4467In-book reference : Book 64, Hadith 482USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 743   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4468,
    "id": 4468,
    "url": "https://sunnah.com/bukhari:4468",
    "bookNumber": 64,
    "hadithNumber": 483,
    "narrator": "Narrated Salim's father:",
    "english": "The Prophet (ﷺ) appointed Usama as the commander of the troops (to be sent to Syria). The Muslims \nspoke about Usama (unfavorably ). The Prophet (ﷺ) said, \" I have been informed that you spoke about \nUsama. (Let it be known that ) he is the most beloved of all people to me.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ الْفُضَيْلِ بْنِ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، اسْتَعْمَلَ النَّبِيُّ صلى الله عليه وسلم أُسَامَةَ ـ فَقَالُوا فِيهِ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ قَدْ بَلَغَنِي أَنَّكُمْ قُلْتُمْ فِي أُسَامَةَ، وَإِنَّهُ أَحَبُّ النَّاسِ إِلَىَّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4468In-book reference : Book 64, Hadith 483USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 744   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4469,
    "id": 4469,
    "url": "https://sunnah.com/bukhari:4469",
    "bookNumber": 64,
    "hadithNumber": 484,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) sent troops appointed Usama bin Zaid as their commander. The people criticized his \nleadership. Allah's Messenger (ﷺ) got up and said, \"If you (people) are criticizing his (i.e. Usama's) \nleadership you used to criticize the leadership of his father before. By Allah, he (i.e. Zaid) deserved \nthe leadership indeed, and he used to be one of the most beloved persons to me, and now this (i.e. his \nson, Usama) is one of the most beloved persons to me after him.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ النَّاسُ فِي إِمَارَتِهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنْ تَطْعُنُوا فِي إِمَارَتِهِ فَقَدْ كُنْتُمْ تَطْعُنُونَ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلإِمَارَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4469In-book reference : Book 64, Hadith 484USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 745   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4470,
    "id": 4470,
    "url": "https://sunnah.com/bukhari:4470",
    "bookNumber": 64,
    "hadithNumber": 485,
    "narrator": "Narrated Ibn Abu Habib:",
    "english": "Abu Al-Khair said, \"As-Sanabih, I asked (me), 'When did you migrate?' I (i.e. Abu Al-Khair) said, \n'We went out from Yemen as emigrants and arrived at Al-Juhfa, and there came a rider whom I asked \nabout the news. The rider said: We buried the Prophet (ﷺ) five days ago.\" I asked (As-Sanabihi), 'Did you \nhear anything about the night of Qadr?' He replied, 'Bilal, the Mu'adh-dhin of the Prophet (ﷺ) informed \nme that it is on one of the seven nights of the last ten days (of Ramadan).",
    "arabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنِ ابْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنِ الصُّنَابِحِيِّ، أَنَّهُ قَالَ لَهُ مَتَى هَاجَرْتَ قَالَ خَرَجْنَا مِنَ الْيَمَنِ مُهَاجِرِينَ، فَقَدِمْنَا الْجُحْفَةَ، فَأَقْبَلَ رَاكِبٌ فَقُلْتُ لَهُ الْخَبَرَ فَقَالَ دَفَنَّا النَّبِيَّ صلى الله عليه وسلم مُنْذُ خَمْسٍ‏.‏ قُلْتُ هَلْ سَمِعْتَ فِي لَيْلَةِ الْقَدْرِ شَيْئًا قَالَ نَعَمْ أَخْبَرَنِي بِلاَلٌ مُؤَذِّنُ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ فِي السَّبْعِ فِي الْعَشْرِ الأَوَاخِرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4470In-book reference : Book 64, Hadith 485USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 746   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4471,
    "id": 4471,
    "url": "https://sunnah.com/bukhari:4471",
    "bookNumber": 64,
    "hadithNumber": 486,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "I asked Zaid bin Al-Arqam, \"In how many Ghazawat did you take part in the company of Allah's \nApostle?\" He replied, \"Seventeen.\" I further asked, \"How many Ghazawat did the Prophet (ﷺ) fight?\" He \nreplied, \"Nineteen.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ زَيْدَ بْنَ أَرْقَمَ ـ رضى الله عنه ـ كَمْ غَزَوْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَبْعَ عَشْرَةَ‏.‏ قُلْتُ كَمْ غَزَا النَّبِيُّ صلى الله عليه وسلم قَالَ تِسْعَ عَشْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4471In-book reference : Book 64, Hadith 486USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 747   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4472,
    "id": 4472,
    "url": "https://sunnah.com/bukhari:4472",
    "bookNumber": 64,
    "hadithNumber": 487,
    "narrator": "Narrated Al-Bara:",
    "english": "I fought fifteen Ghazawat in the company of the Prophet.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، حَدَّثَنَا الْبَرَاءُ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم خَمْسَ عَشْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4472In-book reference : Book 64, Hadith 487USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 748   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4473,
    "id": 4473,
    "url": "https://sunnah.com/bukhari:4473",
    "bookNumber": 64,
    "hadithNumber": 488,
    "narrator": "Narrated Buraida:",
    "english": "That he fought sixteen Ghazawat with Allah''s Apostle.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ الْحَسَنِ، حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلِ بْنِ هِلاَلٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ كَهْمَسٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ عَشْرَةَ غَزْوَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4473In-book reference : Book 64, Hadith 488USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 749   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4474,
    "id": 4474,
    "url": "https://sunnah.com/bukhari:4474",
    "bookNumber": 65,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Sa`id bin Al-Mu'alla:",
    "english": "While I was praying in the Mosque, Allah's Messenger (ﷺ) called me but I did not respond to him. Later I \nsaid, \"O Allah's Messenger (ﷺ)! I was praying.\" He said, \"Didn't Allah say'--\"Give your response to Allah \n(by obeying Him) and to His Apostle when he calls you.\" (8.24) \nHe then said to me, \"I will teach you a Sura which is the greatest Sura in the Qur'an, before you leave \nthe Mosque.\" Then he got hold of my hand, and when he intended to leave (the Mosque), I said to \nhim, \"Didn't you say to me, 'I will teach you a Sura which is the greatest Sura in the Qur'an?' He said, \n\"Al-Hamdu-Li l-lah Rabbi-l-`alamin (i.e. Praise be to Allah, the Lord of the worlds) which is Al-Sab'a \nAl-Mathani (i.e. seven repeatedly recited Verses) and the Grand Qur'an which has been given to me.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى، قَالَ كُنْتُ أُصَلِّي فِي الْمَسْجِدِ فَدَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ أُجِبْهُ، فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أُصَلِّي‏.‏ فَقَالَ ‏\"‏ أَلَمْ يَقُلِ اللَّهُ ‏{‏اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ‏}‏ ثُمَّ قَالَ لِي لأُعَلِّمَنَّكَ سُورَةً هِيَ أَعْظَمُ السُّوَرِ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ ‏\"‏‏.‏ ثُمَّ أَخَذَ بِيَدِي، فَلَمَّا أَرَادَ أَنْ يَخْرُجَ قُلْتُ لَهُ أَلَمْ تَقُلْ ‏\"‏ لأُعَلِّمَنَّكَ سُورَةً هِيَ أَعْظَمُ سُورَةٍ فِي الْقُرْآنِ ‏\"‏‏.‏ قَالَ ‏\"‏ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4474In-book reference : Book 65, Hadith 1USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 1   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4475,
    "id": 4475,
    "url": "https://sunnah.com/bukhari:4475",
    "bookNumber": 65,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When the Imam says: 'Ghair-il-Maghdubi `alaihim Walad-Dallin (i.e. not the \npath of those who earn Your Anger, nor the path of those who went astray (1.7)), then you must say, \n'Ameen', for if one's utterance of 'Ameen' coincides with that of the angels, then his past sins will be \nforgiven.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَالَ الإِمَامُ ‏{‏غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ‏}‏ فَقُولُوا آمِينَ‏.‏ فَمَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4475In-book reference : Book 65, Hadith 2USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 2   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4476,
    "id": 4476,
    "url": "https://sunnah.com/bukhari:4476",
    "bookNumber": 65,
    "hadithNumber": 3,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"On the Day of Resurrection the Believers will assemble and say, 'Let us ask \nsomebody to intercede for us with our Lord.' So they will go to Adam and say, 'You are the father of \nall the people, and Allah created you with His Own Hands, and ordered the angels to prostrate to you, \nand taught you the names of all things; so please intercede for us with your Lord, so that He may \nrelieve us from this place of ours.' Adam will say, 'I am not fit for this (i.e. intercession for you).' Then \nAdam will remember his sin and feel ashamed thereof. He will say, 'Go to Noah, for he was the first \nApostle, Allah sent to the inhabitants of the earth.' They will go to him and Noah will say, \n'I am not fit for this undertaking.' He will remember his appeal to his Lord to do what he had no \nknowledge of, then he will feel ashamed thereof and will say, 'Go to the Khalil--r-Rahman (i.e. \nAbraham).' They will go to him and he will say, 'I am not fit for this undertaking. Go to Moses, the \nslave to whom Allah spoke (directly) and gave him the Torah .' So they will go to him and he will say, \n'I am not fit for this undertaking.' and he will mention (his) killing a person who was not a killer, and \nso he will feel ashamed thereof before his Lord, and he will say, 'Go to Jesus, Allah's Slave, His \nApostle and Allah's Word and a Spirit coming from Him. Jesus will say, 'I am not fit for this \nundertaking, go to Muhammad the Slave of Allah whose past and future sins were forgiven by Allah.' \nSo they will come to me and I will proceed till I will ask my Lord's Permission and I will be given \npermission. When I see my Lord, I will fall down in Prostration and He will let me remain in that state \nas long as He wishes and then I will be addressed.' (Muhammad!) Raise your head. Ask, and your \nrequest will be granted; say, and your saying will be listened to; intercede, and your intercession will \nbe accepted.' I will raise my head and praise Allah with a saying (i.e. invocation) He will teach me, \nand then I will intercede. He will fix a limit for me (to intercede for) whom I will admit into Paradise. \nThen I will come back again to Allah, and when I see my Lord, the same thing will happen to me. And \nthen I will intercede and Allah will fix a limit for me to intercede whom I will let into Paradise, then I \nwill come back for the third time; and then I will come back for the fourth time, and will say, 'None \nremains in Hell but those whom the Qur'an has imprisoned (in Hell) and who have been destined to an \neternal stay in Hell.' \" (The compiler) Abu `Abdullah said: 'But those whom the Qur'an has imprisoned \nin Hell,' refers to the Statement of Allah: \n\"They will dwell therein forever.\" (16.29)",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَجْتَمِعُ الْمُؤْمِنُونَ يَوْمَ الْقِيَامَةِ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا إِلَى رَبِّنَا فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ أَبُو النَّاسِ، خَلَقَكَ اللَّهُ بِيَدِهِ وَأَسْجَدَ لَكَ مَلاَئِكَتَهُ، وَعَلَّمَكَ أَسْمَاءَ كُلِّ شَىْءٍ، فَاشْفَعْ لَنَا عِنْدَ رَبِّكَ حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ ذَنْبَهُ فَيَسْتَحِي ـ ائْتُوا نُوحًا فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللَّهُ إِلَى أَهْلِ الأَرْضِ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ‏.‏ وَيَذْكُرُ سُؤَالَهُ رَبَّهُ مَا لَيْسَ لَهُ بِهِ عِلْمٌ فَيَسْتَحِي، فَيَقُولُ ائْتُوا خَلِيلَ الرَّحْمَنِ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، ائْتُوا مُوسَى عَبْدًا كَلَّمَهُ اللَّهُ وَأَعْطَاهُ التَّوْرَاةَ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ‏.‏ وَيَذْكُرُ قَتْلَ النَّفْسِ بِغَيْرِ نَفْسٍ فَيَسْتَحِي مِنْ رَبِّهِ فَيَقُولُ ائْتُوا عِيسَى عَبْدَ اللَّهِ وَرَسُولَهُ، وَكَلِمَةَ اللَّهِ وَرُوحَهُ‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ، ائْتُوا مُحَمَّدًا صلى الله عليه وسلم عَبْدًا غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ فَيَأْتُونِي فَأَنْطَلِقُ حَتَّى أَسْتَأْذِنَ عَلَى رَبِّي فَيُؤْذَنُ ‏{‏لِي‏}‏ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ ثُمَّ يُقَالُ ارْفَعْ رَأْسَكَ، وَسَلْ تُعْطَهْ، وَقُلْ يُسْمَعْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَرْفَعُ رَأْسِي فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ، ثُمَّ أَشْفَعُ، فَيَحُدُّ لِي حَدًّا، فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَعُودُ إِلَيْهِ، فَإِذَا رَأَيْتُ رَبِّي ـ مِثْلَهُ ـ ثُمَّ أَشْفَعُ، فَيَحُدُّ لِي حَدًّا، فَأُدْخِلُهُمُ الْجَنَّةَ ‏{‏ثُمَّ أَعُودُ الثَّالِثَةَ‏}‏ ثُمَّ أَعُودُ الرَّابِعَةَ فَأَقُولُ مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ وَوَجَبَ عَلَيْهِ الْخُلُودُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏\"‏ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ ‏\"‏‏.‏ يَعْنِي قَوْلَ اللَّهِ تَعَالَى ‏{‏خَالِدِينَ فِيهَا‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4476In-book reference : Book 65, Hadith 3USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 3   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4477,
    "id": 4477,
    "url": "https://sunnah.com/bukhari:4477",
    "bookNumber": 65,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah:",
    "english": "I asked the Prophet, \"What is the greatest sin in the Sight of Allah?\" He said, \"That you set up a rival \nunto Allah though He Alone created you.\" I said, \"That is indeed a great sin.\" Then asked, \"What is \nnext?\" He said, \"To kill your son lest he should share your food with you.\" I asked, \"What is next?\" \nHe said, \"To commit illegal sexual intercourse with the wife of your neighbor.\"",
    "arabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الذَّنْبِ أَعْظَمُ عِنْدَ اللَّهِ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهْوَ خَلَقَكَ ‏\"‏‏.‏ قُلْتُ إِنَّ ذَلِكَ لَعَظِيمٌ، قُلْتُ ثُمَّ أَىُّ قَالَ ‏\"‏ وَأَنْ تَقْتُلَ وَلَدَكَ تَخَافُ أَنْ يَطْعَمَ مَعَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىُّ قَالَ ‏\"‏ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4477In-book reference : Book 65, Hadith 4USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 4   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4478,
    "id": 4478,
    "url": "https://sunnah.com/bukhari:4478",
    "bookNumber": 65,
    "hadithNumber": 5,
    "narrator": "Narrated Sa`id bin Zaid:",
    "english": "Allah's Messenger (ﷺ) said, \"The Kam'a (i.e. a kind of edible fungus) is like the Manna (in that it is obtained \nwithout effort) and its water is a (medicine) cure for eye trouble.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ، وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4478In-book reference : Book 65, Hadith 5USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 5   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4479,
    "id": 4479,
    "url": "https://sunnah.com/bukhari:4479",
    "bookNumber": 65,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"It was said to the children of Israel, 'Enter the gate (of the town), prostrate (in \nhumility) and say: Hittatun (i.e. repentance) i.e. O Allah! \nForgive our sins.' But they entered by dragging themselves on their buttocks, so they did something \ndifferent (from what they had been ordered to do) and said, 'Hittatun,' but added, \"A grain in a hair.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ‏{‏ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ‏}‏ فَدَخَلُوا يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ، فَبَدَّلُوا وَقَالُوا حِطَّةٌ، حَبَّةٌ فِي شَعَرَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4479In-book reference : Book 65, Hadith 6USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 6   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4480,
    "id": 4480,
    "url": "https://sunnah.com/bukhari:4480",
    "bookNumber": 65,
    "hadithNumber": 7,
    "narrator": "Narrated Anas:",
    "english": "`Abdullah bin Salam heard the news of the arrival of Allah's Messenger (ﷺ) (at Medina) while he was on a \nfarm collecting its fruits. So he came to the Prophet (ﷺ) and said, \"I will ask you about three things which \nnobody knows unless he be a prophet. Firstly, what is the first portent of the Hour? What is the first \nmeal of the people of Paradise? And what makes a baby look like its father or mother?'. The Prophet (ﷺ) \nsaid, \"Just now Gabriel has informed me about that.\" `Abdullah said, \"Gabriel?\" The Prophet (ﷺ) said, \n\"Yes.\" `Abdullah said, \"He, among the angels is the enemy of the Jews.\" On that the Prophet (ﷺ) recited \nthis Holy Verse:-- \n\"Whoever is an enemy to Gabriel (let him die in his fury!) for he has brought it (i.e. Qur'an) down to \nyour heart by Allah's permission.\" (2.97) Then he added, \"As for the first portent of the Hour, it will \nbe a fire that will collect the people from the East to West. And as for the first meal of the people of \nParadise, it will be the caudite (i.e. extra) lobe of the fish liver. And if a man's discharge proceeded \nthat of the woman, then the child resembles the father, and if the woman's discharge proceeded that of \nthe man, then the child resembles the mother.\" On hearing that, `Abdullah said, \"I testify that None \nhas the right to be worshipped but Allah, and that you are the Messenger of Allah, O, Allah's Messenger (ﷺ); the \nJews are liars, and if they should come to know that I have embraced Islam, they would accuse me of \nbeing a liar.\" In the meantime some Jews came (to the Prophet) and he asked them, \"What is \n`Abdullah's status amongst you?\" They replied, \"He is the best amongst us, and he is our chief and the \nson of our chief.\" The Prophet (ﷺ) said, \"What would you think if `Abdullah bin Salam embraced Islam?\" \nThey replied, \"May Allah protect him from this!\" Then `Abdullah came out and said, \"I testify that \nNone has the right to be worshipped but Allah and that Muhammad is the Messenger of Allah.\" The Jews \nthen said, \"Abdullah is the worst of us and the son of the worst of us,\" and disparaged him. On that \n`Abdullah said, \"O Allah's Messenger (ﷺ)! This is what I was afraid of!\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ بَكْرٍ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ سَمِعَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ، بِقُدُومِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي أَرْضٍ يَخْتَرِفُ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنِّي سَائِلُكَ عَنْ ثَلاَثٍ لاَ يَعْلَمُهُنَّ إِلاَّ نَبِيٌّ فَمَا أَوَّلُ أَشْرَاطِ السَّاعَةِ وَمَا أَوَّلُ طَعَامِ أَهْلِ الْجَنَّةِ وَمَا يَنْزِعُ الْوَلَدُ إِلَى أَبِيهِ أَوْ إِلَى أُمِّهِ قَالَ ‏\"‏ أَخْبَرَنِي بِهِنَّ جِبْرِيلُ آنِفًا ‏\"‏‏.‏ قَالَ جِبْرِيلُ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ ذَاكَ عَدُوُّ الْيَهُودِ مِنَ الْمَلاَئِكَةِ‏.‏ فَقَرَأَ هَذِهِ الآيَةَ ‏{‏مَنْ كَانَ عَدُوًّا لِجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَى قَلْبِكَ‏}‏ أَمَّا أَوَّلُ أَشْرَاطِ السَّاعَةِ فَنَارٌ تَحْشُرُ النَّاسَ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ، وَأَمَّا أَوَّلُ طَعَامِ أَهْلِ الْجَنَّةِ فَزِيَادَةُ كَبِدِ حُوتٍ، وَإِذَا سَبَقَ مَاءُ الرَّجُلِ مَاءَ الْمَرْأَةِ نَزَعَ الْوَلَدَ، وَإِذَا سَبَقَ مَاءُ الْمَرْأَةِ نَزَعَتْ ‏\"‏‏.‏ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ‏.‏ يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ قَوْمٌ بُهُتٌ، وَإِنَّهُمْ إِنْ يَعْلَمُوا بِإِسْلاَمِي قَبْلَ أَنْ تَسْأَلَهُمْ يَبْهَتُونِي‏.‏ فَجَاءَتِ الْيَهُودُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَىُّ رَجُلٍ عَبْدُ اللَّهِ فِيكُمْ ‏\"‏‏.‏ قَالُوا خَيْرُنَا وَابْنُ خَيْرِنَا، وَسَيِّدُنَا وَابْنُ سَيِّدِنَا‏.‏ قَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ أَسْلَمَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ فَقَالُوا أَعَاذَهُ اللَّهُ مِنْ ذَلِكَ‏.‏ فَخَرَجَ عَبْدُ اللَّهِ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالُوا شَرُّنَا وَابْنُ شَرِّنَا‏.‏ وَانْتَقَصُوهُ‏.‏ قَالَ فَهَذَا الَّذِي كُنْتُ أَخَافُ يَا رَسُولَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4480In-book reference : Book 65, Hadith 7USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 7   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4481,
    "id": 4481,
    "url": "https://sunnah.com/bukhari:4481",
    "bookNumber": 65,
    "hadithNumber": 8,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Umar said, \"Our best Qur'an reciter is Ubai and our best judge is `Ali; and in spite of this, we leave \nsome of the statements of Ubai because Ubai says, 'I do not leave anything that I have heard from \nAllah's Messenger (ﷺ) while Allah: \n\"Whatever verse (Revelations) do We abrogate or cause to be forgotten but We bring a better one or \nsimilar to it.\" (2.106)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ أَقْرَؤُنَا أُبَىٌّ، وَأَقْضَانَا عَلِيٌّ، وَإِنَّا لَنَدَعُ مِنْ قَوْلِ أُبَىٍّ، وَذَاكَ أَنَّ أُبَيًّا يَقُولُ لاَ أَدَعُ شَيْئًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ قَالَ اللَّهُ تَعَالَى ‏{‏مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نَنْسَأْهَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4481In-book reference : Book 65, Hadith 8USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 8   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4482,
    "id": 4482,
    "url": "https://sunnah.com/bukhari:4482",
    "bookNumber": 65,
    "hadithNumber": 9,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"Allah said, 'The son of Adam tells a lie against me though he has no right to do so, \nand he abuses Me though he has no right to do so. As for his telling a lie against Me, it is that he \nclaims that I cannot recreate him as I created him before; and as for his abusing Me, it is his statement \nthat I have offspring. No! Glorified be Me! I am far from taking a wife or offspring.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذَلِكَ، وَشَتَمَنِي وَلَمْ يَكُنْ لَهُ ذَلِكَ، فَأَمَّا تَكْذِيبُهُ إِيَّاىَ فَزَعَمَ أَنِّي لاَ أَقْدِرُ أَنْ أُعِيدَهُ كَمَا كَانَ، وَأَمَّا شَتْمُهُ إِيَّاىَ فَقَوْلُهُ لِي وَلَدٌ، فَسُبْحَانِي أَنْ أَتَّخِذَ صَاحِبَةً أَوْ وَلَدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4482In-book reference : Book 65, Hadith 9USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 9   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4483,
    "id": 4483,
    "url": "https://sunnah.com/bukhari:4483",
    "bookNumber": 65,
    "hadithNumber": 10,
    "narrator": "Narrated Anas:",
    "english": "`Umar said, \"I agreed with Allah in three things,\" or said, \"My Lord agreed with me in three things. I \nsaid, 'O Allah's Messenger (ﷺ)! Would that you took the station of Abraham as a place of prayer.' I also said, \n'O Allah's Messenger (ﷺ)! Good and bad persons visit you! Would that you ordered the Mothers of the \nbelievers to cover themselves with veils.' So the Divine Verses of Al-Hijab (i.e. veiling of the women) \nwere revealed. I came to know that the Prophet (ﷺ) had blamed some of his wives so I entered upon them \nand said, 'You should either stop (troubling the Prophet (ﷺ) ) or else Allah will give His Apostle better \nwives than you.' When I came to one of his wives, she said to me, 'O `Umar! Does Allah's Messenger (ﷺ) \nhaven't what he could advise his wives with, that you try to advise them?' \" Thereupon Allah \nrevealed:-- \n\"It may be, if he divorced you (all) his Lord will give him instead of you, wives better than you \nMuslims (who submit to Allah)..\" (66.5)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَالَ عُمَرُ وَافَقْتُ اللَّهَ فِي ثَلاَثٍ ـ أَوْ وَافَقَنِي رَبِّي فِي ثَلاَثٍ ـ قُلْتُ يَا رَسُولَ اللَّهِ، لَوِ اتَّخَذْتَ مَقَامَ إِبْرَاهِيمَ مُصَلًّى وَقُلْتُ يَا رَسُولَ اللَّهِ يَدْخُلُ عَلَيْكَ الْبَرُّ وَالْفَاجِرُ، فَلَوْ أَمَرْتَ أُمَّهَاتِ الْمُؤْمِنِينَ بِالْحِجَابِ فَأَنْزَلَ اللَّهُ آيَةَ الْحِجَابِ قَالَ وَبَلَغَنِي مُعَاتَبَةُ النَّبِيِّ صلى الله عليه وسلم بَعْضَ نِسَائِهِ، فَدَخَلْتُ عَلَيْهِنَّ قُلْتُ إِنِ انْتَهَيْتُنَّ أَوْ لَيُبَدِّلَنَّ اللَّهُ رَسُولَهُ صلى الله عليه وسلم خَيْرًا مِنْكُنَّ‏.‏ حَتَّى أَتَيْتُ إِحْدَى نِسَائِهِ، قَالَتْ يَا عُمَرُ، أَمَا فِي رَسُولِ اللَّهِ صلى الله عليه وسلم مَا يَعِظُ نِسَاءَهُ حَتَّى تَعِظَهُنَّ أَنْتَ فَأَنْزَلَ اللَّهُ ‏{‏عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ‏}‏ الآيَةَ‏.‏       \n وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ سَمِعْتُ أَنَسًا عَنْ عُمَرَ.",
    "reference": "Reference : Sahih al-Bukhari 4483In-book reference : Book 65, Hadith 10USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 10   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4484,
    "id": 4484,
    "url": "https://sunnah.com/bukhari:4484",
    "bookNumber": 65,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "(The wife of the Prophet) Allah's Messenger (ﷺ) said, \"Don't you see that when your people built the Ka`ba, \nthey did not build it on all Abraham's foundations?\" I said, \"O Allah's Messenger (ﷺ)! Why don't you rebuild \nit on Abraham's foundations?\" He said, \"Were your people not so close to (the period of Heathenism, \ni.e. the Period between their being Muslims and being infidels), I would do so.\" The sub-narrator, \n`Abdullah bin `Umar said, \"Aisha had surely heard Allah's Messenger (ﷺ) saying that, for I do not think that \nAllah's Messenger (ﷺ) left touching the two corners of the Ka`ba facing Al-Hijr except because the Ka`ba \nwas not built on all Abraham's foundations.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلَمْ تَرَىْ أَنَّ قَوْمَكِ بَنَوُا الْكَعْبَةَ وَاقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلاَ تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ قَالَ ‏\"‏ لَوْلاَ حِدْثَانُ قَوْمِكِ بِالْكُفْرِ ‏\"‏‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَئِنْ كَانَتْ عَائِشَةُ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ اسْتِلاَمَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ، إِلاَّ أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4484In-book reference : Book 65, Hadith 11USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 11   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4485,
    "id": 4485,
    "url": "https://sunnah.com/bukhari:4485",
    "bookNumber": 65,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Huraira:",
    "english": "The people of the Scripture (Jews) used to recite the Torah in Hebrew and they used to explain it in \nArabic to the Muslims. On that Allah's Messenger (ﷺ) said, \"Do not believe the people of the Scripture or \ndisbelieve them, but say:-- \"We believe in Allah and what is revealed to us.\" (2.136)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ أَهْلُ الْكِتَابِ يَقْرَءُونَ التَّوْرَاةَ بِالْعِبْرَانِيَّةِ، وَيُفَسِّرُونَهَا بِالْعَرَبِيَّةِ لأَهْلِ الإِسْلاَمِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُصَدِّقُوا أَهْلَ الْكِتَابِ وَلاَ تُكَذِّبُوهُمْ، وَقُولُوا ‏{‏آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ‏}‏ الآيَةَ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4485In-book reference : Book 65, Hadith 12USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 12   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4486,
    "id": 4486,
    "url": "https://sunnah.com/bukhari:4486",
    "bookNumber": 65,
    "hadithNumber": 13,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) prayed facing Bait-ulMaqdis (i.e. Jerusalem) for sixteen or seventeen months but he \nwished that his Qibla would be the Ka`ba (at Mecca). (So Allah Revealed (2.144) and he offered `Asr \nprayers(in his Mosque facing Ka`ba at Mecca) and some people prayed with him. A man from among \nthose who had prayed with him, went out and passed by some people offering prayer in another \nmosque, and they were in the state of bowing. He said, \"I, (swearing by Allah,) testify that I have \nprayed with the Prophet (ﷺ) facing Mecca.\" Hearing that, they turned their faces to the Ka`ba while they \nwere still bowing. Some men had died before the Qibla was changed towards the Ka`ba. They had \nbeen killed and we did not know what to say about them (i.e. whether their prayers towards Jerusalem \nwere accepted or not). So Allah revealed:-- \"And Allah would never make your faith (i.e. prayer) to be \nlost (i.e. your prayers offered (towards Jerusalem). Truly Allah is Full of Pity, Most Merciful towards \nmankind.\" (2.143)",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، سَمِعَ زُهَيْرًا، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى إِلَى بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُعْجِبُهُ أَنْ تَكُونَ قِبْلَتُهُ قِبَلَ الْبَيْتِ، وَإِنَّهُ صَلَّى ـ أَوْ صَلاَّهَا ـ صَلاَةَ الْعَصْرِ، وَصَلَّى مَعَهُ قَوْمٌ، فَخَرَجَ رَجُلٌ مِمَّنْ كَانَ صَلَّى مَعَهُ، فَمَرَّ عَلَى أَهْلِ الْمَسْجِدِ وَهُمْ رَاكِعُونَ قَالَ أَشْهَدُ بِاللَّهِ لَقَدْ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم قِبَلَ مَكَّةَ، فَدَارُوا كَمَا هُمْ قِبَلَ الْبَيْتِ، وَكَانَ الَّذِي مَاتَ عَلَى الْقِبْلَةِ قَبْلَ أَنْ تُحَوَّلَ قِبَلَ الْبَيْتِ رِجَالٌ قُتِلُوا لَمْ نَدْرِ مَا نَقُولُ فِيهِمْ، فَأَنْزَلَ اللَّهُ ‏{‏وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4486In-book reference : Book 65, Hadith 13USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 13   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4487,
    "id": 4487,
    "url": "https://sunnah.com/bukhari:4487",
    "bookNumber": 65,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"Noah will be called on the Day of Resurrection and he will say, 'Labbaik and \nSa`daik, O my Lord!' Allah will say, 'Did you convey the Message?' Noah will say, 'Yes.' His nation \nwill then be asked, 'Did he convey the Message to you?' They will say, 'No Warner came to us.' Then \nAllah will say (to Noah), 'Who will bear witness in your favor?' He will say, 'Muhammad and his \nfollowers. So they (i.e. Muslims) will testify that he conveyed the Message. And the Apostle \n(Muhammad) will be a witness over yourselves, and that is what is meant by the Statement of Allah \n\"Thus We have made of you a just and the best nation that you may be witnesses over mankind and \nthe Apostle (Muhammad) will be a witness over yourselves.\" \n(2.143)",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ رَاشِدٍ، حَدَّثَنَا جَرِيرٌ، وَأَبُو أُسَامَةَ ـ وَاللَّفْظُ لِجَرِيرٍ ـ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، وَقَالَ أَبُو أُسَامَةَ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُدْعَى نُوحٌ يَوْمَ الْقِيَامَةِ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ يَا رَبِّ‏.‏ فَيَقُولُ هَلْ بَلَّغْتَ فَيَقُولُ نَعَمْ‏.‏ فَيُقَالُ لأُمَّتِهِ هَلْ بَلَّغَكُمْ فَيَقُولُونَ مَا أَتَانَا مِنْ نَذِيرٍ‏.‏ فَيَقُولُ مَنْ يَشْهَدُ لَكَ فَيَقُولُ مُحَمَّدٌ وَأُمَّتُهُ‏.‏ فَتَشْهَدُونَ أَنَّهُ قَدْ بَلَّغَ ‏\"‏‏.‏ ‏{‏وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا‏}‏ فَذَلِكَ قَوْلُهُ جَلَّ ذِكْرُهُ ‏{‏وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا‏}‏ وَالْوَسَطُ الْعَدْلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4487In-book reference : Book 65, Hadith 14USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 14   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4488,
    "id": 4488,
    "url": "https://sunnah.com/bukhari:4488",
    "bookNumber": 65,
    "hadithNumber": 15,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While some people were offering Fajr prayer in the Quba' mosque, some-one came and said, \"Allah \nhas revealed to the Prophet (ﷺ) Qur'anic instructions that you should face the Ka`ba (while praying) so \nyou too, should face it.\" Those people then turned towards the Ka`ba.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ بَيْنَا النَّاسُ يُصَلُّونَ الصُّبْحَ فِي مَسْجِدِ قُبَاءٍ إِذْ جَاءَ جَاءٍ فَقَالَ أَنْزَلَ اللَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم قُرْآنًا أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا‏.‏ فَتَوَجَّهُوا إِلَى الْكَعْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4488In-book reference : Book 65, Hadith 15USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 15   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4489,
    "id": 4489,
    "url": "https://sunnah.com/bukhari:4489",
    "bookNumber": 65,
    "hadithNumber": 16,
    "narrator": "Narrated Anas:",
    "english": "None remains of those who prayed facing both Qiblas (that is, Jerusalem and Mecca) except myself.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمْ يَبْقَ مِمَّنْ صَلَّى الْقِبْلَتَيْنِ غَيْرِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4489In-book reference : Book 65, Hadith 16USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 16   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4490,
    "id": 4490,
    "url": "https://sunnah.com/bukhari:4490",
    "bookNumber": 65,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While some people were offering morning prayer at Quba' a man came to them and said, \"A Qur'anic \nOrder has been revealed to Allah's Messenger (ﷺ) tonight that he should face the Ka`ba at Mecca (in prayer), \nso you too should turn your faces towards it.\" At that moment their faces were towards Sham (i.e. \nJerusalem) (and on hearing that) they turned towards the Ka`ba (at Mecca).",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ بَيْنَمَا النَّاسُ فِي الصُّبْحِ بِقُبَاءٍ جَاءَهُمْ رَجُلٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَأُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ أَلاَ فَاسْتَقْبِلُوهَا‏.‏ وَكَانَ وَجْهُ النَّاسِ إِلَى الشَّأْمِ فَاسْتَدَارُوا بِوُجُوهِهِمْ إِلَى الْكَعْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4490In-book reference : Book 65, Hadith 17USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 17   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4491,
    "id": 4491,
    "url": "https://sunnah.com/bukhari:4491",
    "bookNumber": 65,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While some people were offering Fajr prayer at Quba' (mosque), some-one came to them and said, \n\"Tonight some Qur'anic Verses have been revealed to the Prophet (ﷺ) and he has been ordered to face the \nKa`ba (at Mecca) (during prayers), so you too should turn your faces towards it.\" At that time their \nfaces were towards Sham (Jerusalem) so they turned towards the Ka`ba (at Mecca).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4491In-book reference : Book 65, Hadith 18USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 18   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4492,
    "id": 4492,
    "url": "https://sunnah.com/bukhari:4492",
    "bookNumber": 65,
    "hadithNumber": 19,
    "narrator": "Narrated Al-Bara:",
    "english": "We prayed along with the Prophet (ﷺ) facing Jerusalem for sixteen or seventeen months. Then Allah \nordered him to turn his face towards the Qibla (in Mecca):-- \n\"And from whence-so-ever you start forth (for prayers) turn your face in the direction of (the Sacred \nMosque of Mecca) Al-Masjid-ul Haram..\" (2.149)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ صَلَّيْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ ـ أَوْ سَبْعَةَ عَشَرَ ـ شَهْرًا، ثُمَّ صَرَفَهُ نَحْوَ الْقِبْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4492In-book reference : Book 65, Hadith 19USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4493,
    "id": 4493,
    "url": "https://sunnah.com/bukhari:4493",
    "bookNumber": 65,
    "hadithNumber": 20,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While some people were at Quba (offering) morning prayer, a man came to them and said, \"Last night \nQur'anic Verses have been revealed whereby the Prophet (ﷺ) has been ordered to face the Ka`ba (at \nMecca), so you too should face it.\" So they, keeping their postures, turned towards the Ka`ba. \nFormerly the people were facing Sham (Jerusalem) (Allah said):-- \n\"And from whence-so-ever you start forth (for prayers), turn your face in the direction of the Sacred \nMosque of Mecca (Al-Masjid-ul-Haram), and whence-so-ever you are, turn your face towards it \n(when you pray)\" (2.150)",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ بَيْنَا النَّاسُ فِي الصُّبْحِ بِقُبَاءٍ إِذْ جَاءَهُمْ رَجُلٌ فَقَالَ أُنْزِلَ اللَّيْلَةَ قُرْآنٌ، فَأُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ، فَاسْتَقْبِلُوهَا‏.‏ وَاسْتَدَارُوا كَهَيْئَتِهِمْ، فَتَوَجَّهُوا إِلَى الْكَعْبَةِ وَكَانَ وَجْهُ النَّاسِ إِلَى الشَّأْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4493In-book reference : Book 65, Hadith 20USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 20   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4494,
    "id": 4494,
    "url": "https://sunnah.com/bukhari:4494",
    "bookNumber": 65,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn `Umar:",
    "english": "While some people were offering Fajr prayer at Quba mosque, someone came to them and said, \n\"Qur'anic literature\" has been revealed to Allah's Messenger (ﷺ) tonight, and he has been ordered to face the \nKa`ba (of Mecca) so you too, should turn your faces towards it. Their faces were then towards Sham \n(Jerusalem), so they turned towards the Qibla (i.e. Ka`ba of Mecca).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَمَا النَّاسُ فِي صَلاَةِ الصُّبْحِ بِقُبَاءٍ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ، فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْقِبْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4494In-book reference : Book 65, Hadith 21USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 21   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4495,
    "id": 4495,
    "url": "https://sunnah.com/bukhari:4495",
    "bookNumber": 65,
    "hadithNumber": 22,
    "narrator": "Narrated `Urwa:",
    "english": "I said to `Aisha, the wife of the Prophet, and I was at that time a young boy, \"How do you interpret the \nStatement of Allah: \n\"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah.\" \nSo it is not harmful of those who perform the Hajj to the House of Allah) or perform the Umra, to \nambulate (Tawaf) between them. In my opinion it is not sinful for one not to ambulate (Tawaf) \nbetween them.\" `Aisha said, \"Your interpretation is wrong for as you say, the Verse should have been: \n\"So it is not harmful of those who perform the Hajj or Umra to the House, not to ambulate (Tawaf) \nbetween them.' This Verse was revealed in connection with the Ansar who (during the Pre-Islamic \nPeriod) used to visit Manat (i.e. an idol) after assuming their Ihram, and it was situated near Qudaid \n(i.e. a place at Mecca), and they used to regard it sinful to ambulate between Safa and Marwa after \nembracing Islam. When Islam came, they asked Allah's Messenger (ﷺ) about it, whereupon Allah revealed:-- \n\"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah. So it is not \nharmful of those who perform the Hajj of the House (of Allah) or perform the Umra, to ambulate \n(Tawaf) between them.\" (2.158)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَمَا أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا، إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ، كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4495In-book reference : Book 65, Hadith 22USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 22   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4496,
    "id": 4496,
    "url": "https://sunnah.com/bukhari:4496",
    "bookNumber": 65,
    "hadithNumber": 23,
    "narrator": "Narrated `Asim bin Sulaiman:",
    "english": "I asked Anas bin Malik about Safa and Marwa. Anas replied, \"We used to consider (i.e. going around) \nthem a custom of the Pre-islamic period of Ignorance, so when Islam came, we gave up going around \nthem. Then Allah revealed\" \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the \nSymbols of Allah. So it is not harmful of those who perform the Hajj of the House (of Allah) or \nperform the Umra to ambulate (Tawaf) between them.\" (2.158)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنِ الصَّفَا، وَالْمَرْوَةِ،‏.‏ فَقَالَ كُنَّا نَرَى أَنَّهُمَا مِنْ أَمْرِ الْجَاهِلِيَّةِ، فَلَمَّا كَانَ الإِسْلاَمُ أَمْسَكْنَا عَنْهُمَا، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ ‏}‏ إِلَى قَوْلِهِ ‏{‏أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4496In-book reference : Book 65, Hadith 23USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 23   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4497,
    "id": 4497,
    "url": "https://sunnah.com/bukhari:4497",
    "bookNumber": 65,
    "hadithNumber": 24,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said one statement and I said another. The Prophet (ﷺ) said \"Whoever dies while still \ninvoking anything other than Allah as a rival to Allah, will enter Hell (Fire).\" And I said, \"Whoever \ndies without invoking anything as a rival to Allah, will enter Paradise.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم كَلِمَةً وَقُلْتُ أُخْرَى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَاتَ وَهْوَ يَدْعُو مِنْ دُونِ اللَّهِ نِدًّا دَخَلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أَنَا مَنْ مَاتَ وَهْوَ لاَ يَدْعُو لِلَّهِ نِدًّا دَخَلَ الْجَنَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4497In-book reference : Book 65, Hadith 24USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 24   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4498,
    "id": 4498,
    "url": "https://sunnah.com/bukhari:4498",
    "bookNumber": 65,
    "hadithNumber": 25,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The law of Qisas (i.e. equality in punishment) was prescribed for the children of Israel, but the Diya \n(i.e. blood money was not ordained for them). So Allah said to this Nation (i.e. Muslims): \n\"O you who believe! The law of Al-Qisas (i.e. equality in punishment) is prescribed for you in cases \nof murder: The free for the free, the slave for the slave, and the female for the female. But if the \nrelatives (or one of them) of the killed (person) forgive their brother (i.e. the killers something of \nQisas (i.e. not to kill the killer by accepting blood money in the case of intentional murder)----then the \nrelatives (of the killed person) should demand blood-money in a reasonable manner and the killer \nmust pay with handsome gratitude. This is an allevitation and a Mercy from your Lord, (in \ncomparison to what was prescribed for the nations before you). \nSo after this, whoever transgresses the limits (i.e. to kill the killer after taking the blood-money) shall \nhave a painful torment.\" (2.178)",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، قَالَ سَمِعْتُ مُجَاهِدًا، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ كَانَ فِي بَنِي إِسْرَائِيلَ الْقِصَاصُ، وَلَمْ تَكُنْ فِيهِمُ الدِّيَةُ فَقَالَ اللَّهُ تَعَالَى لِهَذِهِ الأُمَّةِ ‏{‏كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالأُنْثَى بِالأُنْثَى فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ‏}‏ فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ ‏{‏فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ‏}‏ يَتَّبِعُ بِالْمَعْرُوفِ وَيُؤَدِّي بِإِحْسَانٍ، ‏{‏ذَلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ‏}‏ وَرَحْمَةٌ مِمَّا كُتِبَ عَلَى مَنْ كَانَ قَبْلَكُمْ‏.‏ ‏{‏فَمَنِ اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ‏}‏ قَتَلَ بَعْدَ قَبُولِ الدِّيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4498In-book reference : Book 65, Hadith 25USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 25   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4499,
    "id": 4499,
    "url": "https://sunnah.com/bukhari:4499",
    "bookNumber": 65,
    "hadithNumber": 26,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"The prescribed Law of Allah is the equality in punishment (i.e. Al-Qisas).\" (In \ncases of murders, etc.)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا حُمَيْدٌ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4499In-book reference : Book 65, Hadith 26USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 26   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4500,
    "id": 4500,
    "url": "https://sunnah.com/bukhari:4500",
    "bookNumber": 65,
    "hadithNumber": 27,
    "narrator": "Narrated Anas:",
    "english": "That his aunt, Ar-Rubai' broke an incisor tooth of a girl. My aunt's family requested the girl's relatives \nfor forgiveness but they refused; then they proposed a compensation, but they refused. Then they went \nto Allah's Messenger (ﷺ) and refused everything except Al-Qisas (i.e. equality in punishment). So Allah's \nApostle passed the judgment of Al-Qisas (i.e. equality of punishment). Anas bin Al-Nadr said, \"O \nAllah's Messenger (ﷺ)! Will the incisor tooth of Ar-Rubai be broken? No, by Him Who sent you with the \nTruth, her incisor tooth will not be broken.\" Allah's Messenger (ﷺ) said, \"O Anas! The prescribed law of \nAllah is equality in punishment (i.e. Al-Qisas.)\" Thereupon those people became satisfied and forgave \nher. Then Allah's Messenger (ﷺ) said, \"Among Allah's Worshippers there are some who, if they took Allah's \nOath (for something), Allah fulfill their oaths.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ بَكْرٍ السَّهْمِيَّ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ الرُّبَيِّعَ، عَمَّتَهُ كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ، فَطَلَبُوا إِلَيْهَا الْعَفْوَ فَأَبَوْا، فَعَرَضُوا الأَرْشَ فَأَبَوْا، فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَوْا إِلاَّ الْقِصَاصَ، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْقِصَاصِ، فَقَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ، أَتُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ثَنِيَّتُهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏ فَرَضِيَ الْقَوْمُ فَعَفَوْا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4500In-book reference : Book 65, Hadith 27USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 27   (deprecated numbering scheme)"
  }
]