[
  {
    "hadithGlobalNumber": 4901,
    "id": 4901,
    "url": "https://sunnah.com/bukhari:4901",
    "bookNumber": 65,
    "hadithNumber": 421,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "I was with my uncle and I heard `Abdullah bin Ubai bin Salul, saying, \"Don't spend on those who are \nwith Allah's Messenger (ﷺ) that they may disperse and go away from him.\" He also said, \"If we return to \nMedina, surely, the more honorable will expel the meaner.\" So I informed my uncle of that and then \nmy uncle informed Allah's Messenger (ﷺ) thereof. Allah's Messenger (ﷺ) sent for `Abdullah bin Ubai and his \ncompanions. They swore that they did not say anything of that sort Allah's Messenger (ﷺ) deemed their \nstatement true and rejected mine. Thereof I became as distressed as I have never been before, and \nstayed at home. Then Allah revealed (Surat Al-Munafiqin): \n'When the hypocrites come to you.....(63.1) They are the ones who say: Spend nothing on those who \nare with Allah's Messenger (ﷺ) ..(63.7) Verily the more honorable will expel therefrom the meaner..' (63.7-8) \nAllah's Messenger (ﷺ) sent for me and recited that Sura for me and said, \"Allah has confirmed your \nstatement.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أَرْقَمَ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ عَمِّي فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ابْنَ سَلُولَ يَقُولُ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا‏.‏ وَقَالَ أَيْضًا لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمِّي فَذَكَرَ عَمِّي لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَأَصْحَابِهِ، فَحَلَفُوا مَا قَالُوا، فَصَدَّقَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَذَّبَنِي، فَأَصَابَنِي هَمٌّ لَمْ يُصِبْنِي مِثْلُهُ، فَجَلَسْتُ فِي بَيْتِي، فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ إِلَى قَوْلِهِ ‏{‏هُمُ الَّذِينَ يَقُولُونَ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ‏}‏ إِلَى قَوْلِهِ ‏{‏لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏}‏ فَأَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَهَا عَلَىَّ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4901In-book reference : Book 65, Hadith 421USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 424   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4902,
    "id": 4902,
    "url": "https://sunnah.com/bukhari:4902",
    "bookNumber": 65,
    "hadithNumber": 422,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "When `Abdullah bin Ubai said, \"Do not spend on those who are with Allah's Messenger (ﷺ),\" and also said, \n\"If we return to Medina,\" I informed the Prophet (ﷺ) of his saying. The Ansar blamed me for that, and \n`Abdullah bin Ubai swore that he did not say. I returned to my house and slept. Allah's Messenger (ﷺ) then \ncalled me and I went to him. He said, \"Allah has confirmed your statement.\" The Verse: \"They are the \none who say: Spend nothing......(63.7) was revealed.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ كَعْبٍ الْقُرَظِيَّ، قَالَ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ ـ رضى الله عنه ـ قَالَ لَمَّا قَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ‏.‏ وَقَالَ أَيْضًا لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ‏.‏ أَخْبَرْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَلاَمَنِي الأَنْصَارُ، وَحَلَفَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ مَا قَالَ ذَلِكَ، فَرَجَعْتُ إِلَى الْمَنْزِلِ فَنِمْتُ فَدَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ فَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏ وَنَزَلَ ‏{‏هُمُ الَّذِينَ يَقُولُونَ لاَ تُنْفِقُوا‏}‏ الآيَةَ‏.‏ وَقَالَ ابْنُ أَبِي زَائِدَةَ عَنِ الأَعْمَشِ عَنْ عَمْرٍو عَنِ ابْنِ أَبِي لَيْلَى عَنْ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4902In-book reference : Book 65, Hadith 422USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 425   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4903,
    "id": 4903,
    "url": "https://sunnah.com/bukhari:4903",
    "bookNumber": 65,
    "hadithNumber": 423,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "We went out with the Prophet (ﷺ) : on a journey and the people suffered from lack of provisions. So \n`Abdullah bin Ubai said to his companions, \"Don't spend on those who are with Allah's Messenger (ﷺ), that \nthey may disperse and go away from him.\" He also said, \"If we return to Medina, surely, the more \nhonorable will expel therefrom the meaner. So I went to the Prophet (ﷺ) and informed him of that. He sent \nfor `Abdullah bin Ubai and asked him, but `Abdullah bin Ubai swore that he did not say so. The \npeople said, \"Zaid told a lie to 'Allah's Messenger (ﷺ).\" What they said distressed me very much. Later Allah \nrevealed the confirmation of my statement in his saying:-- \n'(When the hypocrites come to you.' (63.1) So the Prophet (ﷺ) called them that they might ask Allah to \nforgive them, but they turned their heads aside. (Concerning Allah's saying: 'Pieces of wood propped \nup,' Zaid said; They were the most handsome men.)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لأَصْحَابِهِ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ‏.‏ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَسَأَلَهُ، فَاجْتَهَدَ يَمِينَهُ مَا فَعَلَ، قَالُوا كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَوَقَعَ فِي نَفْسِي مِمَّا قَالُوا شِدَّةٌ، حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَصْدِيقِي فِي ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ فَدَعَاهُمُ النَّبِيُّ صلى الله عليه وسلم لِيَسْتَغْفِرَ لَهُمْ فَلَوَّوْا رُءُوسَهُمْ‏.‏ وَقَوْلُهُ ‏{‏خُشُبٌ مُسَنَّدَةٌ‏}‏ قَالَ كَانُوا رِجَالاً أَجْمَلَ شَىْءٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4903In-book reference : Book 65, Hadith 423USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 426   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4904,
    "id": 4904,
    "url": "https://sunnah.com/bukhari:4904",
    "bookNumber": 65,
    "hadithNumber": 424,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "While I was with my uncle, I heard `Abdullah bin Ubai bin Salul saying, \"Do not spend on those who \nare with Allah's Messenger (ﷺ), that they may disperse and go away (from him). And if we return to Medina, \nsurely, the more honorable will expel therefrom the meaner. \"I mentioned that to my uncle who, in \nturn, mentioned it to the Prophet. The Prophet (ﷺ) called me and I told him about that. Then he sent for \n`Abdullah bin Ubai and his companions, and they swore that they did not say so. The Prophet (ﷺ) \ndisbelieved my statement and believed theirs. I was distressed as I have never been before, and I \nremained in my house. My uncle said to me, \"You just wanted the Prophet (ﷺ) to consider you a liar and \nhate you.\" Then Allah revealed:-- \n'When the hypocrites come to you, they say: 'We bear witness that you are indeed the Apostle of \nAllah.\" (63.1) So the Prophet (ﷺ) sent for me and recited it and said, \"Allah has confirmed your \nstatement.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كُنْتُ مَعَ عَمِّي فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ابْنَ سَلُولَ، يَقُولُ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا، وَلَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمِّي، فَذَكَرَ عَمِّي لِلنَّبِيِّ صلى الله عليه وسلم ‏{‏فَدَعَانِي فَحَدَّثْتُهُ، فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَأَصْحَابِهِ فَحَلَفُوا مَا قَالُوا، وَكَذَّبَنِي النَّبِيُّ صلى الله عليه وسلم‏}‏ وَصَدَّقَهُمْ، فَأَصَابَنِي غَمٌّ لَمْ يُصِبْنِي مِثْلُهُ قَطُّ، فَجَلَسْتُ فِي بَيْتِي وَقَالَ عَمِّي مَا أَرَدْتَ إِلَى أَنْ كَذَّبَكَ النَّبِيُّ صلى الله عليه وسلم وَمَقَتَكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ‏}‏ وَأَرْسَلَ إِلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَهَا وَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4904In-book reference : Book 65, Hadith 424USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 427   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4905,
    "id": 4905,
    "url": "https://sunnah.com/bukhari:4905",
    "bookNumber": 65,
    "hadithNumber": 425,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "We were in a Ghazwa (Sufyan once said, in an army) and a man from the emigrants kicked an Ansari \nman (on the buttocks with his foot). The Ansari man said, \"O the Ansar! (Help!)\" and the emigrant \nsaid. \"O the emigrants! (Help!) Allah's Messenger (ﷺ) heard that and said, \"What is this call for, which is \ncharacteristic of the period of ignorance?\" They said, \"O Allah's Messenger (ﷺ)! A man from the emigrants \nkicked one of the Ansar (on the buttocks with his foot).\" Allah's Messenger (ﷺ) said, \"Leave it (that call) as is \na detestable thing.\" `Abdullah bin Ubai heard that and said, 'Have the (the emigrants) done so? By \nAllah, if we return Medina, surely, the more honorable will expel therefrom the meaner.\" When this \nstatement reached the Prophet. `Umar got up an, said, \"O Allah's Messenger (ﷺ)! Let me chop off the head of \nthis hypocrite (`Abdullah bin Ubai)!\" The Prophet (ﷺ) said \"Leave him, lest the people say that \nMuhammad kills his companions.\" The Ansar were then more in number than the emigrants when the \nlatter came to Medina, but later on the emigrant increased.",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا فِي غَزَاةٍ ـ قَالَ سُفْيَانُ مَرَّةً فِي جَيْشٍ ـ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَسَمِعَ ذَاكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ دَعْوَى جَاهِلِيَّةٍ ‏\"‏ قَالُوا يَا رَسُولَ اللَّهِ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ‏.‏ فَقَالَ ‏\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏‏.‏ فَسَمِعَ بِذَلِكَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَقَالَ فَعَلُوهَا، أَمَا وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَامَ عُمَرُ فَقَالَ يَا رَسُولَ اللَّهِ دَعْنِي أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُ لاَ يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏ وَكَانَتِ الأَنْصَارُ أَكْثَرَ مِنَ الْمُهَاجِرِينَ حِينَ قَدِمُوا الْمَدِينَةَ، ثُمَّ إِنَّ الْمُهَاجِرِينَ كَثُرُوا بَعْدُ‏.‏ قَالَ سُفْيَانُ فَحَفِظْتُهُ مِنْ عَمْرٍو قَالَ عَمْرٌو سَمِعْتُ جَابِرًا كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4905In-book reference : Book 65, Hadith 425USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 428   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4906,
    "id": 4906,
    "url": "https://sunnah.com/bukhari:4906",
    "bookNumber": 65,
    "hadithNumber": 426,
    "narrator": "Narrated Musa bin `Uqba:",
    "english": "`Abdullah bin Al-Fadl told me that Anas bin Malik said, \"I was much grieve over those who had been \nkilled in the Battle of Al-Harra. When Zaid bin Arqarr heard of my intense grief (over the killed \nAnsar), he wrote a letter to me saying that he heard Allah's Messenger (ﷺ) saying, O Allah! Forgive the \nAnsar and the Ansar children. The subnarrator, Ibn Al-Fadl, is not sure whether the Prophet (ﷺ) also said, \nAnd their grand-children.\" Some of those who were present, asked Anas (about Zaid). He said, \"He \n(Zaid) is the one about whom Allah's Messenger (ﷺ) said, 'He is the one whose sound hearing Allah testified.'",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْفَضْلِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ حَزِنْتُ عَلَى مَنْ أُصِيبَ بِالْحَرَّةِ فَكَتَبَ إِلَىَّ زَيْدُ بْنُ أَرْقَمَ وَبَلَغَهُ شِدَّةُ حُزْنِي يَذْكُرُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلأَنْصَارِ وَلأَبْنَاءِ الأَنْصَارِ ‏\"‏ ـ وَشَكَّ ابْنُ الْفَضْلِ فِي أَبْنَاءِ أَبْنَاءِ الأَنْصَارِ ـ فَسَأَلَ أَنَسًا بَعْضُ مَنْ كَانَ عِنْدَهُ فَقَالَ هُوَ الَّذِي يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا الَّذِي أَوْفَى اللَّهُ لَهُ بِأُذُنِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4906In-book reference : Book 65, Hadith 426USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 429   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4907,
    "id": 4907,
    "url": "https://sunnah.com/bukhari:4907",
    "bookNumber": 65,
    "hadithNumber": 427,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "We were in a Ghazwa and a man from the emigrants kicked an Ansari (on the buttocks with his foot). \nThe Ansari man said, \"O the Ansari! (Help!)\" The emigrant said, \"O the emigrants! (Help).\" When \nAllah's Messenger (ﷺ) heard that, he said, \"What is that?\" They said, \"A man from the emigrants kicked a \nman from the Ansar (on the buttocks his foot). On that the Ansar said, 'O the Ansar!' and the emigrant \nsaid, 'O the emigrants!\" The Prophet (ﷺ) said' \"Leave it (that call) for it Is a detestable thing.\" The number \nof Ansar was larger (than that of the emigrants) at the time when the Prophet (ﷺ) came to Medina, but \nlater the number of emigrants increased. `Abdullah bin Ubai said, \"Have they, (the emigrants) done \nso? By Allah, if we return to Medina, surely, the more honorable will expel therefrom the meaner,\" \n`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! Let me chop off the head of this hypocrite!\" The \nProphet said, \"Leave him, lest the people say Muhammad kills his companions:\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ كُنَّا فِي غَزَاةٍ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَسَمَّعَهَا اللَّهُ رَسُولَهُ صلى الله عليه وسلم قَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَقَالُوا كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَالَلْمُهَاجِرِينَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏‏.‏ قَالَ جَابِرٌ وَكَانَتِ الأَنْصَارُ حِينَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم أَكْثَرَ، ثُمَّ كَثُرَ الْمُهَاجِرُونَ بَعْدُ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَوَقَدْ فَعَلُوا، وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه دَعْنِي يَا رَسُولَ اللَّهِ أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُ لاَ يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4907In-book reference : Book 65, Hadith 427USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4908,
    "id": 4908,
    "url": "https://sunnah.com/bukhari:4908",
    "bookNumber": 65,
    "hadithNumber": 428,
    "narrator": "Narrated Salim:",
    "english": "That `Abdullah bin `Umar told him that he had divorced his wife while she was in her menses so \n`Umar informed Allah's Messenger (ﷺ) \nof that. Allah's Messenger (ﷺ) became very angry at that and said, \"(Ibn `Umar must return her to his house \nand keep her as his wife till she becomes clean and then menstruates and becomes clean again, \nwhereupon, if he wishes to divorce her, he may do so while she is still clean and before having any \nsexual relations with her, for that is the legally prescribed period for divorce as Allah has ordered.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَذَكَرَ عُمَرُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَغَيَّظَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\n\"‏ لِيُرَاجِعْهَا ثُمَّ يُمْسِكْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ فَتَطْهُرَ، فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا طَاهِرًا قَبْلَ أَنْ يَمَسَّهَا فَتِلْكَ الْعِدَّةُ كَمَا أَمَرَهُ اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4908In-book reference : Book 65, Hadith 428USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 431   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4909,
    "id": 4909,
    "url": "https://sunnah.com/bukhari:4909",
    "bookNumber": 65,
    "hadithNumber": 429,
    "narrator": "Narrated Abu Salama:",
    "english": "A man came to Ibn `Abbas while Abu Huraira was sitting with him and said, \"Give me your verdict \nregarding a lady who delivered a baby forty days after the death of her husband.\" Ibn `Abbas said, \n\"This indicates the end of one of the two prescribed periods.\" I said \"For those who are pregnant, their \nprescribed period is until they deliver their burdens.\" Abu Huraira said, I agree with my cousin (Abu \nSalama).\" Then Ibn `Abbas sent his slave, Kuraib to Um Salama to ask her (regarding this matter). \nShe replied. \"The husband of Subai'a al Aslamiya was killed while she was pregnant, and she \ndelivered a baby forty days after his death. Then her hand was asked in marriage and Allah's Messenger (ﷺ) \nmarried her (to somebody). Abu As-Sanabil was one of those who asked for her hand in marriage\".",
    "arabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عَبَّاسٍ وَأَبُو هُرَيْرَةَ جَالِسٌ عِنْدَهُ فَقَالَ أَفْتِنِي فِي امْرَأَةٍ وَلَدَتْ بَعْدَ زَوْجِهَا بِأَرْبَعِينَ لَيْلَةً‏.‏ فَقَالَ ابْنُ عَبَّاسٍ آخِرُ الأَجَلَيْنِ‏.‏ قُلْتُ أَنَا ‏{‏وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ‏}‏ قَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي ـ يَعْنِي أَبَا سَلَمَةَ ـ فَأَرْسَلَ ابْنُ عَبَّاسٍ غُلاَمَهُ كُرَيْبًا إِلَى أُمِّ سَلَمَةَ يَسْأَلُهَا فَقَالَتْ قُتِلَ زَوْجُ سُبَيْعَةَ الأَسْلَمِيَّةِ وَهْىَ حُبْلَى، فَوَضَعَتْ بَعْدَ مَوْتِهِ بِأَرْبَعِينَ لَيْلَةً فَخُطِبَتْ فَأَنْكَحَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ أَبُو السَّنَابِلِ فِيمَنْ خَطَبَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4909In-book reference : Book 65, Hadith 429USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4910,
    "id": 4910,
    "url": "https://sunnah.com/bukhari:4910",
    "bookNumber": 65,
    "hadithNumber": 430,
    "narrator": "",
    "english": "See hadith 4909",
    "arabic": "وَقَالَ سُلَيْمَانُ بْنُ حَرْبٍ وَأَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ كُنْتُ فِي حَلْقَةٍ فِيهَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى وَكَانَ أَصْحَابُهُ يُعَظِّمُونَهُ، فَذَكَرَ آخِرَ الأَجَلَيْنِ فَحَدَّثْتُ بِحَدِيثِ سُبَيْعَةَ بِنْتِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ فَضَمَّزَ لِي بَعْضُ أَصْحَابِهِ‏.‏ قَالَ مُحَمَّدٌ فَفَطِنْتُ لَهُ فَقُلْتُ إِنِّي إِذًا لَجَرِيءٌ إِنْ كَذَبْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ وَهْوَ فِي نَاحِيَةِ الْكُوفَةِ‏.‏ فَاسْتَحْيَا وَقَالَ لَكِنَّ عَمَّهُ لَمْ يَقُلْ ذَاكَ‏.‏ فَلَقِيتُ أَبَا عَطِيَّةَ مَالِكَ بْنَ عَامِرٍ فَسَأَلْتُهُ فَذَهَبَ يُحَدِّثُنِي حَدِيثَ سُبَيْعَةَ فَقُلْتُ هَلْ سَمِعْتَ عَنْ عَبْدِ اللَّهِ فِيهَا شَيْئًا فَقَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ فَقَالَ أَتَجْعَلُونَ عَلَيْهَا التَّغْلِيظَ وَلاَ تَجْعَلُونَ عَلَيْهَا الرُّخْصَةَ‏.‏ لَنَزَلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ الطُّولَى ‏{‏وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4910In-book reference : Book 65, Hadith 430USC-MSA web (English) reference : Vol. 1, Book 60, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4911,
    "id": 4911,
    "url": "https://sunnah.com/bukhari:4911",
    "bookNumber": 65,
    "hadithNumber": 431,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "If someone says to his wife, \"You are unlawful to me.\" he must make an expiation (for his oath). Ibn \n`Abbas added: There is for you in Allah's Messenger (ﷺ), an excellent example to follow.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنِ ابْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ فِي الْحَرَامِ يُكَفِّرُ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ إِسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4911In-book reference : Book 65, Hadith 431USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 433   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4912,
    "id": 4912,
    "url": "https://sunnah.com/bukhari:4912",
    "bookNumber": 65,
    "hadithNumber": 432,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to drink honey in the house of Zainab, the daughter of Jahsh, and would stay \nthere with her. So Hafsa and I agreed secretly that, if he come to either of us, she would say to him. \"It \nseems you have eaten Maghafir (a kind of bad-smelling resin), for I smell in you the smell of \nMaghafir,\" (We did so) and he replied. \"No, but I was drinking honey in the house of Zainab, the \ndaughter of Jahsh, and I shall never take it again. I have taken an oath as to that, and you should not \ntell anybody about it.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ وَيَمْكُثُ عِنْدَهَا فَوَاطَيْتُ أَنَا وَحَفْصَةُ عَنْ أَيَّتُنَا دَخَلَ عَلَيْهَا فَلْتَقُلْ لَهُ أَكَلْتَ مَغَافِيرَ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ‏.‏ قَالَ ‏\n\"‏ لاَ وَلَكِنِّي كُنْتُ أَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ فَلَنْ أَعُودَ لَهُ وَقَدْ حَلَفْتُ لاَ تُخْبِرِي بِذَلِكِ أَحَدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4912In-book reference : Book 65, Hadith 432USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4913,
    "id": 4913,
    "url": "https://sunnah.com/bukhari:4913",
    "bookNumber": 65,
    "hadithNumber": 433,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "For the whole year I had the desire to ask `Umar bin Al-Khattab regarding the explanation of a Verse \n(in Surat Al-Tahrim) but I could not ask him because I respected him very much. When he went to \nperform the Hajj, I too went along with him. On our return, while we were still on the way home. \n`Umar went aside to answer the call of nature by the Arak trees. I waited till he finished and then I \nproceeded with him and asked him. \"O chief of the Believers! Who were the two wives of the Prophet (ﷺ) \nwho aided one another against him?\" He said, \"They were Hafsa and `Aisha.\" Then I said to him, \"By \nAllah, I wanted to ask you about this a year ago, but I could not do so owing to my respect for you.\" \n`Umar said, \"Do not refrain from asking me. If you think that I have knowledge (about a certain \nmatter), ask me; and if I know (something about it), I will tell you.\" Then `Umar added, \"By Allah, in \nthe Pre-lslamic Period of Ignorance we did not pay attention to women until Allah revealed regarding \nthem what He revealed regarding them and assigned for them what He has assigned. Once while I was \nthinking over a certain matter, my wife said, \"I recommend that you do so-and-so.\" I said to her, \n\"What have you got to do with the is matter? Why do you poke your nose in a matter which I want to \nsee fulfilled.?\" \nShe said, How strange you are, O son of Al-Khattab! You don't want to be argued with whereas your \ndaughter, Hafsa surely, argues with Allah's Messenger (ﷺ) so much that he remains angry for a full day!\" \n`Umar then reported; how he at once put on his outer garment and went to Hafsa and said to her, \"O \nmy daughter! Do you argue with Allah's Messenger (ﷺ) so that he remains angry the whole day?\" H. afsa \nsaid, \"By Allah, we argue with him.\" `Umar said, \"Know that I warn you of Allah's punishment and \nthe anger of Allah's Messenger (ﷺ) . . . O my daughter! Don't be betrayed by the one who is proud of her \nbeauty because of the love of Allah's Messenger (ﷺ) for her (i.e. `Aisha).\" `Umar addled, \"Then I went out to \nUm Salama's house who was one of my relatives, and I talked to her. She said, O son of Al-Khattab! It \nis rather astonishing that you interfere in everything; you even want to interfere between Allah's \nApostle and his wives!' By Allah, by her talk she influenced me so much that I lost some of my anger. \nI left her (and went home). \nAt that time I had a friend from the Ansar who used to bring news (from the Prophet) in case of my \nabsence, and I used to bring him the news if he was absent. In those days we were afraid of one of the \nkings of Ghassan tribe. We heard that he intended to move and attack us, so fear filled our hearts \nbecause of that. (One day) my Ansari friend unexpectedly knocked at my door, and said, \"Open \nOpen!' I said, 'Has the king of Ghassan come?' He said, 'No, but something worse; Allah's Messenger (ﷺ) has \nisolated himself from his wives.' I said, 'Let the nose of `Aisha and Hafsa be stuck to dust (i.e. \nhumiliated)!' Then I put on my clothes and went to Allah's Messenger (ﷺ)'s residence, and behold, he was \nstaying in an upper room of his to which he ascended by a ladder, and a black slave of Allah's Messenger (ﷺ) \nwas (sitting) on the first step. \nI said to him, 'Say (to the Prophet (ﷺ) ) `Umar bin Al-Khattab is here.' Then the Prophet (ﷺ) admitted me and I \nnarrated the story to Allah's Messenger (ﷺ). When I reached the story of Um Salama, Allah's Messenger (ﷺ) smiled \nwhile he was lying on a mat made of palm tree leaves with nothing between him and the mat. \nUnderneath his head there was a leather pillow stuffed with palm fibres, and leaves of a saut tree were \npiled at his feet, and above his head hung a few water skins. On seeing the marks of the mat imprinted \non his side, I wept. He said.' 'Why are you weeping?' I replied, \"O Allah's Messenger (ﷺ)! Caesar and \nKhosrau are leading the life (i.e. Luxurious life) while you, Allah's Messenger (ﷺ) though you are, is living in \ndestitute\". The Prophet (ﷺ) then replied. 'Won't you be satisfied that they enjoy this world and we the \nHereafter?' \"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُحَدِّثُ أَنَّهُ قَالَ مَكَثْتُ سَنَةً أُرِيدُ أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنْ آيَةٍ، فَمَا أَسْتَطِيعُ أَنْ أَسْأَلَهُ هَيْبَةً لَهُ، حَتَّى خَرَجَ حَاجًّا فَخَرَجْتُ مَعَهُ فَلَمَّا رَجَعْتُ وَكُنَّا بِبَعْضِ الطَّرِيقِ عَدَلَ إِلَى الأَرَاكِ لِحَاجَةٍ لَهُ ـ قَالَ ـ فَوَقَفْتُ لَهُ حَتَّى فَرَغَ سِرْتُ مَعَهُ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ اللَّتَانِ تَظَاهَرَتَا عَلَى النَّبِيِّ صلى الله عليه وسلم مِنْ أَزْوَاجِهِ فَقَالَ تِلْكَ حَفْصَةُ وَعَائِشَةُ‏.‏ قَالَ فَقُلْتُ وَاللَّهِ إِنْ كُنْتُ لأُرِيدُ أَنْ أَسْأَلَكَ عَنْ هَذَا مُنْذُ سَنَةٍ، فَمَا أَسْتَطِيعُ هَيْبَةً لَكَ‏.‏ قَالَ فَلاَ تَفْعَلْ مَا ظَنَنْتَ أَنَّ عِنْدِي مِنْ عِلْمٍ فَاسْأَلْنِي، فَإِنْ كَانَ لِي عِلْمٌ خَبَّرْتُكَ بِهِ ـ قَالَ ـ ثُمَّ قَالَ عُمَرُ وَاللَّهِ إِنْ كُنَّا فِي الْجَاهِلِيَّةِ مَا نَعُدُّ لِلنِّسَاءِ أَمْرًا، حَتَّى أَنْزَلَ اللَّهُ فِيهِنَّ مَا أَنْزَلَ وَقَسَمَ لَهُنَّ مَا قَسَمَ ـ قَالَ ـ فَبَيْنَا أَنَا فِي أَمْرٍ أَتَأَمَّرُهُ إِذْ قَالَتِ امْرَأَتِي لَوْ صَنَعْتَ كَذَا وَكَذَا ـ قَالَ ـ فَقُلْتُ لَهَا مَالَكِ وَلِمَا هَا هُنَا فِيمَا تَكَلُّفُكِ فِي أَمْرٍ أُرِيدُهُ‏.‏ فَقَالَتْ لِي عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ مَا تُرِيدُ أَنْ تُرَاجَعَ أَنْتَ، وَإِنَّ ابْنَتَكَ لَتُرَاجِعُ رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ‏.‏ فَقَامَ عُمَرُ فَأَخَذَ رِدَاءَهُ مَكَانَهُ حَتَّى دَخَلَ عَلَى حَفْصَةَ فَقَالَ لَهَا يَا بُنَيَّةُ إِنَّكِ لَتُرَاجِعِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ‏.‏ فَقَالَتْ حَفْصَةُ وَاللَّهِ إِنَّا لَنُرَاجِعُهُ‏.‏ فَقُلْتُ‏.‏ تَعْلَمِينَ أَنِّي أُحَذِّرُكِ عُقُوبَةَ اللَّهِ وَغَضَبَ رَسُولِهِ صلى الله عليه وسلم يَا بُنَيَّةُ لاَ يَغُرَّنَّكِ هَذِهِ الَّتِي أَعْجَبَهَا حُسْنُهَا حُبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم إِيَّاهَا ـ يُرِيدُ عَائِشَةَ ـ قَالَ ثُمَّ خَرَجْتُ حَتَّى دَخَلْتُ عَلَى أُمِّ سَلَمَةَ لِقَرَابَتِي مِنْهَا فَكَلَّمْتُهَا‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ دَخَلْتَ فِي كُلِّ شَىْءٍ، حَتَّى تَبْتَغِي أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَزْوَاجِهِ‏.‏ فَأَخَذَتْنِي وَاللَّهِ أَخْذًا كَسَرَتْنِي عَنْ بَعْضِ مَا كُنْتُ أَجِدُ، فَخَرَجْتُ مِنْ عِنْدِهَا، وَكَانَ لِي صَاحِبٌ مِنَ الأَنْصَارِ إِذَا غِبْتُ أَتَانِي بِالْخَبَرِ، وَإِذَا غَابَ كُنْتُ أَنَا آتِيهِ بِالْخَبَرِ، وَنَحْنُ نَتَخَوَّفُ مَلِكًا مِنْ مُلُوكِ غَسَّانَ، ذُكِرَ لَنَا أَنَّهُ يُرِيدُ أَنْ يَسِيرَ إِلَيْنَا، فَقَدِ امْتَلأَتْ صُدُورُنَا مِنْهُ، فَإِذَا صَاحِبِي الأَنْصَارِيُّ يَدُقُّ الْبَابَ فَقَالَ افْتَحِ افْتَحْ‏.‏ فَقُلْتُ جَاءَ الْغَسَّانِيُّ فَقَالَ بَلْ أَشَدُّ مِنْ ذَلِكَ‏.‏ اعْتَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَزْوَاجَهُ‏.‏ فَقُلْتُ رَغَمَ أَنْفُ حَفْصَةَ وَعَائِشَةَ‏.‏ فَأَخَذْتُ ثَوْبِيَ فَأَخْرُجُ حَتَّى جِئْتُ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَشْرُبَةٍ لَهُ يَرْقَى عَلَيْهَا بِعَجَلَةٍ، وَغُلاَمٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ فَقُلْتُ لَهُ قُلْ هَذَا عُمَرُ بْنُ الْخَطَّابِ‏.‏ فَأَذِنَ لِي ـ قَالَ عُمَرُ ـ فَقَصَصْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هَذَا الْحَدِيثَ، فَلَمَّا بَلَغْتُ حَدِيثَ أُمِّ سَلَمَةَ تَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِنَّهُ لَعَلَى حَصِيرٍ مَا بَيْنَهُ وَبَيْنَهُ شَىْءٌ، وَتَحْتَ رَأْسِهِ وِسَادَةٌ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، وَإِنَّ عِنْدَ رِجْلَيْهِ قَرَظًا مَصْبُوبًا، وَعِنْدَ رَأْسِهِ أَهَبٌ مُعَلَّقَةٌ فَرَأَيْتُ أَثَرَ الْحَصِيرِ فِي جَنْبِهِ فَبَكَيْتُ فَقَالَ ‏\"‏ مَا يُبْكِيكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ كِسْرَى وَقَيْصَرَ فِيمَا هُمَا فِيهِ وَأَنْتَ رَسُولُ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَمَا تَرْضَى أَنْ تَكُونَ لَهُمُ الدُّنْيَا وَلَنَا الآخِرَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4913In-book reference : Book 65, Hadith 433USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4914,
    "id": 4914,
    "url": "https://sunnah.com/bukhari:4914",
    "bookNumber": 65,
    "hadithNumber": 434,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I intended to ask `Umar so I said, \"Who were those two ladies who tried to back each other against \nthe Prophet?\" I hardly finished my speech when he said, They were `Aisha and Hafsa.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ عُبَيْدَ بْنَ حُنَيْنٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ أَرَدْتُ أَنْ أَسْأَلَ عُمَرَ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ اللَّتَانِ تَظَاهَرَتَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَا أَتْمَمْتُ كَلاَمِي حَتَّى قَالَ عَائِشَةُ وَحَفْصَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4914In-book reference : Book 65, Hadith 434USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 436   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4915,
    "id": 4915,
    "url": "https://sunnah.com/bukhari:4915",
    "bookNumber": 65,
    "hadithNumber": 435,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I intended to ask `Umar about those two ladies who back each other against 'Allah's Messenger (ﷺ) . For one \nyear I was seeking the opportunity to ask this question, but in vain, until once when I accompanied \nhim for Hajj. While we were in Zahran, `Umar went to answer the call of nature and told me to follow \nhim with some water for ablution. So I followed him with a container of water and started pouring \nwater for him. I found it a good opportunity to ask him, so I said, \"O chief of the Believers! Who were \nthose two ladies who had backed each other (against the Prophet)?\" Before I could complete my \nquestion, he replied, \"They were `Aisha and Hafsa.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ عُبَيْدَ بْنَ حُنَيْنٍ، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَرَدْتُ أَنْ أَسْأَلَ، عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ، تَظَاهَرَتَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَكُثْتُ سَنَةً فَلَمْ أَجِدْ لَهُ مَوْضِعًا، حَتَّى خَرَجْتُ مَعَهُ حَاجًّا، فَلَمَّا كُنَّا بِظَهْرَانَ ذَهَبَ عُمَرُ لِحَاجَتِهِ فَقَالَ أَدْرِكْنِي بِالْوَضُوءِ فَأَدْرَكْتُهُ بِالإِدَاوَةِ، فَجَعَلْتُ أَسْكُبُ عَلَيْهِ وَرَأَيْتُ مَوْضِعًا فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ اللَّتَانِ تَظَاهَرَتَا قَالَ ابْنُ عَبَّاسٍ فَمَا أَتْمَمْتُ كَلاَمِي حَتَّى قَالَ عَائِشَةُ وَحَفْصَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4915In-book reference : Book 65, Hadith 435USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 437   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4916,
    "id": 4916,
    "url": "https://sunnah.com/bukhari:4916",
    "bookNumber": 65,
    "hadithNumber": 436,
    "narrator": "Narrated `Umar:",
    "english": "The wives of the Prophet (ﷺ) out of their jealousy, backed each other against the Prophet, so I said to \nthem, \"It may be, if he divorced you all, that Allah will give him, instead of you wives better than \nyou.\" So this Verse was revealed. (66.5)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ اجْتَمَعَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم فِي الْغَيْرَةِ عَلَيْهِ فَقُلْتُ لَهُنَّ عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4916In-book reference : Book 65, Hadith 436USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 438   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4917,
    "id": 4917,
    "url": "https://sunnah.com/bukhari:4917",
    "bookNumber": 65,
    "hadithNumber": 437,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(regarding the Verse):-- 'Cruel after all that, base-born (of illegitimate birth).' (68.13) It was revealed \nin connection with a man from Quaraish who had a notable sign (Zanamah) similar to the notable sign \nwhich usually-hung on the neck of a sheep (to recognize it).",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏عُتُلٍّ بَعْدَ ذَلِكَ زَنِيمٍ‏}‏ قَالَ رَجُلٌ مِنْ قُرَيْشٍ لَهُ زَنَمَةٌ مِثْلُ زَنَمَةِ الشَّاةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4917In-book reference : Book 65, Hadith 437USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 439   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4918,
    "id": 4918,
    "url": "https://sunnah.com/bukhari:4918",
    "bookNumber": 65,
    "hadithNumber": 438,
    "narrator": "Narrated Haritha bin Wahb Al-Khuza`i:",
    "english": "I heard the Prophet (ﷺ) saying. \"May I tell you of the people of Paradise? Every weak and poor obscure \nperson whom the people look down upon but his oath is fulfilled by Allah when he takes an oath to do \nsomething. And may I inform you of the people of the Hell-Fire? They are all those violent, arrogant \nand stubborn people.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ، أَلاَ أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُسْتَكْبِرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4918In-book reference : Book 65, Hadith 438USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 440   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4919,
    "id": 4919,
    "url": "https://sunnah.com/bukhari:4919",
    "bookNumber": 65,
    "hadithNumber": 439,
    "narrator": "Narrated Abu Sa`id:",
    "english": "I heard the Prophet (ﷺ) saying, \"Our Lord Allah will lay bare His Shin, and then all the Believers, men and women, will prostrate themselves before Him, but there will remain those who used to prostrate in the world for showing off and for gaining good reputation. Such people will try to prostrate (on the Day of Judgment) but their back swill be as stiff as if it is one bone (a single vertebra).",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَكْشِفُ رَبُّنَا عَنْ سَاقِهِ فَيَسْجُدُ لَهُ كُلُّ مُؤْمِنٍ وَمُؤْمِنَةٍ، وَيَبْقَى مَنْ كَانَ يَسْجُدُ فِي الدُّنْيَا رِئَاءً وَسُمْعَةً، فَيَذْهَبُ لِيَسْجُدَ فَيَعُودُ ظَهْرُهُ طَبَقًا وَاحِدًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4919In-book reference : Book 65, Hadith 439USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 441   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4920,
    "id": 4920,
    "url": "https://sunnah.com/bukhari:4920",
    "bookNumber": 65,
    "hadithNumber": 440,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "All the idols which were worshiped by the people of Noah were worshiped by the Arabs later on. \nAs for the idol Wadd, it was worshiped by the tribe of Kalb at Daumat-al-Jandal; Suwa` was the idol \nof (the tribe of) Hudhail; Yaghouth was worshiped by (the tribe of) Murad and then by Bani Ghutaif at Al-Jurf near Saba; Ya`uq was the idol of Hamdan, \nand Nasr was the idol of Himyar, the branch of Dhi-al-Kala`. The names (of the idols) formerly \nbelonged to some pious men of the people of Noah, and when they died Satan inspired their people to \n(prepare and place idols at the places where they used to sit, and to call those idols by their names. \nThe people did so, but the idols were not worshiped till those people (who initiated them) had died \nand the origin of the idols had become obscure, whereupon people began worshiping them.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، وَقَالَ، عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ صَارَتِ الأَوْثَانُ الَّتِي كَانَتْ فِي قَوْمِ نُوحٍ فِي الْعَرَبِ بَعْدُ، أَمَّا وُدٌّ كَانَتْ لِكَلْبٍ بِدَوْمَةِ الْجَنْدَلِ، وَأَمَّا سُوَاعٌ كَانَتْ لِهُذَيْلٍ، وَأَمَّا يَغُوثُ فَكَانَتْ لِمُرَادٍ ثُمَّ لِبَنِي غُطَيْفٍ بِالْجُرُفِ عِنْدَ سَبَا، وَأَمَّا يَعُوقُ فَكَانَتْ لِهَمْدَانَ، وَأَمَّا نَسْرٌ فَكَانَتْ لِحِمْيَرَ، لآلِ ذِي الْكَلاَعِ‏.‏ أَسْمَاءُ رِجَالٍ صَالِحِينَ مِنْ قَوْمِ نُوحٍ، فَلَمَّا هَلَكُوا أَوْحَى الشَّيْطَانُ إِلَى قَوْمِهِمْ أَنِ انْصِبُوا إِلَى مَجَالِسِهِمُ الَّتِي كَانُوا يَجْلِسُونَ أَنْصَابًا، وَسَمُّوهَا بِأَسْمَائِهِمْ فَفَعَلُوا فَلَمْ تُعْبَدْ حَتَّى إِذَا هَلَكَ أُولَئِكَ وَتَنَسَّخَ الْعِلْمُ عُبِدَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4920In-book reference : Book 65, Hadith 440USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 442   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4921,
    "id": 4921,
    "url": "https://sunnah.com/bukhari:4921",
    "bookNumber": 65,
    "hadithNumber": 441,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) went out along with a group of his companions towards `Ukaz Market. At that time \nsomething intervened between the devils and the news of the Heaven, and flames were sent down \nupon them, so the devils returned. Their fellow-devils said, \"What is wrong with you? \" They said, \n\"Something has intervened between us and the news of the Heaven, and fires (flames) have been shot \nat us.\" Their fellow-devils said, \"Nothing has intervened between you and the news of the Heaven, but \nan important event has happened. Therefore, travel all over the world, east and west, and try to find \nout what has happened.\" And so they set out and travelled all over the world, east and west, looking \nfor that thing which intervened between them and the news of the Heaven. Those of the devils who \nhad set out towards Tihama, went to Allah's Messenger (ﷺ) at Nakhla (a place between Mecca and Taif) \nwhile he was on his way to `Ukaz Market. (They met him) while he was offering the Fajr prayer with \nhis companions. When they heard the Holy Qur'an being recited (by Allah's Messenger (ﷺ)), they listened to \nit and said (to each other). This is the thing which has intervened between you and the news of the \nHeavens.\" Then they returned to their people and said, \"O our people! We have really heard a \nwonderful recital (Qur'an). It gives guidance to the right, and we have believed therein. We shall not \njoin in worship, anybody with our Lord.\" (See 72.1-2) Then Allah revealed to His Prophet (Surat al- \nJinn): \n'Say: It has been revealed to me that a group (3 to 9) of Jinns listened (to the Qur'an).' (72.1) The \nstatement of the Jinns was revealed to him .",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ، وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ فَرَجَعَتِ الشَّيَاطِينُ فَقَالُوا مَا لَكُمْ فَقَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ‏.‏ قَالَ مَا حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ إِلاَّ مَا حَدَثَ، فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَانْظُرُوا مَا هَذَا الأَمْرُ الَّذِي حَدَثَ‏.‏ فَانْطَلَقُوا فَضَرَبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا يَنْظُرُونَ مَا هَذَا الأَمْرُ الَّذِي حَالَ بَيْنَهُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ قَالَ فَانْطَلَقَ الَّذِينَ تَوَجَّهُوا نَحْوَ تِهَامَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِنَخْلَةَ، وَهْوَ عَامِدٌ إِلَى سُوقِ عُكَاظٍ، وَهْوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ، فَلَمَّا سَمِعُوا الْقُرْآنَ تَسَمَّعُوا لَهُ فَقَالُوا هَذَا الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ فَهُنَالِكَ رَجَعُوا إِلَى قَوْمِهِمْ فَقَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ، وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا‏.‏ وَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ صلى الله عليه وسلم ‏{‏قُلْ أُوحِيَ إِلَىَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ‏}‏ وَإِنَّمَا أُوحِيَ إِلَيْهِ قَوْلُ الْجِنِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4921In-book reference : Book 65, Hadith 441USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 443   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4922,
    "id": 4922,
    "url": "https://sunnah.com/bukhari:4922",
    "bookNumber": 65,
    "hadithNumber": 442,
    "narrator": "Narrated Yahya bin Abi Kathir:",
    "english": "I asked Aba Salama bin `Abdur-Rahman about the first Sura revealed of the Qur'an. He replied \"O \nyou, wrapped-up (i.e. Al Muddaththir).\" I said, \"They say it was, 'Read, in the Name of your Lord \nWho created,' (i.e. Surat Al-`Alaq (the Clot).\" On that, Abu Salama said, \"I asked Jabir bin `Abdullah \nabout that, saying the same as you have said, whereupon he said, 'I will not tell you except what \nAllah's Messenger (ﷺ) had told us. Allah's Messenger (ﷺ) said, \"I was in seclusion in the cave of Hiram', and after I \ncompleted the limited period of my seclusion. I came down (from the cave) and heard a voice calling \nme. I looked to my right, but saw nothing. Then I looked up and saw something. So I went to Khadija \n(the Prophet's wife) and told her to wrap me up and pour cold water on me. So they wrapped me up \nand poured cold water on me.\" Then, 'O you, (Muhammad) wrapped up! Arise and warn,' (Surat Al \nMuddaththir) was revealed.\" (74.1)",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، سَأَلْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ عَنْ أَوَّلِ، مَا نَزَلَ مِنَ الْقُرْآنِ‏.‏ قَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ قُلْتُ يَقُولُونَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ‏}‏ فَقَالَ أَبُو سَلَمَةَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ رضى الله عنهما عَنْ ذَلِكَ وَقُلْتُ لَهُ مِثْلَ الَّذِي قُلْتَ فَقَالَ جَابِرٌ لاَ أُحَدِّثُكَ إِلاَّ مَا حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ جَاوَرْتُ بِحِرَاءٍ، فَلَمَّا قَضَيْتُ جِوَارِي هَبَطْتُ فَنُودِيتُ فَنَظَرْتُ عَنْ يَمِينِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ عَنْ شِمَالِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ أَمَامِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ خَلْفِي فَلَمْ أَرَ شَيْئًا، فَرَفَعْتُ رَأْسِي فَرَأَيْتُ شَيْئًا، فَأَتَيْتُ خَدِيجَةَ فَقُلْتُ دَثِّرُونِي وَصُبُّوا عَلَىَّ مَاءً بَارِدًا ـ قَالَ ـ فَدَثَّرُونِي وَصَبُّوا عَلَىَّ مَاءً بَارِدًا قَالَ فَنَزَلَتْ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ‏}‏ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4922In-book reference : Book 65, Hadith 442USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 444   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4923,
    "id": 4923,
    "url": "https://sunnah.com/bukhari:4923",
    "bookNumber": 65,
    "hadithNumber": 443,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"I was in a seclusion in the cave of Hira.........\"(similar to the narration related by \n`Ali bin Al-Mubarak, 444 above).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَغَيْرُهُ، قَالاَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ جَاوَرْتُ بِحِرَاءٍ ‏\"‏‏.‏ مِثْلَ حَدِيثِ عُثْمَانَ بْنِ عُمَرَ عَنْ عَلِيِّ بْنِ الْمُبَارَكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4923In-book reference : Book 65, Hadith 443USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 445   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4924,
    "id": 4924,
    "url": "https://sunnah.com/bukhari:4924",
    "bookNumber": 65,
    "hadithNumber": 444,
    "narrator": "Narrated Yahya:",
    "english": "I asked Aba Salama, \"Which Sura of the Qur'an was revealed first?\" He replied, \"O you, wrapped-up' \n(Al-Muddaththir).\" I said, \"I have been informed that it was, 'Read, in the Name of your Lord who \ncreated (i.e. Surat Al-Alaq)...similar to the narration related by `Ali bin Al-Mubarak, 444 above).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى، قَالَ سَأَلْتُ أَبَا سَلَمَةَ أَىُّ الْقُرْآنِ أُنْزِلَ أَوَّلُ فَقَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ فَقُلْتُ أُنْبِئْتُ أَنَّهُ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ‏}‏ فَقَالَ أَبُو سَلَمَةَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ أَىُّ الْقُرْآنِ أُنْزِلَ أَوَّلُ فَقَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ فَقُلْتُ أُنْبِئْتُ أَنَّهُ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ‏}‏ فَقَالَ لاَ أُخْبِرُكَ إِلاَّ بِمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ جَاوَرْتُ فِي حِرَاءٍ فَلَمَّا قَضَيْتُ جِوَارِي، هَبَطْتُ فَاسْتَبْطَنْتُ الْوَادِيَ فَنُودِيتُ، فَنَظَرْتُ أَمَامِي وَخَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي فَإِذَا هُوَ جَالِسٌ عَلَى عَرْشٍ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَأَتَيْتُ خَدِيجَةَ فَقُلْتُ دَثِّرُونِي وَصُبُّوا عَلَىَّ مَاءً بَارِدًا، وَأُنْزِلَ عَلَىَّ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4924In-book reference : Book 65, Hadith 444USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4925,
    "id": 4925,
    "url": "https://sunnah.com/bukhari:4925",
    "bookNumber": 65,
    "hadithNumber": 445,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I heard the Prophet (ﷺ) describing the period of pause of the Divine Inspiration. He said in his talk, \n\"While I was walking, I heard voices from the sky. I looked up, and behold ! I saw the same Angel \nwho came to me in the cave of Hira' sitting on a chair between the sky and the earth. I was too much \nafraid of him (so I returned to my house) and said, 'Fold me up in garments!' They wrapped me up. \nThen Allah revealed: 'O you wrapped...and desert the idols before the prayer became compulsory.' \nRujz means idols.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، فَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ فَقَالَ فِي حَدِيثِهِ ‏\"‏ فَبَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ رَأْسِي فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَجَئِثْتُ مِنْهُ رُعْبًا فَرَجَعْتُ فَقُلْتُ زَمِّلُونِي زَمِّلُونِي‏.‏ فَدَثَّرُونِي فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ إِلَى ‏{‏وَالرِّجْزَ فَاهْجُرْ‏}‏ ـ قَبْلَ أَنْ تُفْرَضَ الصَّلاَةُ ـ وَهْىَ الأَوْثَانُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4925In-book reference : Book 65, Hadith 445USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4926,
    "id": 4926,
    "url": "https://sunnah.com/bukhari:4926",
    "bookNumber": 65,
    "hadithNumber": 446,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "That he heard Allah's Messenger (ﷺ) describing the period of pause of the Divine Inspiration, and in his \ndescription he said, \"While I was walking I heard a voice from the sky. I looked up towards the sky, \nand behold! I saw the same Angel who came to me in the Cave of Hira', sitting on a chair between the \nsky and the earth. I was so terrified by him that I fell down on the ground. Then I went to my wife and \nsaid, 'Wrap me in garments! Wrap me in garments!' They wrapped me, and then Allah revealed: \n\"O you, (Muhammad) wrapped-up! Arise and warn...and desert the idols.\" (74.1-5) Abu Salama \nsaid....Rujz means idols.\" After that, the Divine Inspiration started coming more frequently and \nregularly.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ ‏\"‏ فَبَيْنَا أَنَا أَمْشِي سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ بَصَرِي قِبَلَ السَّمَاءِ، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ قَاعِدٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَجَئِثْتُ مِنْهُ حَتَّى هَوَيْتُ إِلَى الأَرْضِ، فَجِئْتُ أَهْلِي فَقُلْتُ زَمِّلُونِي زَمِّلُونِي‏.‏ فَزَمَّلُونِي فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ إِلَى قَوْلِهِ ‏{‏فَاهْجُرْ‏}‏ ‏\"‏ ـ قَالَ أَبُو سَلَمَةَ وَالرِّجْزَ الأَوْثَانَ ـ ‏\"‏ ثُمَّ حَمِيَ الْوَحْىُ وَتَتَابَعَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4926In-book reference : Book 65, Hadith 446USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 448   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4927,
    "id": 4927,
    "url": "https://sunnah.com/bukhari:4927",
    "bookNumber": 65,
    "hadithNumber": 447,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) used to move his tongue when the divine Inspiration was being revealed to him. (Sufyan, \na subnarrator, demonstrated (how the Prophet (ﷺ) used to move his lips) and added. \"In order to memorize \nit.\" So Allah revealed: \"Move not your tongue concerning (the Qur'an) to make haste therewith.\" \n(75.16)",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ ـ وَكَانَ ثِقَةً ـ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا نَزَلَ عَلَيْهِ الْوَحْىُ حَرَّكَ بِهِ لِسَانَهُ ـ وَوَصَفَ سُفْيَانُ ـ يُرِيدُ أَنْ يَحْفَظَهُ فَأَنْزَلَ اللَّهُ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4927In-book reference : Book 65, Hadith 447USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4928,
    "id": 4928,
    "url": "https://sunnah.com/bukhari:4928",
    "bookNumber": 65,
    "hadithNumber": 448,
    "narrator": "Narrated Musa bin Abi Aisha:",
    "english": "That he asked Sa`id bin Jubair regarding (the statement of Allah). 'Move not your tongue concerning \n(the Qur'an) to make haste therewith.' He said, \"Ibn `Abbas said that the Prophet (ﷺ) used to move his lips \nwhen the Divine Inspiration was being revealed to him. So the Prophet (ﷺ) was ordered not to move his \ntongue, which he used to do, lest some words should escape his memory. 'It is for Us to collect it' \nmeans, We will collect it in your chest;' and its recitation' means, We will make you recite it. 'But \nwhen We recite it (i.e. when it is revealed to you), follow its recital; it is for Us to explain it and make \nit clear,' (i.e. We will explain it through your tongue).",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ جُبَيْرٍ عَنْ قَوْلِهِ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ قَالَ وَقَالَ ابْنُ عَبَّاسٍ كَانَ يُحَرِّكُ شَفَتَيْهِ إِذَا أُنْزِلَ عَلَيْهِ، فَقِيلَ لَهُ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ ـ يَخْشَى أَنْ يَنْفَلِتَ مِنْهُ ـ ‏{‏إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ أَنْ نَجْمَعَهُ فِي صَدْرِكَ، وَقُرْآنَهُ أَنْ تَقْرَأَهُ ‏{‏فَإِذَا قَرَأْنَاهُ‏}‏ يَقُولُ أُنْزِلَ عَلَيْهِ ‏{‏فَاتَّبِعْ قُرْآنَهُ * ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ أَنْ نُبَيِّنَهُ عَلَى لِسَانِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4928In-book reference : Book 65, Hadith 448USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 450   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4929,
    "id": 4929,
    "url": "https://sunnah.com/bukhari:4929",
    "bookNumber": 65,
    "hadithNumber": 449,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(as regards) Allah's Statement: \n\"Move not your tongue concerning (the Qur'an) to make haste therewith.\" (75.16) \nWhen Gabriel revealed the Divine Inspiration in Allah's Messenger (ﷺ) , he (Allah's Messenger (ﷺ)) moved his \ntongue and lips, and that state used to be very hard for him, and that movement indicated that \nrevelation was taking place. So Allah revealed in Surat Al-Qiyama which begins: \n'I do swear by the Day of Resurrection...' (75) the Verses:-- \n'Move not your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it \n(Qur'an) in your mind, and give you the ability to recite it by heart. (75.16-17) Ibn `Abbas added: It is \nfor Us to collect it (Qur'an) (in your mind), and give you the ability to recite it by heart means, \"When \nWe reveal it, listen. Then it is for Us to explain it,\" means, 'It is for us to explain it through your \ntongue.' So whenever Gabriel came to Allah's Messenger (ﷺ) ' he would keep quiet (and listen), and when the \nAngel left, the Prophet (ﷺ) would recite that revelation as Allah promised him.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ جِبْرِيلُ بِالْوَحْىِ، وَكَانَ مِمَّا يُحَرِّكُ بِهِ لِسَانَهُ وَشَفَتَيْهِ فَيَشْتَدُّ عَلَيْهِ وَكَانَ يُعْرَفُ مِنْهُ، فَأَنْزَلَ اللَّهُ الآيَةَ الَّتِي فِي ‏{‏لاَ أُقْسِمُ بِيَوْمِ الْقِيَامَةِ‏}‏ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ قَالَ عَلَيْنَا أَنْ نَجْمَعَهُ فِي صَدْرِكَ، وَقُرْآنَهُ ‏{‏فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ فَإِذَا أَنْزَلْنَاهُ فَاسْتَمِعْ ‏{‏ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ عَلَيْنَا أَنْ نُبَيِّنَهُ بِلِسَانِكَ ـ قَالَ ـ فَكَانَ إِذَا أَتَاهُ جِبْرِيلُ أَطْرَقَ، فَإِذَا ذَهَبَ قَرَأَهُ كَمَا وَعَدَهُ اللَّهُ‏.‏ ‏{‏أَوْلَى لَكَ فَأَوْلَى‏}‏ تَوَعُّدٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4929In-book reference : Book 65, Hadith 449USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4930,
    "id": 4930,
    "url": "https://sunnah.com/bukhari:4930",
    "bookNumber": 65,
    "hadithNumber": 450,
    "narrator": "Narrated `Abdullah:",
    "english": "We were with the Prophet (ﷺ) when Surat Wal-Mursalat was revealed to him. While we were receiving it \nfrom his mouth, a snake suddenly came and we ran to kill it, but it outstripped us and entered its hole \nquickly. Allah's le said, \"It has escaped your evil, and you too, have escaped its evil.\"",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُنْزِلَتْ عَلَيْهِ وَالْمُرْسَلاَتِ، وَإِنَّا لَنَتَلَقَّاهَا مِنْ فِيهِ فَخَرَجَتْ حَيَّةٌ، فَابْتَدَرْنَاهَا فَسَبَقَتْنَا فَدَخَلَتْ جُحْرَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وُقِيَتْ شَرَّكُمْ، كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4930In-book reference : Book 65, Hadith 450USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4931,
    "id": 4931,
    "url": "https://sunnah.com/bukhari:4931",
    "bookNumber": 65,
    "hadithNumber": 451,
    "narrator": "Narrated `Abdullah:",
    "english": "(Similarly--as no. 452 above.)",
    "arabic": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، بِهَذَا‏.‏ وَعَنْ إِسْرَائِيلَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، مِثْلَهُ‏.‏ وَتَابَعَهُ أَسْوَدُ بْنُ عَامِرٍ عَنْ إِسْرَائِيلَ،‏.‏ وَقَالَ حَفْصٌ وَأَبُو مُعَاوِيَةَ وَسُلَيْمَانُ بْنُ قَرْمٍ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ،‏.‏       \nقَالَ يَحْيَى بْنُ حَمَّادٍ أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ،‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ.",
    "reference": "Reference : Sahih al-Bukhari 4931In-book reference : Book 65, Hadith 451USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 453   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4932,
    "id": 4932,
    "url": "https://sunnah.com/bukhari:4932",
    "bookNumber": 65,
    "hadithNumber": 453,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(as regards the explanation of Hadith 454). 'Indeed, it (Hell) throws about sparks (huge) as Forts.' We \nused to collect wood in the form of logs, three cubits long or shorter. for heating purposes in winter., \nand we used to call such wood, the Qasr.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، إِنَّهَا تَرْمِي بِشَرَرٍ كَالْقَصْرِ قَالَ كُنَّا نَرْفَعُ الْخَشَبَ بِقَصَرٍ ثَلاَثَةَ أَذْرُعٍ أَوْ أَقَلَّ، فَنَرْفَعُهُ لِلشِّتَاءِ فَنُسَمِّيهِ الْقَصَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4932In-book reference : Book 65, Hadith 453USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4933,
    "id": 4933,
    "url": "https://sunnah.com/bukhari:4933",
    "bookNumber": 65,
    "hadithNumber": 454,
    "narrator": "Narrated Ibn 'Abbas:",
    "english": "(regarding) the explanation of \"... It throws\nsparks as Al-Qasr ...\" (V. 77:32):\nWe used to collect logs of wood, three\ncubits long or longer, to store for heating\npurposes in winter, and we used to call it Al-\nQasr, it also means a castle or a fort.\n\"As if they were Jimalatun Sufr (yellow\ncamels or bundles of ropes)\" (V.77:33):\nmeans the ropes of a ship which are made in\nbundles till it become as wide as men's waists.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏تَرْمِي بِشَرَرٍ‏}‏ كُنَّا نَعْمِدُ إِلَى الْخَشَبَةِ ثَلاَثَةَ أَذْرُعٍ وَفَوْقَ ذَلِكَ، فَنَرْفَعُهُ لِلشِّتَاءِ فَنُسَمِّيهِ الْقَصَرَ‏.‏ ‏{‏كَأَنَّهُ جِمَالاَتٌ صُفْرٌ‏}‏ حِبَالُ السُّفْنِ تُجْمَعُ حَتَّى تَكُونَ كَأَوْسَاطِ الرِّجَالِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4933In-book reference : Book 65, Hadith 454USC-MSA web (English) reference : Vol. 1, Book 60, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4934,
    "id": 4934,
    "url": "https://sunnah.com/bukhari:4934",
    "bookNumber": 65,
    "hadithNumber": 455,
    "narrator": "Narrated `Abdullah:",
    "english": "While we were with the Prophet (ﷺ) in a cave, Surat wal-Mursalat was revealed to him and he recited it, \nand I heard it directly from his mouth as soon as he recited its revelation. Suddenly a snake sprang at \nus, and the Prophet (ﷺ) said, \"Kill it!\" We ran to kill it but it escaped quickly. The Prophet (ﷺ) said. \"It has \nescaped your evil, and you too have escaped its evil.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَارٍ إِذْ نَزَلَتْ عَلَيْهِ وَالْمُرْسَلاَتِ، فَإِنَّهُ لَيَتْلُوهَا وَإِنِّي لأَتَلَقَّاهَا مِنْ فِيهِ وَإِنَّ فَاهُ لَرَطْبٌ بِهَا، إِذْ وَثَبَتْ عَلَيْنَا حَيَّةٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْتُلُوهَا ‏\"‏‏.‏ فَابْتَدَرْنَاهَا فَذَهَبَتْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وُقِيَتْ شَرَّكُمْ، كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏ قَالَ عُمَرُ حَفِظْتُهُ مِنْ أَبِي فِي غَارٍ بِمِنًى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4934In-book reference : Book 65, Hadith 455USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4935,
    "id": 4935,
    "url": "https://sunnah.com/bukhari:4935",
    "bookNumber": 65,
    "hadithNumber": 456,
    "narrator": "Narrated Al--A`mash:",
    "english": "Abu Huraira said, \"Allah's Messenger (ﷺ) said, 'Between the two sounds of the trumpet, there will be forty.\" \nSomebody asked Abu Huraira, \"Forty days?\" But he refused to reply. Then he asked, \"Forty months?\" \nHe refused to reply. Then he asked, \"Forty years?\" Again, he refused to reply. Abu Huraira added. \n\"Then (after this period) Allah will send water from the sky and then the dead bodies will grow like \nvegetation grows, There is nothing of the human body that does not decay except one bone; that is the \nlittle bone at the end of the coccyx of which the human body will be recreated on the Day of \nResurrection.\" (See Hadith No. 338)",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُونَ ‏\"‏‏.‏ قَالَ أَرْبَعُونَ يَوْمًا قَالَ أَبَيْتُ‏.‏ قَالَ أَرْبَعُونَ شَهْرًا قَالَ أَبَيْتُ‏.‏ قَالَ أَرْبَعُونَ سَنَةً قَالَ أَبَيْتُ‏.‏ قَالَ ‏\"‏ ثُمَّ يُنْزِلُ اللَّهُ مِنَ السَّمَاءِ مَاءً‏.‏ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْبَقْلُ لَيْسَ مِنَ الإِنْسَانِ شَىْءٌ إِلاَّ يَبْلَى إِلاَّ عَظْمًا وَاحِدًا وَهْوَ عَجْبُ الذَّنَبِ، وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4935In-book reference : Book 65, Hadith 456USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 457   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4936,
    "id": 4936,
    "url": "https://sunnah.com/bukhari:4936",
    "bookNumber": 65,
    "hadithNumber": 457,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "I saw Allah's Messenger (ﷺ) pointing with his index and middle fingers, saying. \"The time of my Advent and \nthe Hour are like these two fingers.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ بِإِصْبَعَيْهِ هَكَذَا بِالْوُسْطَى وَالَّتِي تَلِي الإِبْهَامَ ‏\n\"‏ بُعِثْتُ وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4936In-book reference : Book 65, Hadith 457USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4937,
    "id": 4937,
    "url": "https://sunnah.com/bukhari:4937",
    "bookNumber": 65,
    "hadithNumber": 458,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) said, \"Such a person as recites the Qur'an and masters it by heart, will be with the noble \nrighteous scribes (in Heaven). And such a person exerts himself to learn the Qur'an by heart, and \nrecites it with great difficulty, will have a double reward.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى، يُحَدِّثُ عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهْوَ حَافِظٌ لَهُ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ، وَمَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهْوَ يَتَعَاهَدُهُ وَهْوَ عَلَيْهِ شَدِيدٌ، فَلَهُ أَجْرَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4937In-book reference : Book 65, Hadith 458USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4938,
    "id": 4938,
    "url": "https://sunnah.com/bukhari:4938",
    "bookNumber": 65,
    "hadithNumber": 459,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"On the Day when all mankind will stand before the Lord of the Worlds, some of \nthem will be enveloped in their sweat up to the middle of their ears.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ ‏{‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ حَتَّى يَغِيبَ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4938In-book reference : Book 65, Hadith 459USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 460   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4939,
    "id": 4939,
    "url": "https://sunnah.com/bukhari:4939",
    "bookNumber": 65,
    "hadithNumber": 460,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) said,\" (On the Day of Resurrection) any one whose account will be taken will be \nruined (i.e. go to Hell).\" I said, \"O Allah's Messenger (ﷺ)! May Allah make me be sacrificed for you. Doesn't \nAllah say: \n\"Then as for him who will be given his record in his right hand, he surely will receive an easy \nreckoning.?\" (84.7-8) He replied, \"That is only the presentation of the accounts; but he whose record \nis questioned, will be ruined.\"\n\n(This hadith is also narrated through two other chains)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ أَبِي يُونُسَ، حَاتِمِ بْنِ أَبِي صَغِيرَةَ عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ إِلاَّ هَلَكَ ‏\"‏‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ، أَلَيْسَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ ‏{‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏‏.‏ قَالَ ‏\"‏ ذَاكَ الْعَرْضُ يُعْرَضُونَ، وَمَنْ نُوقِشَ الْحِسَابَ هَلَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4939In-book reference : Book 65, Hadith 460USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 463   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4940,
    "id": 4940,
    "url": "https://sunnah.com/bukhari:4940",
    "bookNumber": 65,
    "hadithNumber": 461,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(as regards the Verse):--'You shall surely travel from stage to stage (in this life and in the Hereafter).' \n(It means) from one state to another. That concerns your Prophet.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ النَّضْرِ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، جَعْفَرُ بْنُ إِيَاسٍ عَنْ مُجَاهِدٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ ‏{‏لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ‏}‏ حَالاً بَعْدَ حَالٍ، قَالَ هَذَا نَبِيُّكُمْ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4940In-book reference : Book 65, Hadith 461USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 464   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4941,
    "id": 4941,
    "url": "https://sunnah.com/bukhari:4941",
    "bookNumber": 65,
    "hadithNumber": 462,
    "narrator": "Narrated Al-Bara:",
    "english": "The first of the companions of the Prophet (ﷺ) who came to us (in Medina), were Mus`ab bin `Umar and \nIbn Um Maktum, and they started teaching us the Qur'an. Then came `Ammar, Bilal and Sa`d. \nAfterwards `Umar bin Al-Kkattab came along with a batch of twenty (men): and after that the Prophet (ﷺ) \ncame. I never saw the people of Medina so pleased with anything as they were with his arrival, so that \neven the little boys and girls were saying, \"This is Allah's Messenger (ﷺ) who has come.\" He (the Prophet (ﷺ) ) \ndid not come (to Medina) till I had learnt Surat Al-Ala and also other similar Suras.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَوَّلُ مَنْ قَدِمَ عَلَيْنَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مُصْعَبُ بْنُ عُمَيْرٍ وَابْنُ أُمِّ مَكْتُومٍ فَجَعَلاَ يُقْرِئَانِنَا الْقُرْآنَ، ثُمَّ جَاءَ عَمَّارٌ وَبِلاَلٌ وَسَعْدٌ ثُمَّ جَاءَ عُمَرُ بْنُ الْخَطَّابِ فِي عِشْرِينَ ثُمَّ جَاءَ النَّبِيُّ صلى الله عليه وسلم فَمَا رَأَيْتُ أَهْلَ الْمَدِينَةِ فَرِحُوا بِشَىْءٍ فَرَحَهُمْ بِهِ، حَتَّى رَأَيْتُ الْوَلاَئِدَ وَالصِّبْيَانَ يَقُولُونَ هَذَا رَسُولُ اللَّهِ قَدْ جَاءَ‏.‏ فَمَا جَاءَ حَتَّى قَرَأْتُ ‏{‏سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ فِي سُوَرٍ مِثْلِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4941In-book reference : Book 65, Hadith 462USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 465   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4942,
    "id": 4942,
    "url": "https://sunnah.com/bukhari:4942",
    "bookNumber": 65,
    "hadithNumber": 463,
    "narrator": "Narrated `Abdullah bin Zama:",
    "english": "That he heard the Prophet (ﷺ) delivering a sermon, and he mentioned the shecamel and the one who \nhamstrung it. Allah's Messenger (ﷺ) recited:-- \n'When, the most wicked man among them went forth (to hamstrung the she-camel).' (91.12.) Then he \nsaid, \"A tough man whose equal was rare and who enjoyed the protection of his people, like Abi \nZama went forth to (hamstrung) it.\" The Prophet (ﷺ) then mentioned about the women (in his sermon). \"It \nis not wise for anyone of you to lash his wife like a slave, for he might sleep with her the same \nevening.\" Then he advised them not to laugh when somebody breaks wind and said, \"Why should \nanybody laugh at what he himself does?\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ عَبْدُ اللَّهِ بْنُ زَمْعَةَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ وَذَكَرَ النَّاقَةَ وَالَّذِي عَقَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏{‏إِذِ انْبَعَثَ أَشْقَاهَا‏}‏ انْبَعَثَ لَهَا رَجُلٌ عَزِيزٌ عَارِمٌ، مَنِيعٌ فِي رَهْطِهِ، مِثْلُ أَبِي زَمْعَةَ ‏\"‏‏.‏ وَذَكَرَ النِّسَاءَ فَقَالَ ‏\"‏ يَعْمِدُ أَحَدُكُمْ يَجْلِدُ امْرَأَتَهُ جَلْدَ الْعَبْدِ، فَلَعَلَّهُ يُضَاجِعُهَا مِنْ آخِرِ يَوْمِهِ ‏\"‏‏.‏ ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنَ الضَّرْطَةِ وَقَالَ ‏\"‏ لِمَ يَضْحَكُ أَحَدُكُمْ مِمَّا يَفْعَلُ ‏\"‏‏.‏ وَقَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مِثْلُ أَبِي زَمْعَةَ عَمِّ الزُّبَيْرِ بْنِ الْعَوَّامِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4942In-book reference : Book 65, Hadith 463USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4943,
    "id": 4943,
    "url": "https://sunnah.com/bukhari:4943",
    "bookNumber": 65,
    "hadithNumber": 464,
    "narrator": "Narrated Alqama:",
    "english": "I went to Sham with a group of the companions of `Abdullah (bin Mas`ud). Abu Ad-Darda' heard of \nour arrival so he came to us and said, \"Is there anybody among you who can recite (Qur'an)\" We \nreplied in the affirmative. Then he asked, \"Who is the best reciter?\" They pointed at me. Then he told \nme to recite, so I recited the verse:-- \n'By the night as it envelops 'By the day as it appears in brightness; By (Him Who created) male and \nthe female.' (92.1-3) Abu Ad-Darda' then said to me, \"Did you hear it (like this) from the mouth of \nyour friend (`Abdullah bin Mas`ud)?\" I said, \"Yes.\" He said, \"I too, heard it (like this) from the mouth \nof the Prophet, but these people do not consider this recitation as the correct one.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ دَخَلْتُ فِي نَفَرٍ مِنْ أَصْحَابِ عَبْدِ اللَّهِ الشَّأْمَ فَسَمِعَ بِنَا أَبُو الدَّرْدَاءِ فَأَتَانَا فَقَالَ أَفِيكُمْ مَنْ يَقْرَأُ فَقُلْنَا نَعَمْ‏.‏ قَالَ فَأَيُّكُمْ أَقْرَأُ فَأَشَارُوا إِلَىَّ فَقَالَ اقْرَأْ‏.‏ فَقَرَأْتُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى * وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَنْتَ سَمِعْتَهَا مِنْ فِي صَاحِبِكَ قُلْتُ نَعَمْ‏.‏ قَالَ وَأَنَا سَمِعْتُهَا مِنْ فِي النَّبِيِّ صلى الله عليه وسلم وَهَؤُلاَءِ يَأْبَوْنَ عَلَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4943In-book reference : Book 65, Hadith 464USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 467   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4944,
    "id": 4944,
    "url": "https://sunnah.com/bukhari:4944",
    "bookNumber": 65,
    "hadithNumber": 465,
    "narrator": "Narrated Ibrahim:",
    "english": "The companions of `Abdullah (bin Mas`ud) came to Abu Darda', (and before they arrived at his \nhome), he looked for them and found them. Then he asked them,: 'Who among you can recite (Qur'an) \nas `Abdullah recites it?\" They replied, \"All of us.\" He asked, \"Who among you knows it by heart?\" \nThey pointed at 'Alqama. Then he asked Alqama. \"How did you hear `Abdullah bin Mas`ud reciting \nSurat Al-Lail (The Night)?\" Alqama recited: \n'By the male and the female.' Abu Ad-Darda said, \"I testify that I heard me Prophet reciting it \nlikewise, but these people want me to recite it:-- \n'And by Him Who created male and female.' but by Allah, I will not follow them.\"",
    "arabic": "حَدَّثَنَا عُمَرُ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، قَالَ قَدِمَ أَصْحَابُ عَبْدِ اللَّهِ عَلَى أَبِي الدَّرْدَاءِ فَطَلَبَهُمْ فَوَجَدَهُمْ فَقَالَ أَيُّكُمْ يَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ قَالَ كُلُّنَا‏.‏ قَالَ فَأَيُّكُمْ يَحْفَظُ وَأَشَارُوا إِلَى عَلْقَمَةَ‏.‏ قَالَ كَيْفَ سَمِعْتَهُ يَقْرَأُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى‏}‏‏.‏ قَالَ عَلْقَمَةُ ‏{‏وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَشْهَدُ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ هَكَذَا، وَهَؤُلاَءِ يُرِيدُونِي عَلَى أَنْ أَقْرَأَ ‏{‏وَمَا خَلَقَ الذَّكَرَ وَالأُنْثَى‏}‏ وَاللَّهِ لاَ أُتَابِعُهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4944In-book reference : Book 65, Hadith 465USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 468   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4945,
    "id": 4945,
    "url": "https://sunnah.com/bukhari:4945",
    "bookNumber": 65,
    "hadithNumber": 466,
    "narrator": "Narrated `Ali:",
    "english": "We were in the company of the Prophet (ﷺ) in a funeral procession at Baqi Al-Gharqad. He said, \"There is \nnone of you but has his place written for him in Paradise or in the Hell- Fire.\" They said, \"O Allah's \nApostle! Shall we depend (on this fact and give up work)?\" He said, \"Carry on doing (good deeds), for \nevery body will find it easy to do (what will lead him to his destined place).\" Then he recited: \n'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best reward from \nAllah (i.e. Allah will compensate him for what he will spend in Allah's way). So, We will make \nsmooth for him the path of ease. But he who is a greedy miser....for him, the path for evil.' (92.5-10)",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَقِيعِ الْغَرْقَدِ فِي جَنَازَةٍ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ الْجَنَّةِ وَمَقْعَدُهُ مِنَ النَّارِ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ فَقَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ إِلَى قَوْلِهِ ‏{‏لِلْعُسْرَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4945In-book reference : Book 65, Hadith 466USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 469   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4946,
    "id": 4946,
    "url": "https://sunnah.com/bukhari:4946",
    "bookNumber": 65,
    "hadithNumber": 468,
    "narrator": "Narrated `Ali:",
    "english": "While the Prophet (ﷺ) was in a funeral procession, he took a small stick and started scraping the earth \nwith it and said, \"There is none among you but has his place written for him, either in the Hell Fire or \nin Paradise.\" They (the people) said, \"Allah's Messenger (ﷺ)! Shall we depend on this (and leave work)?\" He \nreplied. \"Carry on doing (good deeds), for everybody will find easy (to do) such deeds as will lead \nhim to his destined place.\" The Prophet (ﷺ) then recited:-- \n'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best \nReward.'.....(92.5-10)",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ أَنَّهُ كَانَ فِي جَنَازَةٍ فَأَخَذَ عُودًا يَنْكُتُ فِي الأَرْضِ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ أَوْ مِنَ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏ قَالَ شُعْبَةُ وَحَدَّثَنِي بِهِ مَنْصُورٌ فَلَمْ أُنْكِرْهُ مِنْ حَدِيثِ سُلَيْمَانَ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4946In-book reference : Book 65, Hadith 468USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 471   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4947,
    "id": 4947,
    "url": "https://sunnah.com/bukhari:4947",
    "bookNumber": 65,
    "hadithNumber": 469,
    "narrator": "Narrated `Ali:",
    "english": "We were in the company of the Prophet (ﷺ) and he said, \"There is none among you but has his place \nwritten for him, either in Paradise or in the Hell-Fire.\" We said, \"O Allah's Messenger (ﷺ)! Shall we depend \n(on this fact and give up work)?\" He replied, \"No! Carry on doing good deeds, for everybody will find \neasy (to do) such deeds as will lead him to his destined place.\" Then the Prophet (ﷺ) recited: 'As for him \nwho gives (in charity) and keeps his duty to Allah, and believes in the Best reward. We will make \nsmooth for him the path of ease....the path for evil.' (92.5-10)",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ الْجَنَّةِ وَمَقْعَدُهُ مِنَ النَّارِ ‏\"‏‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ لاَ، اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى * فَسَنُيَسِّرُهُ لِلْيُسْرَى‏}‏ إِلَى قَوْلِهِ ‏{‏فَسَنُيَسِّرُهُ لِلْعُسْرَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4947In-book reference : Book 65, Hadith 469USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 472   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4948,
    "id": 4948,
    "url": "https://sunnah.com/bukhari:4948",
    "bookNumber": 65,
    "hadithNumber": 470,
    "narrator": "Narrated `Ali:",
    "english": "While we were in a funeral procession in Baqi Al-Gharqad, Allah's Messenger (ﷺ) came and sat down, and \nwe sat around him. He had a small stick in his hand and he bent his head and started scraping the \nground with it. He then said, \"There is none among you, and no created soul but has his place written \nfor him either in Paradise or in the Hell-Fire, and also has his happy or miserable fate (in the \nHereafter) written for him.\" A man said, \"O Allah's Messenger (ﷺ)! Shall we depend upon what is written for \nus and give up doing (good) deeds? For whoever among us is destined to be fortunate (in the \nHereafter), will join the fortunate peoples and whoever among us is destined to be miserable will do \nsuch deeds as are characteristic of the people who are destined to misery.\" The Prophet (ﷺ) said, \"Those \nwho are destined to be happy (in the Hereafter) will find it easy and pleasant to do the deeds \ncharacteristic of those destined to happiness, while those who are to be among the miserable (in the \nHereafter), will find it easy to do the deeds characteristic of those destined to misery.\" Then he recited: 'As for him who gives (in charity) and keeps his duty to Allah and believes in the Best reward from Allah,' (92.5-6)",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا فِي جَنَازَةٍ فِي بَقِيعِ الْغَرْقَدِ، فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَعَدَ وَقَعَدْنَا حَوْلَهُ، وَمَعَهُ مِخْصَرَةٌ فَنَكَّسَ، فَجَعَلَ يَنْكُتُ بِمِخْصَرَتِهِ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ وَمَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلاَّ كُتِبَ مَكَانُهَا مِنَ الْجَنَّةِ وَالنَّارِ، وَإِلاَّ قَدْ كُتِبَتْ شَقِيَّةً أَوْ سَعِيدَةً ‏\"‏‏.‏ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ فَمَنْ كَانَ مِنَّا مِنْ أَهْلِ السَّعَادَةِ فَسَيَصِيرُ إِلَى أَهْلِ السَّعَادَةِ، وَمَنْ كَانَ مِنَّا مِنْ أَهْلِ الشَّقَاءِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ الشَّقَاوَةِ‏.‏ قَالَ ‏\"‏ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ السَّعَادَةِ وَأَمَّا أَهْلُ الشَّقَاوَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ الشَّقَاءِ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4948In-book reference : Book 65, Hadith 470USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 473   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4949,
    "id": 4949,
    "url": "https://sunnah.com/bukhari:4949",
    "bookNumber": 65,
    "hadithNumber": 471,
    "narrator": "Narrated `Ali:",
    "english": "While the Prophet (ﷺ) was in a funeral procession. he picked up something and started scraping the \nground with it, and said, \"There is none among you but has his place written for him either in the Hell \nFire or in Paradise.\" They said, \"O Allah's Messenger (ﷺ)! Shall we not depend upon what has been written \nfor us and give up deeds? He said, \"Carry on doing (good) deeds, for everybody will find easy to do \nsuch deeds as will lead him to his destined place for which he has been created. So he who is destined \nto be among the happy (in the Hereafter), will find it easy to do the deeds characteristic of such \npeople, while he who is destined to be among the miserable ones, will find it easy to do the deeds \ncharacteristic of such people.\" Then he recited: \n'As for him who gives (in charity) and fears Allah, and believes in the best....' (92.5-10)",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ، يُحَدِّثُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي جَنَازَةٍ فَأَخَذَ شَيْئًا فَجَعَلَ يَنْكُتُ بِهِ الأَرْضَ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ وَمَقْعَدُهُ مِنَ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ، أَمَّا مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ السَّعَادَةِ، وَأَمَّا مَنْ كَانَ مِنْ أَهْلِ الشَّقَاءِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ الشَّقَاوَةِ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4949In-book reference : Book 65, Hadith 471USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 474   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4950,
    "id": 4950,
    "url": "https://sunnah.com/bukhari:4950",
    "bookNumber": 65,
    "hadithNumber": 472,
    "narrator": "Narrated Jundub bin Sufyan:",
    "english": "Once Allah's Messenger (ﷺ) became sick and could not offer his night prayer (Tahajjud) for two or three \nnights. Then a lady (the wife of Abu Lahab) came and said, \"O Muhammad! I think that your Satan \nhas forsaken you, for I have not seen him with you for two or three nights!\" On that Allah revealed: \n'By the fore-noon, and by the night when it darkens, your Lord (O Muhammad) has neither forsaken \nyou, nor hated you.' (93.1-3)",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، قَالَ سَمِعْتُ جُنْدُبَ بْنَ سُفْيَانَ ـ رضى الله عنه ـ قَالَ اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَقُمْ لَيْلَتَيْنِ أَوْ ثَلاَثًا، فَجَاءَتِ امْرَأَةٌ فَقَالَتْ يَا مُحَمَّدُ إِنِّي لأَرْجُو أَنْ يَكُونَ شَيْطَانُكَ قَدْ تَرَكَكَ، لَمْ أَرَهُ قَرِبَكَ مُنْذُ لَيْلَتَيْنِ أَوْ ثَلاَثًا‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَالضُّحَى * وَاللَّيْلِ إِذَا سَجَى * مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4950In-book reference : Book 65, Hadith 472USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4951,
    "id": 4951,
    "url": "https://sunnah.com/bukhari:4951",
    "bookNumber": 65,
    "hadithNumber": 473,
    "narrator": "Narrated Jundub Al-Bajali:",
    "english": "A lady said, \"O Allah's Messenger (ﷺ)! I see that your friend has delayed. (in conveying Qur'an) to you.\" So \nthere was revealed: 'Your Lord (O Muhammad) has neither forsaken you, not hated you.' (93.1-3)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، غُنْدَرٌ حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، قَالَ سَمِعْتُ جُنْدَبًا الْبَجَلِيَّ، قَالَتِ امْرَأَةٌ يَا رَسُولَ اللَّهِ مَا أُرَى صَاحِبَكَ إِلاَّ أَبْطَأَكَ‏.‏ فَنَزَلَتْ ‏{‏مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4951In-book reference : Book 65, Hadith 473USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 476   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4952,
    "id": 4952,
    "url": "https://sunnah.com/bukhari:4952",
    "bookNumber": 65,
    "hadithNumber": 474,
    "narrator": "Narrated Al-Bara:",
    "english": "While the Prophet (ﷺ) was on a journey, he recited Surat at-Tini waz-Zaituni (95) in one of the first two \nrak`at of the `Isha prayer.",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي سَفَرٍ فَقَرَأَ فِي الْعِشَاءِ فِي إِحْدَى الرَّكْعَتَيْنِ بِالتِّينِ وَالزَّيْتُونِ‏.‏ ‏{‏تَقْوِيمٍ‏}‏ الْخَلْقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4952In-book reference : Book 65, Hadith 474USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4953,
    "id": 4953,
    "url": "https://sunnah.com/bukhari:4953",
    "bookNumber": 65,
    "hadithNumber": 475,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet) The commencement (of the Divine Inspiration) to Allah's Messenger (ﷺ) was in the \nform of true dreams in his sleep, for he never had a dream but it turned out to be true and clear as the \nbright daylight. Then he began to like seclusions, so he used to go in seclusion in the cave of Hira \nwhere he used to worship Allah continuously for many nights before going back to his family to take \nthe necessary provision (of food) for the stay. He come back to (his wife) Khadija again to take his \nprovision (of food) likewise, till one day he received the Guidance while he was in the cave of Hira. \nAn Angel came to him and asked him to read. Allah's Messenger (ﷺ) replied, \"I do not know how to read.\" \nThe Prophet (ﷺ) added, \"Then the Angel held me (forcibly) and pressed me so hard that I felt distressed. \nThen he released me and again asked me to read, and I replied, 'I do not know how to read.' \nThereupon he held me again and pressed me for the second time till I felt distressed. He then released \nme and asked me to read, but again I replied. 'I do not know how to read.' Thereupon he held me for \nthe third time and pressed me till I got distressed, and then he released me and said, 'Read, in the \nName of your Lord Who has created (all that exists), has created man out of a clot, Read! And your \nLord is the Most Generous. Who has taught (the writing) by the pen, has taught man that which he \nknew not.\" (96.1-5). \nThen Allah's Messenger (ﷺ) returned with that experience; and the muscles between his neck and shoulders \nwere trembling till he came upon Khadija (his wife) and said, \"Cover me!\" They covered him, and \nwhen the state of fear was over, he said to Khadija, \"O Khadija! What is wrong with me? I was afraid \nthat something bad might happen to me.\" Then he told her the story. Khadija said, \"Nay! But receive \nthe good tidings! By Allah, Allah will never disgrace you, for by Allah, you keep good relations with \nyour Kith and kin, speak the truth, help the poor and the destitute, entertain your guests generously \nand assist those who are stricken with calamities.\" Khadija then took him to Waraqa bin Naufil, the \nson of Khadija's paternal uncle. Waraqa had been converted to Christianity in the Pre-lslamic Period \nand used to write Arabic and write of the Gospel in Arabic as much as Allah wished him to write. He \nwas an old man and had lost his eyesight. Khadija said (to Waraqa), \"O my cousin! Listen to what \nyour nephew is going to say.\" Waraqa said, \"O my nephew! What have you seen?\" The Prophet (ﷺ) then \ndescribed whatever he had seen. Waraqa said, \"This is the same Angel (Gabriel) who was sent to \nMoses. I wish I were young.\" He added some other statement. Allah's Messenger (ﷺ) asked, \"Will these \npeople drive me out?\" Waraqa said, \"Yes, for nobody brought the like of what you have brought, but \nwas treated with hostility. If I were to remain alive till your day (when you start preaching). then I \nwould support you strongly.\" But a short while later Waraqa died and the Divine Inspiration was \npaused (stopped) for a while so that Allah's Messenger (ﷺ) was very much grieved.",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ مَرْوَانَ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ، أَخْبَرَنَا أَبُو صَالِحٍ، سَلْمَوَيْهِ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ، عَنْ يُونُسَ بْنِ يَزِيدَ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلاَّ جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، ثُمَّ حُبِّبَ إِلَيْهِ الْخَلاَءُ فَكَانَ يَلْحَقُ بِغَارِ حِرَاءٍ فَيَتَحَنَّثُ فِيهِ ـ قَالَ وَالتَّحَنُّثُ التَّعَبُّدُ ـ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ قَبْلَ أَنْ يَرْجِعَ إِلَى أَهْلِهِ، وَيَتَزَوَّدُ لِذَلِكَ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَيَتَزَوَّدُ بِمِثْلِهَا، حَتَّى فَجِئَهُ الْحَقُّ وَهْوَ فِي غَارِ حِرَاءٍ فَجَاءَهُ الْمَلَكُ فَقَالَ اقْرَأْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَنَا بِقَارِئٍ ‏\"‏‏.‏ قَالَ ‏\"‏ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجُهْدُ ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ اقْرَأْ‏.‏ قُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّانِيِةَ حَتَّى بَلَغَ مِنِّي الْجُهْدُ، ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ اقْرَأْ‏.‏ قُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ حَتَّى بَلَغَ مِنِّي الْجُهْدُ ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ‏}‏ ‏\"‏‏.‏ الآيَاتِ إِلَى قَوْلِهِ ‏{‏عَلَّمَ الإِنْسَانَ مَا لَمْ يَعْلَمْ‏}‏ فَرَجَعَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم تَرْجُفُ بَوَادِرُهُ حَتَّى دَخَلَ عَلَى خَدِيجَةَ فَقَالَ ‏\"‏ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ قَالَ لِخَدِيجَةَ ‏\"‏ أَىْ خَدِيجَةُ مَا لِي، لَقَدْ خَشِيتُ عَلَى نَفْسِي ‏\"‏‏.‏ فَأَخْبَرَهَا الْخَبَرَ‏.‏ قَالَتْ خَدِيجَةُ كَلاَّ أَبْشِرْ، فَوَاللَّهِ لاَ يُخْزِيكَ اللَّهُ أَبَدًا، فَوَاللَّهِ إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ الْمَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ فَانْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلٍ وَهْوَ ابْنُ عَمِّ خَدِيجَةَ أَخِي أَبِيهَا، وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعَرَبِيَّ وَيَكْتُبُ مِنَ الإِنْجِيلِ بِالْعَرَبِيَّةِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ فَقَالَتْ خَدِيجَةُ يَا ابْنَ عَمِّ اسْمَعْ مِنِ ابْنِ أَخِيكَ‏.‏ قَالَ وَرَقَةُ يَا ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ النَّبِيُّ صلى الله عليه وسلم خَبَرَ مَا رَأَى‏.‏ فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أُنْزِلَ عَلَى مُوسَى، لَيْتَنِي فِيهَا جَذَعًا، لَيْتَنِي أَكُونُ حَيًّا‏.‏ ذَكَرَ حَرْفًا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَمُخْرِجِيَّ هُمْ ‏\"‏‏.‏ قَالَ وَرَقَةُ نَعَمْ لَمْ يَأْتِ رَجُلٌ بِمَا جِئْتَ بِهِ إِلاَّ أُوذِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ حَيًّا أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الْوَحْىُ، فَتْرَةً حَتَّى حَزِنَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4953In-book reference : Book 65, Hadith 475USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4954,
    "id": 4954,
    "url": "https://sunnah.com/bukhari:4954",
    "bookNumber": 65,
    "hadithNumber": 476,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "While Allah's Messenger (ﷺ) was talking about the period of pause in \nrevelation. he said in his narration. \"Once while I was walking, all of a sudden I heard a voice from \nthe sky. I looked up and saw to my surprise, the same Angel as had visited me in the cave of Hira.' He \nwas sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, \nWrap me! Wrap me!\" So they covered him and then Allah revealed: \n'O you, wrapped up! Arise and warn and your Lord magnify, and your garments purify and dessert the \nidols.' (74.1-5) \nAbu Salama said, \"(Rijz) are the idols which the people of the Pre-lslamic period used to worship.\" \nAfter this the revelation started coming frequently and regularly.",
    "arabic": "قَالَ مُحَمَّدُ بْنُ شِهَابٍ فَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيِّ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ قَالَ فِي حَدِيثِهِ ‏\"‏ بَيْنَا أَنَا أَمْشِي سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ بَصَرِي، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ فَفَرِقْتُ مِنْهُ فَرَجَعْتُ فَقُلْتُ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَدَثَّرُوهُ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ * وَثِيَابَكَ فَطَهِّرْ * وَالرِّجْزَ فَاهْجُرْ‏}‏‏.‏ قَالَ أَبُو سَلَمَةَ وَهْىَ الأَوْثَانُ الَّتِي كَانَ أَهْلُ الْجَاهِلِيَّةِ يَعْبُدُونَ‏.‏ قَالَ ثُمَّ تَتَابَعَ الْوَحْىُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4954In-book reference : Book 65, Hadith 476USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4955,
    "id": 4955,
    "url": "https://sunnah.com/bukhari:4955",
    "bookNumber": 65,
    "hadithNumber": 477,
    "narrator": "Narrated Aisha:",
    "english": "The commencement of the Divine Inspiration to Allah's Messenger (ﷺ) was in the form of true dreams. The \nAngel came to him and said, \"Read, in the Name of your Lord Who has created (all that exists), has \ncreated man a clot. Read! And your Lord is Most Generous\" ..(96.1,2,3)",
    "arabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الرُّؤْيَا الصَّالِحَةُ فَجَاءَهُ الْمَلَكُ فَقَالَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4955In-book reference : Book 65, Hadith 477USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4956,
    "id": 4956,
    "url": "https://sunnah.com/bukhari:4956",
    "bookNumber": 65,
    "hadithNumber": 478,
    "narrator": "Narrated `Aisha:",
    "english": "The commencement of (the Divine Inspirations to) Allah's Messenger (ﷺ) was in the form of true dreams. \nThe Angel came to him and said, \"Read! In the Name of your Lord Who has created all exists), has \ncreated man from a clot. Read! And your Lord is Most Generous, Who has taught (the writing) by the \npen. (96.1-4)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، ح وَقَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، قَالَ مُحَمَّدُ أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها‏.‏ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الرُّؤْيَا الصَّادِقَةُ جَاءَهُ الْمَلَكُ فَقَالَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4956In-book reference : Book 65, Hadith 478USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 480   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4957,
    "id": 4957,
    "url": "https://sunnah.com/bukhari:4957",
    "bookNumber": 65,
    "hadithNumber": 479,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) returned to Khadija and said, \"Wrap me! Wrap me!\" (Then the sub-narrator narrated the \nrest of the narration.)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ سَمِعْتُ عُرْوَةَ، قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم إِلَى خَدِيجَةَ فَقَالَ ‏\n\"‏ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَذَكَرَ الْحَدِيثَ",
    "reference": "Reference : Sahih al-Bukhari 4957In-book reference : Book 65, Hadith 479USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 481   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4958,
    "id": 4958,
    "url": "https://sunnah.com/bukhari:4958",
    "bookNumber": 65,
    "hadithNumber": 480,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Abu Jahl said, \"If I see Muhammad praying at the Ka`ba, I will tread on his neck.\" When the Prophet (ﷺ) \nheard of that, he said, \"If he does so, the Angels will snatch him away.\"",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، عَنْ عِكْرِمَةَ، قَالَ ابْنُ عَبَّاسٍ قَالَ أَبُو جَهْلٍ لَئِنْ رَأَيْتُ مُحَمَّدًا يُصَلِّي عِنْدَ الْكَعْبَةِ لأَطَأَنَّ عَلَى عُنُقِهِ‏.‏ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَوْ فَعَلَهُ لأَخَذَتْهُ الْمَلاَئِكَةُ ‏\"‏‏.‏ تَابَعَهُ عَمْرُو بْنُ خَالِدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ عَبْدِ الْكَرِيمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4958In-book reference : Book 65, Hadith 480USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 482   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4959,
    "id": 4959,
    "url": "https://sunnah.com/bukhari:4959",
    "bookNumber": 65,
    "hadithNumber": 481,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said to Ubai (bin Ka`b). \"Allah has ordered me to recite to you:--'Those who disbelieve \namong the people of the Scripture and among the idolators are not going to stop (from their disbelief.') \n(Sura 98) Ubai said, \"Did Allah mention me by name?\" The Prophet (ﷺ) said, \"Yes.\" On that, Ubai wept.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم لأُبَىٍّ‏.‏ ‏\"‏ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ ‏{‏لَمْ يَكُنِ الَّذِينَ كَفَرُوا‏}‏ ‏\"‏‏.‏ قَالَ وَسَمَّانِي قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَبَكَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4959In-book reference : Book 65, Hadith 481USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 483   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4960,
    "id": 4960,
    "url": "https://sunnah.com/bukhari:4960",
    "bookNumber": 65,
    "hadithNumber": 482,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said to Ubai, \"Allah has ordered me recite Qur'an to you.\" Ubai asked, \"Did Allah \nmention me by name to you?\" The Prophet (ﷺ) said, \"Allah has mentioned your name to me.\" On that \nUbai started weeping. (The sub-narrator) Qatada added: I have been informed that the Prophet (ﷺ) recited: \n'Those who disbelieve among the people of the Scripture,\" ...to Ubai.",
    "arabic": "حَدَّثَنَا حَسَّانُ بْنُ حَسَّانَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأُبَىٍّ ‏\"‏ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ الْقُرْآنَ ‏\"‏‏.‏ قَالَ أُبَىٌّ آللَّهُ سَمَّانِي لَكَ قَالَ ‏\"‏ اللَّهُ سَمَّاكَ لِي ‏\"‏‏.‏ فَجَعَلَ أُبَىٌّ يَبْكِي‏.‏ قَالَ قَتَادَةُ فَأُنْبِئْتُ أَنَّهُ قَرَأَ عَلَيْهِ ‏{‏لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4960In-book reference : Book 65, Hadith 482USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 484   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4961,
    "id": 4961,
    "url": "https://sunnah.com/bukhari:4961",
    "bookNumber": 65,
    "hadithNumber": 483,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Prophet said to Ubai bin Ka`b, \"Allah has ordered me to recite Qur'an to you.\" Ubai said, \"Did \nAllah mention me by name to you?\" The Prophet (ﷺ) said, \"Yes.\" Ubai said, \"Have I been mentioned by \nthe Lord of the Worlds?\" The Prophet (ﷺ) said, \"Yes.\" Then Ubai burst into tears.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي دَاوُدَ أَبُو جَعْفَرٍ الْمُنَادِي، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ لأُبَىِّ بْنِ كَعْبٍ ‏\"‏ إِنَّ اللَّهَ أَمَرَنِي أَنْ أُقْرِئَكَ الْقُرْآنَ ‏\"‏‏.‏ قَالَ آللَّهُ سَمَّانِي لَكَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ وَقَدْ ذُكِرْتُ عِنْدَ رَبِّ الْعَالَمِينَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَذَرَفَتْ عَيْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4961In-book reference : Book 65, Hadith 483USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4962,
    "id": 4962,
    "url": "https://sunnah.com/bukhari:4962",
    "bookNumber": 65,
    "hadithNumber": 484,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \" Horses are kept for one of three purposes: A man may keep them (for Allah's \nCause) to receive a reward in the Hereafter; another may keep them as a means of protection; and a \nthird may keep them to be a burden for him. As for the man for whom the horse is a source of reward, \nhe is the one who ties it for Allah's Cause, and he ties it with a long rope in a pasture or a garden, then, \nwhatever it eats or drinks in that pasture or garden will be added to his good deeds. And if it breaks its \nrope and jumps over one or two hills, then, for all its footsteps and its manure, good deeds will be \nwritten for him. And if it passes by a river and drinks of its water though its owner had no intention to \nwater it from that river, even then he will have good deeds written for him. So that horse will be (a \nsource of) reward for such a man. \nIf a man ties a horse for earning his livelihood and abstaining from asking others for help and he does \nnot forget Allah's right, i.e. pays its Zakat and gives it to be used in Allah's Cause, then that horse will \nbe a means of protection for him. But if a man ties it out of pride and to show off and to excite others, \nthen that horse will be a burden (of sins) for him.\" Then Allah's Messenger (ﷺ) was asked regarding donkeys. \nHe replied, \"Nothing has been revealed to me except this comprehensive Verse which includes \neverything: \n'So whoever does good equal to the weight of an atom (or a smallest ant) shall see it; and whoever \ndoes evil equal to the weight of an atom (or a smallest ant) shall see it.' (99.7-8)",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِثَلاَثَةٍ، لِرَجُلٍ أَجْرٌ، وَلِرَجُلٍ سِتْرٌ، وَعَلَى رَجُلٍ وِزْرٌ، فَأَمَّا الَّذِي لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ، فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ فِي الْمَرْجِ وَالرَّوْضَةِ، كَانَ لَهُ حَسَنَاتٍ، وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ، وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ حَسَنَاتٍ لَهُ فَهْىَ لِذَلِكَ الرَّجُلِ أَجْرٌ، وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ ظُهُورِهَا فَهْىَ لَهُ سِتْرٌ، وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِئَاءً وَنِوَاءً فَهْىَ عَلَى ذَلِكَ وِزْرٌ‏.‏ فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ‏.‏ قَالَ ‏\"‏ مَا أَنْزَلَ اللَّهُ عَلَىَّ فِيهَا إِلاَّ هَذِهِ الآيَةَ الْفَاذَّةَ الْجَامِعَةَ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4962In-book reference : Book 65, Hadith 484USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 486   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4963,
    "id": 4963,
    "url": "https://sunnah.com/bukhari:4963",
    "bookNumber": 65,
    "hadithNumber": 485,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) was asked about donkeys and he replied, \"Nothing has been revealed to me regarding \ndonkeys except this comprehensive Verse which includes everything: \n\"So whoever does good equal to the weight of an atom (or a smallest ant) shall see it; And whoever, \ndoes evil equal to the weight of an atom or a smallest ant) shall see it.' (99.7-8)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْحُمُرِ فَقَالَ ‏\"‏ لَمْ يُنْزَلْ عَلَىَّ فِيهَا شَىْءٌ إِلاَّ هَذِهِ الآيَةُ الْجَامِعَةُ الْفَاذَّةُ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4963In-book reference : Book 65, Hadith 485USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 487   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4964,
    "id": 4964,
    "url": "https://sunnah.com/bukhari:4964",
    "bookNumber": 65,
    "hadithNumber": 486,
    "narrator": "Narrated Anas:",
    "english": "When the Prophet (ﷺ) was made to ascend to the Heavens, he said (after his return), \"I came upon a river \nthe banks of which were made of tents of hollow pearls. I asked Gabriel. What is this (river?) He replied, 'This is the Kauthar.'",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شَيْبَانُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا عُرِجَ بِالنَّبِيِّ صلى الله عليه وسلم إِلَى السَّمَاءِ قَالَ ‏\n\"‏ أَتَيْتُ عَلَى نَهَرٍ حَافَتَاهُ قِبَابُ اللُّؤْلُؤِ مُجَوَّفًا فَقُلْتُ مَا هَذَا يَا جِبْرِيلُ قَالَ هَذَا الْكَوْثَرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4964In-book reference : Book 65, Hadith 486USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4965,
    "id": 4965,
    "url": "https://sunnah.com/bukhari:4965",
    "bookNumber": 65,
    "hadithNumber": 487,
    "narrator": "Narrated Abu Ubaida:",
    "english": "I asked `Aisha 'regarding the verse:--'Verily we have granted you the Kauthar.' She replied, \"The \nKauthar is a river which has been given to your Prophet on the banks of which there are (tents of) \nhollow pearls and its utensils are as numberless as the stars.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ الْكَاهِلِيُّ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَ سَأَلْتُهَا عَنْ قَوْلِهِ تَعَالَى ‏{‏إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ‏}‏ قَالَتْ نَهَرٌ أُعْطِيَهُ نَبِيُّكُمْ صلى الله عليه وسلم شَاطِئَاهُ عَلَيْهِ دُرٌّ مُجَوَّفٌ آنِيَتُهُ كَعَدَدِ النُّجُومِ‏.‏ رَوَاهُ زَكَرِيَّاءُ وَأَبُو الأَحْوَصِ وَمُطَرِّفٌ عَنْ أَبِي إِسْحَاقَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4965In-book reference : Book 65, Hadith 487USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 489   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4966,
    "id": 4966,
    "url": "https://sunnah.com/bukhari:4966",
    "bookNumber": 65,
    "hadithNumber": 488,
    "narrator": "Narrated Abu Bishr:",
    "english": "Sa`id bin Jubair said that Ibn `Abbas said about Al-Kauthar. \"That is the good which Allah has \nbestowed upon His Apostle.\" I said to Sa`id bin Jubair. \"But the people claim that it is a river in \nParadise.\" Sa`id said, \"The river in Paradise is part of the good which Allah has bestowed on His \nApostle.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ فِي الْكَوْثَرِ هُوَ الْخَيْرُ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏ قَالَ أَبُو بِشْرٍ قُلْتُ لِسَعِيدِ بْنِ جُبَيْرٍ فَإِنَّ النَّاسَ يَزْعُمُونَ أَنَّهُ نَهَرٌ فِي الْجَنَّةِ‏.‏ فَقَالَ سَعِيدٌ النَّهَرُ الَّذِي فِي الْجَنَّةِ مِنَ الْخَيْرِ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4966In-book reference : Book 65, Hadith 488USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 490   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4967,
    "id": 4967,
    "url": "https://sunnah.com/bukhari:4967",
    "bookNumber": 65,
    "hadithNumber": 489,
    "narrator": "Narrated Aisha:",
    "english": "\"When the \"Surat-An-Nasr\", 'When comes the Help of Allah and the conquest,' had been revealed to \nthe Prophet (ﷺ) he did not offer any prayer except that he said therein, \"Subhanka Rabbana wa bihamdika; \nAllahumma ighfirli (I testify the Uniqueness of our Lord, and all the praises are for Him: O Allah, \nforgive me!\")",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا صَلَّى النَّبِيُّ صلى الله عليه وسلم صَلاَةً بَعْدَ أَنْ نَزَلَتْ عَلَيْهِ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ إِلاَّ يَقُولُ فِيهَا ‏\"‏ سُبْحَانَكَ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4967In-book reference : Book 65, Hadith 489USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4968,
    "id": 4968,
    "url": "https://sunnah.com/bukhari:4968",
    "bookNumber": 65,
    "hadithNumber": 490,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) used to say very often in bowing and prostration (during his prayers), Subhanka \nAllahumma Rabbana wa bihamdika; Allahumma ighfirli,\" according to the order of the Qur'an.",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ ‏\n\"‏ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي ‏\"‏‏.‏ يَتَأَوَّلُ الْقُرْآنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4968In-book reference : Book 65, Hadith 490USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4969,
    "id": 4969,
    "url": "https://sunnah.com/bukhari:4969",
    "bookNumber": 65,
    "hadithNumber": 491,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Umar asked the people regarding Allah's Statement: \n'When comes the Help of Allah (to you O Muhammad against your enemies) and the conquest of \nMecca.' (110.1) They replied, \"It indicates the future conquest of towns and palaces (by Muslims).\" \n`Umar said, \"What do you say about it, O Ibn `Abbas?\" I replied, \"(This Surat) indicates the \ntermination of the life of Muhammad. Through it he was informed of the nearness of his death.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ عُمَرَ ـ رضى الله عنه ـ سَأَلَهُمْ عَنْ قَوْلِهِ تَعَالَى ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ قَالُوا فَتْحُ الْمَدَائِنِ وَالْقُصُورِ قَالَ مَا تَقُولُ يَا ابْنَ عَبَّاسٍ قَالَ أَجَلٌ أَوْ مَثَلٌ ضُرِبَ لِمُحَمَّدٍ صلى الله عليه وسلم نُعِيَتْ لَهُ نَفْسُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4969In-book reference : Book 65, Hadith 491USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 493   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4970,
    "id": 4970,
    "url": "https://sunnah.com/bukhari:4970",
    "bookNumber": 65,
    "hadithNumber": 492,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Umar used to make me sit with the elderly men who had fought in the Battle of Badr. Some of them \nfelt it (did not like that) and said to `Umar \"Why do you bring in this boy to sit with us while we have \nsons like him?\" `Umar replied, \"Because of what you know of his position (i.e. his religious \nknowledge.)\" One day `Umar called me and made me sit in the gathering of those people; and I think \nthat he called me just to show them. (my religious knowledge). `Umar then asked them (in my \npresence). \"What do you say about the interpretation of the Statement of Allah: \n'When comes Help of Allah (to you O, Muhammad against your enemies) and the conquest (of \nMecca).' (110.1) Some of them said, \"We are ordered to praise Allah and ask for His forgiveness \nwhen Allah's Help and the conquest (of Mecca) comes to us.\" Some others kept quiet and did not say \nanything. On that, `Umar asked me, \"Do you say the same, O Ibn `Abbas?\" I replied, \"No.\" He said, \n'What do you say then?\" I replied, \"That is the sign of the death of Allah's Messenger (ﷺ) which Allah \ninformed him of. Allah said:-- \n'(O Muhammad) When comes the Help of Allah (to you against your enemies) and the conquest (of \nMecca) (which is the sign of your death). You should celebrate the praises of your Lord and ask for \nHis Forgiveness, and He is the One Who accepts the repentance and forgives.' (110.3) On that `Umar \nsaid, \"I do not know anything about it other than what you have said.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ عُمَرُ يُدْخِلُنِي مَعَ أَشْيَاخِ بَدْرٍ، فَكَأَنَّ بَعْضَهُمْ وَجَدَ فِي نَفْسِهِ فَقَالَ لِمَ تُدْخِلُ هَذَا مَعَنَا وَلَنَا أَبْنَاءٌ مِثْلُهُ فَقَالَ عُمَرُ إِنَّهُ مِنْ حَيْثُ عَلِمْتُمْ‏.‏ فَدَعَا ذَاتَ يَوْمٍ ـ فَأَدْخَلَهُ مَعَهُمْ ـ فَمَا رُئِيتُ أَنَّهُ دَعَانِي يَوْمَئِذٍ إِلاَّ لِيُرِيَهُمْ‏.‏ قَالَ مَا تَقُولُونَ فِي قَوْلِ اللَّهِ تَعَالَى ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ فَقَالَ بَعْضُهُمْ أُمِرْنَا نَحْمَدُ اللَّهَ وَنَسْتَغْفِرُهُ، إِذَا نُصِرْنَا وَفُتِحَ عَلَيْنَا‏.‏ وَسَكَتَ بَعْضُهُمْ فَلَمْ يَقُلْ شَيْئًا فَقَالَ لِي أَكَذَاكَ تَقُولُ يَا ابْنَ عَبَّاسٍ فَقُلْتُ لاَ‏.‏ قَالَ فَمَا تَقُولُ قُلْتُ هُوَ أَجَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْلَمَهُ لَهُ، قَالَ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ وَذَلِكَ عَلاَمَةُ أَجَلِكَ ‏{‏فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا‏}‏‏.‏ فَقَالَ عُمَرُ مَا أَعْلَمُ مِنْهَا إِلاَّ مَا تَقُولُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4970In-book reference : Book 65, Hadith 492USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4971,
    "id": 4971,
    "url": "https://sunnah.com/bukhari:4971",
    "bookNumber": 65,
    "hadithNumber": 493,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed. Allah's Messenger (ﷺ) went \nout, and when he had ascended As-Safa mountain, he shouted, \"O Sabahah!\" The people said, \"Who is \nthat?\" \"Then they gathered around him, whereupon he said, \"Do you see? If I inform you that \ncavalrymen are proceeding up the side of this mountain, will you believe me?\" They said, \"We have \nnever heard you telling a lie.\" Then he said, \"I am a plain warner to you of a coming severe \npunishment.\" Abu Lahab said, \"May you perish! You gathered us only for this reason? \" Then Abu \nLahab went away. So the \"Surat:--ul--LAHAB\" 'Perish the hands of Abu Lahab!' (111.1) was \nrevealed.",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ وَرَهْطَكَ مِنْهُمُ الْمُخْلَصِينَ، خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى صَعِدَ الصَّفَا فَهَتَفَ ‏\"‏ يَا صَبَاحَاهْ ‏\"‏‏.‏ فَقَالُوا مَنْ هَذَا، فَاجْتَمَعُوا إِلَيْهِ‏.‏ فَقَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ أَخْبَرْتُكُمْ أَنَّ خَيْلاً تَخْرُجُ مِنْ سَفْحِ هَذَا الْجَبَلِ أَكُنْتُمْ مُصَدِّقِيَّ ‏\"‏‏.‏ قَالُوا مَا جَرَّبْنَا عَلَيْكَ كَذِبًا‏.‏ قَالَ ‏\"‏ فَإِنِّي نَذِيرٌ لَكُمْ بَيْنَ يَدَىْ عَذَابٍ شَدِيدٍ ‏\"‏‏.‏ قَالَ أَبُو لَهَبٍ تَبًّا لَكَ مَا جَمَعْتَنَا إِلاَّ لِهَذَا ثُمَّ قَامَ فَنَزَلَتْ ‏{‏تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ‏}‏ وَقَدْ تَبَّ هَكَذَا قَرَأَهَا الأَعْمَشُ يَوْمَئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4971In-book reference : Book 65, Hadith 493USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4972,
    "id": 4972,
    "url": "https://sunnah.com/bukhari:4972",
    "bookNumber": 65,
    "hadithNumber": 494,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) went out towards Al-Batha' and ascended the mountain and shouted, \"O Sabahah!\" So the \nQuraish people gathered around him. He said, \"Do you see? If I tell you that an enemy is going to \nattack you in the morning or in the evening, will you believe me?\" They replied, \"Yes.\" He said, \n\"Then I am a plain warner to you of a coming severe punishment.\" Abu Lahab said, \"Is it for this \nreason that you have gathered us? May you perish ! \" Then Allah revealed: 'Perish the hands of Abu \nLahab!'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى الْبَطْحَاءِ فَصَعِدَ إِلَى الْجَبَلِ فَنَادَى ‏\"‏ يَا صَبَاحَاهْ ‏\"‏‏.‏ فَاجْتَمَعَتْ إِلَيْهِ قُرَيْشٌ فَقَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ حَدَّثْتُكُمْ أَنَّ الْعَدُوَّ مُصَبِّحُكُمْ أَوْ مُمَسِّيكُمْ، أَكُنْتُمْ تُصَدِّقُونِي ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ فَإِنِّي نَذِيرٌ لَكُمْ بَيْنَ يَدَىْ عَذَابٍ شَدِيدٍ ‏\"‏‏.‏ فَقَالَ أَبُو لَهَبٍ أَلِهَذَا جَمَعْتَنَا تَبًّا لَكَ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏تَبَّتْ يَدَا أَبِي لَهَبٍ‏}‏ إِلَى آخِرِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4972In-book reference : Book 65, Hadith 494USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4973,
    "id": 4973,
    "url": "https://sunnah.com/bukhari:4973",
    "bookNumber": 65,
    "hadithNumber": 495,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Abu Lahab said, \"May you perish! Is it' for this that you have gathered us?\" So there was revealed:'Perish the hands of Abu Lahab'.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَبُو لَهَبٍ تَبًّا لَكَ أَلِهَذَا جَمَعْتَنَا فَنَزَلَتْ ‏{‏تَبَّتْ يَدَا أَبِي لَهَبٍ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4973In-book reference : Book 65, Hadith 495USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 497   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4974,
    "id": 4974,
    "url": "https://sunnah.com/bukhari:4974",
    "bookNumber": 65,
    "hadithNumber": 496,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah said: 'The son of Adam tells a lie against Me,, though he hasn't the right to \ndo so. He abuses me though he hasn't the right to do so. As for his telling a lie against Me, it is his \nsaying that I will not recreate him as I created him for the first time. In fact, the first creation was not \neasier for Me than new creation. As for his abusing Me, it is his saying that Allah has begotten \nchildren, while I am the One, the Self-Sufficient Master Whom all creatures need, I beget not, nor was \nI begotten, and there is none like unto Me.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذَلِكَ، وَشَتَمَنِي وَلَمْ يَكُنْ لَهُ ذَلِكَ، فَأَمَّا تَكْذِيبُهُ إِيَّاىَ فَقَوْلُهُ لَنْ يُعِيدَنِي كَمَا بَدَأَنِي، وَلَيْسَ أَوَّلُ الْخَلْقِ بِأَهْوَنَ عَلَىَّ مِنْ إِعَادَتِهِ، وَأَمَّا شَتْمُهُ إِيَّاىَ فَقَوْلُهُ اتَّخَذَ اللَّهُ وَلَدًا، وَأَنَا الأَحَدُ الصَّمَدُ لَمْ أَلِدْ وَلَمْ أُولَدْ وَلَمْ يَكُنْ لِي كُفْأً أَحَدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4974In-book reference : Book 65, Hadith 496USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 498   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4975,
    "id": 4975,
    "url": "https://sunnah.com/bukhari:4975",
    "bookNumber": 65,
    "hadithNumber": 497,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah said:-- 'The son of Adam tells a lie against Me and he hasn't the right to \ndo so; and he abuses me and he hasn't the right to do so. His telling a lie against Me is his saying that I \nwill not recreate him as I created him for the first time; and his abusing Me is his saying that Allah has \nbegotten children, while I am the self-sufficient Master, Whom all creatures need, Who begets not nor \nwas He begotten, and there is none like unto Me.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ وَحَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَالَ اللَّهُ كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذَلِكَ، وَشَتَمَنِي وَلَمْ يَكُنْ لَهُ ذَلِكَ، أَمَّا تَكْذِيبُهُ إِيَّاىَ أَنْ يَقُولَ إِنِّي لَنْ أُعِيدَهُ كَمَا بَدَأْتُهُ، وَأَمَّا شَتْمُهُ إِيَّاىَ أَنْ يَقُولَ اتَّخَذَ اللَّهُ وَلَدًا، وَأَنَا الصَّمَدُ الَّذِي لَمْ أَلِدْ وَلَمْ أُولَدْ وَلَمْ يَكُنْ لِي كُفُؤًا أَحَدٌ ‏\"‏‏.‏ ‏{‏لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُؤًا أَحَدٌ‏}‏ كُفُؤًا وَكَفِيئًا وَكِفَاءً وَاحِدٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4975In-book reference : Book 65, Hadith 497USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 499   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4976,
    "id": 4976,
    "url": "https://sunnah.com/bukhari:4976",
    "bookNumber": 65,
    "hadithNumber": 498,
    "narrator": "Narrated Zirr bin Hubaish:",
    "english": "I asked Ubai bin Ka`b regarding the two Muwwidhat (Surats of taking refuge with Allah). He said, \"I \nasked the Prophet (ﷺ) about them, He said, 'These two Surats have been recited to me and I have recited \nthem (and are present in the Qur'an).' So, we say as Allah's Messenger (ﷺ) said (i.e., they are part of the \nQur'an.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، وَعَبْدَةَ، عَنْ زِرِّ بْنِ حُبَيْشٍ، قَالَ سَأَلْتُ أُبَىَّ بْنَ كَعْبٍ عَنِ الْمُعَوِّذَتَيْنِ، فَقَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ قِيلَ لِي فَقُلْتُ فَنَحْنُ نَقُولُ كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4976In-book reference : Book 65, Hadith 498USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 500   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4977,
    "id": 4977,
    "url": "https://sunnah.com/bukhari:4977",
    "bookNumber": 65,
    "hadithNumber": 499,
    "narrator": "Narrated Zirr bin Hubaish:",
    "english": "I asked Ubai bin Ka`b, \"O Abu AlMundhir! Your brother, Ibn Mas`ud said so-and-so (i.e., the two \nMu'awwidh-at do not belong to the Qur'an).\" Ubai said, \"I asked Allah's Messenger (ﷺ) about them, and he \nsaid, 'They have been revealed to me, and I have recited them (as a part of the Qur'an),\" So Ubai \nadded, \"So we say as Allah's Messenger (ﷺ) has said.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدَةُ بْنُ أَبِي لُبَابَةَ، عَنْ زِرِّ بْنِ حُبَيْشٍ، وَحَدَّثَنَا عَاصِمٌ، عَنْ زِرٍّ، قَالَ سَأَلْتُ أُبَىَّ بْنَ كَعْبٍ قُلْتُ يَا أَبَا الْمُنْذِرِ إِنَّ أَخَاكَ ابْنَ مَسْعُودٍ يَقُولُ كَذَا وَكَذَا‏.‏ فَقَالَ أُبَىٌّ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لِي قِيلَ لِي‏.‏ فَقُلْتُ، قَالَ فَنَحْنُ نَقُولُ كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4977In-book reference : Book 65, Hadith 499USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 501   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4978,
    "id": 4978,
    "url": "https://sunnah.com/bukhari:4978",
    "bookNumber": 66,
    "hadithNumber": 1,
    "narrator": "Narrated `Aisha and Ibn `Abbas:",
    "english": "The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ أَخْبَرَتْنِي عَائِشَةُ، وَابْنُ، عَبَّاسٍ رضى الله عنهم قَالاَ لَبِثَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ الْقُرْآنُ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ.",
    "reference": "Reference : Sahih al-Bukhari 4978, 4979In-book reference : Book 66, Hadith 1USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 502   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4979,
    "id": 4979,
    "url": "https://sunnah.com/bukhari:4979",
    "bookNumber": 66,
    "hadithNumber": 1,
    "narrator": "Narrated `Aisha and Ibn `Abbas:",
    "english": "The Prophet (ﷺ) remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and \nhe stayed in Medina for ten years.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ أَخْبَرَتْنِي عَائِشَةُ، وَابْنُ، عَبَّاسٍ رضى الله عنهم قَالاَ لَبِثَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ الْقُرْآنُ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ.",
    "reference": "Reference : Sahih al-Bukhari 4978, 4979In-book reference : Book 66, Hadith 1USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 502   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4980,
    "id": 4980,
    "url": "https://sunnah.com/bukhari:4980",
    "bookNumber": 66,
    "hadithNumber": 2,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I was informed that Gabriel came to the Prophet (ﷺ) while Um Salama was with him. Gabriel started \ntalking (to the Prophet). Then the Prophet (ﷺ) asked Um Salama, \"Who is this?\" She replied, \"He is Dihya \n(al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other \nthan him (i.e. Dihya) till I heard the sermon of the Prophet (ﷺ) wherein he informed about the news of \nGabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: \nFrom Usama bin Zaid.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، عَنْ أَبِي عُثْمَانَ، قَالَ أُنْبِئْتُ أَنَّ جِبْرِيلَ، أَتَى النَّبِيَّ صلى الله عليه وسلم وَعِنْدَهُ أُمُّ سَلَمَةَ فَجَعَلَ يَتَحَدَّثُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأُمِّ سَلَمَةَ ‏\n\"‏ مَنْ هَذَا ‏\"‏‏.‏ أَوْ كَمَا قَالَ قَالَتْ هَذَا دِحْيَةُ‏.‏ فَلَمَّا قَامَ قَالَتْ وَاللَّهِ مَا حَسِبْتُهُ إِلاَّ إِيَّاهُ حَتَّى سَمِعْتُ خُطْبَةَ النَّبِيِّ صلى الله عليه وسلم يُخْبِرُ خَبَرَ جِبْرِيلَ أَوْ كَمَا قَالَ، قَالَ أَبِي قُلْتُ لأَبِي عُثْمَانَ مِمَّنْ سَمِعْتَ هَذَا‏.‏ قَالَ مِنْ أُسَامَةَ بْنِ زَيْدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4980In-book reference : Book 66, Hadith 2USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 503   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4981,
    "id": 4981,
    "url": "https://sunnah.com/bukhari:4981",
    "bookNumber": 66,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Every Prophet was given miracles because of which people believed, but what I \nhave been given, is Divine Inspiration which Allah has revealed to me. So I hope that my followers \nwill outnumber the followers of the other Prophets on the Day of Resurrection.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا مِنَ الأَنْبِيَاءِ نَبِيٌّ إِلاَّ أُعْطِيَ مَا مِثْلُهُ آمَنَ عَلَيْهِ الْبَشَرُ، وَإِنَّمَا كَانَ الَّذِي أُوتِيتُ وَحْيًا أَوْحَاهُ اللَّهُ إِلَىَّ فَأَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ تَابِعًا يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4981In-book reference : Book 66, Hadith 3USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 504   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4982,
    "id": 4982,
    "url": "https://sunnah.com/bukhari:4982",
    "bookNumber": 66,
    "hadithNumber": 4,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah sent down His Divine Inspiration to His Apostle continuously and abundantly during the period \npreceding his death till He took him unto Him. That was the period of the greatest part of revelation; \nand Allah's Messenger (ﷺ) died after that.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ اللَّهَ، تَعَالَى تَابَعَ عَلَى رَسُولِهِ صلى الله عليه وسلم قَبْلَ وَفَاتِهِ حَتَّى تَوَفَّاهُ أَكْثَرَ مَا كَانَ الْوَحْىُ، ثُمَّ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4982In-book reference : Book 66, Hadith 4USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 505   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4983,
    "id": 4983,
    "url": "https://sunnah.com/bukhari:4983",
    "bookNumber": 66,
    "hadithNumber": 5,
    "narrator": "Narrated Jundub:",
    "english": "Once the Prophet (ﷺ) fell ill and did not offer the night prayer (Tahajjud prayer) for a night or two. A \nwoman (the wife of Abu Lahab) came to him and said, \"O Muhammad ! I do not see but that your \nSatan has left you.\" Then Allah revealed (Surat-Ad-Duha): \n'By the fore-noon, and by the night when it darkens (or is still); Your Lord has not forsaken you, nor \nhated you.' (93)",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، قَالَ سَمِعْتُ جُنْدَبًا، يَقُولُ اشْتَكَى النَّبِيُّ صلى الله عليه وسلم فَلَمْ يَقُمْ لَيْلَةً أَوْ لَيْلَتَيْنِ فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ يَا مُحَمَّدُ مَا أُرَى شَيْطَانَكَ إِلاَّ قَدْ تَرَكَكَ، فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَالضُّحَى * وَاللَّيْلِ إِذَا سَجَى * مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4983In-book reference : Book 66, Hadith 5USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 506   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4984,
    "id": 4984,
    "url": "https://sunnah.com/bukhari:4984",
    "bookNumber": 66,
    "hadithNumber": 6,
    "narrator": "Narrated Anas bin Malik:",
    "english": "(The Caliph `Uthman ordered Zaid bin Thabit, Sa`id bin Al-As, `Abdullah bin Az-Zubair and `Abdur- \nRahman bin Al-Harith bin Hisham to write the Qur'an in the form of a book (Mushafs) and said to \nthem. \"In case you disagree with Zaid bin Thabit (Al-Ansari) regarding any dialectic Arabic utterance \nof the Qur'an, then write it in the dialect of Quraish, for the Qur'an was revealed in this dialect.\" So \nthey did it.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، وَأَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ فَأَمَرَ عُثْمَانُ زَيْدَ بْنَ ثَابِتٍ وَسَعِيدَ بْنَ الْعَاصِ وَعَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَعَبْدَ الرَّحْمَنِ بْنَ الْحَارِثِ بْنِ هِشَامٍ أَنْ يَنْسَخُوهَا، فِي الْمَصَاحِفِ وَقَالَ لَهُمْ إِذَا اخْتَلَفْتُمْ أَنْتُمْ وَزَيْدُ بْنُ ثَابِتٍ فِي عَرَبِيَّةٍ مِنْ عَرَبِيَّةِ الْقُرْآنِ فَاكْتُبُوهَا بِلِسَانِ قُرَيْشٍ، فَإِنَّ الْقُرْآنَ أُنْزِلَ بِلِسَانِهِمْ فَفَعَلُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4984In-book reference : Book 66, Hadith 6USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 507   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4985,
    "id": 4985,
    "url": "https://sunnah.com/bukhari:4985",
    "bookNumber": 66,
    "hadithNumber": 7,
    "narrator": "Narrated Safwan bin Ya`la bin Umaiya:",
    "english": "Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time he is being inspired Divinely.\" When \nthe Prophet (ﷺ) was at Al-Ja'rana and was shaded by a garment hanging over him and some of his \ncompanions were with him, a man perfumed with scent came and said, \"O Allah's Messenger (ﷺ)! What is \nyour opinion regarding a man who assumes Ihram and puts on a cloak after perfuming his body with \nscent?\" The Prophet (ﷺ) waited for a while, and then the Divine Inspiration descended upon him. `Umar \npointed out to Ya`la, telling him to come. Ya`la came and pushed his head (underneath the screen \nwhich was covering the Prophet (ﷺ) ) and behold! The Prophet's face was red and he kept on breathing \nheavily for a while and then he was relieved. Thereupon he said, \"Where is the questioner who asked \nme about `Umra a while ago?\" The man was sought and then was brought before the Prophet (ﷺ) who said \n(to him), \"As regards the scent which you perfumed your body with, you must wash it off thrice, and \nas for your cloak, you must take it off; and then perform in your `Umra all those things which you \nperform in Hajj.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ،‏.‏ وَقَالَ مُسَدَّدٌ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ أَخْبَرَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ، أَنَّ يَعْلَى، كَانَ يَقُولُ لَيْتَنِي أَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ يُنْزَلُ عَلَيْهِ الْوَحْىُ، فَلَمَّا كَانَ النَّبِيُّ صلى الله عليه وسلم بِالْجِعْرَانَةِ وَعَلَيْهِ ثَوْبٌ قَدْ أَظَلَّ عَلَيْهِ وَمَعَهُ نَاسٌ مِنْ أَصْحَابِهِ إِذْ جَاءَهُ رَجُلٌ مُتَضَمِّخٌ بِطِيبٍ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحْرَمَ فِي جُبَّةٍ بَعْدَ مَا تَضَمَّخَ بِطِيبٍ فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم سَاعَةً فَجَاءَهُ الْوَحْىُ فَأَشَارَ عُمَرُ إِلَى يَعْلَى أَنْ تَعَالَ، فَجَاءَ يَعْلَى فَأَدْخَلَ رَأْسَهُ فَإِذَا هُوَ مُحْمَرُّ الْوَجْهِ يَغِطُّ كَذَلِكَ سَاعَةً ثُمَّ سُرِّيَ عَنْهُ فَقَالَ ‏\"‏ أَيْنَ الَّذِي يَسْأَلُنِي عَنِ الْعُمْرَةِ آنِفًا ‏\"‏‏.‏ فَالْتُمِسَ الرَّجُلُ فَجِيءَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَمَّا الطِّيبُ الَّذِي بِكَ فَاغْسِلْهُ ثَلاَثَ مَرَّاتٍ، وَأَمَّا الْجُبَّةُ فَانْزِعْهَا ثُمَّ اصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4985In-book reference : Book 66, Hadith 7USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 508   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4986,
    "id": 4986,
    "url": "https://sunnah.com/bukhari:4986",
    "bookNumber": 66,
    "hadithNumber": 8,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "Abu Bakr As-Siddiq sent for me when the people of Yamama had been killed (i.e., a number of the \nProphet's Companions who fought against Musailima). (I went to him) and found `Umar bin Al- \nKhattab sitting with him. Abu Bakr then said (to me), \"`Umar has come to me and said: \"Casualties \nwere heavy among the Qurra' of the Qur'an (i.e. those who knew the Qur'an by heart) on the day of \nthe Battle of Yamama, and I am afraid that more heavy casualties may take place among the Qurra' \non other battlefields, whereby a large part of the Qur'an may be lost. Therefore I suggest, you (Abu \nBakr) order that the Qur'an be collected.\" I said to `Umar, \"How can you do something which Allah's \nApostle did not do?\" `Umar said, \"By Allah, that is a good project.\" `Umar kept on urging me to \naccept his proposal till Allah opened my chest for it and I began to realize the good in the idea which \n`Umar had realized.\" Then Abu Bakr said (to me). 'You are a wise young man and we do not have any \nsuspicion about you, and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). So you should \nsearch for (the fragmentary scripts of) the Qur'an and collect it in one book.\" By Allah If they had \nordered me to shift one of the mountains, it would not have been heavier for me than this ordering me \nto collect the Qur'an. Then I said to Abu Bakr, \"How will you do something which Allah's Messenger (ﷺ) did \nnot do?\" Abu Bakr replied, \"By Allah, it is a good project.\" Abu Bakr kept on urging me to accept his \nidea until Allah opened my chest for what He had opened the chests of Abu Bakr and `Umar. So I \nstarted looking for the Qur'an and collecting it from (what was written on) palme stalks, thin white \nstones and also from the men who knew it by heart, till I found the last Verse of Surat at-Tauba \n(Repentance) with Abi Khuzaima Al-Ansari, and I did not find it with anybody other than him. The \nVerse is: \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty..(till the end of Surat-Baraa' (at-Tauba) (9.128-129). \nThen the complete manuscripts (copy) of the Qur'an remained with Abu Bakr till he died, then with \n`Umar till the end of his life, and then with Hafsa, the daughter of `Umar.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ بْنِ السَّبَّاقِ، أَنَّ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ قَالَ أَرْسَلَ إِلَىَّ أَبُو بَكْرٍ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَإِذَا عُمَرُ بْنُ الْخَطَّابِ عِنْدَهُ قَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِقُرَّاءِ الْقُرْآنِ وَإِنِّي أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِالْقُرَّاءِ بِالْمَوَاطِنِ، فَيَذْهَبَ كَثِيرٌ مِنَ الْقُرْآنِ وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ‏.‏ قُلْتُ لِعُمَرَ كَيْفَ تَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ عُمَرُ هَذَا وَاللَّهِ خَيْرٌ‏.‏ فَلَمْ يَزَلْ عُمَرُ يُرَاجِعُنِي حَتَّى شَرَحَ اللَّهُ صَدْرِي لِذَلِكَ، وَرَأَيْتُ فِي ذَلِكَ الَّذِي رَأَى عُمَرُ‏.‏ قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ إِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ لاَ نَتَّهِمُكَ، وَقَدْ كُنْتَ تَكْتُبُ الْوَحْىَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَتَبَّعِ الْقُرْآنَ فَاجْمَعْهُ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ أَثْقَلَ عَلَىَّ مِمَّا أَمَرَنِي مِنْ جَمْعِ الْقُرْآنِ قُلْتُ كَيْفَ تَفْعَلُونَ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ أَبُو بَكْرٍ يُرَاجِعُنِي حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ لَهُ صَدْرَ أَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الْعُسُبِ وَاللِّخَافِ وَصُدُورِ الرِّجَالِ حَتَّى وَجَدْتُ آخِرَ سُورَةِ التَّوْبَةِ مَعَ أَبِي خُزَيْمَةَ الأَنْصَارِيِّ لَمْ أَجِدْهَا مَعَ أَحَدٍ غَيْرَهُ ‏{‏لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ‏}‏ حَتَّى خَاتِمَةِ بَرَاءَةَ، فَكَانَتِ الصُّحُفُ عِنْدَ أَبِي بَكْرٍ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ عِنْدَ عُمَرَ حَيَاتَهُ ثُمَّ عِنْدَ حَفْصَةَ بِنْتِ عُمَرَ ـ رضى الله عنه ـ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4986In-book reference : Book 66, Hadith 8USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 509   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4987,
    "id": 4987,
    "url": "https://sunnah.com/bukhari:4987",
    "bookNumber": 66,
    "hadithNumber": 9,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Hudhaifa bin Al-Yaman came to `Uthman at the time when the people of Sham and the people of Iraq \nwere Waging war to conquer Arminya and Adharbijan. Hudhaifa was afraid of their (the people of \nSham and Iraq) differences in the recitation of the Qur'an, so he said to `Uthman, \"O chief of the \nBelievers! Save this nation before they differ about the Book (Qur'an) as Jews and the Christians did \nbefore.\" So `Uthman sent a message to Hafsa saying, \"Send us the manuscripts of the Qur'an so that \nwe may compile the Qur'anic materials in perfect copies and return the manuscripts to you.\" Hafsa \nsent it to `Uthman. `Uthman then ordered Zaid bin Thabit, `Abdullah bin AzZubair, Sa`id bin Al-As \nand `AbdurRahman bin Harith bin Hisham to rewrite the manuscripts in perfect copies. `Uthman said \nto the three Quraishi men, \"In case you disagree with Zaid bin Thabit on any point in the Qur'an, then \nwrite it in the dialect of Quraish, the Qur'an was revealed in their tongue.\" They did so, and when they \nhad written many copies, `Uthman returned the original manuscripts to Hafsa. `Uthman sent to every \nMuslim province one copy of what they had copied, and ordered that all the other Qur'anic materials, \nwhether written in fragmentary manuscripts or whole copies, be burnt.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ، حَدَّثَنَا ابْنُ شِهَابٍ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُ أَنَّ حُذَيْفَةَ بْنَ الْيَمَانِ قَدِمَ عَلَى عُثْمَانَ وَكَانَ يُغَازِي أَهْلَ الشَّأْمِ فِي فَتْحِ إِرْمِينِيَةَ وَأَذْرَبِيجَانَ مَعَ أَهْلِ الْعِرَاقِ فَأَفْزَعَ حُذَيْفَةَ اخْتِلاَفُهُمْ فِي الْقِرَاءَةِ فَقَالَ حُذَيْفَةُ لِعُثْمَانَ يَا أَمِيرَ الْمُؤْمِنِينَ أَدْرِكْ هَذِهِ الأُمَّةَ قَبْلَ أَنْ يَخْتَلِفُوا فِي الْكِتَابِ اخْتِلاَفَ الْيَهُودِ وَالنَّصَارَى فَأَرْسَلَ عُثْمَانُ إِلَى حَفْصَةَ أَنْ أَرْسِلِي إِلَيْنَا بِالصُّحُفِ نَنْسَخُهَا فِي الْمَصَاحِفِ ثُمَّ نَرُدُّهَا إِلَيْكِ فَأَرْسَلَتْ بِهَا حَفْصَةُ إِلَى عُثْمَانَ فَأَمَرَ زَيْدَ بْنَ ثَابِتٍ وَعَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَسَعِيدَ بْنَ الْعَاصِ وَعَبْدَ الرَّحْمَنِ بْنَ الْحَارِثِ بْنِ هِشَامٍ فَنَسَخُوهَا فِي الْمَصَاحِفِ وَقَالَ عُثْمَانُ لِلرَّهْطِ الْقُرَشِيِّينَ الثَّلاَثَةِ إِذَا اخْتَلَفْتُمْ أَنْتُمْ وَزَيْدُ بْنُ ثَابِتٍ فِي شَىْءٍ مِنَ الْقُرْآنِ فَاكْتُبُوهُ بِلِسَانِ قُرَيْشٍ فَإِنَّمَا نَزَلَ بِلِسَانِهِمْ فَفَعَلُوا حَتَّى إِذَا نَسَخُوا الصُّحُفَ فِي الْمَصَاحِفِ رَدَّ عُثْمَانُ الصُّحُفَ إِلَى حَفْصَةَ وَأَرْسَلَ إِلَى كُلِّ أُفُقٍ بِمُصْحَفٍ مِمَّا نَسَخُوا وَأَمَرَ بِمَا سِوَاهُ مِنَ الْقُرْآنِ فِي كُلِّ صَحِيفَةٍ أَوْ مُصْحَفٍ أَنْ يُحْرَقَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4987In-book reference : Book 66, Hadith 9USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4988,
    "id": 4988,
    "url": "https://sunnah.com/bukhari:4988",
    "bookNumber": 66,
    "hadithNumber": 10,
    "narrator": "Zaid bin Thabit added, \"A \nverse from Surat Ahzab was missed by me when we copied the Qur'an and I used to hear Allah's Messenger (ﷺ) reciting it. So we searched for it and found it with Khuza`ima bin Thabit Al-Ansari. (That \nVerse was):",
    "english": "'Among the Believers are men who have been true in their covenant with Allah.' (33.23)",
    "arabic": "قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، سَمِعَ زَيْدَ بْنَ ثَابِتٍ، قَالَ فَقَدْتُ آيَةً مِنَ الأَحْزَابِ حِينَ نَسَخْنَا الْمُصْحَفَ قَدْ كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهَا فَالْتَمَسْنَاهَا فَوَجَدْنَاهَا مَعَ خُزَيْمَةَ بْنِ ثَابِتٍ الأَنْصَارِيِّ ‏{‏مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ‏}‏ فَأَلْحَقْنَاهَا فِي سُورَتِهَا فِي الْمُصْحَفِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4988In-book reference : Book 66, Hadith 10USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4989,
    "id": 4989,
    "url": "https://sunnah.com/bukhari:4989",
    "bookNumber": 66,
    "hadithNumber": 11,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "Abu Bakr sent for me and said, \"You used to write the Divine Revelations for Allah's Messenger (ﷺ) : So you \nshould search for (the Qur'an and collect) it.\" I started searching for the Qur'an till I found the last two \nVerses of Surat at-Tauba with Abi Khuza`ima Al-Ansari and I could not find these Verses with \nanybody other than him. (They were): \n'Verily there has come unto you an Apostle (Muhammad) from amongst yourselves. It grieves him \nthat you should receive any injury or difficulty ...' (9.128-129)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّ ابْنَ السَّبَّاقِ، قَالَ إِنَّ زَيْدَ بْنَ ثَابِتٍ قَالَ أَرْسَلَ إِلَىَّ أَبُو بَكْرٍ ـ رضى الله عنه ـ قَالَ إِنَّكَ كُنْتَ تَكْتُبُ الْوَحْىَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَاتَّبِعِ الْقُرْآنَ‏.‏ فَتَتَبَّعْتُ حَتَّى وَجَدْتُ آخِرَ سُورَةِ التَّوْبَةِ آيَتَيْنِ مَعَ أَبِي خُزَيْمَةَ الأَنْصَارِيِّ لَمْ أَجِدْهُمَا مَعَ أَحَدٍ غَيْرَهُ ‏{‏لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ‏}‏ إِلَى آخِرِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4989In-book reference : Book 66, Hadith 11USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 511   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4990,
    "id": 4990,
    "url": "https://sunnah.com/bukhari:4990",
    "bookNumber": 66,
    "hadithNumber": 12,
    "narrator": "Narrated Al-Bara:",
    "english": "There was revealed: 'Not equal are those believers who sit (at home) and those who strive and fight in \nthe Cause of Allah.' (4.95) \nThe Prophet (ﷺ) said, \"Call Zaid for me and let him bring the board, the inkpot and the scapula bone (or \nthe scapula bone and the ink pot).\"' Then he said, \"Write: 'Not equal are those Believers who sit..\", and \nat that time `Amr bin Um Maktum, the blind man was sitting behind the Prophet (ﷺ) . He said, \"O Allah's \nApostle! What is your order For me (as regards the above Verse) as I am a blind man?\" So, instead of \nthe above Verse, the following Verse was revealed: \n'Not equal are those believers who sit (at home) except those who are disabled (by injury or are blind \nor lame etc.) and those who strive and fight in the cause of Allah.' (4.95)",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا نَزَلَتْ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ‏}‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ادْعُ لِي زَيْدًا وَلْيَجِئْ بِاللَّوْحِ وَالدَّوَاةِ وَالْكَتِفِ ـ أَوِ الْكَتِفِ وَالدَّوَاةِ ـ ثُمَّ قَالَ ‏\"‏ اكْتُبْ لاَ يَسْتَوِي الْقَاعِدُونَ ‏\"‏ وَخَلْفَ ظَهْرِ النَّبِيِّ صلى الله عليه وسلم عَمْرُو بْنُ أُمِّ مَكْتُومٍ الأَعْمَى قَالَ يَا رَسُولَ اللَّهِ فَمَا تَأْمُرُنِي فَإِنِّي رَجُلٌ ضَرِيرُ الْبَصَرِ فَنَزَلَتْ مَكَانَهَا ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ فِي سَبِيلِ اللَّهِ ‏{‏غَيْرُ أُولِي الضَّرَرِ‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4990In-book reference : Book 66, Hadith 12USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 512   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4991,
    "id": 4991,
    "url": "https://sunnah.com/bukhari:4991",
    "bookNumber": 66,
    "hadithNumber": 13,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) said, \"Gabriel recited the Qur'an to me in one way. Then I requested him (to read it in \nanother way), and continued asking him to recite it in other ways, and he recited it in several ways till \nhe ultimately recited it in seven different ways.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقْرَأَنِي جِبْرِيلُ عَلَى حَرْفٍ فَرَاجَعْتُهُ، فَلَمْ أَزَلْ أَسْتَزِيدُهُ وَيَزِيدُنِي حَتَّى انْتَهَى إِلَى سَبْعَةِ أَحْرُفٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4991In-book reference : Book 66, Hadith 13USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 513   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4992,
    "id": 4992,
    "url": "https://sunnah.com/bukhari:4992",
    "bookNumber": 66,
    "hadithNumber": 14,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ) and I \nlistened to his recitation and noticed that he recited in several different ways which Allah's Messenger (ﷺ) \nhad not taught me. I was about to jump over him during his prayer, but I controlled my temper, and \nwhen he had completed his prayer, I put his upper garment around his neck and seized him by it and \nsaid, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Messenger (ﷺ) taught it to \nme.\" I said, \"You have told a lie, for Allah's Messenger (ﷺ) has taught it to me in a different way from \nyours.\" So I dragged him to Allah's Messenger (ﷺ) and said (to Allah's Messenger (ﷺ)), \n\"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's \nApostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I \nheard him reciting. Then Allah's Messenger (ﷺ) said, \"It was revealed in this way,\" and added, \"Recite, O \n`Umar!\" I recited it as he had taught me. Allah's Messenger (ﷺ) then said, \"It was revealed in this way. This \nQur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier \nfor you (or read as much of it as may be easy for you).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، وَعَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ، حَدَّثَاهُ أَنَّهُمَا، سَمِعَا عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَمَعْتُ لِقِرَاءَتِهِ فَإِذَا هُوَ يَقْرَأُ عَلَى حُرُوفٍ كَثِيرَةٍ لَمْ يُقْرِئْنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَكِدْتُ أُسَاوِرُهُ فِي الصَّلاَةِ فَتَصَبَّرْتُ حَتَّى سَلَّمَ فَلَبَّبْتُهُ بِرِدَائِهِ فَقُلْتُ مَنْ أَقْرَأَكَ هَذِهِ السُّورَةَ الَّتِي سَمِعْتُكَ تَقْرَأُ‏.‏ قَالَ أَقْرَأَنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ كَذَبْتَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَقْرَأَنِيهَا عَلَى غَيْرِ مَا قَرَأْتَ، فَانْطَلَقْتُ بِهِ أَقُودُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ بِسُورَةِ الْفُرْقَانِ عَلَى حُرُوفٍ لَمْ تُقْرِئْنِيهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسِلْهُ اقْرَأْ يَا هِشَامُ ‏\"‏‏.‏ فَقَرَأَ عَلَيْهِ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَذَلِكَ أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ اقْرَأْ يَا عُمَرُ ‏\"‏‏.‏ فَقَرَأْتُ الْقِرَاءَةَ الَّتِي أَقْرَأَنِي، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَذَلِكَ أُنْزِلَتْ، إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4992In-book reference : Book 66, Hadith 14USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 514   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4993,
    "id": 4993,
    "url": "https://sunnah.com/bukhari:4993",
    "bookNumber": 66,
    "hadithNumber": 15,
    "narrator": "Narrated Yusuf bin Mahk:",
    "english": "While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type \nof shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O \nmother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to \ncompile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" \n`Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that \nwas revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. \nWhen the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the \nfirst thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never \nleave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they \nwould have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of \nplaying age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their \nappointed time (for their full recompense), and the Hour will be more grievous and more bitter.' \n(54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with \nhim.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the \nSuras (in their proper order) .",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ وَأَخْبَرَنِي يُوسُفُ بْنُ مَاهَكَ، قَالَ إِنِّي عِنْدَ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ إِذْ جَاءَهَا عِرَاقِيٌّ فَقَالَ أَىُّ الْكَفَنِ خَيْرٌ قَالَتْ وَيْحَكَ وَمَا يَضُرُّكَ قَالَ يَا أُمَّ الْمُؤْمِنِينَ أَرِينِي مُصْحَفَكِ‏.‏ قَالَتْ لِمَ قَالَ لَعَلِّي أُوَلِّفُ الْقُرْآنَ عَلَيْهِ فَإِنَّهُ يُقْرَأُ غَيْرَ مُؤَلَّفٍ‏.‏ قَالَتْ وَمَا يَضُرُّكَ أَيَّهُ قَرَأْتَ قَبْلُ، إِنَّمَا نَزَلَ أَوَّلَ مَا نَزَلَ مِنْهُ سُورَةٌ مِنَ الْمُفَصَّلِ فِيهَا ذِكْرُ الْجَنَّةِ وَالنَّارِ حَتَّى إِذَا ثَابَ النَّاسُ إِلَى الإِسْلاَمِ نَزَلَ الْحَلاَلُ وَالْحَرَامُ، وَلَوْ نَزَلَ أَوَّلَ شَىْءٍ لاَ تَشْرَبُوا الْخَمْرَ‏.‏ لَقَالُوا لاَ نَدَعُ الْخَمْرَ أَبَدًا‏.‏ وَلَوْ نَزَلَ‏.‏ لاَ تَزْنُوا‏.‏ لَقَالُوا لاَ نَدَعُ الزِّنَا أَبَدًا‏.‏ لَقَدْ نَزَلَ بِمَكَّةَ عَلَى مُحَمَّدٍ صلى الله عليه وسلم وَإِنِّي لَجَارِيَةٌ أَلْعَبُ ‏{‏بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ‏}‏ وَمَا نَزَلَتْ سُورَةُ الْبَقَرَةِ وَالنِّسَاءِ إِلاَّ وَأَنَا عِنْدَهُ‏.‏ قَالَ فَأَخْرَجَتْ لَهُ الْمُصْحَفَ فَأَمْلَتْ عَلَيْهِ آىَ السُّوَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4993In-book reference : Book 66, Hadith 15USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 515   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4994,
    "id": 4994,
    "url": "https://sunnah.com/bukhari:4994",
    "bookNumber": 66,
    "hadithNumber": 16,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "Surat Bani-lsrael, Al-Kahf (The Cave), Maryam, Taha, Al-Anbiya' (The prophets) are amongst my \nfirst earnings and my old property, and (in fact) they are my old property.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ فِي بَنِي إِسْرَائِيلَ وَالْكَهْفِ وَمَرْيَمَ وَطَهَ وَالأَنْبِيَاءِ إِنَّهُنَّ مِنَ الْعِتَاقِ الأُوَلِ وَهُنَّ مِنْ تِلاَدِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4994In-book reference : Book 66, Hadith 16USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 516   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4995,
    "id": 4995,
    "url": "https://sunnah.com/bukhari:4995",
    "bookNumber": 66,
    "hadithNumber": 17,
    "narrator": "Narrated Al-Bara':",
    "english": "I learnt, 'Glorify the Name of your Lord the Most High' (Surat al-A'la) No 87, before the Prophet (ﷺ) came \n(to Medina) .",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، أَنْبَأَنَا أَبُو إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ تَعَلَّمْتُ ‏{‏سَبِّحِ اسْمَ رَبِّكَ‏}‏ قَبْلَ أَنْ يَقْدَمَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4995In-book reference : Book 66, Hadith 17USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 517   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4996,
    "id": 4996,
    "url": "https://sunnah.com/bukhari:4996",
    "bookNumber": 66,
    "hadithNumber": 18,
    "narrator": "Narrated Shaqiq:",
    "english": "`Abdullah said, \"I learnt An-Naza'ir which the Prophet (ﷺ) used to recite in pairs in each rak`a.\" Then \n`Abdullah got up and Alqama accompanied him to his house, and when Alqama came out, we asked \nhim (about those Suras). He said, \"They are twenty Suras that start from the beginning of Al- \nMufassal, according to the arrangement done be Ibn Mas`ud, and end with the Suras starting with Ha \nMim, e.g. Ha Mim (the Smoke). and \"About what they question one another?\" (78.1)",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ قَالَ عَبْدُ اللَّهِ قَدْ عَلِمْتُ النَّظَائِرَ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَؤُهُنَّ اثْنَيْنِ اثْنَيْنِ فِي كُلِّ رَكْعَةٍ‏.‏ فَقَامَ عَبْدُ اللَّهِ وَدَخَلَ مَعَهُ عَلْقَمَةُ وَخَرَجَ عَلْقَمَةُ فَسَأَلْنَاهُ فَقَالَ عِشْرُونَ سُورَةً مِنْ أَوَّلِ الْمُفَصَّلِ عَلَى تَأْلِيفِ ابْنِ مَسْعُودٍ آخِرُهُنَّ الْحَوَامِيمُ حم الدُّخَانُ وَعَمَّ يَتَسَاءَلُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4996In-book reference : Book 66, Hadith 18USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 518   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4997,
    "id": 4997,
    "url": "https://sunnah.com/bukhari:4997",
    "bookNumber": 66,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was the most generous person, and he used to become more so (generous) particularly in \nthe month of Ramadan because Gabriel used to meet him every night of the month of Ramadan till it \nelapsed. Allah's Messenger (ﷺ) used to recite the Qur'an for him. When Gabriel met him, he used to become \nmore generous than the fast wind in doing good.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَجْوَدَ النَّاسِ بِالْخَيْرِ، وَأَجْوَدُ مَا يَكُونُ فِي شَهْرِ رَمَضَانَ لأَنَّ جِبْرِيلَ كَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ فِي شَهْرِ رَمَضَانَ حَتَّى يَنْسَلِخَ يَعْرِضُ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الْقُرْآنَ، فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4997In-book reference : Book 66, Hadith 19USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 519   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4998,
    "id": 4998,
    "url": "https://sunnah.com/bukhari:4998",
    "bookNumber": 66,
    "hadithNumber": 20,
    "narrator": "Narrated Abu-Huraira:",
    "english": "Gabriel used to repeat the recitation of the Qur'an with the Prophet (ﷺ) once a year, but he repeated it \ntwice with him in the year he died. The Prophet (ﷺ) used to stay in I`tikaf for ten days every year (in the \nmonth of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ يَعْرِضُ عَلَى النَّبِيِّ صلى الله عليه وسلم الْقُرْآنَ كُلَّ عَامٍ مَرَّةً، فَعَرَضَ عَلَيْهِ مَرَّتَيْنِ فِي الْعَامِ الَّذِي قُبِضَ، وَكَانَ يَعْتَكِفُ كُلَّ عَامٍ عَشْرًا فَاعْتَكَفَ عِشْرِينَ فِي الْعَامِ الَّذِي قُبِضَ ‏{‏فِيهِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4998In-book reference : Book 66, Hadith 20USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 520   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4999,
    "id": 4999,
    "url": "https://sunnah.com/bukhari:4999",
    "bookNumber": 66,
    "hadithNumber": 21,
    "narrator": "Narrated Masriq:",
    "english": "`Abdullah bin `Amr mentioned `Abdullah bin Masud and said, \"I shall ever love that man, for I heard \nthe Prophet (ﷺ) saying, 'Take (learn) the Qur'an from four: `Abdullah bin Masud, Salim, Mu`adh and Ubai \nbin Ka`b.' \"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، ذَكَرَ عَبْدُ اللَّهِ بْنُ عَمْرٍو عَبْدَ اللَّهِ بْنَ مَسْعُودٍ فَقَالَ لاَ أَزَالُ أُحِبُّهُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ خُذُوا الْقُرْآنَ مِنْ أَرْبَعَةٍ مِنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَسَالِمٍ وَمُعَاذٍ وَأُبَىِّ بْنِ كَعْبٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4999In-book reference : Book 66, Hadith 21USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 521   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5000,
    "id": 5000,
    "url": "https://sunnah.com/bukhari:5000",
    "bookNumber": 66,
    "hadithNumber": 22,
    "narrator": "Narrated Shaqiq bin Salama:",
    "english": "Once `Abdullah bin Mas`ud delivered a sermon before us and said, \"By Allah, I learnt over seventy \nSuras direct from Allah's Messenger (ﷺ) . By Allah, the companions of the Prophet (ﷺ) came to know that I am \none of those who know Allah's Book best of all of them, yet I am not the best of them.\" Shaqiq added: \nI sat in his religious gathering and I did not hear anybody opposing him (in his speech).",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقُ بْنُ سَلَمَةَ، قَالَ خَطَبَنَا عَبْدُ اللَّهِ فَقَالَ وَاللَّهِ لَقَدْ أَخَذْتُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم بِضْعًا وَسَبْعِينَ سُورَةً، وَاللَّهِ لَقَدْ عَلِمَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم أَنِّي مِنْ أَعْلَمِهِمْ بِكِتَابِ اللَّهِ وَمَا أَنَا بِخَيْرِهِمْ‏.‏ قَالَ شَقِيقٌ فَجَلَسْتُ فِي الْحِلَقِ أَسْمَعُ مَا يَقُولُونَ فَمَا سَمِعْتُ رَادًّا يَقُولُ غَيْرَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5000In-book reference : Book 66, Hadith 22USC-MSA web (English) reference : Vol. 6, Book 61, Hadith 522   (deprecated numbering scheme)"
  }
]