[
  {
    "hadithGlobalNumber": 1101,
    "id": 1101,
    "url": "https://sunnah.com/bukhari:1101",
    "bookNumber": 18,
    "hadithNumber": 21,
    "narrator": "Narrated Hafs bin `Asim:",
    "english": "Ibn `Umar went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional \nprayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to \nfollow.' \" (33.21)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ حَفْصَ بْنَ عَاصِمٍ، حَدَّثَهُ قَالَ سَافَرَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ فَقَالَ صَحِبْتُ النَّبِيَّ صلى الله عليه وسلم فَلَمْ أَرَهُ يُسَبِّحُ فِي السَّفَرِ، وَقَالَ اللَّهُ جَلَّ ذِكْرُهُ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1101In-book reference : Book 18, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 205   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1102,
    "id": 1102,
    "url": "https://sunnah.com/bukhari:1102",
    "bookNumber": 18,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu \nBakr, `Umar and `Uthman used to do the same.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عِيسَى بْنِ حَفْصِ بْنِ عَاصِمٍ، قَالَ حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ ابْنَ عُمَرَ، يَقُولُ صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَانَ لاَ يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ، وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَذَلِكَ ـ رضى الله عنهم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1102In-book reference : Book 18, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 206   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1103,
    "id": 1103,
    "url": "https://sunnah.com/bukhari:1103",
    "bookNumber": 18,
    "hadithNumber": 23,
    "narrator": "Narrated Ibn Abu Laila:",
    "english": "Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). \nShe said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight \nrak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ مَا أَنْبَأَ أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم صَلَّى الضُّحَى غَيْرُ أُمِّ هَانِئٍ ذَكَرَتْ أَنَّ النَّبِيَّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا، فَصَلَّى ثَمَانِ رَكَعَاتٍ، فَمَا رَأَيْتُهُ صَلَّى صَلاَةً أَخَفَّ مِنْهَا، غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1103In-book reference : Book 18, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1104,
    "id": 1104,
    "url": "https://sunnah.com/bukhari:1104",
    "bookNumber": 18,
    "hadithNumber": 24,
    "narrator": "",
    "english": "Narrated `Abdullah bin Amir that his father had told him that he had seen the Prophet (p.b.u.h) \npraying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَامِرٍ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم صَلَّى السُّبْحَةَ بِاللَّيْلِ فِي السَّفَرِ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1104In-book reference : Book 18, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1105,
    "id": 1105,
    "url": "https://sunnah.com/bukhari:1105",
    "bookNumber": 18,
    "hadithNumber": 25,
    "narrator": "Narrated Salim bin `Abdullah:",
    "english": "Ibn `Umar said, \"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by \nsigns facing any direction.\" Ibn `Umar used to do the same.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُسَبِّحُ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ كَانَ وَجْهُهُ، يُومِئُ بِرَأْسِهِ، وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1105In-book reference : Book 18, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1106,
    "id": 1106,
    "url": "https://sunnah.com/bukhari:1106",
    "bookNumber": 18,
    "hadithNumber": 26,
    "narrator": "Narrated Salim's father:",
    "english": "The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ إِذَا جَدَّ بِهِ السَّيْرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1106In-book reference : Book 18, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1107,
    "id": 1107,
    "url": "https://sunnah.com/bukhari:1107",
    "bookNumber": 18,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet (ﷺ) used to offer the Maghrib and the `Isha' prayers together on journeys.",
    "arabic": "وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنِ الْحُسَيْنِ الْمُعَلِّمِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْمَعُ بَيْنَ صَلاَةِ الظُّهْرِ وَالْعَصْرِ إِذَا كَانَ عَلَى ظَهْرِ سَيْرٍ، وَيَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1107In-book reference : Book 18, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1108,
    "id": 1108,
    "url": "https://sunnah.com/bukhari:1108",
    "bookNumber": 18,
    "hadithNumber": 28,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.",
    "arabic": "وَعَنْ حُسَيْنٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ صَلاَةِ الْمَغْرِبِ وَالْعِشَاءِ فِي السَّفَرِ‏.‏ وَتَابَعَهُ عَلِيُّ بْنُ الْمُبَارَكِ وَحَرْبٌ عَنْ يَحْيَى عَنْ حَفْصٍ عَنْ أَنَسٍ جَمَعَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1108In-book reference : Book 18, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1109,
    "id": 1109,
    "url": "https://sunnah.com/bukhari:1109",
    "bookNumber": 18,
    "hadithNumber": 29,
    "narrator": "Narrated Az-Zuhri:",
    "english": "Salim told me, \"`Abdullah bin `Umar said, 'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he \noffered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \n\"Abdullah bin `Umar used to do the same whenever he was in a hurry during the journey. After \nmaking the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform \nTaslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer \ntwo rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the \n`Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ صَلاَةَ الْمَغْرِبِ، حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ‏.‏ قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُهُ إِذَا أَعْجَلَهُ السَّيْرُ، وَيُقِيمُ الْمَغْرِبَ فَيُصَلِّيهَا ثَلاَثًا، ثُمَّ يُسَلِّمُ، ثُمَّ قَلَّمَا يَلْبَثُ حَتَّى يُقِيمَ الْعِشَاءَ، فَيُصَلِّيهَا رَكْعَتَيْنِ، ثُمَّ يُسَلِّمُ وَلاَ يُسَبِّحُ بَيْنَهَا بِرَكْعَةٍ، وَلاَ بَعْدَ الْعِشَاءِ بِسَجْدَةٍ حَتَّى يَقُومَ مِنْ جَوْفِ اللَّيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1109In-book reference : Book 18, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1110,
    "id": 1110,
    "url": "https://sunnah.com/bukhari:1110",
    "bookNumber": 18,
    "hadithNumber": 30,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Whenever the Prophet (ﷺ) started a journey before noon, he used to delay the Zuhr prayer till the time of \n`Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer \nand then ride (for the journey).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ هَاتَيْنِ الصَّلاَتَيْنِ فِي السَّفَرِ‏.‏ يَعْنِي الْمَغْرِبَ وَالْعِشَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1110In-book reference : Book 18, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 212   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1111,
    "id": 1111,
    "url": "https://sunnah.com/bukhari:1111",
    "bookNumber": 18,
    "hadithNumber": 31,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time \nfor the `Asr prayer and then he would dismount and pray them together; and whenever the sun \ndeclined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).",
    "arabic": "حَدَّثَنَا حَسَّانُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ، ثُمَّ يَجْمَعُ بَيْنَهُمَا، وَإِذَا زَاغَتْ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1111In-book reference : Book 18, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1112,
    "id": 1112,
    "url": "https://sunnah.com/bukhari:1112",
    "bookNumber": 18,
    "hadithNumber": 32,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ، ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا، فَإِنْ زَاغَتِ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1112In-book reference : Book 18, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1113,
    "id": 1113,
    "url": "https://sunnah.com/bukhari:1113",
    "bookNumber": 18,
    "hadithNumber": 33,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him \nstanding and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is \nto be followed and so when he bows you should bow; and when he lifts his head you should also do \nthe same.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِهِ وَهْوَ شَاكٍ، فَصَلَّى جَالِسًا وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا، فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا، فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1113In-book reference : Book 18, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 214   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1114,
    "id": 1114,
    "url": "https://sunnah.com/bukhari:1114",
    "bookNumber": 18,
    "hadithNumber": 34,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) fell down from a horse and his right side was either injured or scratched, so \nwe went to inquire about his health. The time for the prayer became due and he offered the prayer \nwhile sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says \nTakbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head \nyou should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends \nhis praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for \nYou.\") (See Hadith No. 656 Vol. 1).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سَقَطَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ فَرَسٍ فَخُدِشَ ـ أَوْ فَجُحِشَ ـ شِقُّهُ الأَيْمَنُ، فَدَخَلْنَا عَلَيْهِ نَعُودُهُ، فَحَضَرَتِ الصَّلاَةُ فَصَلَّى قَاعِدًا فَصَلَّيْنَا قُعُودًا وَقَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1114In-book reference : Book 18, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 215   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1115,
    "id": 1115,
    "url": "https://sunnah.com/bukhari:1115",
    "bookNumber": 18,
    "hadithNumber": 35,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays \nwhile standing it is better and he who prays while sitting gets half the reward of that who prays \nstanding; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا حُسَيْنٌ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنه ـ أَنَّهُ سَأَلَ نَبِيَّ اللَّهِ صلى الله عليه وسلم‏.‏ أَخْبَرَنَا إِسْحَاقُ قَالَ أَخْبَرَنَا عَبْدُ الصَّمَدِ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا الْحُسَيْنُ عَنِ ابْنِ بُرَيْدَةَ قَالَ حَدَّثَنِي عِمْرَانُ بْنُ حُصَيْنٍ ـ وَكَانَ مَبْسُورًا ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ الرَّجُلِ قَاعِدًا فَقَالَ ‏\n\"‏ إِنْ صَلَّى قَائِمًا فَهْوَ أَفْضَلُ، وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ، وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1115In-book reference : Book 18, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 216   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1116,
    "id": 1116,
    "url": "https://sunnah.com/bukhari:1116",
    "bookNumber": 18,
    "hadithNumber": 36,
    "narrator": "Narrated `Abdullah bin Buraida:",
    "english": "`Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked \nthe Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray \nstanding; and whoever prays sitting gets half the reward of that who prays while standing; and \nwhoever prays while Lying gets half the reward of that who prays while sitting.' \"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ ـ وَكَانَ رَجُلاً مَبْسُورًا ـ وَقَالَ أَبُو مَعْمَرٍ مَرَّةً عَنْ عِمْرَانَ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ صَلاَةِ الرَّجُلِ وَهْوَ قَاعِدٌ فَقَالَ ‏\n\"‏ مَنْ صَلَّى قَائِمًا فَهْوَ أَفْضَلُ، وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ، وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ نَائِمًا عِنْدِي مُضْطَجِعًا هَا هُنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1116In-book reference : Book 18, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 217   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1117,
    "id": 1117,
    "url": "https://sunnah.com/bukhari:1117",
    "bookNumber": 18,
    "hadithNumber": 37,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray \nwhile sitting and if you cannot do even that, then pray Lying on your side.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ عَبْدِ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، قَالَ حَدَّثَنِي الْحُسَيْنُ الْمُكْتِبُ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنه ـ قَالَ كَانَتْ بِي بَوَاسِيرُ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الصَّلاَةِ فَقَالَ ‏\n\"‏ صَلِّ قَائِمًا، فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا، فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1117In-book reference : Book 18, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 218   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1118,
    "id": 1118,
    "url": "https://sunnah.com/bukhari:1118",
    "bookNumber": 18,
    "hadithNumber": 38,
    "narrator": "Narrated Aisha:",
    "english": "(the mother of the faithful believers) I never saw Allah's Messenger (ﷺ) offering the night prayer while \nsitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he \nwould get up and recite thirty or forty verses (while standing) and then bow.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أُمِّ الْمُؤْمِنِينَ أَنَّهَا أَخْبَرَتْهُ أَنَّهَا لَمْ تَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةَ اللَّيْلِ قَاعِدًا قَطُّ حَتَّى أَسَنَّ، فَكَانَ يَقْرَأُ قَاعِدًا حَتَّى إِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ، فَقَرَأَ نَحْوًا مِنْ ثَلاَثِينَ آيَةً أَوْ أَرْبَعِينَ آيَةً، ثُمَّ رَكَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1118In-book reference : Book 18, Hadith 38USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1119,
    "id": 1119,
    "url": "https://sunnah.com/bukhari:1119",
    "bookNumber": 18,
    "hadithNumber": 39,
    "narrator": "Narrated `Aisha:",
    "english": "(the mother of the faithful believers) Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would \nrecite while sitting, and when thirty or forty verses remained from the recitation he would get up and \nrecite them while standing and then he would bow and prostrate. He used to do the same in the second \nrak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I \nwas asleep, he would lie down.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، وَأَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهْوَ جَالِسٌ، فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ نَحْوٌ مِنْ ثَلاَثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَهَا وَهْوَ قَائِمٌ، ثُمَّ يَرْكَعُ ثُمَّ يَسْجُدُ، يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ، فَإِذَا قَضَى صَلاَتَهُ نَظَرَ، فَإِنْ كُنْتُ يَقْظَى تَحَدَّثَ مَعِي، وَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1119In-book reference : Book 18, Hadith 39USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1120,
    "id": 1120,
    "url": "https://sunnah.com/bukhari:1120",
    "bookNumber": 19,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. \nAnta qaiyyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa \nman fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Wa lakal-hamd, anta-l-haq wa wa'duka-lhaq, \nwa liqa'uka Haq, wa qauluka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa \nMuhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika \namantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma \nqaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la \nilaha illa anta (or la ilaha ghairuka). (O Allah! All the praises are for you, You are the Holder of the \nHeavens and the Earth, And whatever is in them. All the praises are for You; You have the possession \nof the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light \nof the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the \nEarth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet \nYou is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace \nbe upon them) are true; And Muhammad is true, And the Day of Resurrection is true. O Allah ! I \nsurrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your \nhelp I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). \nPlease forgive me my previous And future sins; And whatever I concealed or revealed And You are \nthe One who make (some people) forward And (some) backward. There is none to be worshipped but \nyou . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa \nbillah' (There is neither might nor power except with Allah).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ، عَنْ طَاوُسٍ، سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ قَالَ ‏\"‏ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ، لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ، وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَلِقَاؤُكَ حَقٌّ، وَقَوْلُكَ حَقٌّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ صلى الله عليه وسلم حَقٌّ، وَالسَّاعَةُ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَهَ إِلاَّ أَنْتَ ـ أَوْ لاَ إِلَهَ غَيْرُكَ ـ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَزَادَ عَبْدُ الْكَرِيمِ أَبُو أُمَيَّةَ ‏\"‏ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏ قَالَ سُفْيَانُ قَالَ سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ سَمِعَهُ مِنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1120In-book reference : Book 19, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1121,
    "id": 1121,
    "url": "https://sunnah.com/bukhari:1121",
    "bookNumber": 19,
    "hadithNumber": 2,
    "narrator": "Narrated Salim's father:",
    "english": "In the lifetime of the Prophet (ﷺ) whosoever saw a dream would narrate it to Allah's Messenger (ﷺ). I had a wish \nof seeing a dream to narrate it to Allah's Messenger (ﷺ) (p.b.u.h) I was a grown up boy and used to sleep in \nthe Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and \ntook me to the Fire which was built all round like a built well and had two poles in it and the people in \nit were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another \nangel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Messenger (ﷺ). The \nProphet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's \nfather) used to sleep but a little at night.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنَا مَعْمَرٌ،‏.‏ وَحَدَّثَنِي مَحْمُودٌ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ الرَّجُلُ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم إِذَا رَأَى رُؤْيَا قَصَّهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَمَنَّيْتُ أَنْ أَرَى رُؤْيَا فَأَقُصَّهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَكُنْتُ غُلاَمًا شَابًّا، وَكُنْتُ أَنَامُ فِي الْمَسْجِدِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُ فِي النَّوْمِ كَأَنَّ مَلَكَيْنِ أَخَذَانِي فَذَهَبَا بِي إِلَى النَّارِ فَإِذَا هِيَ مَطْوِيَّةٌ كَطَىِّ الْبِئْرِ، وَإِذَا لَهَا قَرْنَانِ، وَإِذَا فِيهَا أُنَاسٌ قَدْ عَرَفْتُهُمْ فَجَعَلْتُ أَقُولُ أَعُوذُ بِاللَّهِ مِنَ النَّارِ ـ قَالَ ـ فَلَقِيَنَا مَلَكٌ آخَرُ فَقَالَ لِي لَمْ تُرَعْ‏.‏ \nفَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ، لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ‏\"‏‏.‏ فَكَانَ بَعْدُ لاَ يَنَامُ مِنَ اللَّيْلِ إِلاَّ قَلِيلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1121, 1122In-book reference : Book 19, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1122,
    "id": 1122,
    "url": "https://sunnah.com/bukhari:1122",
    "bookNumber": 19,
    "hadithNumber": 2,
    "narrator": "Narrated Salim's father:",
    "english": "In the lifetime of the Prophet (ﷺ) whosoever saw a dream would narrate it to Allah's Messenger (ﷺ). I had a wish \nof seeing a dream to narrate it to Allah's Messenger (ﷺ) (p.b.u.h) I was a grown up boy and used to sleep in \nthe Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and \ntook me to the Fire which was built all round like a built well and had two poles in it and the people in \nit were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another \nangel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Messenger (ﷺ). The \nProphet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's \nfather) used to sleep but a little at night.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنَا مَعْمَرٌ،‏.‏ وَحَدَّثَنِي مَحْمُودٌ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ الرَّجُلُ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم إِذَا رَأَى رُؤْيَا قَصَّهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَمَنَّيْتُ أَنْ أَرَى رُؤْيَا فَأَقُصَّهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَكُنْتُ غُلاَمًا شَابًّا، وَكُنْتُ أَنَامُ فِي الْمَسْجِدِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُ فِي النَّوْمِ كَأَنَّ مَلَكَيْنِ أَخَذَانِي فَذَهَبَا بِي إِلَى النَّارِ فَإِذَا هِيَ مَطْوِيَّةٌ كَطَىِّ الْبِئْرِ، وَإِذَا لَهَا قَرْنَانِ، وَإِذَا فِيهَا أُنَاسٌ قَدْ عَرَفْتُهُمْ فَجَعَلْتُ أَقُولُ أَعُوذُ بِاللَّهِ مِنَ النَّارِ ـ قَالَ ـ فَلَقِيَنَا مَلَكٌ آخَرُ فَقَالَ لِي لَمْ تُرَعْ‏.‏ \nفَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ، لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ‏\"‏‏.‏ فَكَانَ بَعْدُ لاَ يَنَامُ مِنَ اللَّيْلِ إِلاَّ قَلِيلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1121, 1122In-book reference : Book 19, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1123,
    "id": 1123,
    "url": "https://sunnah.com/bukhari:1123",
    "bookNumber": 19,
    "hadithNumber": 3,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to offer eleven rak`at and that was his prayer. He used to prolong the prostration \nto such an extent that one could recite fifty verses (of the Qur'an) before he would lift his head. He \nused to pray two rak`at (Sunna) before the Fajr prayer and then used to lie down on his right side till \nthe call-maker came and informed him about the prayer.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً، كَانَتْ تِلْكَ صَلاَتَهُ، يَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُنَادِي لِلصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1123In-book reference : Book 19, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1124,
    "id": 1124,
    "url": "https://sunnah.com/bukhari:1124",
    "bookNumber": 19,
    "hadithNumber": 4,
    "narrator": "Narrated Jundab:",
    "english": "The Prophet (ﷺ) became sick and did not get up (for Tahajjud prayer) for a night or two.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَسْوَدِ، قَالَ سَمِعْتُ جُنْدَبًا، يَقُولُ اشْتَكَى النَّبِيُّ صلى الله عليه وسلم فَلَمْ يَقُمْ لَيْلَةً أَوْ لَيْلَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1124In-book reference : Book 19, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1125,
    "id": 1125,
    "url": "https://sunnah.com/bukhari:1125",
    "bookNumber": 19,
    "hadithNumber": 5,
    "narrator": "Narrated Jundab bin `Abdullah:",
    "english": "Gabriel did not come to the Prophet (for some time) and so one of the Quraish women said, \"His \nSatan has deserted him.\" So came the Divine Revelation: \"By the forenoon And by the night When it \nis still! Your Lord (O Muhammad) has neither Forsaken you Nor hated you.\" (93.1-3)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ احْتَبَسَ جِبْرِيلُ صلى الله عليه وسلم عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتِ امْرَأَةٌ مِنْ قُرَيْشٍ أَبْطَأَ عَلَيْهِ شَيْطَانُهُ‏.‏ فَنَزَلَتْ ‏{‏وَالضُّحَى * وَاللَّيْلِ إِذَا سَجَى * مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
    "reference": "Reference : Sahih al-Bukhari 1125In-book reference : Book 19, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1126,
    "id": 1126,
    "url": "https://sunnah.com/bukhari:1126",
    "bookNumber": 19,
    "hadithNumber": 6,
    "narrator": "Narrated Um Salama:",
    "english": "One night the Prophet (ﷺ) got up and said, \"Subhan Allah! How many afflictions Allah has revealed \ntonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady \noccupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in \nthe Hereafter.\"",
    "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ بِنْتِ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَيْقَظَ لَيْلَةً فَقَالَ ‏\n\"‏ سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتْنَةِ، مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ مَنْ يُوقِظُ صَوَاحِبَ الْحُجُرَاتِ، يَا رُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ فِي الآخِرَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1126In-book reference : Book 19, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1127,
    "id": 1127,
    "url": "https://sunnah.com/bukhari:1127",
    "bookNumber": 19,
    "hadithNumber": 7,
    "narrator": "Narrated `Ali bin Abi Talib:",
    "english": "One night Allah's Messenger (ﷺ) came to me and Fatima, the daughter of the Prophet (ﷺ) and asked, \"Won't you \npray (at night)?\" I said, \"O Allah's Messenger (ﷺ)! Our souls are in the hands of Allah and if He wants us to \nget up He will make us get up.\" When I said that, he left us without saying anything and I heard that \nhe was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ، أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ بِنْتَ النَّبِيِّ ـ عَلَيْهِ السَّلاَمُ ـ لَيْلَةً فَقَالَ ‏\"‏ أَلاَ تُصَلِّيَانِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَنْفُسُنَا بِيَدِ اللَّهِ، فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا‏.‏ فَانْصَرَفَ حِينَ قُلْنَا ذَلِكَ وَلَمْ يَرْجِعْ إِلَىَّ شَيْئًا‏.‏ ثُمَّ سَمِعْتُهُ وَهْوَ مُوَلٍّ يَضْرِبُ فَخِذَهُ وَهْوَ يَقُولُ ‏\"‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً‏}‏‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1127In-book reference : Book 19, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1128,
    "id": 1128,
    "url": "https://sunnah.com/bukhari:1128",
    "bookNumber": 19,
    "hadithNumber": 8,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to give up a good deed, although he loved to do it, for fear that people might act \non it and it might be made compulsory for them. The Prophet (ﷺ) never prayed the Duha prayer, but I \noffer it.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَدَعُ الْعَمَلَ وَهْوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ، وَمَا سَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُبْحَةَ الضُّحَى قَطُّ، وَإِنِّي لأُسَبِّحُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1128In-book reference : Book 19, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1129,
    "id": 1129,
    "url": "https://sunnah.com/bukhari:1129",
    "bookNumber": 19,
    "hadithNumber": 9,
    "narrator": "Narrated `Aisha the mother of the faithful believers:",
    "english": "One night Allah's Messenger (ﷺ) offered the prayer in the Mosque and the people followed him. The next \nnight he also offered the prayer and too many people gathered. On the third and the fourth nights more \npeople gathered, but Allah's Messenger (ﷺ) did not come out to them. In the morning he said, \"I saw what \nyou were doing and nothing but the fear that it (i.e. the prayer) might be enjoined on you, stopped me \nfrom coming to you.\" And that happened in the month of Ramadan.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى ذَاتَ لَيْلَةٍ فِي الْمَسْجِدِ فَصَلَّى بِصَلاَتِهِ نَاسٌ، ثُمَّ صَلَّى مِنَ الْقَابِلَةِ فَكَثُرَ النَّاسُ، ثُمَّ اجْتَمَعُوا مِنَ اللَّيْلَةِ الثَّالِثَةِ أَوِ الرَّابِعَةِ، فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَلَمَّا أَصْبَحَ قَالَ ‏\n\"‏ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ وَلَمْ يَمْنَعْنِي مِنَ الْخُرُوجِ إِلَيْكُمْ إِلاَّ أَنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ ‏\"‏، وَذَلِكَ فِي رَمَضَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1129In-book reference : Book 19, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1130,
    "id": 1130,
    "url": "https://sunnah.com/bukhari:1130",
    "bookNumber": 19,
    "hadithNumber": 10,
    "narrator": "Narrated Al-Mughira:",
    "english": "The Prophet (ﷺ) used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why \n(he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مِسْعَرٌ، عَنْ زِيَادٍ، قَالَ سَمِعْتُ الْمُغِيرَةَ ـ رضى الله عنه ـ يَقُولُ إِنْ كَانَ النَّبِيُّ صلى الله عليه وسلم لَيَقُومُ لِيُصَلِّيَ حَتَّى تَرِمُ قَدَمَاهُ أَوْ سَاقَاهُ، فَيُقَالُ لَهُ فَيَقُولُ ‏\n\"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1130In-book reference : Book 19, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1131,
    "id": 1131,
    "url": "https://sunnah.com/bukhari:1131",
    "bookNumber": 19,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdullah bin `Amr bin Al-`As:",
    "english": "Allah's Messenger (ﷺ) told me, \"The most beloved prayer to Allah is that of David and the most beloved \nfasts to Allah are those of David. He used to sleep for half of the night and then pray for one third of \nthe night and again sleep for its sixth part and used to fast on alternate days.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، أَنَّ عَمْرَو بْنَ أَوْسٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ ‏\n\"‏ أَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ وَأَحَبُّ الصِّيَامِ إِلَى اللَّهِ صِيَامُ دَاوُدَ، وَكَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ، وَيَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1131In-book reference : Book 19, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1132,
    "id": 1132,
    "url": "https://sunnah.com/bukhari:1132",
    "bookNumber": 19,
    "hadithNumber": 12,
    "narrator": "Narrated Masruq:",
    "english": "I asked `Aisha which deed was most loved by the Prophet. She said, \"A deed done continuously.\" I \nfurther asked, \"When did he used to get up (in the night for the prayer).\" She said, \"He used to get up \non hearing the crowing of a cock.\"",
    "arabic": "حَدَّثَنِي عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَشْعَثَ، سَمِعْتُ أَبِي قَالَ، سَمِعْتُ مَسْرُوقًا، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَتِ الدَّائِمُ‏.‏ قُلْتُ مَتَى كَانَ يَقُومُ قَالَتْ يَقُومُ إِذَا سَمِعَ الصَّارِخَ‏.",
    "reference": "Reference : Sahih al-Bukhari 1132In-book reference : Book 19, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1133,
    "id": 1133,
    "url": "https://sunnah.com/bukhari:1133",
    "bookNumber": 19,
    "hadithNumber": 14,
    "narrator": "Narrated `Aisha:",
    "english": "In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، قَالَ ذَكَرَ أَبِي عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا أَلْفَاهُ السَّحَرُ عِنْدِي إِلاَّ نَائِمًا‏.‏ تَعْنِي النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1133In-book reference : Book 19, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1134,
    "id": 1134,
    "url": "https://sunnah.com/bukhari:1134",
    "bookNumber": 19,
    "hadithNumber": 15,
    "narrator": "Narrated Qatada:",
    "english": "Anas bin Malik said, \"The Prophet (p.b.u.h) and Zaid bin Thabit took their Suhur together. When they \nfinished it, the Prophet (ﷺ) stood for the (Fajr) prayer and offered it.\" We asked Anas, \"What was the \ninterval between their finishing the Suhur and the starting of the morning prayer?\" Anas replied, \"It \nwas equal to the time taken by a person in reciting fifty verses of the Qur'an.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَزَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ تَسَحَّرَا، فَلَمَّا فَرَغَا مِنْ سَحُورِهِمَا قَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلَى الصَّلاَةِ فَصَلَّى‏.‏ قُلْنَا لأَنَسٍ كَمْ كَانَ بَيْنَ فَرَاغِهِمَا مِنْ سَحُورِهِمَا وَدُخُولِهِمَا فِي الصَّلاَةِ قَالَ كَقَدْرِ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1134In-book reference : Book 19, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1135,
    "id": 1135,
    "url": "https://sunnah.com/bukhari:1135",
    "bookNumber": 19,
    "hadithNumber": 16,
    "narrator": "Narrated Abu-Wail:",
    "english": "`Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet (ﷺ) and he kept on standing till \nan ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and \nleave the Prophet (standing).\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً، فَلَمْ يَزَلْ قَائِمًا حَتَّى هَمَمْتُ بِأَمْرِ سَوْءٍ‏.‏ قُلْنَا وَمَا هَمَمْتَ قَالَ هَمَمْتَ أَنْ أَقْعُدَ وَأَذَرَ النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1135In-book reference : Book 19, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1136,
    "id": 1136,
    "url": "https://sunnah.com/bukhari:1136",
    "bookNumber": 19,
    "hadithNumber": 17,
    "narrator": "Narrated Hudhaifa:",
    "english": "Whenever the Prophet (ﷺ) got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَامَ لِلتَّهَجُّدِ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1136In-book reference : Book 19, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 237   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1137,
    "id": 1137,
    "url": "https://sunnah.com/bukhari:1137",
    "bookNumber": 19,
    "hadithNumber": 18,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "A man said, \"O Allah's Messenger (ﷺ)! How is the prayer of the night?\" He said, \"Two rak`at followed by \ntwo rak`at and so on, and when you apprehend the approaching dawn, offer one rak`a as witr.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ إِنَّ رَجُلاً قَالَ يَا رَسُولَ اللَّهِ، كَيْفَ صَلاَةُ اللَّيْلِ قَالَ ‏\n\"‏ مَثْنَى مَثْنَى، فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1137In-book reference : Book 19, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1138,
    "id": 1138,
    "url": "https://sunnah.com/bukhari:1138",
    "bookNumber": 19,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The prayer of the Prophet (ﷺ) used to be of thirteen rak`at, i.e. of the night prayer.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي أَبُو جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ صَلاَةُ النَّبِيِّ صلى الله عليه وسلم ثَلاَثَ عَشْرَةَ رَكْعَةً‏.‏ يَعْنِي بِاللَّيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1138In-book reference : Book 19, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1139,
    "id": 1139,
    "url": "https://sunnah.com/bukhari:1139",
    "bookNumber": 19,
    "hadithNumber": 20,
    "narrator": "Narrated Masruq:",
    "english": "I asked Aisha about the night prayer of Allah's Messenger (ﷺ) and she said, \"It was seven, nine or eleven \nrak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ يَحْيَى بْنِ وَثَّابٍ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ‏.‏ فَقَالَتْ سَبْعٌ وَتِسْعٌ وَإِحْدَى عَشْرَةَ سِوَى رَكْعَتَىِ الْفَجْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1139In-book reference : Book 19, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1140,
    "id": 1140,
    "url": "https://sunnah.com/bukhari:1140",
    "bookNumber": 19,
    "hadithNumber": 21,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (p.b.u.h) used to offer thirteen rak`at of the night prayer and that included the witr and \ntwo rak`at (Sunna) of the Fajr prayer.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَخْبَرَنَا حَنْظَلَةُ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً مِنْهَا الْوِتْرُ وَرَكْعَتَا الْفَجْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1140In-book reference : Book 19, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1141,
    "id": 1141,
    "url": "https://sunnah.com/bukhari:1141",
    "bookNumber": 19,
    "hadithNumber": 22,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Sometimes Allah's Messenger (ﷺ) would not fast (for so many days) that we thought that he would not fast \nthat month and he sometimes used to fast (for so many days) that we thought he would not leave \nfasting throughout that month and (as regards his prayer and sleep at night), if you wanted to see him \npraying at night, you could see him praying and if you wanted to see him sleeping, you could see him \nsleeping.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُفْطِرُ مِنَ الشَّهْرِ حَتَّى نَظُنَّ أَنْ لاَ يَصُومَ مِنْهُ، وَيَصُومُ حَتَّى نَظُنَّ أَنْ لاَ يُفْطِرَ مِنْهُ شَيْئًا، وَكَانَ لاَ تَشَاءُ أَنْ تَرَاهُ مِنَ اللَّيْلِ مُصَلِّيًا إِلاَّ رَأَيْتَهُ وَلاَ نَائِمًا إِلاَّ رَأَيْتَهُ‏.‏ تَابَعَهُ سُلَيْمَانُ وَأَبُو خَالِدٍ الأَحْمَرُ عَنْ حُمَيْدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1141In-book reference : Book 19, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1142,
    "id": 1142,
    "url": "https://sunnah.com/bukhari:1142",
    "bookNumber": 19,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On \nevery knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one \nwakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot \nis undone, and when one prays the third knot is undone and one gets up energetic with a good heart in \nthe morning; otherwise one gets up lazy and with a mischievous heart.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ، يَضْرِبُ كُلَّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ، فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ، فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ، فَإِنْ صَلَّى انْحَلَّتْ عُقْدَةٌ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ، وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1142In-book reference : Book 19, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1143,
    "id": 1143,
    "url": "https://sunnah.com/bukhari:1143",
    "bookNumber": 19,
    "hadithNumber": 24,
    "narrator": "Narrated Samura bin Jundab:",
    "english": "The Prophet (ﷺ) said in his narration of a dream that he saw, \"He whose head was being crushed with a \nstone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"",
    "arabic": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا عَوْفٌ، قَالَ حَدَّثَنَا أَبُو رَجَاءٍ، قَالَ حَدَّثَنَا سَمُرَةُ بْنُ جُنْدَبٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرُّؤْيَا قَالَ ‏\n\"‏ أَمَّا الَّذِي يُثْلَغُ رَأْسُهُ بِالْحَجَرِ فَإِنَّهُ يَأْخُذُ الْقُرْآنَ فَيَرْفِضُهُ وَيَنَامُ عَنِ الصَّلاَةِ الْمَكْتُوبَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1143In-book reference : Book 19, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1144,
    "id": 1144,
    "url": "https://sunnah.com/bukhari:1144",
    "bookNumber": 19,
    "hadithNumber": 25,
    "narrator": "Narrated `Abdullah:",
    "english": "A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till \nmorning and had not got up for the prayer. The Prophet (ﷺ) said, \"Satan urinated in his ears.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، قَالَ حَدَّثَنَا مَنْصُورٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ ذُكِرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجُلٌ فَقِيلَ مَا زَالَ نَائِمًا حَتَّى أَصْبَحَ مَا قَامَ إِلَى الصَّلاَةِ‏.‏ فَقَالَ ‏\n\"‏ بَالَ الشَّيْطَانُ فِي أُذُنِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1144In-book reference : Book 19, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1145,
    "id": 1145,
    "url": "https://sunnah.com/bukhari:1145",
    "bookNumber": 19,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the \nnearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, \nso that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is \nthere anyone seeking My forgiveness, so that I may forgive him?\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَأَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1145In-book reference : Book 19, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1146,
    "id": 1146,
    "url": "https://sunnah.com/bukhari:1146",
    "bookNumber": 19,
    "hadithNumber": 27,
    "narrator": "Narrated Al-Aswad:",
    "english": "I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, \nand get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the \nAdhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform \nablution and then go out (for the prayer).\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ،‏.‏ وَحَدَّثَنِي سُلَيْمَانُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ كَيْفَ صَلاَةُ النَّبِيِّ صلى الله عليه وسلم بِاللَّيْلِ قَالَتْ كَانَ يَنَامُ أَوَّلَهُ وَيَقُومُ آخِرَهُ، فَيُصَلِّي ثُمَّ يَرْجِعُ إِلَى فِرَاشِهِ، فَإِذَا أَذَّنَ الْمُؤَذِّنُ وَثَبَ، فَإِنْ كَانَ بِهِ حَاجَةٌ اغْتَسَلَ، وَإِلاَّ تَوَضَّأَ وَخَرَجَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1146In-book reference : Book 19, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1147,
    "id": 1147,
    "url": "https://sunnah.com/bukhari:1147",
    "bookNumber": 19,
    "hadithNumber": 28,
    "narrator": "Narrated Abu Salma bin `Abdur Rahman:",
    "english": "I asked `Aisha, \"How is the prayer of Allah's Messenger (ﷺ) during the month of Ramadan.\" She said, \n\"Allah's Messenger (ﷺ) never exceeded eleven rak`at in Ramadan or in other months; he used to offer four \nrak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty \nand length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Messenger (ﷺ)! Do you sleep before \noffering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزِيدُ فِي رَمَضَانَ وَلاَ فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاَثًا، قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ‏.‏ فَقَالَ ‏\n\"‏ يَا عَائِشَةُ، إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1147In-book reference : Book 19, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1148,
    "id": 1148,
    "url": "https://sunnah.com/bukhari:1148",
    "bookNumber": 19,
    "hadithNumber": 29,
    "narrator": "Narrated `Aisha:",
    "english": "I did not see the Prophet (ﷺ) reciting (the Qur'an) in the night prayer while sitting except when he became \nold; when he used to recite while sitting, and when thirty or forty verses remained from the Sura, he \nwould get up and recite them and then bow.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي شَىْءٍ مِنْ صَلاَةِ اللَّيْلِ جَالِسًا، حَتَّى إِذَا كَبِرَ قَرَأَ جَالِسًا، فَإِذَا بَقِيَ عَلَيْهِ مِنَ السُّورَةِ ثَلاَثُونَ أَوْ أَرْبَعُونَ آيَةً قَامَ فَقَرَأَهُنَّ ثُمَّ رَكَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1148In-book reference : Book 19, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1149,
    "id": 1149,
    "url": "https://sunnah.com/bukhari:1149",
    "bookNumber": 19,
    "hadithNumber": 30,
    "narrator": "Narrated Abu Huraira:",
    "english": "At the time of the Fajr prayer the Prophet (ﷺ) asked Bilal, \"Tell me of the best deed you did after \nembracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do \nanything worth mentioning except that whenever I performed ablution during the day or night, I \nprayed after that ablution as much as was written for me.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِبِلاَلٍ عِنْدَ صَلاَةِ الْفَجْرِ ‏\n\"‏ يَا بِلاَلُ حَدِّثْنِي بِأَرْجَى عَمَلٍ عَمِلْتَهُ فِي الإِسْلاَمِ، فَإِنِّي سَمِعْتُ دَفَّ نَعْلَيْكَ بَيْنَ يَدَىَّ فِي الْجَنَّةِ ‏\"‏‏.‏ قَالَ مَا عَمِلْتُ عَمَلاً أَرْجَى عِنْدِي أَنِّي لَمْ أَتَطَهَّرْ طُهُورًا فِي سَاعَةِ لَيْلٍ أَوْ نَهَارٍ إِلاَّ صَلَّيْتُ بِذَلِكَ الطُّهُورِ مَا كُتِبَ لِي أَنْ أُصَلِّيَ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ دَفَّ نَعْلَيْكَ يَعْنِي تَحْرِيكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1149In-book reference : Book 19, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1150,
    "id": 1150,
    "url": "https://sunnah.com/bukhari:1150",
    "bookNumber": 19,
    "hadithNumber": 31,
    "narrator": "",
    "english": "Narrated Anas bin Malik\n\n\n     Once the Prophet (p.b.u.h) entered the Mosque and saw a rope hanging \n     in between its two pillars. He said, \"What is this rope?\" The people \n     said, \"This rope is for Zainab who, when she feels tired, holds it (to\n     keep standing for the prayer.)\" The Prophet (ﷺ) said, \"Don't use it. \n     Remove the rope. You should pray as long as you feel active, and when \n     you get tired, sit down.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم فَإِذَا حَبْلٌ مَمْدُودٌ بَيْنَ السَّارِيَتَيْنِ فَقَالَ ‏\"‏ مَا هَذَا الْحَبْلُ ‏\"‏‏.‏ قَالُوا هَذَا حَبْلٌ لِزَيْنَبَ فَإِذَا فَتَرَتْ تَعَلَّقَتْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ، حُلُّوهُ، لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ، فَإِذَا فَتَرَ فَلْيَقْعُدْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1150In-book reference : Book 19, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1151,
    "id": 1151,
    "url": "https://sunnah.com/bukhari:1151",
    "bookNumber": 19,
    "hadithNumber": 32,
    "narrator": "Narrated 'Aisha:",
    "english": "A woman from the tribe of Bani Asad was sitting with me and Allah's \n     Apostle (p.b.u.h) came to my house and said, \"Who is this?\" I said, \n     \"(She is) So and so. She does not sleep at night because she is \n     engaged in prayer.\" The Prophet (ﷺ) said disapprovingly: Do (good) deeds \n     which is within your capacity as Allah never gets tired of giving \n     rewards till you get tired of doing good deeds.\"",
    "arabic": "قَالَ وَقَالَ عَبْدُ اللَّهِ بْنِ مَسْلَمَةَ عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَتْ عِنْدِي امْرَأَةٌ مِنْ بَنِي أَسَدٍ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ قُلْتُ فُلاَنَةُ لاَ تَنَامُ بِاللَّيْلِ‏.‏ فَذُكِرَ مِنْ صَلاَتِهَا فَقَالَ ‏\"‏ مَهْ عَلَيْكُمْ مَا تُطِيقُونَ مِنَ الأَعْمَالِ، فَإِنَّ اللَّهَ لاَ يَمَلُّ حَتَّى تَمَلُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1151In-book reference : Book 19, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1152,
    "id": 1152,
    "url": "https://sunnah.com/bukhari:1152",
    "bookNumber": 19,
    "hadithNumber": 33,
    "narrator": "Narrated `Abdullah bin `Amr bin Al-`As:",
    "english": "Allah's Messenger (ﷺ) said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then \nstopped the night prayer.\"",
    "arabic": "حَدَّثَنَا عَبَّاسُ بْنُ الْحُسَيْنِ، حَدَّثَنَا مُبَشِّرٌ، عَنِ الأَوْزَاعِيِّ،‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا عَبْدَ اللَّهِ، لاَ تَكُنْ مِثْلَ فُلاَنٍ، كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ ‏\"‏‏.‏ وَقَالَ هِشَامٌ حَدَّثَنَا ابْنُ أَبِي الْعِشْرِينَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، عَنْ عُمَرَ بْنِ الْحَكَمِ بْنِ ثَوْبَانَ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، مِثْلَهُ‏.‏ وَتَابَعَهُ عَمْرُو بْنُ أَبِي سَلَمَةَ عَنِ الأَوْزَاعِيِّ،‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1152In-book reference : Book 19, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1153,
    "id": 1153,
    "url": "https://sunnah.com/bukhari:1153",
    "bookNumber": 19,
    "hadithNumber": 34,
    "narrator": "Narrated 'Abdullah bin 'Amr:",
    "english": "Once Allah's Messenger (ﷺ) said to me, \"I have been informed that you offer Salat (prayer) all the night and observe Saum (fast) during the day.\" I said, \"(Yes) I do so.\" He said, \"If you do so, your eye sight will become weak and you will become weak. No doubt, your body has right on you, and your family has right on you, so observe Saum (for some days) and do not observe it (for some days), offer Salat (for sometime) and then sleep.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَمْ أُخْبَرْ أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ ‏\"‏ قُلْتُ إِنِّي أَفْعَلُ ذَلِكَ‏.‏ قَالَ ‏\"‏ فَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ هَجَمَتْ عَيْنُكَ وَنَفِهَتْ نَفْسُكَ، وَإِنَّ لِنَفْسِكَ حَقٌّ، وَلأَهْلِكَ حَقٌّ، فَصُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1153In-book reference : Book 19, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1154,
    "id": 1154,
    "url": "https://sunnah.com/bukhari:1154",
    "bookNumber": 19,
    "hadithNumber": 35,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "The Prophet (ﷺ) \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, \nwaLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha \nil-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped \nbut Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are \ndue for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none \nhas the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power \nExcept with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), \nhe will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ، قَالَ حَدَّثَنِي جُنَادَةُ بْنُ أَبِي أُمَيَّةَ، حَدَّثَنِي عُبَادَةُ بْنُ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ تَعَارَّ مِنَ اللَّيْلِ فَقَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ‏.‏ الْحَمْدُ لِلَّهِ، وَسُبْحَانَ اللَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ‏.‏ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِي‏.‏ أَوْ دَعَا اسْتُجِيبَ، فَإِنْ تَوَضَّأَ وَصَلَّى قُبِلَتْ صَلاَتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1154In-book reference : Book 19, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1155,
    "id": 1155,
    "url": "https://sunnah.com/bukhari:1155",
    "bookNumber": 19,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Huraira:",
    "english": "That once Allah's Messenger (ﷺ) (p.b.u.h) said, \"Your brother, i.e. `Abdullah bin Rawaha does not say \nobscene (referring to his verses): Amongst us is Allah's Messenger (ﷺ), who recites His Book when it dawns. \nHe showed us the guidance, after we were blind. We believe that whatever he says will come true. \nAnd he spends his nights in such a way as his sides do not touch his bed. While the pagans were \ndeeply asleep.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي الْهَيْثَمُ بْنُ أَبِي سِنَانٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ وَهُوَ يَقْصُصُ فِي قَصَصِهِ وَهُوَ يَذْكُرُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِنَّ أَخًا لَكُمْ لاَ يَقُولُ الرَّفَثَ‏.‏ يَعْنِي بِذَلِكَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ وَفِينَا رَسُولُ اللَّهِ يَتْلُو كِتَابَهُ إِذَا انْشَقَّ مَعْرُوفٌ مِنَ الْفَجْرِ سَاطِعُ أَرَانَا الْهُدَى بَعْدَ الْعَمَى فَقُلُوبُنَا بِهِ مُوقِنَاتٌ أَنَّ مَا قَالَ وَاقِعُ يَبِيتُ يُجَافِي جَنْبَهُ عَنْ فِرَاشِهِ إِذَا اسْتَثْقَلَتْ بِالْمُشْرِكِينَ الْمَضَاجِعُ تَابَعَهُ عُقَيْلٌ‏.‏ وَقَالَ الزُّبَيْدِيُّ أَخْبَرَنِي الزُّهْرِيُّ عَنْ سَعِيدٍ وَالأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1155In-book reference : Book 19, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1156,
    "id": 1156,
    "url": "https://sunnah.com/bukhari:1156",
    "bookNumber": 19,
    "hadithNumber": 37,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ رَأَيْتُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَأَنَّ بِيَدِي قِطْعَةَ إِسْتَبْرَقٍ، فَكَأَنِّي لاَ أُرِيدُ مَكَانًا مِنَ الْجَنَّةِ إِلاَّ طَارَتْ إِلَيْهِ، وَرَأَيْتُ كَأَنَّ اثْنَيْنِ أَتَيَانِي أَرَادَا أَنْ يَذْهَبَا بِي إِلَى النَّارِ فَتَلَقَّاهُمَا مَلَكٌ فَقَالَ لَمْ تُرَعْ خَلِّيَا عَنْهُ‏.‏ فَقَصَّتْ حَفْصَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم إِحْدَى رُؤْيَاىَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ‏\"‏‏.‏ فَكَانَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ يُصَلِّي مِنَ اللَّيْلِ‏.‏ وَكَانُوا لاَ يَزَالُونَ يَقُصُّونَ عَلَى النَّبِيِّ صلى الله عليه وسلم الرُّؤْيَا أَنَّهَا فِي اللَّيْلَةِ السَّابِعَةِ مِنَ الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَتْ فِي الْعَشْرِ الأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرِّيْهَا فَلْيَتَحَرَّهَا مِنَ الْعَشْرِ الأَوَاخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1156, 1157, 1158In-book reference : Book 19, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1157,
    "id": 1157,
    "url": "https://sunnah.com/bukhari:1157",
    "bookNumber": 19,
    "hadithNumber": 37,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ رَأَيْتُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَأَنَّ بِيَدِي قِطْعَةَ إِسْتَبْرَقٍ، فَكَأَنِّي لاَ أُرِيدُ مَكَانًا مِنَ الْجَنَّةِ إِلاَّ طَارَتْ إِلَيْهِ، وَرَأَيْتُ كَأَنَّ اثْنَيْنِ أَتَيَانِي أَرَادَا أَنْ يَذْهَبَا بِي إِلَى النَّارِ فَتَلَقَّاهُمَا مَلَكٌ فَقَالَ لَمْ تُرَعْ خَلِّيَا عَنْهُ‏.‏ فَقَصَّتْ حَفْصَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم إِحْدَى رُؤْيَاىَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ‏\"‏‏.‏ فَكَانَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ يُصَلِّي مِنَ اللَّيْلِ‏.‏ وَكَانُوا لاَ يَزَالُونَ يَقُصُّونَ عَلَى النَّبِيِّ صلى الله عليه وسلم الرُّؤْيَا أَنَّهَا فِي اللَّيْلَةِ السَّابِعَةِ مِنَ الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَتْ فِي الْعَشْرِ الأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرِّيْهَا فَلْيَتَحَرَّهَا مِنَ الْعَشْرِ الأَوَاخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1156, 1157, 1158In-book reference : Book 19, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1158,
    "id": 1158,
    "url": "https://sunnah.com/bukhari:1158",
    "bookNumber": 19,
    "hadithNumber": 37,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar said, \"In the lifetime of the Prophet (ﷺ) I dreamt that a piece of silk cloth was in my hand and it \nflew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to \nme and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told \nthem to leave me. Hafsa narrated one of my dreams to the Prophet (ﷺ) and the Prophet (ﷺ) said, \"Abdullah is \na good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) \nstarted offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that \n(Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet (ﷺ) said, \"I see that your dreams \nagree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten \nnights of Ramadan.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ رَأَيْتُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَأَنَّ بِيَدِي قِطْعَةَ إِسْتَبْرَقٍ، فَكَأَنِّي لاَ أُرِيدُ مَكَانًا مِنَ الْجَنَّةِ إِلاَّ طَارَتْ إِلَيْهِ، وَرَأَيْتُ كَأَنَّ اثْنَيْنِ أَتَيَانِي أَرَادَا أَنْ يَذْهَبَا بِي إِلَى النَّارِ فَتَلَقَّاهُمَا مَلَكٌ فَقَالَ لَمْ تُرَعْ خَلِّيَا عَنْهُ‏.‏ فَقَصَّتْ حَفْصَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم إِحْدَى رُؤْيَاىَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ‏\"‏‏.‏ فَكَانَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ يُصَلِّي مِنَ اللَّيْلِ‏.‏ وَكَانُوا لاَ يَزَالُونَ يَقُصُّونَ عَلَى النَّبِيِّ صلى الله عليه وسلم الرُّؤْيَا أَنَّهَا فِي اللَّيْلَةِ السَّابِعَةِ مِنَ الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَتْ فِي الْعَشْرِ الأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرِّيْهَا فَلْيَتَحَرَّهَا مِنَ الْعَشْرِ الأَوَاخِرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1156, 1157, 1158In-book reference : Book 19, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1159,
    "id": 1159,
    "url": "https://sunnah.com/bukhari:1159",
    "bookNumber": 19,
    "hadithNumber": 38,
    "narrator": "Narrated `Aisha;:",
    "english": "Allah's Messenger (ﷺ) offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at \nand then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama \n(of the Fajr prayer) and he never missed them.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدٌ ـ هُوَ ابْنُ أَبِي أَيُّوبَ ـ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ صَلَّى النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ ثُمَّ صَلَّى ثَمَانَ رَكَعَاتٍ وَرَكْعَتَيْنِ جَالِسًا وَرَكْعَتَيْنِ بَيْنَ النِّدَاءَيْنِ، وَلَمْ يَكُنْ يَدَعُهُمَا أَبَدًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1159In-book reference : Book 19, Hadith 38USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1160,
    "id": 1160,
    "url": "https://sunnah.com/bukhari:1160",
    "bookNumber": 19,
    "hadithNumber": 39,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to lie down on his right side, after offering two rak`at (Sunna) of the Fajr prayer.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، قَالَ حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا صَلَّى رَكْعَتَىِ الْفَجْرِ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1160In-book reference : Book 19, Hadith 39USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1161,
    "id": 1161,
    "url": "https://sunnah.com/bukhari:1161",
    "bookNumber": 19,
    "hadithNumber": 40,
    "narrator": "Narrated `Aisha:",
    "english": "After offering the Sunna of the Fajr prayer, the Prophet (ﷺ) used to talk to me, if I happen to be awake; \notherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا صَلَّى ‏{‏سُنَّةَ الْفَجْرِ‏}‏ فَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي وَإِلاَّ اضْطَجَعَ حَتَّى يُؤْذَنَ بِالصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1161In-book reference : Book 19, Hadith 40USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1162,
    "id": 1162,
    "url": "https://sunnah.com/bukhari:1162",
    "bookNumber": 19,
    "hadithNumber": 41,
    "narrator": "Narrated `Aisha:",
    "english": "After offering the two rak`at (Sunna) the Prophet (p.b.u.h) used to talk to me, if I happen to be awake; \notherwise he would lie down.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ أَبُو النَّضْرِ عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي رَكْعَتَيْنِ فَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي وَإِلاَّ اضْطَجَعَ‏.‏ قُلْتُ لِسُفْيَانَ فَإِنَّ بَعْضَهُمْ يَرْوِيهِ رَكْعَتَىِ الْفَجْرِ‏.‏ قَالَ سُفْيَانُ هُوَ ذَاكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1162In-book reference : Book 19, Hadith 41USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1163,
    "id": 1163,
    "url": "https://sunnah.com/bukhari:1163",
    "bookNumber": 19,
    "hadithNumber": 42,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) was never more regular and particular in offering any Nawafil than the two rak`at \n(Sunna) of the Fajr prayer.",
    "arabic": "حَدَّثَنَا بَيَانُ بْنُ عَمْرٍو، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم عَلَى شَىْءٍ مِنَ النَّوَافِلِ أَشَدَّ مِنْهُ تَعَاهُدًا عَلَى رَكْعَتَىِ الْفَجْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1163In-book reference : Book 19, Hadith 42USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1164,
    "id": 1164,
    "url": "https://sunnah.com/bukhari:1164",
    "bookNumber": 19,
    "hadithNumber": 43,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to offer thirteen rak`at in the night prayer and on hearing the Adhan for the \nmorning prayer, he used to offer two light rak`at.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً، ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1164In-book reference : Book 19, Hadith 43USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1165,
    "id": 1165,
    "url": "https://sunnah.com/bukhari:1165",
    "bookNumber": 19,
    "hadithNumber": 44,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder \nwhether he recited Al-Fatiha (or not).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَمَّتِهِ، عَمْرَةَ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم ح وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ سَعِيدٍ ـ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُخَفِّفُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ حَتَّى إِنِّي لأَقُولُ هَلْ قَرَأَ بِأُمِّ الْكِتَابِ",
    "reference": "Reference : Sahih al-Bukhari 1165In-book reference : Book 19, Hadith 44USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1166,
    "id": 1166,
    "url": "https://sunnah.com/bukhari:1166",
    "bookNumber": 19,
    "hadithNumber": 45,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (p.b.u.h) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to \nguide one to the right sort of action concerning any job or a deed), in all matters as he taught us the \nSuras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at \nprayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka \nbi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala \naqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra \nKhairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li \nthumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati \n`Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana \nThumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might \nand I ask for Your great blessings. You are capable and I am not. You know and I do not and You \nknow the unseen. O Allah! If You know that this job is good for my religion and my subsistence and \nin my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and \nmake it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In \nmy religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later \nneeds)--Then keep it away from me and let me be away from it. And ordain for me whatever is good \nfor me, And make me satisfied with it). The Prophet (ﷺ) added that then the person should name \n(mention) his need.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا الاِسْتِخَارَةَ فِي الأُمُورِ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ ‏\n\"‏ إِذَا هَمَّ أَحَدُكُمْ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلِ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ وَتَعْلَمُ وَلاَ أَعْلَمُ وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ ـ قَالَ ـ وَيُسَمِّي حَاجَتَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1166In-book reference : Book 19, Hadith 45USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1167,
    "id": 1167,
    "url": "https://sunnah.com/bukhari:1167",
    "bookNumber": 19,
    "hadithNumber": 46,
    "narrator": "Narrated Abu Qatada bin Rabi Al-Ansari;:",
    "english": "The Prophet (ﷺ) said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` \nat prayer.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، سَمِعَ أَبَا قَتَادَةَ بْنَ رِبْعِيٍّ الأَنْصَارِيّ َ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلاَ يَجْلِسْ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1167In-book reference : Book 19, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1168,
    "id": 1168,
    "url": "https://sunnah.com/bukhari:1168",
    "bookNumber": 19,
    "hadithNumber": 47,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) led us and offered a two rak`at prayer and then went away.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ انْصَرَفَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1168In-book reference : Book 19, Hadith 47USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1169,
    "id": 1169,
    "url": "https://sunnah.com/bukhari:1169",
    "bookNumber": 19,
    "hadithNumber": 48,
    "narrator": "Narrated `Abdullah bin `Umar Abu:",
    "english": "I offered with Allah's Messenger (ﷺ) a two rak`at prayer before the Zuhr prayer and two rak`at after the Zuhr \nprayer, two rak`at after Jumua, Maghrib and `Isha' prayers.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الْجُمُعَةِ، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1169In-book reference : Book 19, Hadith 48USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1170,
    "id": 1170,
    "url": "https://sunnah.com/bukhari:1170",
    "bookNumber": 19,
    "hadithNumber": 49,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "While delivering a sermon, Allah's Messenger (ﷺ) said, \"If anyone of you comes while the Imam is \ndelivering the sermon or has come out for it, he should offer a two rak`at prayer.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ ‏\n\"‏ إِذَا جَاءَ أَحَدُكُمْ وَالإِمَامُ يَخْطُبُ ـ أَوْ قَدْ خَرَجَ ـ فَلْيُصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1170In-book reference : Book 19, Hadith 49USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 267   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1171,
    "id": 1171,
    "url": "https://sunnah.com/bukhari:1171",
    "bookNumber": 19,
    "hadithNumber": 50,
    "narrator": "Narrated Mujahid:",
    "english": "Somebody came to the house of Ibn `Umar and told him that Allah's Messenger (ﷺ)s had entered the Ka`ba. \nIbn `Umar said, \"I went in front of the Ka`ba and found that Allah's Messenger (ﷺ) had come out of the \nKa`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's \nApostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he \npray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two \nrak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) \nadvised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" \nItban (bin Malik) said, \"Allah's Messenger (ﷺ) \n(p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and \noffered two rak`at.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ، سَمِعْتُ مُجَاهِدًا، يَقُولُ أُتِيَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ فِي مَنْزِلِهِ فَقِيلَ لَهُ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ دَخَلَ الْكَعْبَةَ قَالَ فَأَقْبَلْتُ فَأَجِدُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ خَرَجَ، وَأَجِدُ بِلاَلاً عِنْدَ الْبَابِ قَائِمًا فَقُلْتُ يَا بِلاَلُ، صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْكَعْبَةِ قَالَ نَعَمْ‏.‏ قُلْتُ فَأَيْنَ قَالَ بَيْنَ هَاتَيْنِ الأُسْطُوَانَتَيْنِ‏.‏ ثُمَّ خَرَجَ فَصَلَّى رَكْعَتَيْنِ فِي وَجْهِ الْكَعْبَةِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ أَوْصَانِي النَّبِيُّ صلى الله عليه وسلم بِرَكْعَتَىِ الضُّحَى‏.‏ وَقَالَ عِتْبَانُ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ ـ رضى الله عنه ـ بَعْدَ مَا امْتَدَّ النَّهَارُ وَصَفَفْنَا وَرَاءَهُ فَرَكَعَ رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1171In-book reference : Book 19, Hadith 50USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1172,
    "id": 1172,
    "url": "https://sunnah.com/bukhari:1172",
    "bookNumber": 19,
    "hadithNumber": 51,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم سَجْدَتَيْنِ قَبْلَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الْمَغْرِبِ، وَسَجْدَتَيْنِ بَعْدَ الْعِشَاءِ، وَسَجْدَتَيْنِ بَعْدَ الْجُمُعَةِ، فَأَمَّا الْمَغْرِبُ وَالْعِشَاءُ فَفِي بَيْتِهِ‏.‏ قَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَحَدَّثَتْنِي أُخْتِي، حَفْصَةُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي سَجْدَتَيْنِ خَفِيفَتَيْنِ بَعْدَ مَا يَطْلُعُ الْفَجْرُ، وَكَانَتْ سَاعَةً لاَ أَدْخُلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَقَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1172, 1173In-book reference : Book 19, Hadith 51USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1173,
    "id": 1173,
    "url": "https://sunnah.com/bukhari:1173",
    "bookNumber": 19,
    "hadithNumber": 51,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I offered with the Prophet (ﷺ) two rak`at before the Zuhr and two rak`at after the Zuhr prayer; two rak`at \nafter Maghrib, `Isha' and the Jumua prayers. Those of the Maghrib and `Isha' were offered in his \nhouse. My sister Hafsa told me that the Prophet (ﷺ) used to offer two light rak`at after dawn and it was the \ntime when I never went to the Prophet.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم سَجْدَتَيْنِ قَبْلَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الْمَغْرِبِ، وَسَجْدَتَيْنِ بَعْدَ الْعِشَاءِ، وَسَجْدَتَيْنِ بَعْدَ الْجُمُعَةِ، فَأَمَّا الْمَغْرِبُ وَالْعِشَاءُ فَفِي بَيْتِهِ‏.‏ قَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَحَدَّثَتْنِي أُخْتِي، حَفْصَةُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي سَجْدَتَيْنِ خَفِيفَتَيْنِ بَعْدَ مَا يَطْلُعُ الْفَجْرُ، وَكَانَتْ سَاعَةً لاَ أَدْخُلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَقَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1172, 1173In-book reference : Book 19, Hadith 51USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1174,
    "id": 1174,
    "url": "https://sunnah.com/bukhari:1174",
    "bookNumber": 19,
    "hadithNumber": 52,
    "narrator": "Narrated `Amr:",
    "english": "I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Messenger (ﷺ) eight \nrak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) \ntogether.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; \nthe `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 \nVol. 1).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ أَبَا الشَّعْثَاءِ، جَابِرًا قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَمَانِيًا جَمِيعًا وَسَبْعًا جَمِيعًا‏.‏ قُلْتُ يَا أَبَا الشَّعْثَاءِ أَظُنُّهُ أَخَّرَ الظُّهْرَ وَعَجَّلَ الْعَصْرَ وَعَجَّلَ الْعِشَاءَ وَأَخَّرَ الْمَغْرِبَ‏.‏ قَالَ وَأَنَا أَظُنُّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1174In-book reference : Book 19, Hadith 52USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1175,
    "id": 1175,
    "url": "https://sunnah.com/bukhari:1175",
    "bookNumber": 19,
    "hadithNumber": 53,
    "narrator": "Narrated Muwarriq:",
    "english": "I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did \n`Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to \npray it?\" He replied in the negative. I again asked, \"Did the Prophet (ﷺ) use to pray it?\" Ibn `Umar replied, \n\"I don't think he did.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ تَوْبَةَ، عَنْ مُوَرِّقٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ ـ رضى الله عنهما ـ أَتُصَلِّي الضُّحَى قَالَ لاَ‏.‏ قُلْتُ فَعُمَرُ‏.‏ قَالَ لاَ‏.‏ قُلْتُ فَأَبُو بَكْرٍ‏.‏ قَالَ لاَ‏.‏ قُلْتُ فَالنَّبِيُّ صلى الله عليه وسلم قَالَ لاَ إِخَالُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1175In-book reference : Book 19, Hadith 53USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1176,
    "id": 1176,
    "url": "https://sunnah.com/bukhari:1176",
    "bookNumber": 19,
    "hadithNumber": 54,
    "narrator": "Narrated `Abdur Rahman bin Abi Laila:",
    "english": "Only Um Hani narrated to me that she had seen the Prophet (ﷺ) offering the Duha prayer. She said, \"On \nthe day of the conquest of Mecca, the Prophet (ﷺ) entered my house, took a bath and offered eight rak`at \n(of Duha prayers. I had never seen the Prophet (ﷺ) offering such a light prayer but he performed bowing \nand prostrations perfectly .",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، يَقُولُ مَا حَدَّثَنَا أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يُصَلِّي الضُّحَى غَيْرَ أُمِّ هَانِئٍ فَإِنَّهَا قَالَتْ إِنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ بَيْتَهَا يَوْمَ فَتْحِ مَكَّةَ فَاغْتَسَلَ وَصَلَّى ثَمَانِيَ رَكَعَاتٍ فَلَمْ أَرَ صَلاَةً قَطُّ أَخَفَّ مِنْهَا، غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1176In-book reference : Book 19, Hadith 54USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1177,
    "id": 1177,
    "url": "https://sunnah.com/bukhari:1177",
    "bookNumber": 19,
    "hadithNumber": 55,
    "narrator": "Narrated `Aisha:",
    "english": "I never saw the Prophet (ﷺ) offering the Duha prayer but I always offer it.",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم سَبَّحَ سُبْحَةَ الضُّحَى، وَإِنِّي لأُسَبِّحُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1177In-book reference : Book 19, Hadith 55USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1178,
    "id": 1178,
    "url": "https://sunnah.com/bukhari:1178",
    "bookNumber": 19,
    "hadithNumber": 56,
    "narrator": "Narrated Abu Huraira:",
    "english": "My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: \nTo fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا عَبَّاسٌ الْجُرَيْرِيُّ ـ هُوَ ابْنُ فَرُّوخَ ـ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ أَوْصَانِي خَلِيلِي بِثَلاَثٍ لاَ أَدَعُهُنَّ حَتَّى أَمُوتَ صَوْمِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَصَلاَةِ الضُّحَى، وَنَوْمٍ عَلَى وِتْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1178In-book reference : Book 19, Hadith 56USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1179,
    "id": 1179,
    "url": "https://sunnah.com/bukhari:1179",
    "bookNumber": 19,
    "hadithNumber": 57,
    "narrator": "Narrated Anas bin Sirin:",
    "english": "I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very \n     fat, said to the Prophet, 'I am unable to present myself for the \n     prayer with you.' He prepared a meal for the Prophet (ﷺ) and invited him \n     to his house. He washed one side of a mat with water and the Prophet (ﷺ) \n     offered two Rakat on it.\" So and so, the son of so and so, the son of \n     Al-Jarud asked Anas, \"Did the Prophet (ﷺ) use to offer the Duha prayer?\" \n     Anas replied, \"I never saw him praying (the Duha prayer) except on \n     that day.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ الأَنْصَارِيَّ، قَالَ قَالَ رَجُلٌ مِنَ الأَنْصَارِ ـ وَكَانَ ضَخْمًا ـ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي لاَ أَسْتَطِيعُ الصَّلاَةَ مَعَكَ‏.‏ فَصَنَعَ لِلنَّبِيِّ صلى الله عليه وسلم طَعَامًا، فَدَعَاهُ إِلَى بَيْتِهِ، وَنَضَحَ لَهُ طَرَفَ حَصِيرٍ بِمَاءٍ فَصَلَّى عَلَيْهِ رَكْعَتَيْنِ‏.‏ وَقَالَ فُلاَنُ بْنُ فُلاَنِ بْنِ جَارُودٍ لأَنَسٍ ـ رضى الله عنه ـ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الضُّحَى فَقَالَ مَا رَأَيْتُهُ صَلَّى غَيْرَ ذَلِكَ الْيَوْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1179In-book reference : Book 19, Hadith 57USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1180,
    "id": 1180,
    "url": "https://sunnah.com/bukhari:1180",
    "bookNumber": 19,
    "hadithNumber": 58,
    "narrator": "Narrated Ibn 'Umar:",
    "english": "I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.\n\nHafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ حَفِظْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم عَشْرَ رَكَعَاتٍ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ، وَكَانَتْ سَاعَةً لاَ يُدْخَلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏ حَدَّثَتْنِي حَفْصَةُ، أَنَّهُ كَانَ إِذَا أَذَّنَ الْمُؤَذِّنُ وَطَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1180, 1181In-book reference : Book 19, Hadith 58USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1181,
    "id": 1181,
    "url": "https://sunnah.com/bukhari:1181",
    "bookNumber": 19,
    "hadithNumber": 58,
    "narrator": "Narrated Ibn 'Umar:",
    "english": "I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.\n\nHafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ حَفِظْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم عَشْرَ رَكَعَاتٍ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ، وَكَانَتْ سَاعَةً لاَ يُدْخَلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏ حَدَّثَتْنِي حَفْصَةُ، أَنَّهُ كَانَ إِذَا أَذَّنَ الْمُؤَذِّنُ وَطَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1180, 1181In-book reference : Book 19, Hadith 58USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1182,
    "id": 1182,
    "url": "https://sunnah.com/bukhari:1182",
    "bookNumber": 19,
    "hadithNumber": 59,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ‏.‏ تَابَعَهُ ابْنُ أَبِي عَدِيٍّ وَعَمْرٌو عَنْ شُعْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1182In-book reference : Book 19, Hadith 59USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1183,
    "id": 1183,
    "url": "https://sunnah.com/bukhari:1183",
    "bookNumber": 19,
    "hadithNumber": 60,
    "narrator": "Narrated `Abdullah Al-Muzni:",
    "english": "The Prophet (ﷺ) said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third \ntime, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to \ntake it as a tradition.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنِ ابْنِ بُرَيْدَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلُّوا قَبْلَ صَلاَةِ الْمَغْرِبِ ‏\"‏‏.‏ ـ قَالَ فِي الثَّالِثَةِ ـ لِمَنْ شَاءَ كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1183In-book reference : Book 19, Hadith 60USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1184,
    "id": 1184,
    "url": "https://sunnah.com/bukhari:1184",
    "bookNumber": 19,
    "hadithNumber": 61,
    "narrator": "Narrated Marthad bin `Abdullah Al-Yazani:",
    "english": "I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at \nbefore the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Messenger (ﷺ).\" I asked \nhim, \"What prevents you from offering it now?\" He replied, \"Business.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، قَالَ سَمِعْتُ مَرْثَدَ بْنَ عَبْدِ اللَّهِ الْيَزَنِيَّ، قَالَ أَتَيْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ فَقُلْتُ أَلاَ أُعْجِبُكَ مِنْ أَبِي تَمِيمٍ يَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْمَغْرِبِ‏.‏ فَقَالَ عُقْبَةُ إِنَّا كُنَّا نَفْعَلُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قُلْتُ فَمَا يَمْنَعُكَ الآنَ قَالَ الشُّغْلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1184In-book reference : Book 19, Hadith 61USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1185,
    "id": 1185,
    "url": "https://sunnah.com/bukhari:1185",
    "bookNumber": 19,
    "hadithNumber": 62,
    "narrator": "Narrated Mahmud bin Ar-rabi' Al-Ansari:",
    "english": "that he remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had \nthrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard \n`Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my \npeople at Bani Salim in the prayer and there was a valley between me and those people. Whenever it \nrained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and \nsaid, 'I have weak eyesight and the valley between me and my people flows during the rainy season \nand it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so \nthat I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) \nand Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) \nasked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you \nwant us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So \nAllah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows \nbehind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim \nwith him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a \nspecial type of dish prepared from barley flour and meat soup)-- \nWhen the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a \ngreat number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' \nOne of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's \nApostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but \nAllah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we \nnever saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, \nwhoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of \nAllah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some \npeople, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu \nAiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the \nnarration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and \nI vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin \nMalik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for \nHajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin \nMalik, who was by then an old blind man, was leading his people in the prayer. When he finished the \nprayer, I greeted him and introduced myself to him and then asked him about that narration. He told \nthat narration again in the same manner as he had narrated it the first time.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَعَقَلَ مَجَّةً مَجَّهَا فِي وَجْهِهِ مِنْ بِئْرٍ كَانَتْ فِي دَارِهِمْ‏.‏ فَزَعَمَ مَحْمُودٌ أَنَّهُ سَمِعَ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيّ َ ـ رضى الله عنه ـ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ كُنْتُ أُصَلِّي لِقَوْمِي بِبَنِي سَالِمٍ، وَكَانَ يَحُولُ بَيْنِي وَبَيْنَهُمْ وَادٍ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ قِبَلَ مَسْجِدِهِمْ، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ إِنِّي أَنْكَرْتُ بَصَرِي، وَإِنَّ الْوَادِيَ الَّذِي بَيْنِي وَبَيْنَ قَوْمِي يَسِيلُ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ، فَوَدِدْتُ أَنَّكَ تَأْتِي فَتُصَلِّي مِنْ بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَأَفْعَلُ ‏\"‏‏.‏ فَغَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ ـ رضى الله عنه ـ بَعْدَ مَا اشْتَدَّ النَّهَارُ فَاسْتَأْذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى قَالَ ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ أَنْ أُصَلِّيَ فِيهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرَ وَصَفَفْنَا وَرَاءَهُ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَسَلَّمْنَا حِينَ سَلَّمَ، فَحَبَسْتُهُ عَلَى خَزِيرٍ يُصْنَعُ لَهُ فَسَمِعَ أَهْلُ الدَّارِ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَيْتِي فَثَابَ رِجَالٌ مِنْهُمْ حَتَّى كَثُرَ الرِّجَالُ فِي الْبَيْتِ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ مَا فَعَلَ مَالِكٌ لاَ أَرَاهُ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ ذَاكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ ذَاكَ أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ أَمَّا نَحْنُ فَوَاللَّهِ لاَ نَرَى وُدَّهُ وَلاَ حَدِيثَهُ إِلاَّ إِلَى الْمُنَافِقِينَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّ اللَّهَ قَدْ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ مَحْمُودٌ فَحَدَّثْتُهَا قَوْمًا فِيهِمْ أَبُو أَيُّوبَ صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَتِهِ الَّتِي تُوُفِّيَ فِيهَا وَيَزِيدُ بْنُ مُعَاوِيَةَ عَلَيْهِمْ بِأَرْضِ الرُّومِ، فَأَنْكَرَهَا عَلَىَّ أَبُو أَيُّوبَ قَالَ وَاللَّهِ مَا أَظُنُّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَا قُلْتَ قَطُّ‏.‏ فَكَبُرَ ذَلِكَ عَلَىَّ فَجَعَلْتُ لِلَّهِ عَلَىَّ إِنْ سَلَّمَنِي حَتَّى أَقْفُلَ مِنْ غَزْوَتِي أَنْ أَسْأَلَ عَنْهَا عِتْبَانَ بْنَ مَالِكٍ ـ رضى الله عنه ـ إِنْ وَجَدْتُهُ حَيًّا فِي مَسْجِدِ قَوْمِهِ، فَقَفَلْتُ فَأَهْلَلْتُ بِحَجَّةٍ أَوْ بِعُمْرَةٍ، ثُمَّ سِرْتُ حَتَّى قَدِمْتُ الْمَدِينَةَ فَأَتَيْتُ بَنِي سَالِمٍ، فَإِذَا عِتْبَانُ شَيْخٌ أَعْمَى يُصَلِّي لِقَوْمِهِ فَلَمَّا سَلَّمَ مِنَ الصَّلاَةِ سَلَّمْتُ عَلَيْهِ وَأَخْبَرْتُهُ مَنْ أَنَا، ثُمَّ سَأَلْتُهُ عَنْ ذَلِكَ الْحَدِيثِ فَحَدَّثَنِيهِ كَمَا حَدَّثَنِيهِ أَوَّلَ مَرَّةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1185, 1186In-book reference : Book 19, Hadith 62USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1186,
    "id": 1186,
    "url": "https://sunnah.com/bukhari:1186",
    "bookNumber": 19,
    "hadithNumber": 62,
    "narrator": "Narrated Mahmud bin Ar-rabi' Al-Ansari:",
    "english": "that he remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had \nthrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard \n`Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my \npeople at Bani Salim in the prayer and there was a valley between me and those people. Whenever it \nrained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and \nsaid, 'I have weak eyesight and the valley between me and my people flows during the rainy season \nand it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so \nthat I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) \nand Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) \nasked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you \nwant us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So \nAllah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows \nbehind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim \nwith him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a \nspecial type of dish prepared from barley flour and meat soup)-- \nWhen the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a \ngreat number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' \nOne of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's \nApostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but \nAllah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we \nnever saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, \nwhoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of \nAllah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some \npeople, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu \nAiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the \nnarration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and \nI vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin \nMalik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for \nHajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin \nMalik, who was by then an old blind man, was leading his people in the prayer. When he finished the \nprayer, I greeted him and introduced myself to him and then asked him about that narration. He told \nthat narration again in the same manner as he had narrated it the first time.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَعَقَلَ مَجَّةً مَجَّهَا فِي وَجْهِهِ مِنْ بِئْرٍ كَانَتْ فِي دَارِهِمْ‏.‏ فَزَعَمَ مَحْمُودٌ أَنَّهُ سَمِعَ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيّ َ ـ رضى الله عنه ـ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ كُنْتُ أُصَلِّي لِقَوْمِي بِبَنِي سَالِمٍ، وَكَانَ يَحُولُ بَيْنِي وَبَيْنَهُمْ وَادٍ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ قِبَلَ مَسْجِدِهِمْ، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ إِنِّي أَنْكَرْتُ بَصَرِي، وَإِنَّ الْوَادِيَ الَّذِي بَيْنِي وَبَيْنَ قَوْمِي يَسِيلُ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ، فَوَدِدْتُ أَنَّكَ تَأْتِي فَتُصَلِّي مِنْ بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَأَفْعَلُ ‏\"‏‏.‏ فَغَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ ـ رضى الله عنه ـ بَعْدَ مَا اشْتَدَّ النَّهَارُ فَاسْتَأْذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى قَالَ ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ أَنْ أُصَلِّيَ فِيهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرَ وَصَفَفْنَا وَرَاءَهُ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَسَلَّمْنَا حِينَ سَلَّمَ، فَحَبَسْتُهُ عَلَى خَزِيرٍ يُصْنَعُ لَهُ فَسَمِعَ أَهْلُ الدَّارِ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَيْتِي فَثَابَ رِجَالٌ مِنْهُمْ حَتَّى كَثُرَ الرِّجَالُ فِي الْبَيْتِ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ مَا فَعَلَ مَالِكٌ لاَ أَرَاهُ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ ذَاكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ ذَاكَ أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ أَمَّا نَحْنُ فَوَاللَّهِ لاَ نَرَى وُدَّهُ وَلاَ حَدِيثَهُ إِلاَّ إِلَى الْمُنَافِقِينَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّ اللَّهَ قَدْ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ مَحْمُودٌ فَحَدَّثْتُهَا قَوْمًا فِيهِمْ أَبُو أَيُّوبَ صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَتِهِ الَّتِي تُوُفِّيَ فِيهَا وَيَزِيدُ بْنُ مُعَاوِيَةَ عَلَيْهِمْ بِأَرْضِ الرُّومِ، فَأَنْكَرَهَا عَلَىَّ أَبُو أَيُّوبَ قَالَ وَاللَّهِ مَا أَظُنُّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَا قُلْتَ قَطُّ‏.‏ فَكَبُرَ ذَلِكَ عَلَىَّ فَجَعَلْتُ لِلَّهِ عَلَىَّ إِنْ سَلَّمَنِي حَتَّى أَقْفُلَ مِنْ غَزْوَتِي أَنْ أَسْأَلَ عَنْهَا عِتْبَانَ بْنَ مَالِكٍ ـ رضى الله عنه ـ إِنْ وَجَدْتُهُ حَيًّا فِي مَسْجِدِ قَوْمِهِ، فَقَفَلْتُ فَأَهْلَلْتُ بِحَجَّةٍ أَوْ بِعُمْرَةٍ، ثُمَّ سِرْتُ حَتَّى قَدِمْتُ الْمَدِينَةَ فَأَتَيْتُ بَنِي سَالِمٍ، فَإِذَا عِتْبَانُ شَيْخٌ أَعْمَى يُصَلِّي لِقَوْمِهِ فَلَمَّا سَلَّمَ مِنَ الصَّلاَةِ سَلَّمْتُ عَلَيْهِ وَأَخْبَرْتُهُ مَنْ أَنَا، ثُمَّ سَأَلْتُهُ عَنْ ذَلِكَ الْحَدِيثِ فَحَدَّثَنِيهِ كَمَا حَدَّثَنِيهِ أَوَّلَ مَرَّةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1185, 1186In-book reference : Book 19, Hadith 62USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1187,
    "id": 1187,
    "url": "https://sunnah.com/bukhari:1187",
    "bookNumber": 19,
    "hadithNumber": 63,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Offer some of your prayers in your houses and do not make them graves.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، وَعُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اجْعَلُوا فى بُيُوتِكُمْ مِنْ صَلاَتِكُمْ وَلاَ تَتَّخِذُوهَا قُبُورًا ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1187In-book reference : Book 19, Hadith 63USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1188,
    "id": 1188,
    "url": "https://sunnah.com/bukhari:1188",
    "bookNumber": 20,
    "hadithNumber": 1,
    "narrator": "Narrated Quza'a:",
    "english": "I heard Abu Said saying four words. He said, \"I heard the Prophet (ﷺ) \n     (saying the following narrative).\" He had participated in twelve holy \n     battles with the Prophet.",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ قَزَعَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ ـ رضى الله عنه ـ أَرْبَعًا قَالَ سَمِعْتُ مِنَ النَّبِيِّ، صلى الله عليه وسلم وَكَانَ غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً ح‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1188In-book reference : Book 20, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1189,
    "id": 1189,
    "url": "https://sunnah.com/bukhari:1189",
    "bookNumber": 20,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Do not set out on a journey\n     except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of \n     Allah's Messenger (ﷺ) , and the Mosque of Al-Aqsa, (Mosque of Jerusalem).\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ، وَمَسْجِدِ الرَّسُولِ صلى الله عليه وسلم وَمَسْجِدِ الأَقْصَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1189In-book reference : Book 20, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1190,
    "id": 1190,
    "url": "https://sunnah.com/bukhari:1190",
    "bookNumber": 20,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"One prayer in my Mosque is better than one thousand prayers in any other \nmosque excepting Al-Masjid-AI-Haram.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ رَبَاحٍ، وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1190In-book reference : Book 20, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1191,
    "id": 1191,
    "url": "https://sunnah.com/bukhari:1191",
    "bookNumber": 20,
    "hadithNumber": 4,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar never offered the Duha prayer except on two occasions: \n(1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would \nperform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. \n(2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he \ndisliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Messenger (ﷺ) used to visit the \nMosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I \ndo only what my companions used to do and I don't forbid anybody to pray at any time during the day \nor night except that one should not intend to pray at sunrise or sunset.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ـ هُوَ الدَّوْرَقِيُّ ـ حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ لاَ يُصَلِّي مِنَ الضُّحَى إِلاَّ فِي يَوْمَيْنِ يَوْمَ يَقْدَمُ بِمَكَّةَ، فَإِنَّهُ كَانَ يَقْدَمُهَا ضُحًى، فَيَطُوفُ بِالْبَيْتِ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ خَلْفَ الْمَقَامِ، وَيَوْمَ يَأْتِي مَسْجِدَ قُبَاءٍ، فَإِنَّهُ كَانَ يَأْتِيهِ كُلَّ سَبْتٍ، فَإِذَا دَخَلَ الْمَسْجِدَ كَرِهَ أَنْ يَخْرُجَ مِنْهُ حَتَّى يُصَلِّيَ فِيهِ‏.‏ قَالَ وَكَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَزُورُهُ رَاكِبًا وَمَاشِيًا‏.‏ قَالَ وَكَانَ يَقُولُ إِنَّمَا أَصْنَعُ كَمَا رَأَيْتُ أَصْحَابِي يَصْنَعُونَ، وَلاَ أَمْنَعُ أَحَدًا أَنْ يُصَلِّيَ فِي أَىِّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ، غَيْرَ أَنْ لاَ تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1191, 1192In-book reference : Book 20, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1192,
    "id": 1192,
    "url": "https://sunnah.com/bukhari:1192",
    "bookNumber": 20,
    "hadithNumber": 4,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar never offered the Duha prayer except on two occasions: \n(1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would \nperform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. \n(2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he \ndisliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Messenger (ﷺ) used to visit the \nMosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I \ndo only what my companions used to do and I don't forbid anybody to pray at any time during the day \nor night except that one should not intend to pray at sunrise or sunset.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ـ هُوَ الدَّوْرَقِيُّ ـ حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ لاَ يُصَلِّي مِنَ الضُّحَى إِلاَّ فِي يَوْمَيْنِ يَوْمَ يَقْدَمُ بِمَكَّةَ، فَإِنَّهُ كَانَ يَقْدَمُهَا ضُحًى، فَيَطُوفُ بِالْبَيْتِ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ خَلْفَ الْمَقَامِ، وَيَوْمَ يَأْتِي مَسْجِدَ قُبَاءٍ، فَإِنَّهُ كَانَ يَأْتِيهِ كُلَّ سَبْتٍ، فَإِذَا دَخَلَ الْمَسْجِدَ كَرِهَ أَنْ يَخْرُجَ مِنْهُ حَتَّى يُصَلِّيَ فِيهِ‏.‏ قَالَ وَكَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَزُورُهُ رَاكِبًا وَمَاشِيًا‏.‏ قَالَ وَكَانَ يَقُولُ إِنَّمَا أَصْنَعُ كَمَا رَأَيْتُ أَصْحَابِي يَصْنَعُونَ، وَلاَ أَمْنَعُ أَحَدًا أَنْ يُصَلِّيَ فِي أَىِّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ، غَيْرَ أَنْ لاَ تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1191, 1192In-book reference : Book 20, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1193,
    "id": 1193,
    "url": "https://sunnah.com/bukhari:1193",
    "bookNumber": 20,
    "hadithNumber": 5,
    "narrator": "Narrated `Abdullah bin Dinar:",
    "english": "Ibn `Umar said, \"The Prophet (ﷺ) used to go to the Mosque of Quba every Saturday (sometimes) walking \nand (sometimes) riding.\" `Abdullah (Ibn `Umar) used to do the same.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْتِي مَسْجِدَ قُبَاءٍ كُلَّ سَبْتٍ مَاشِيًا وَرَاكِبًا‏.‏ وَكَانَ عَبْدُ اللَّهِ ـ رضى الله عنهما ـ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1193In-book reference : Book 20, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1194,
    "id": 1194,
    "url": "https://sunnah.com/bukhari:1194",
    "bookNumber": 20,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) used to go to the Mosque of Quba (sometimes) walking and sometimes riding. Added \nNafi` (in another narration), \"He then would offer two rak`at (in the Mosque of Quba).\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا‏.‏ زَادَ ابْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ فَيُصَلِّي فِيهِ رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1194In-book reference : Book 20, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1195,
    "id": 1195,
    "url": "https://sunnah.com/bukhari:1195",
    "bookNumber": 20,
    "hadithNumber": 7,
    "narrator": "Narrated `Abdullah bin Zaid Al-Mazini:",
    "english": "Allah's Messenger (ﷺ) said, \"Between my house and the pulpit there is a garden of the gardens of Paradise.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْمَازِنِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1195In-book reference : Book 20, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1196,
    "id": 1196,
    "url": "https://sunnah.com/bukhari:1196",
    "bookNumber": 20,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Between my house and my pulpit there is a garden of the gardens of Paradise, and \nmy pulpit is on my fountain tank (i.e. Al-Kauthar).\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1196In-book reference : Book 20, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1197,
    "id": 1197,
    "url": "https://sunnah.com/bukhari:1197",
    "bookNumber": 20,
    "hadithNumber": 9,
    "narrator": "Narrated Qaza'a Maula:",
    "english": "(freed slave of) Ziyad: I heard Abu Sa`id Al-khudri narrating four things from the Prophet (ﷺ) and I \nappreciated them very much. He said, conveying the words of the Prophet. \n(1) \"A woman should not go on a two day journey except with her husband or a Dhi-Mahram. \n(2) No fasting is permissible on two days: `Id-ul-Fitr and `Id-ul-Adha. \n(3) No prayer after two prayers, i.e. after the Fajr prayer till the sunrises and after the `Asr prayer till \nthe sun sets. \n(4) Do not prepare yourself for a journey except to three Mosques, i.e. Al-Masjid-AI-Haram, the \nMosque of Aqsa (Jerusalem) and my Mosque.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، سَمِعْتُ قَزَعَةَ، مَوْلَى زِيَادٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يُحَدِّثُ بِأَرْبَعٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فَأَعْجَبْنَنِي وَآنَقْنَنِي قَالَ ‏\n\"‏ لاَ تُسَافِرِ الْمَرْأَةُ يَوْمَيْنِ إِلاَّ مَعَهَا زَوْجُهَا أَوْ ذُو مَحْرَمٍ‏.‏ وَلاَ صَوْمَ فِي يَوْمَيْنِ الْفِطْرِ وَالأَضْحَى، وَلاَ صَلاَةَ بَعْدَ صَلاَتَيْنِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ، وَلاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِ الأَقْصَى وَمَسْجِدِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1197In-book reference : Book 20, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 21, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1198,
    "id": 1198,
    "url": "https://sunnah.com/bukhari:1198",
    "bookNumber": 21,
    "hadithNumber": 1,
    "narrator": "Narrated Kuraib Maula Ibn `Abbas:",
    "english": "`Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the \nfaithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Messenger (ﷺ) along with \nhis wife slept lengthwise. Allah's Messenger (ﷺ) slept till midnight or slightly before or after it. Then Allah's \nApostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he \nrecited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer \nand performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas \nadded, \"I got up and did the same as Allah's Messenger (ﷺ) had done and then went and stood by his side. \nAllah's Messenger (ﷺ) then put his right hand over my head and caught my right ear and twisted it. He \noffered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at \nand then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two \nlight rak`at and went out and offered the early morning (Fajr) prayer.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ وَهْىَ خَالَتُهُ ـ قَالَ فَاضْطَجَعْتُ عَلَى عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ، ثُمَّ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ، فَمَسَحَ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ آيَاتٍ خَوَاتِيمَ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا بِيَدِهِ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1198In-book reference : Book 21, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1199,
    "id": 1199,
    "url": "https://sunnah.com/bukhari:1199",
    "bookNumber": 21,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah:",
    "english": "We used to greet the Prophet (ﷺ) while he was praying and he used to answer our greetings. When we \nreturned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the \nprayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious \nmatter).\"",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كُنَّا نُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي الصَّلاَةِ فَيَرُدُّ عَلَيْنَا، فَلَمَّا رَجَعْنَا مِنْ عِنْدِ النَّجَاشِيِّ سَلَّمْنَا عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْنَا وَقَالَ ‏\n\"‏ إِنَّ فِي الصَّلاَةِ شُغْلاً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1199In-book reference : Book 21, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 290   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1200,
    "id": 1200,
    "url": "https://sunnah.com/bukhari:1200",
    "bookNumber": 21,
    "hadithNumber": 4,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "In the lifetime of the Prophet (ﷺ) we used to speak while praying, and one of us would tell his needs to his \ncompanions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were \nordered to remain silent while praying.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى ـ هُوَ ابْنُ يُونُسَ ـ عَنْ إِسْمَاعِيلَ، عَنِ الْحَارِثِ بْنِ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، قَالَ قَالَ لِي زَيْدُ بْنُ أَرْقَمَ إِنْ كُنَّا لَنَتَكَلَّمُ فِي الصَّلاَةِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم، يُكَلِّمُ أَحَدُنَا صَاحِبَهُ بِحَاجَتِهِ حَتَّى نَزَلَتْ ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ‏}‏ الآيَةَ، فَأُمِرْنَا بِالسُّكُوتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1200In-book reference : Book 21, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 22, Hadith 292   (deprecated numbering scheme)"
  }
]