[
  {
    "hadithGlobalNumber": 1701,
    "id": 1701,
    "url": "https://sunnah.com/bukhari:1701",
    "bookNumber": 25,
    "hadithNumber": 179,
    "narrator": "Narrated `Aisha:",
    "english": "Once the Prophet (ﷺ) sent sheep as Hadi.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَهْدَى النَّبِيُّ صلى الله عليه وسلم مَرَّةً غَنَمًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1701In-book reference : Book 25, Hadith 179USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 758   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1702,
    "id": 1702,
    "url": "https://sunnah.com/bukhari:1702",
    "bookNumber": 25,
    "hadithNumber": 180,
    "narrator": "Narrated `Aisha:",
    "english": "I used to make the garlands for (the Hadis of) the Prophet (ﷺ) and he would garland the sheep (with them) \nand would stay with his family as a non-Muhrim.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَفْتِلُ الْقَلاَئِدَ لِلنَّبِيِّ صلى الله عليه وسلم فَيُقَلِّدُ الْغَنَمَ، وَيُقِيمُ فِي أَهْلِهِ حَلاَلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1702In-book reference : Book 25, Hadith 180USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 759   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1703,
    "id": 1703,
    "url": "https://sunnah.com/bukhari:1703",
    "bookNumber": 25,
    "hadithNumber": 181,
    "narrator": "Narrated Aisha:",
    "english": "I used to twist the garlands for the sheep of the Prophet (ﷺ) and he would send them (to the Ka`ba), and \nstay as a non-Muhrim.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ،‏.‏ وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَفْتِلُ قَلاَئِدَ الْغَنَمِ لِلنَّبِيِّ صلى الله عليه وسلم فَيَبْعَثُ بِهَا، ثُمَّ يَمْكُثُ حَلاَلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1703In-book reference : Book 25, Hadith 181USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 760   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1704,
    "id": 1704,
    "url": "https://sunnah.com/bukhari:1704",
    "bookNumber": 25,
    "hadithNumber": 182,
    "narrator": "Narrated `Aisha:",
    "english": "I twisted (the garlands) for the Hadis of the Prophet (ﷺ) before he assumed Ihram.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ فَتَلْتُ لِهَدْىِ النَّبِيِّ صلى الله عليه وسلم ـ تَعْنِي الْقَلاَئِدَ ـ قَبْلَ أَنْ يُحْرِمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1704In-book reference : Book 25, Hadith 182USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 761   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1705,
    "id": 1705,
    "url": "https://sunnah.com/bukhari:1705",
    "bookNumber": 25,
    "hadithNumber": 183,
    "narrator": "Narrated `Aisha:",
    "english": "I twisted the garlands of the Hadis from the wool which was with me.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ، عَنْ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ قَالَتْ فَتَلْتُ قَلاَئِدَهَا مِنْ عِهْنٍ كَانَ عِنْدِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1705In-book reference : Book 25, Hadith 183USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 762   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1706,
    "id": 1706,
    "url": "https://sunnah.com/bukhari:1706",
    "bookNumber": 25,
    "hadithNumber": 184,
    "narrator": "Narrated `Ikrima:",
    "english": "Abu Huraira said, \"The Prophet (ﷺ) saw a man driving a Badana (sacrificial camel). The Prophet (p.b.u.h) \nsaid (to him), 'Ride on it.' He replied, 'It is a Badana.' The Prophet (ﷺ) again said, 'Ride on it!' Abu Huraira \nadded, 'Then I saw that man riding it, showing obedience to the Prophet (p.b.u.h), and a shoe was \n(hanging) from its neck.' \"\n\n\nNarrated Abu Huraira:\n\nFrom the Prophet: (as above).",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، عَنْ مَعْمَرٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ فَلَقَدْ رَأَيْتُهُ رَاكِبَهَا يُسَايِرُ النَّبِيَّ صلى الله عليه وسلم وَالنَّعْلُ فِي عُنُقِهَا‏.‏\nتَابَعَهُ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1706In-book reference : Book 25, Hadith 184USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 763   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1707,
    "id": 1707,
    "url": "https://sunnah.com/bukhari:1707",
    "bookNumber": 25,
    "hadithNumber": 185,
    "narrator": "Narrated `Ali:",
    "english": "Allah's Messenger (ﷺ) ordered me to give in charity the skin and the coverings of the Budn which I had \nslaughtered.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَتَصَدَّقَ بِجِلاَلِ الْبُدْنِ الَّتِي نَحَرْتُ وَبِجُلُودِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1707In-book reference : Book 25, Hadith 185USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 765   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1708,
    "id": 1708,
    "url": "https://sunnah.com/bukhari:1708",
    "bookNumber": 25,
    "hadithNumber": 186,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar intended to perform Hajj in the year of the Hajj of Al-Harawriya during the rule of Ibn Az- \nZubair. Some people said to him, \"It is very likely that there will be a fight among the people, and we \nare afraid that they might prevent you (from performing Hajj).\" He replied, \"Verily, in Allah's Messenger (ﷺ) \nthere is a good example for you (to follow). In this case I would do the same as he had done. I make \nyou witness that I have intended to perform `Umra.\" When he reached Al-Baida', he said, \"The \nconditions for both Hajj and `Umra are the same. I make you witness that I have intended to perform \nHajj along with `Umra.\" After that he took a garlanded Hadi (to Mecca) which he bought (on the \nway). When he reached (Mecca), he performed Tawaf of the Ka`ba and of Safa (and Marwa) and did \nnot do more than that. He did not make legal for himself the things which were illegal for a Muhrim \ntill it was the Day of Nahr (sacrifice), when he had his head shaved and slaughtered (the sacrifice) and \nconsidered sufficient his first Tawaf (between Safa and Marwa), as a (Sa`i) for his Hajj and `Umra \nboth. He then said, \"The Prophet (ﷺ) used to do like that.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ أَرَادَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ الْحَجَّ عَامَ حَجَّةِ الْحَرُورِيَّةِ فِي عَهْدِ ابْنِ الزُّبَيْرِ ـ رضى الله عنهما ـ فَقِيلَ لَهُ إِنَّ النَّاسَ كَائِنٌ بَيْنَهُمْ قِتَالٌ، وَنَخَافُ أَنْ يَصُدُّوكَ‏.‏ فَقَالَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏ إِذًا أَصْنَعَ كَمَا صَنَعَ، أُشْهِدُكُمْ أَنِّي أَوْجَبْتُ عُمْرَةً‏.‏ حَتَّى كَانَ بِظَاهِرِ الْبَيْدَاءِ قَالَ مَا شَأْنُ الْحَجِّ وَالْعُمْرَةِ إِلاَّ وَاحِدٌ، أُشْهِدُكُمْ أَنِّي جَمَعْتُ حَجَّةً مَعَ عُمْرَةٍ‏.‏ وَأَهْدَى هَدْيًا مُقَلَّدًا اشْتَرَاهُ حَتَّى قَدِمَ، فَطَافَ بِالْبَيْتِ وَبِالصَّفَا، وَلَمْ يَزِدْ عَلَى ذَلِكَ، وَلَمْ يَحْلِلْ مِنْ شَىْءٍ حَرُمَ مِنْهُ حَتَّى يَوْمِ النَّحْرِ، فَحَلَقَ وَنَحَرَ وَرَأَى أَنْ قَدْ قَضَى طَوَافَهُ الْحَجَّ وَالْعُمْرَةَ بِطَوَافِهِ الأَوَّلِ، ثُمَّ قَالَ كَذَلِكَ صَنَعَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1708In-book reference : Book 25, Hadith 186USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 766   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1709,
    "id": 1709,
    "url": "https://sunnah.com/bukhari:1709",
    "bookNumber": 25,
    "hadithNumber": 187,
    "narrator": "Narrated `Amra bint `Abdur-Rahman:",
    "english": "I heard `Aisha saying, \"Five days before the end of Dhul-Qa'da we set out from Medina in the \ncompany of Allah's Messenger (ﷺ) with the intention of performing Hajj only. When we approached Mecca, \nAllah's Messenger (ﷺ) ordered those who had no Hadi with them to finish their lhram after performing Tawaf \nof the Ka`ba and (Sa`i) and between Safa and Marwa.\" `Aisha added, \"On the day of Nahr \n(slaughtering of sacrifice) beef was brought to us. I asked, 'What is this?' The reply was, 'Allah's \nApostle (p.b.u.h) has slaughtered (sacrifices) on behalf of his wives.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، لاَ نُرَى إِلاَّ الْحَجَّ، فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ، إِذَا طَافَ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَنْ يَحِلَّ، قَالَتْ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ‏.‏ فَقُلْتُ مَا هَذَا قَالَ نَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ‏.‏ قَالَ يَحْيَى فَذَكَرْتُهُ لِلْقَاسِمِ، فَقَالَ أَتَتْكَ بِالْحَدِيثِ عَلَى وَجْهِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1709In-book reference : Book 25, Hadith 187USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 767   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1710,
    "id": 1710,
    "url": "https://sunnah.com/bukhari:1710",
    "bookNumber": 25,
    "hadithNumber": 188,
    "narrator": "Narrated Nafi`:",
    "english": "`Abdullah (bin `Umar), used to slaughter (his sacrifice) at the Manhar. ('Ubaidullah, a sub-narrator \nsaid, \"The Manhar of Allah's Messenger (ﷺ).\")",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ خَالِدَ بْنَ الْحَارِثِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ ـ رضى الله عنه ـ كَانَ يَنْحَرُ فِي الْمَنْحَرِ‏.‏ قَالَ عُبَيْدُ اللَّهِ مَنْحَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1710In-book reference : Book 25, Hadith 188USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 768   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1711,
    "id": 1711,
    "url": "https://sunnah.com/bukhari:1711",
    "bookNumber": 25,
    "hadithNumber": 189,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar used to send his Hadi from Jam' (to Mina) in the last third of the night with the pilgrims \namongst whom there were free men and slaves, till it was taken into the Manhar (slaughtering place) \nof the Prophet (ﷺ) .",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَبْعَثُ بِهَدْيِهِ مِنْ جَمْعٍ مِنْ آخِرِ اللَّيْلِ، حَتَّى يُدْخَلَ بِهِ مَنْحَرُ النَّبِيِّ صلى الله عليه وسلم مَعَ حُجَّاجٍ فِيهِمُ الْحُرُّ وَالْمَمْلُوكُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1711In-book reference : Book 25, Hadith 189USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 769   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1712,
    "id": 1712,
    "url": "https://sunnah.com/bukhari:1712",
    "bookNumber": 25,
    "hadithNumber": 190,
    "narrator": "Narrated Sahl bin Bakkar:",
    "english": "The narration of Anas abridged, saying, \"The Prophet (ﷺ) slaughtered seven Budn (camels) while \nstanding, with his own hands. On the day of `Id-ul-Adha he slaughtered (sacrificed) two horned rams, \nblack and white in color.",
    "arabic": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ وَذَكَرَ الْحَدِيثَ ـ قَالَ وَنَحَرَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ سَبْعَ بُدْنٍ قِيَامًا، وَضَحَّى بِالْمَدِينَةِ كَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ‏.‏ مُخْتَصَرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1712In-book reference : Book 25, Hadith 190USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 770   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1713,
    "id": 1713,
    "url": "https://sunnah.com/bukhari:1713",
    "bookNumber": 25,
    "hadithNumber": 191,
    "narrator": "Narrated Ziyad bin Jubair:",
    "english": "I saw Ibn `Umar passing by a man who had made his Badana sit to slaughter it. Ibn `Umar said, \n\"Slaughter it while it is standing with one leg tied up as is the tradition of Muhammad.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ يُونُسَ، عَنِ زِيَادِ بْنِ جُبَيْرٍ، قَالَ رَأَيْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَتَى عَلَى رَجُلٍ، قَدْ أَنَاخَ بَدَنَتَهُ يَنْحَرُهَا، قَالَ ابْعَثْهَا قِيَامًا مُقَيَّدَةً، سُنَّةَ مُحَمَّدٍ صلى الله عليه وسلم‏.‏ وَقَالَ شُعْبَةُ عَنْ يُونُسَ أَخْبَرَنِي زِيَادٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1713In-book reference : Book 25, Hadith 191USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 771   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1714,
    "id": 1714,
    "url": "https://sunnah.com/bukhari:1714",
    "bookNumber": 25,
    "hadithNumber": 192,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) offered four rak`at of Zuhr prayer at Medina; and two rak`at of `Asr prayer at Dhil- \nHulaifa and spent the night there and when (the day) dawned, he mounted his Mount and started \nsaying, \"None has the right to be worshipped but Allah, and Glorified be Allah.\" When he reached Al- \nBaida' he recited Talbiya for both Hajj and `Umra. And when he arrived at Mecca, he ordered them \n(his companions) to finish their Ihram. The Prophet (ﷺ) slaughtered seven Budn (camel) with his own \nhands while the camels were standing He also sacrificed two horned rams (black and white in color) at \nMedina.",
    "arabic": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، فَبَاتَ بِهَا، فَلَمَّا أَصْبَحَ رَكِبَ رَاحِلَتَهُ، فَجَعَلَ يُهَلِّلُ وَيُسَبِّحُ، فَلَمَّا عَلاَ عَلَى الْبَيْدَاءِ لَبَّى بِهِمَا جَمِيعًا، فَلَمَّا دَخَلَ مَكَّةَ أَمَرَهُمْ أَنْ يَحِلُّوا‏.‏ وَنَحَرَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ سَبْعَ بُدْنٍ قِيَامًا، وَضَحَّى بِالْمَدِينَةِ كَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1714In-book reference : Book 25, Hadith 192USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 772   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1715,
    "id": 1715,
    "url": "https://sunnah.com/bukhari:1715",
    "bookNumber": 25,
    "hadithNumber": 193,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (p.b.u.h) offered four rak`at of Zuhr prayer at Medina and two rak`at of `Asr prayer at \nDhul-Hulaifa. Narrated Aiyub: \"A man said: Anas said, \"Then he (the Prophet (ﷺ) passed the night there \ntill dawn and then he offered the morning (Fajr) prayer, and mounted his Mount and when it arrived at \nAl-Baida' he assumed Ihram for both `Umra and Hajj.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ‏.‏ وَعَنْ أَيُّوبَ عَنْ رَجُلٍ عَنْ أَنَسٍ ـ رضى الله عنه ـ ثُمَّ بَاتَ حَتَّى أَصْبَحَ، فَصَلَّى الصُّبْحَ، ثُمَّ رَكِبَ رَاحِلَتَهُ حَتَّى إِذَا اسْتَوَتْ بِهِ الْبَيْدَاءَ أَهَلَّ بِعُمْرَةٍ وَحَجَّةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1715In-book reference : Book 25, Hadith 193USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 773   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1716,
    "id": 1716,
    "url": "https://sunnah.com/bukhari:1716",
    "bookNumber": 25,
    "hadithNumber": 194,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to \ndistribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \n\"The Prophet (ﷺ) ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their \nbodies) to the butcher as wages for slaughtering.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، قَالَ أَخْبَرَنِي ابْنُ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم فَقُمْتُ عَلَى الْبُدْنِ، فَأَمَرَنِي فَقَسَمْتُ لُحُومَهَا، ثُمَّ أَمَرَنِي فَقَسَمْتُ جِلاَلَهَا وَجُلُودَهَا‏.‏   قَالَ سُفْيَانُ وَحَدَّثَنِي عَبْدُ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ أَمَرَنِي النَّبِيُّ صلى الله عليه وسلم أَنْ أَقُومَ عَلَى الْبُدْنِ، وَلاَ أُعْطِيَ عَلَيْهَا شَيْئًا فِي جِزَارَتِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1716In-book reference : Book 25, Hadith 194USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 774   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1717,
    "id": 1717,
    "url": "https://sunnah.com/bukhari:1717",
    "bookNumber": 25,
    "hadithNumber": 195,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) ordered me to supervise the (slaughtering) of Budn (Hadi camel) and to distribute their \nmeat, skins and covering sheets in charity and not to give anything (of their bodies) to the butcher as \nwages for slaughtering.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، وَعَبْدُ الْكَرِيمِ الْجَزَرِيُّ، أَنَّ مُجَاهِدًا، أَخْبَرَهُمَا أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى أَخْبَرَهُ أَنَّ عَلِيًّا ـ رضى الله عنه ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يَقُومَ عَلَى بُدْنِهِ، وَأَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا، لُحُومَهَا وَجُلُودَهَا وَجِلاَلَهَا، وَلاَ يُعْطِيَ فِي جِزَارَتِهَا شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1717In-book reference : Book 25, Hadith 195USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 775   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1718,
    "id": 1718,
    "url": "https://sunnah.com/bukhari:1718",
    "bookNumber": 25,
    "hadithNumber": 196,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) \nand I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he \nordered me to distribute their skins in charity and I did so.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي ابْنُ أَبِي لَيْلَى، أَنَّ عَلِيًّا ـ رضى الله عنه ـ حَدَّثَهُ قَالَ أَهْدَى النَّبِيُّ صلى الله عليه وسلم مِائَةَ بَدَنَةٍ، فَأَمَرَنِي بِلُحُومِهَا فَقَسَمْتُهَا، ثُمَّ أَمَرَنِي بِجِلاَلِهَا فَقَسَمْتُهَا، ثُمَّ بِجُلُودِهَا فَقَسَمْتُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1718In-book reference : Book 25, Hadith 196USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 776   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1719,
    "id": 1719,
    "url": "https://sunnah.com/bukhari:1719",
    "bookNumber": 25,
    "hadithNumber": 197,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"I heard Jabir bin `Abdullah saying, 'We never ate the meat of the Budn for more than three \ndays of Mina. Later, the Prophet (ﷺ) gave us permission by saying: 'Eat and take (meat) with you. So we \nate (some) and took (some) with us.' \" I asked `Ata', \"Did Jabir say (that they went on eating the meat) \ntill they reached Medina?\" `Ata' replied, \"No.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنَا عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ كُنَّا لاَ نَأْكُلُ مِنْ لُحُومِ بُدْنِنَا فَوْقَ ثَلاَثِ مِنًى، فَرَخَّصَ لَنَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ كُلُوا وَتَزَوَّدُوا ‏\"‏‏.‏ فَأَكَلْنَا وَتَزَوَّدْنَا‏.‏ قُلْتُ لِعَطَاءٍ أَقَالَ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1719In-book reference : Book 25, Hadith 197USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 777   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1720,
    "id": 1720,
    "url": "https://sunnah.com/bukhari:1720",
    "bookNumber": 25,
    "hadithNumber": 198,
    "narrator": "Narrated `Amra:",
    "english": "I heard `Aisha saying, \"We set out (from Medina) along with Allah's Messenger (ﷺ) five days before the end \nof Dhul-Qa'da with the intention of performing Hajj only. When we approached Mecca, Allah's \nApostle ordered those who had no Hadi along with them to finish the lhram after performing Tawaf of \nthe Ka`ba, (Safa and Marwa). `Aisha added, \"Beef was brought to us on the Day of Nahr and I said, \n'What is this?' Somebody said, 'The Prophet (ﷺ) has slaughtered (cows) on behalf of his wives.' \"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَتْنِي عَمْرَةُ، قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، وَلاَ نَرَى إِلاَّ الْحَجَّ، حَتَّى إِذَا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ إِذَا طَافَ بِالْبَيْتِ ثُمَّ يَحِلُّ‏.‏ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقِيلَ ذَبَحَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ‏.‏ قَالَ يَحْيَى فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ‏.‏ فَقَالَ أَتَتْكَ بِالْحَدِيثِ عَلَى وَجْهِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1720In-book reference : Book 25, Hadith 198USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 778   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1721,
    "id": 1721,
    "url": "https://sunnah.com/bukhari:1721",
    "bookNumber": 25,
    "hadithNumber": 199,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was asked about a person who had his head shaved before slaughtering (his Hadi) (or \nother similar ceremonies of Hajj). He replied, \"There is no harm, there is no harm.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا مَنْصُورٌ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَمَّنْ حَلَقَ قَبْلَ أَنْ يَذْبَحَ وَنَحْوِهِ‏.‏ فَقَالَ ‏\n\"‏ لاَ حَرَجَ، لاَ حَرَجَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1721In-book reference : Book 25, Hadith 199USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 779   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1722,
    "id": 1722,
    "url": "https://sunnah.com/bukhari:1722",
    "bookNumber": 25,
    "hadithNumber": 200,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man said to the Prophet (ﷺ) \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the \nJamra).\" The Prophet (ﷺ) replied, \"There is no harm.\" The man said, \"I had my head shaved before \nslaughtering.\" The Prophet (ﷺ) replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before \nthe Rami.\" The Prophet (ﷺ) replied, \"There is no harm.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم زُرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ وَقَالَ عَبْدُ الرَّحِيمِ الرَّازِيُّ عَنِ ابْنِ خُثَيْمٍ أَخْبَرَنِي عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ الْقَاسِمُ بْنُ يَحْيَى حَدَّثَنِي ابْنُ خُثَيْمٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏   وَقَالَ عَفَّانُ أُرَاهُ عَنْ وُهَيْبٍ، حَدَّثَنَا ابْنُ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ وَعَبَّادِ بْنِ مَنْصُورٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1722In-book reference : Book 25, Hadith 200USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 780   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1723,
    "id": 1723,
    "url": "https://sunnah.com/bukhari:1723",
    "bookNumber": 25,
    "hadithNumber": 201,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was asked by a man who said, \"I have done the Rami in the evening.\" The Prophet (ﷺ) \nreplied, \"There is no harm in it.\" Another man asked, \"I had my head shaved before the slaughtering.\" \nThe Prophet (ﷺ) replied, \"There is no harm in it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ‏.‏ فَقَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1723In-book reference : Book 25, Hadith 201USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 781   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1724,
    "id": 1724,
    "url": "https://sunnah.com/bukhari:1724",
    "bookNumber": 25,
    "hadithNumber": 202,
    "narrator": "Narrated Abu Musa:",
    "english": "I came upon Allah's Messenger (ﷺ) when he was at Al-Batha. He asked me, \"Have you intended to perform \nthe Hajj?\" I replied in the affirmative. He asked, \"For what have you assumed lhram?\" I replied,\" I \nhave assumed Ihram with the same intention as that of the Prophet (ﷺ) .\" The Prophet (ﷺ) said, \"You have \ndone well! Go and perform Tawaf round the Ka`ba and between Safa and Marwa.\" Then I went to one \nof the women of Bani Qais and she took out lice from my head. Later, I assumed the Ihram for Hajj. \nSo, I used to give this verdict to the people till the caliphate of `Umar. When I told him about it, he \nsaid, \"If we take (follow) the Holy Book, then it orders us to complete Hajj and `Umra (Hajj-at- \nTamattu`) and if we follow the tradition of Allah's Messenger (ﷺ) then Allah's Messenger (ﷺ) did not finish his \nlhram till the Hadi had reached its destination (had been slaughtered). (i.e. Hajj-al-Qiran). (See Hadith \nNo. 630)",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ بِالْبَطْحَاءِ‏.‏ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ أَحْسَنْتَ، انْطَلِقْ فَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ‏\"‏‏.‏ ثُمَّ أَتَيْتُ امْرَأَةً مِنْ نِسَاءِ بَنِي قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ، فَكُنْتُ أُفْتِي بِهِ النَّاسَ، حَتَّى خِلاَفَةِ عُمَرَ ـ رضى الله عنه ـ فَذَكَرْتُهُ لَهُ‏.‏ فَقَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ نَأْخُذْ بِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَحِلَّ حَتَّى بَلَغَ الْهَدْىُ مَحِلَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1724In-book reference : Book 25, Hadith 202USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 782   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1725,
    "id": 1725,
    "url": "https://sunnah.com/bukhari:1725",
    "bookNumber": 25,
    "hadithNumber": 203,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Hafsa said, \"O Allah's Messenger (ﷺ)! What is wrong with the people; they finished their Ihram after \nperforming `Umra, but you have not finished it after your `Umra?\" He replied, \"I matted my hair and \nhave garlanded my Hadi. So, I cannot finish my Ihram till I slaughter (my Hadi). \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنهم ـ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1725In-book reference : Book 25, Hadith 203USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 783   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1726,
    "id": 1726,
    "url": "https://sunnah.com/bukhari:1726",
    "bookNumber": 25,
    "hadithNumber": 204,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) (got) his head shaved after performing his Hajj.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، قَالَ نَافِعٌ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ حَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1726In-book reference : Book 25, Hadith 204USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 784   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1727,
    "id": 1727,
    "url": "https://sunnah.com/bukhari:1727",
    "bookNumber": 25,
    "hadithNumber": 205,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"O Allah! Be merciful to those who have their head shaved.\" The people said, \"O \nAllah's Messenger (ﷺ)! And (invoke Allah for) those who get their hair cut short.\" The Prophet (ﷺ) said, \"O \nAllah! Be merciful to those who have their head shaved.\" The people said, \"O Allah's Messenger (ﷺ)! And \nthose who get their hair cut short.\" The Prophet (ﷺ) said (the third time), \"And to those who get their hair \ncut short.\" Nafi` said that the Prophet (ﷺ) had said once or twice, \"O Allah! Be merciful to those who get \ntheir head shaved,\" and on the fourth time he added, \"And to those who have their hair cut short.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ مَرَّةً أَوْ مَرَّتَيْنِ‏.‏ قَالَ وَقَالَ عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ وَقَالَ فِي الرَّابِعَةِ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1727In-book reference : Book 25, Hadith 205USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 785   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1728,
    "id": 1728,
    "url": "https://sunnah.com/bukhari:1728",
    "bookNumber": 25,
    "hadithNumber": 206,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"O Allah! Forgive those who get their heads shaved.\" The people asked. \"Also \nthose who get their hair cut short?\" The Prophet (ﷺ) said, \"O Allah! Forgive those who have their heads \nshaved.\" The people said, \"Also those who get their hair cut short?\" The Prophet (invoke Allah for \nthose who have their heads shaved and) at the third time said, \"also (forgive) those who get their hair \ncut short.\"",
    "arabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَلِلْمُقَصِّرِينَ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَلِلْمُقَصِّرِينَ‏.‏ قَالَهَا ثَلاَثًا‏.‏ قَالَ ‏\"‏ وَلِلْمُقَصِّرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1728In-book reference : Book 25, Hadith 206USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 786   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1729,
    "id": 1729,
    "url": "https://sunnah.com/bukhari:1729",
    "bookNumber": 25,
    "hadithNumber": 207,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) and some of his companions got their heads shaved and some others got their hair cut \nshort.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، قَالَ حَلَقَ النَّبِيُّ صلى الله عليه وسلم وَطَائِفَةٌ مِنْ أَصْحَابِهِ، وَقَصَّرَ بَعْضُهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1729In-book reference : Book 25, Hadith 207USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 787   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1730,
    "id": 1730,
    "url": "https://sunnah.com/bukhari:1730",
    "bookNumber": 25,
    "hadithNumber": 208,
    "narrator": "Narrated Muawiya:",
    "english": "I cut short the hair of Allah's Messenger (ﷺ) with a long blade.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مُعَاوِيَةَ ـ رضى الله عنهم ـ قَالَ قَصَّرْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِشْقَصٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1730In-book reference : Book 25, Hadith 208USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 787   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1731,
    "id": 1731,
    "url": "https://sunnah.com/bukhari:1731",
    "bookNumber": 25,
    "hadithNumber": 209,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and \nbetween Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي كُرَيْبٌ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ أَمَرَ أَصْحَابَهُ أَنْ يَطُوفُوا بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ يَحِلُّوا، وَيَحْلِقُوا أَوْ يُقَصِّرُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1731In-book reference : Book 25, Hadith 209USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 788   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1732,
    "id": 1732,
    "url": "https://sunnah.com/bukhari:1732",
    "bookNumber": 25,
    "hadithNumber": 210,
    "narrator": "",
    "english": "Narrated Nafi' that Ibn 'Umar (ra) performed only one Tawaf. He would take an afternoon nap and then return to Mina. That was on the day of Nahr (slaughtering).",
    "arabic": "وَقَالَ لَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ طَافَ طَوَافًا وَاحِدًا، ثُمَّ يَقِيلُ ثُمَّ يَأْتِي مِنًى ـ يَعْنِي يَوْمَ النَّحْرِ ـ‏.‏ وَرَفَعَهُ عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عُبَيْدُ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1732In-book reference : Book 25, Hadith 210USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 789   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1733,
    "id": 1733,
    "url": "https://sunnah.com/bukhari:1733",
    "bookNumber": 25,
    "hadithNumber": 211,
    "narrator": "Narrated `Aisha:",
    "english": "We performed Hajj with the Prophet (ﷺ) and performed Tawaf-al-ifada on the Day of Nahr (slaughtering). \nSafiya got her menses and the Prophets desired from her what a husband desires from his wife. I said \nto him, \"O Allah's Messenger (ﷺ)! She is having her menses.\" He said, \"Is she going to detain us?\" We \ninformed him that she had performed Tawaf-al-Ifada on the Day of Nahr. He said, \"(Then you can) \ndepart.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ حَجَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَأَفَضْنَا يَوْمَ النَّحْرِ، فَحَاضَتْ صَفِيَّةُ، فَأَرَادَ النَّبِيُّ صلى الله عليه وسلم مِنْهَا مَا يُرِيدُ الرَّجُلُ مِنْ أَهْلِهِ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا حَائِضٌ‏.‏ قَالَ ‏\"‏ حَابِسَتُنَا هِيَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، أَفَاضَتْ يَوْمَ النَّحْرِ‏.‏ قَالَ ‏\"‏ اخْرُجُوا ‏\"‏‏.‏ وَيُذْكَرُ عَنِ الْقَاسِمِ وَعُرْوَةَ وَالأَسْوَدِ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَفَاضَتْ صَفِيَّةُ يَوْمَ النَّحْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1733In-book reference : Book 25, Hadith 211USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 789   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1734,
    "id": 1734,
    "url": "https://sunnah.com/bukhari:1734",
    "bookNumber": 25,
    "hadithNumber": 212,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was asked about the slaughtering, shaving (of the head), and the doing of Rami before or \nafter the due times. He said, \"There is no harm in that.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قِيلَ لَهُ فِي الذَّبْحِ وَالْحَلْقِ وَالرَّمْىِ وَالتَّقْدِيمِ وَالتَّأْخِيرِ فَقَالَ ‏\n\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1734In-book reference : Book 25, Hadith 212USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 790   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1735,
    "id": 1735,
    "url": "https://sunnah.com/bukhari:1735",
    "bookNumber": 25,
    "hadithNumber": 213,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was asked (as regards the ceremonies of Hajj) at Mina on the Day of Nahr and he replied \nthat there was no harm. Then a man said to him, \"I got my head shaved before slaughtering.\" He \nreplied, \"Slaughter (now) and there is no harm in it.\" (Another) man said, \"I did the Rami (of the \nJimar) after midday.\" The Prophet (ﷺ) replied, \"There was no harm in it.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُسْأَلُ يَوْمَ النَّحْرِ بِمِنًى، فَيَقُولُ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ فَسَأَلَهُ رَجُلٌ، فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ اذْبَحْ، وَلاَ حَرَجَ ‏\"‏‏.‏ وَقَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ‏.‏ فَقَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1735In-book reference : Book 25, Hadith 213USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 791   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1736,
    "id": 1736,
    "url": "https://sunnah.com/bukhari:1736",
    "bookNumber": 25,
    "hadithNumber": 214,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "Allah's Messenger (ﷺ) stopped (for a while near the Jimar at Mina) during his last Hajj and the people started \nasking him questions. A man said, \"Ignorantly I got my head shaved before slaughtering.\" The \nProphet replied, \"Slaughter (now) and there is no harm in it.\" Another man said, \"Unknowingly I \nslaughtered the Hadi before doing the Rami.\" The Prophet (ﷺ) said, \"Do Rami now and there is no harm \nin it.\" So, on that day, when the Prophet (ﷺ) was asked about anything (about the ceremonies of Hajj) \ndone before or after (its stated time) his reply was, \"Do it (now) and there is no harm.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ فِي حَجَّةِ الْوَدَاعِ، فَجَعَلُوا يَسْأَلُونَهُ، فَقَالَ رَجُلٌ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَجَاءَ آخَرُ فَقَالَ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1736In-book reference : Book 25, Hadith 214USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 792   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1737,
    "id": 1737,
    "url": "https://sunnah.com/bukhari:1737",
    "bookNumber": 25,
    "hadithNumber": 215,
    "narrator": "Narrated `Abdullah bin `Amr bin Al-`As:",
    "english": "I witnessed the Prophet (ﷺ) when he was delivering the sermon on the Day of Nahr. A man stood up and \nsaid, \"I thought that such and such was to be done before such and such. I got my hair shaved before \nslaughtering.\" (Another said), \"I slaughtered the Hadi before doing the Rami.\" So, the people asked \nabout many similar things. The Prophet (ﷺ) said, \"Do it (now) and there is no harm in all these cases.\" \nWhenever the Prophet (ﷺ) was asked about anything on that day, he replied, \"Do it (now) and there is no \nharm in it.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي الزُّهْرِيُّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنه ـ حَدَّثَهُ أَنَّهُ، شَهِدَ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ النَّحْرِ، فَقَامَ إِلَيْهِ رَجُلٌ، فَقَالَ كُنْتُ أَحْسِبُ أَنَّ كَذَا قَبْلَ كَذَا‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ كُنْتُ أَحْسِبُ أَنَّ كَذَا قَبْلَ كَذَا حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ، نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ وَأَشْبَاهَ ذَلِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏‏.‏ لَهُنَّ كُلِّهِنَّ، فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1737In-book reference : Book 25, Hadith 215USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 793   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1738,
    "id": 1738,
    "url": "https://sunnah.com/bukhari:1738",
    "bookNumber": 25,
    "hadithNumber": 216,
    "narrator": "Narrated `Abdullah bin `Amr bin Al-`As:",
    "english": "Allah's Messenger (ﷺ) stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, \ni.e. 793).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى نَاقَتِهِ‏.‏ فَذَكَرَ الْحَدِيثَ‏.‏ تَابَعَهُ مَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1738In-book reference : Book 25, Hadith 216USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 794   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1739,
    "id": 1739,
    "url": "https://sunnah.com/bukhari:1739",
    "bookNumber": 25,
    "hadithNumber": 217,
    "narrator": "Narrated `Ikrima:",
    "english": "Ibn `Abbas said: \"Allah's Messenger (ﷺ) delivered a sermon on the Day of Nahr, and said, 'O people! (Tell \nme) what is the day today?' The people replied, 'It is the forbidden (sacred) day.' He asked again, \n'What town is this?' They replied, 'It is the forbidden (Sacred) town.' He asked, 'Which month is this?' \nThey replied, 'It is the forbidden (Sacred) month.' He said, 'No doubt! Your blood, your properties, \nand your honor are sacred to one another like the sanctity of this day of yours, in this (sacred) town \n(Mecca) of yours, in this month of yours.' The Prophet (ﷺ) repeated his statement again and again. After \nthat he raised his head and said, 'O Allah! Haven't conveyed (Your Message) to them'. Haven't I \nconveyed Your Message to them?' \" Ibn `Abbas added, \"By Him in Whose Hand my soul is, the \nfollowing was his will (Prophet's will) to his followers:--It is incumbent upon those who are present to \nconvey this information to those who are absent Beware don't renegade (as) disbelievers (turn into \ninfidels) after me, Striking the necks (cutting the throats) of one another.' \"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ النَّاسَ يَوْمَ النَّحْرِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ‏.‏ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا يَوْمٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَأَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا بَلَدٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا شَهْرٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا ‏\"‏‏.‏ فَأَعَادَهَا مِرَارًا، ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَوَصِيَّتُهُ إِلَى أُمَّتِهِ ـ ‏\"‏ فَلْيُبْلِغِ الشَّاهِدُ الْغَائِبَ، لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1739In-book reference : Book 25, Hadith 217USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 795   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1740,
    "id": 1740,
    "url": "https://sunnah.com/bukhari:1740",
    "bookNumber": 25,
    "hadithNumber": 218,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I heard the Prophet (ﷺ) delivering a sermon at `Arafat.",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرٌو، قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ بِعَرَفَاتٍ‏.‏ تَابَعَهُ ابْنُ عُيَيْنَةَ عَنْ عَمْرٍو‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1740In-book reference : Book 25, Hadith 218USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 796   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1741,
    "id": 1741,
    "url": "https://sunnah.com/bukhari:1741",
    "bookNumber": 25,
    "hadithNumber": 219,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day \ntoday?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he \nmight give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further \nasked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till \nwe thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We \nreplied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know \nit better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it \nthe forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and \nyour properties are sacred to one another like the sanctity of this day of yours, in this month of yours, \nin this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message \nto you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are \npresent to convey it (this information) to those who are absent because the informed one might \ncomprehend it (what I have said) better than the present audience, who will convey it to him. Beware! \nDo not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا قُرَّةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ،، وَرَجُلٌ، أَفْضَلُ فِي نَفْسِي مِنْ عَبْدِ الرَّحْمَنِ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ، قَالَ ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ ذُو الْحَجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَتْ بِالْبَلْدَةِ الْحَرَامِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، إِلَى يَوْمِ تَلْقَوْنَ رَبَّكُمْ‏.‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ، فَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَرُبَّ مُبَلَّغٍ أَوْعَى مِنْ سَامِعٍ، فَلاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1741In-book reference : Book 25, Hadith 219USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 797   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1742,
    "id": 1742,
    "url": "https://sunnah.com/bukhari:1742",
    "bookNumber": 25,
    "hadithNumber": 220,
    "narrator": "Narrated Ibn `Umar:",
    "english": "At Mina, the Prophet (p.b.u.h) said, \"Do you know what is the day today?\" The people replied, \"Allah \nand His Apostle know it better.\" He said, \"It is the forbidden (sacred) day. And do you know what \ntown is this?\" They replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden \n(Sacred) town (Mecca). And do you know which month is this?\" The people replied, \"Allah and His \nApostle know it better.\" He said, \"This is the forbidden (sacred) month.\" The Prophet (ﷺ) added, \"No \ndoubt, Allah made your blood, your properties, and your honor sacred to one another like the sanctity \nof this day of yours in this month of yours in this town of yours.\" Narrated Ibn `Umar: On the Day of \nNahr (10th of Dhul-Hijja), the Prophet (ﷺ) stood in between the Jamrat during his Hajj which he \nperformed (as in the previous Hadith) and said, \"This is the greatest Day (i.e. 10th of Dhul-Hijjah).\" \nThe Prophet (ﷺ) started saying repeatedly, \"O Allah! Be Witness (I have conveyed Your Message).\" He \nthen bade the people farewell. The people said, \"This is Hajjat-al-Wada`).\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم بِمِنًى ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ هَذَا يَوْمٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ بَلَدٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهْرٌ حَرَامٌ ـ قَالَ ـ فَإِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا ‏\"‏‏.‏ وَقَالَ هِشَامُ بْنُ الْغَازِ أَخْبَرَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ وَقَفَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَيْنَ الْجَمَرَاتِ فِي الْحَجَّةِ الَّتِي حَجَّ بِهَذَا، وَقَالَ ‏\"‏ هَذَا يَوْمُ الْحَجِّ الأَكْبَرِ ‏\"‏، فَطَفِقَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏‏.‏ وَوَدَّعَ النَّاسَ‏.‏ فَقَالُوا هَذِهِ حَجَّةُ الْوَدَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1742In-book reference : Book 25, Hadith 220USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 798   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1743,
    "id": 1743,
    "url": "https://sunnah.com/bukhari:1743",
    "bookNumber": 25,
    "hadithNumber": 221,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) permitted the people who provided the pilgrims with water to stay at Mecca during the \nnights of Mina.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1743In-book reference : Book 25, Hadith 221USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 799   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1744,
    "id": 1744,
    "url": "https://sunnah.com/bukhari:1744",
    "bookNumber": 25,
    "hadithNumber": 222,
    "narrator": "Narrated Ibn `Umar:",
    "english": "That the Prophet (ﷺ) allowed people who provided the pilgrims with water to stay at Mecca during the \nnights of Mina.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1744In-book reference : Book 25, Hadith 222USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 800   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1745,
    "id": 1745,
    "url": "https://sunnah.com/bukhari:1745",
    "bookNumber": 25,
    "hadithNumber": 223,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Al-Abbas asked the permission from the Prophet (ﷺ) to stay at Mecca during the nights of Mina in order \nto provide water to the people, so the Prophet (ﷺ) allowed him.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْعَبَّاسَ ـ رضى الله عنه ـ اسْتَأْذَنَ النَّبِيَّ صلى الله عليه وسلم لِيَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى، مِنْ أَجْلِ سِقَايَتِهِ، فَأَذِنَ لَهُ‏.‏ تَابَعَهُ أَبُو أُسَامَةَ وَعُقْبَةُ بْنُ خَالِدٍ وَأَبُو ضَمْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1745In-book reference : Book 25, Hadith 223USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 801   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1746,
    "id": 1746,
    "url": "https://sunnah.com/bukhari:1746",
    "bookNumber": 25,
    "hadithNumber": 224,
    "narrator": "Narrated Wabra:",
    "english": "I asked Ibn `Umar, \"When should I do the Rami of the Jimar?\" He replied, \"When your leader does \nthat.\" I asked him again the same question. He replied, \"We used to wait till the sun declined and then \nwe would do the Rami (i.e. on the 11th and 12th of Dhul-Hijja).\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ وَبَرَةَ، قَالَ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ مَتَى أَرْمِي الْجِمَارَ قَالَ إِذَا رَمَى إِمَامُكَ فَارْمِهْ‏.‏ فَأَعَدْتُ عَلَيْهِ الْمَسْأَلَةَ، قَالَ كُنَّا نَتَحَيَّنُ، فَإِذَا زَالَتِ الشَّمْسُ رَمَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1746In-book reference : Book 25, Hadith 224USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 802   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1747,
    "id": 1747,
    "url": "https://sunnah.com/bukhari:1747",
    "bookNumber": 25,
    "hadithNumber": 225,
    "narrator": "Narrated `Abdur-Rahman bin Yazid:",
    "english": "`Abdullah, did the Rami from the middle of the valley. So, I said, \"O, Abu `Abdur-Rahman! Some \npeople do the Rami (of the Jamra) from above it (i.e. from the top of the valley).\" He said, \"By Him \nexcept whom none has the right to be worshipped, this is the place from where the one on whom \nSurat-al-Baqara was revealed (i.e. Allah's Messenger (ﷺ)) did the Rami.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ رَمَى عَبْدُ اللَّهِ مِنْ بَطْنِ الْوَادِي، فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ، إِنَّ نَاسًا يَرْمُونَهَا مِنْ فَوْقِهَا، فَقَالَ وَالَّذِي لاَ إِلَهَ غَيْرُهُ هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الأَعْمَشُ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1747In-book reference : Book 25, Hadith 225USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 803   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1748,
    "id": 1748,
    "url": "https://sunnah.com/bukhari:1748",
    "bookNumber": 25,
    "hadithNumber": 226,
    "narrator": "Narrated `Abdur-Rahman bin Yazid:",
    "english": "When `Abdullah, reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka`ba on the left side and \nMina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al- \nBaqara was revealed (i.e. the Prophet) had done the Rami similarly.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّهُ انْتَهَى إِلَى الْجَمْرَةِ الْكُبْرَى جَعَلَ الْبَيْتَ عَنْ يَسَارِهِ، وَمِنًى عَنْ يَمِينِهِ، وَرَمَى بِسَبْعٍ، وَقَالَ هَكَذَا رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1748In-book reference : Book 25, Hadith 226USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 804   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1749,
    "id": 1749,
    "url": "https://sunnah.com/bukhari:1749",
    "bookNumber": 25,
    "hadithNumber": 227,
    "narrator": "Narrated `Abdur-Rahman bin Yazid:",
    "english": "I performed Hajj with Ibn Mas`ud , and saw him doing Rami of the big Jamra (Jamrat-ul-Aqaba) with \nseven small pebbles, keeping the Ka`ba on his left side and Mina on his right. He then said, \"This is \nthe place where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Messenger (ﷺ) ) stood.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، أَنَّهُ حَجَّ مَعَ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ فَرَآهُ يَرْمِي الْجَمْرَةَ الْكُبْرَى بِسَبْعِ حَصَيَاتٍ، فَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ، وَمِنًى عَنْ يَمِينِهِ، ثُمَّ قَالَ هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1749In-book reference : Book 25, Hadith 227USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 805   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1750,
    "id": 1750,
    "url": "https://sunnah.com/bukhari:1750",
    "bookNumber": 25,
    "hadithNumber": 228,
    "narrator": "Narrated Al-A`mash:",
    "english": "I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the \nSura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is \nmentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with \nIbn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, \nand when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven \nsmall pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except \nWhom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra \nwas revealed (i.e. Allah's Messenger (ﷺ)).' \"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ عَبْدِ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ الْحَجَّاجَ، يَقُولُ عَلَى الْمِنْبَرِ السُّورَةُ الَّتِي يُذْكَرُ فِيهَا الْبَقَرَةُ، وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا آلُ عِمْرَانَ، وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا النِّسَاءُ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لإِبْرَاهِيمَ، فَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ أَنَّهُ كَانَ مَعَ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ، فَاسْتَبْطَنَ الْوَادِيَ، حَتَّى إِذَا حَاذَى بِالشَّجَرَةِ اعْتَرَضَهَا، فَرَمَى بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ، ثُمَّ قَالَ مِنْ هَا هُنَا وَالَّذِي لاَ إِلَهَ غَيْرُهُ قَامَ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1750In-book reference : Book 25, Hadith 228USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 806   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1751,
    "id": 1751,
    "url": "https://sunnah.com/bukhari:1751",
    "bookNumber": 25,
    "hadithNumber": 229,
    "narrator": "Narrated Salim:",
    "english": "Ibn `Umar used to do Rami of the Jamrat-ud-Dunya (the Jamra near to the Khaif mosque) with seven \nsmall stones and used to recite Takbir on throwing every pebble. He then would go ahead till he \nreached the level ground where he would stand facing the Qibla for a long time to invoke (Allah) \nwhile raising his hands (while invoking). Then he would do Rami of the Jamrat-ul-Wusta (middle \nJamra) and then he would go to the left towards the middle ground, where he would stand facing the \nQibla. He would remain standing there for a long period to invoke (Allah) while raising his hands, and \nwould stand there for a long period. Then he would do Rami of the Jamrat-ul-Aqaba from the middle \nof the valley, but he would not stay by it, and then he would leave and say, \"I saw the Prophet (ﷺ) doing \nlike this.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يَرْمِي الْجَمْرَةَ الدُّنْيَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ عَلَى إِثْرِ كُلِّ حَصَاةٍ، ثُمَّ يَتَقَدَّمُ حَتَّى يُسْهِلَ فَيَقُومَ مُسْتَقْبِلَ الْقِبْلَةِ فَيَقُومُ طَوِيلاً، وَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْوُسْطَى، ثُمَّ يَأْخُذُ ذَاتَ الشِّمَالِ فَيَسْتَهِلُ وَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ فَيَقُومُ طَوِيلاً وَيَدْعُو وَيَرْفَعُ يَدَيْهِ، وَيَقُومُ طَوِيلاً، ثُمَّ يَرْمِي جَمْرَةَ ذَاتِ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي، وَلاَ يَقِفُ عِنْدَهَا ثُمَّ يَنْصَرِفُ فَيَقُولُ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1751In-book reference : Book 25, Hadith 229USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 807   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1752,
    "id": 1752,
    "url": "https://sunnah.com/bukhari:1752",
    "bookNumber": 25,
    "hadithNumber": 230,
    "narrator": "Narrated Salim bin `Abdullah:",
    "english": "`Abdullah bin `Umar used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to \nrecite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, \nwhere he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then \nhe would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, \nwhere he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then \nhe would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it. \nIbn `Umar used to say, \"I saw Allah's Messenger (ﷺ) doing like that.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَرْمِي الْجَمْرَةَ الدُّنْيَا بِسَبْعِ حَصَيَاتٍ، ثُمَّ يُكَبِّرُ عَلَى إِثْرِ كُلِّ حَصَاةٍ، ثُمَّ يَتَقَدَّمُ فَيُسْهِلُ، فَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ قِيَامًا طَوِيلاً، فَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْجَمْرَةَ الْوُسْطَى كَذَلِكَ، فَيَأْخُذُ ذَاتَ الشِّمَالِ فَيُسْهِلُ، وَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ قِيَامًا طَوِيلاً، فَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْجَمْرَةَ ذَاتَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي، وَلاَ يَقِفُ عِنْدَهَا، وَيَقُولُ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1752In-book reference : Book 25, Hadith 230USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 808   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1753,
    "id": 1753,
    "url": "https://sunnah.com/bukhari:1753",
    "bookNumber": 25,
    "hadithNumber": 231,
    "narrator": "Narrated Az-Zuhri:",
    "english": "Whenever Allah's Messenger (ﷺ) stoned the Jamra near Mina Mosque, he would do Ramy of it with seven small pebbles and say Takbir on throwing each pebble. Then he would go ahead and stand facing the Qiblah with his hands raised, and invoke (Allah) and he sued to stand for a long period. Then he would come to the second Jamra (Al-Wusta) and stone it will seven small stones, reciting Takbir on throwing each stone. Then he would stand facing the Qiblah with raised hands to invoke (Allah). Then he would come to the Jamra near the 'Aqaba (Jamrat-ul-'Aqaba) and do Ramy of it with seven small pebbles, reciting Takbir on throwing each stone. he then would leave and not stay by it. \n\nNarrated Az-Zuhri: I heard Salim bin 'Abdullah saying the same that his father said on the authority of the Prophet (ﷺ). And Ibn 'Umar used to do the same.",
    "arabic": "وَقَالَ مُحَمَّدٌ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا رَمَى الْجَمْرَةَ الَّتِي تَلِي مَسْجِدَ مِنًى يَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ تَقَدَّمَ أَمَامَهَا فَوَقَفَ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ يَدْعُو، وَكَانَ يُطِيلُ الْوُقُوفَ، ثُمَّ يَأْتِي الْجَمْرَةَ الثَّانِيَةَ، فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ يَنْحَدِرُ ذَاتَ الْيَسَارِ مِمَّا يَلِي الْوَادِيَ، فَيَقِفُ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ يَدْعُو، ثُمَّ يَأْتِي الْجَمْرَةَ الَّتِي عِنْدَ الْعَقَبَةِ فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، ثُمَّ يَنْصَرِفُ وَلاَ يَقِفُ عِنْدَهَا‏.‏ قَالَ الزُّهْرِيُّ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ مِثْلَ هَذَا عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1753In-book reference : Book 25, Hadith 231USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 809   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1754,
    "id": 1754,
    "url": "https://sunnah.com/bukhari:1754",
    "bookNumber": 25,
    "hadithNumber": 232,
    "narrator": "Narrated `Abdur-Rahman bin Al-Qasim:",
    "english": "I heard my father who was the best man of his age, saying, \"I heard `Aisha saying, 'I perfumed Allah's \nApostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al- \nIfada.' She spread her hands (while saying so.)\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، أَنَّهُ سَمِعَ أَبَاهُ ـ وَكَانَ أَفْضَلَ أَهْلِ زَمَانِهِ ـ يَقُولُ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ هَاتَيْنِ حِينَ أَحْرَمَ، وَلِحِلِّهِ حِينَ أَحَلَّ، قَبْلَ أَنْ يَطُوفَ‏.‏ وَبَسَطَتْ يَدَيْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1754In-book reference : Book 25, Hadith 232USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 809   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1755,
    "id": 1755,
    "url": "https://sunnah.com/bukhari:1755",
    "bookNumber": 25,
    "hadithNumber": 233,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The people were ordered to perform the Tawaf of the Ka`ba (Tawaf-al-Wada`) as the lastly thing, \nbefore leaving (Mecca), except the menstruating women who were excused.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أُمِرَ النَّاسُ أَنْ يَكُونَ آخِرُ عَهْدِهِمْ بِالْبَيْتِ، إِلاَّ أَنَّهُ خُفِّفَ عَنِ الْحَائِضِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1755In-book reference : Book 25, Hadith 233USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 810   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1756,
    "id": 1756,
    "url": "https://sunnah.com/bukhari:1756",
    "bookNumber": 25,
    "hadithNumber": 234,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) offered the Zuhr, `Asr, Maghrib and the `Isha' prayers and slept for a while at a place \ncalled Al-Muhassab and then rode to the Ka`ba and performed Tawaf round it .",
    "arabic": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ، ثُمَّ رَقَدَ رَقْدَةً بِالْمُحَصَّبِ، ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ‏.‏   تَابَعَهُ اللَّيْثُ حَدَّثَنِي خَالِدٌ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1756In-book reference : Book 25, Hadith 234USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 811   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1757,
    "id": 1757,
    "url": "https://sunnah.com/bukhari:1757",
    "bookNumber": 25,
    "hadithNumber": 235,
    "narrator": "Narrated `Aisha:",
    "english": "Safiya bint Huyay, the wife of the Prophet (ﷺ) got her menses, and Allah's Messenger (ﷺ) was informed of that. \nHe said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He \nsaid, \"Therefore she will not (delay us).\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَاضَتْ، فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏‏.‏ قَالُوا إِنَّهَا قَدْ أَفَاضَتْ‏.‏ قَالَ ‏\"‏ فَلاَ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1757In-book reference : Book 25, Hadith 235USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 812   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1758,
    "id": 1758,
    "url": "https://sunnah.com/bukhari:1758",
    "bookNumber": 25,
    "hadithNumber": 236,
    "narrator": "Narrated `Ikrima:",
    "english": "The people of Medina asked Ibn `Abbas about a woman who got her menses after performing Tawafal- \nIfada. He said, \"She could depart (from Mecca).\" They said, \"We will not act on your verdict and \nignore the verdict of Zaid.\" Ibn `Abbas said, \"When you reach Medina, inquire about it.\" So, when \nthey reached Medina they asked (about that). One of those whom they asked was Um Sulaim. She told \nthem the narration of Safiya (812).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، أَنَّ أَهْلَ الْمَدِينَةِ، سَأَلُوا ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ امْرَأَةٍ، طَافَتْ ثُمَّ حَاضَتْ، قَالَ لَهُمْ تَنْفِرُ‏.‏ قَالُوا لاَ نَأْخُذُ بِقَوْلِكَ وَنَدَعَ قَوْلَ زَيْدٍ‏.‏ قَالَ إِذَا قَدِمْتُمُ الْمَدِينَةَ فَسَلُوا‏.‏ فَقَدِمُوا الْمَدِينَةَ فَسَأَلُوا، فَكَانَ فِيمَنْ سَأَلُوا أُمُّ سُلَيْمٍ، فَذَكَرَتْ حَدِيثَ صَفِيَّةَ‏.‏ رَوَاهُ خَالِدٌ وَقَتَادَةُ عَنْ عِكْرِمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1758, 1759In-book reference : Book 25, Hadith 236USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 813   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1759,
    "id": 1759,
    "url": "https://sunnah.com/bukhari:1759",
    "bookNumber": 25,
    "hadithNumber": 236,
    "narrator": "Narrated `Ikrima:",
    "english": "The people of Medina asked Ibn `Abbas about a woman who got her menses after performing Tawafal- \nIfada. He said, \"She could depart (from Mecca).\" They said, \"We will not act on your verdict and \nignore the verdict of Zaid.\" Ibn `Abbas said, \"When you reach Medina, inquire about it.\" So, when \nthey reached Medina they asked (about that). One of those whom they asked was Um Sulaim. She told \nthem the narration of Safiya (812).",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، أَنَّ أَهْلَ الْمَدِينَةِ، سَأَلُوا ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ امْرَأَةٍ، طَافَتْ ثُمَّ حَاضَتْ، قَالَ لَهُمْ تَنْفِرُ‏.‏ قَالُوا لاَ نَأْخُذُ بِقَوْلِكَ وَنَدَعَ قَوْلَ زَيْدٍ‏.‏ قَالَ إِذَا قَدِمْتُمُ الْمَدِينَةَ فَسَلُوا‏.‏ فَقَدِمُوا الْمَدِينَةَ فَسَأَلُوا، فَكَانَ فِيمَنْ سَأَلُوا أُمُّ سُلَيْمٍ، فَذَكَرَتْ حَدِيثَ صَفِيَّةَ‏.‏ رَوَاهُ خَالِدٌ وَقَتَادَةُ عَنْ عِكْرِمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1758, 1759In-book reference : Book 25, Hadith 236USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 813   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1760,
    "id": 1760,
    "url": "https://sunnah.com/bukhari:1760",
    "bookNumber": 25,
    "hadithNumber": 237,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) \nsaid from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard \nhim saying that the Prophet (ﷺ) had allowed them (menstruating women) to depart.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا أَفَاضَتْ‏.‏   قَالَ وَسَمِعْتُ ابْنَ عُمَرَ، يَقُولُ إِنَّهَا لاَ تَنْفِرُ‏.‏ ثُمَّ سَمِعْتُهُ يَقُولُ بَعْدُ إِنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ لَهُنَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1760, 1761In-book reference : Book 25, Hadith 237USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 814   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1761,
    "id": 1761,
    "url": "https://sunnah.com/bukhari:1761",
    "bookNumber": 25,
    "hadithNumber": 237,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) \nsaid from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard \nhim saying that the Prophet (ﷺ) had allowed them (menstruating women) to depart.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا أَفَاضَتْ‏.‏   قَالَ وَسَمِعْتُ ابْنَ عُمَرَ، يَقُولُ إِنَّهَا لاَ تَنْفِرُ‏.‏ ثُمَّ سَمِعْتُهُ يَقُولُ بَعْدُ إِنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ لَهُنَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1760, 1761In-book reference : Book 25, Hadith 237USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 814   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1762,
    "id": 1762,
    "url": "https://sunnah.com/bukhari:1762",
    "bookNumber": 25,
    "hadithNumber": 238,
    "narrator": "Narrated `Aisha:",
    "english": "We set out with the Prophet (ﷺ) with the intention of performing Hajj only. The Prophet (ﷺ) reached Mecca \nand performed Tawaf of the Ka`ba and between Safa and Marwa and did not finish the Ihram, because \nhe had the Hadi with him. His companions and his wives performed Tawaf (of the Ka`ba and between \nSafa and Marwa), and those who had no Hadi with them finished their Ihram. I got the menses and \nperformed all the ceremonies of Hajj. So, when the Night of Hasba (night of departure) came, I said, \n\"O Allah's Messenger (ﷺ)! All your companions are returning with Hajj and `Umra except me.\" He asked \nme, \"Didn't you perform Tawaf of the Ka`ba (Umra) when you reached Mecca?\" I said, \"No.\" He said, \n\"Go to Tan`im with your brother `Abdur-Rahman, and assume Ihram for `Umra and I will wait for \nyou at such and such a place.\" So I went with `Abdur-Rahman to Tan`im and assumed Ihram for \n`Umra. Then Safiya bint Huyay got menses. The Prophet (ﷺ) said, \" 'Aqra Halqa! You will detain us! \nDidn't you perform Tawaf-al-Ifada on the Day of Nahr (slaughtering)?\" She said, \"Yes, I did.\" He \nsaid, \"Then there is no harm, depart.\" So I met the Prophet (ﷺ) when he was ascending the heights \ntowards Mecca and I was descending, or vice-versa.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَلاَ نُرَى إِلاَّ الْحَجَّ، فَقَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، وَلَمْ يَحِلَّ وَكَانَ مَعَهُ الْهَدْىُ، فَطَافَ مَنْ كَانَ مَعَهُ مِنْ نِسَائِهِ وَأَصْحَابِهِ، وَحَلَّ مِنْهُمْ مَنْ لَمْ يَكُنْ مَعَهُ الْهَدْىُ، فَحَاضَتْ هِيَ، فَنَسَكْنَا مَنَاسِكَنَا مِنْ حَجِّنَا، فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ لَيْلَةُ النَّفْرِ، قَالَتْ يَا رَسُولَ اللَّهِ كُلُّ أَصْحَابِكَ يَرْجِعُ بِحَجٍّ وَعُمْرَةٍ غَيْرِي‏.‏ قَالَ ‏\"‏ مَا كُنْتِ تَطُوفِي بِالْبَيْتِ لَيَالِيَ قَدِمْنَا ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَاخْرُجِي مَعَ أَخِيكِ إِلَى التَّنْعِيمِ فَأَهِلِّي بِعُمْرَةٍ، وَمَوْعِدُكِ مَكَانَ كَذَا وَكَذَا ‏\"‏‏.‏ فَخَرَجْتُ مَعَ عَبْدِ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ، وَحَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَقْرَى حَلْقَى، إِنَّكِ لَحَابِسَتُنَا، أَمَا كُنْتِ طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ بَلَى‏.‏ قَالَ ‏\"‏ فَلاَ بَأْسَ‏.‏ انْفِرِي ‏\"‏‏.‏ فَلَقِيتُهُ مُصْعِدًا عَلَى أَهْلِ مَكَّةَ، وَأَنَا مُنْهَبِطَةٌ، أَوْ أَنَا مُصْعِدَةٌ، وَهُوَ مُنْهَبِطٌ‏.‏ وَقَالَ مُسَدَّدٌ قُلْتُ لاَ‏.‏ تَابَعَهُ جَرِيرٌ عَنْ مَنْصُورٍ فِي قَوْلِهِ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1762In-book reference : Book 25, Hadith 238USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 815   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1763,
    "id": 1763,
    "url": "https://sunnah.com/bukhari:1763",
    "bookNumber": 25,
    "hadithNumber": 239,
    "narrator": "Narrated `Abdul-Aziz bin Rufai:",
    "english": "I asked Anas bin Malik, \"Tell me something you have observed about the Prophet (ﷺ) concerning where \nhe offered the Zuhr prayer on the Day of Tarwiya (8th Dhul-Hijja).\" Anas replied, \"He offered it at \nMina.\" I said, \"Where did he offer the `Asr prayer on the Day of Nafr (day of departure from Mina)?\" \nHe replied, \"At Al-Abtah,\" and added, \"You should do as your leaders do.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَخْبِرْنِي بِشَىْءٍ، عَقَلْتَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى‏.‏ قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالأَبْطَحِ‏.‏ افْعَلْ كَمَا يَفْعَلُ أُمَرَاؤُكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1763In-book reference : Book 25, Hadith 239USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 816   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1764,
    "id": 1764,
    "url": "https://sunnah.com/bukhari:1764",
    "bookNumber": 25,
    "hadithNumber": 240,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) offered the Zuhr, `Asr, Maghrib and `Isha' prayers and slept for a while at a place called \nAl-Mahassab and then he rode towards the Ka`ba and performed Tawaf (al-Wada`).",
    "arabic": "حَدَّثَنَا عَبْدُ الْمُتَعَالِ بْنُ طَالِبٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ قَتَادَةَ، حَدَّثَهُ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ، وَرَقَدَ رَقْدَةً بِالْمُحَصَّبِ، ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1764In-book reference : Book 25, Hadith 240USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 817   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1765,
    "id": 1765,
    "url": "https://sunnah.com/bukhari:1765",
    "bookNumber": 25,
    "hadithNumber": 241,
    "narrator": "Narrated `Aisha:",
    "english": "It (i.e. Al-Abtah) was a place where the Prophet (ﷺ) used to camp so that it might be easier for him to \ndepart.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّمَا كَانَ مَنْزِلٌ يَنْزِلُهُ النَّبِيُّ صلى الله عليه وسلم لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ‏.‏ يَعْنِي بِالأَبْطَحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1765In-book reference : Book 25, Hadith 241USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 818   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1766,
    "id": 1766,
    "url": "https://sunnah.com/bukhari:1766",
    "bookNumber": 25,
    "hadithNumber": 242,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Staying at Al-Mahassab is not one of the ceremonies (of Hajj), but Al-Mahassab is a place where \nAllah's Messenger (ﷺ) camped (during his Hajjat-al-Wida).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لَيْسَ التَّحْصِيبُ بِشَىْءٍ، إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1766In-book reference : Book 25, Hadith 242USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 819   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1767,
    "id": 1767,
    "url": "https://sunnah.com/bukhari:1767",
    "bookNumber": 25,
    "hadithNumber": 243,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar used to spend the night at Dhi-Tuwa in between the two Thaniyas and then he would enter \nMecca through the Thaniya which is at the higher region of Mecca, and whenever he came to Mecca \nfor Hajj or `Umra, he never made his she camel kneel down except near the gate of the Masjid (Sacred \nMosque) and then he would enter (it) and go to the Black (stone) Corner and start from there \ncircumambulating the Ka`ba seven times: hastening in the first three rounds (Ramal) and walking in \nthe last four. On finishing, he would offer two rak`at prayer and set out to perform Tawaf between \nSafa and Marwa before returning to his dwelling place. On returning (to Medina) from Hajj or `Umra, \nhe used to make his camel kneel down at Al-Batha which is at Dhul-Hulaifa, the place where the \nProphet used to make his camel kneel down.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَبِيتُ بِذِي طُوًى بَيْنَ الثَّنِيَّتَيْنِ، ثُمَّ يَدْخُلُ مِنَ الثَّنِيَّةِ الَّتِي بِأَعْلَى مَكَّةَ، وَكَانَ إِذَا قَدِمَ مَكَّةَ حَاجًّا أَوْ مُعْتَمِرًا لَمْ يُنِخْ نَاقَتَهُ إِلاَّ عِنْدَ باب الْمَسْجِدِ، ثُمَّ يَدْخُلُ فَيَأْتِي الرُّكْنَ الأَسْوَدَ فَيَبْدَأُ بِهِ، ثُمَّ يَطُوفُ سَبْعًا ثَلاَثًا سَعْيًا، وَأَرْبَعًا مَشْيًا، ثُمَّ يَنْصَرِفُ فَيُصَلِّي سَجْدَتَيْنِ، ثُمَّ يَنْطَلِقُ قَبْلَ أَنْ يَرْجِعَ إِلَى مَنْزِلِهِ، فَيَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَكَانَ إِذَا صَدَرَ عَنِ الْحَجِّ أَوِ الْعُمْرَةِ أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم يُنِيخُ بِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1767In-book reference : Book 25, Hadith 243USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 820   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1768,
    "id": 1768,
    "url": "https://sunnah.com/bukhari:1768",
    "bookNumber": 25,
    "hadithNumber": 244,
    "narrator": "Narrated Khalid bin Al-Harith:",
    "english": "'Ubaidullah was asked about Al Mahassab. 'Ubaidullah narrated: Nafi` said, 'Allah's Messenger (ﷺ)s, `Umar \nand Ibn `Umar camped there.\" Nafi` added, \"Ibn `Umar used to offer the Zuhr and `Asr prayers at it \n(i.e. Al-Mahassab).\" I think he mentioned the Maghrib prayer also. I said, \"I don't doubt about `Isha' \n(i.e. he used to offer it there also), and he used to sleep there for a while. He used to say, 'The Prophet (ﷺ) \nused to do the same.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ سُئِلَ عُبَيْدُ اللَّهِ عَنِ الْمُحَصَّبِ، فَحَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ،، قَالَ نَزَلَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَعُمَرُ وَابْنُ عُمَرَ‏.‏ وَعَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يُصَلِّي بِهَا ـ يَعْنِي الْمُحَصَّبَ ـ الظُّهْرَ وَالْعَصْرَ ـ أَحْسِبُهُ قَالَ وَالْمَغْرِبَ‏.‏ قَالَ خَالِدٌ لاَ أَشُكُّ فِي الْعِشَاءِ، وَيَهْجَعُ هَجْعَةً، وَيَذْكُرُ ذَلِكَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1768In-book reference : Book 25, Hadith 244USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 821   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1769,
    "id": 1769,
    "url": "https://sunnah.com/bukhari:1769",
    "bookNumber": 25,
    "hadithNumber": 245,
    "narrator": "Narrated Nafi':",
    "english": "Whenver Ibn 'Umar (ra) approached (Makkah) he used to pass the night at Dhi-Tuwa till dawn, and then he would enter Makkah. On his return, he used to pass by Dhi-Tuwa and pass the night there till dawn, and he used to say that the Prophet (ﷺ) used to do the same.",
    "arabic": "وَقَالَ مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ إِذَا أَقْبَلَ بَاتَ بِذِي طُوًى، حَتَّى إِذَا أَصْبَحَ دَخَلَ، وَإِذَا نَفَرَ مَرَّ بِذِي طُوًى وَبَاتَ بِهَا حَتَّى يُصْبِحَ، وَكَانَ يَذْكُرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1769In-book reference : Book 25, Hadith 245USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 821   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1770,
    "id": 1770,
    "url": "https://sunnah.com/bukhari:1770",
    "bookNumber": 25,
    "hadithNumber": 246,
    "narrator": "Narrated Ibn ' `Abbas:",
    "english": "Dhul-Majaz and `Ukaz were the markets of the people during the Pre-Islamic period of ignorance. \nWhen the people embraced Islam, they disliked to do bargaining there till the following Holy Verses \nwere revealed:-- There is no harm for you If you seek of the bounty Of your Lord (during Hajj by \ntrading, etc.) (2.198)",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ عَمْرُو بْنُ دِينَارٍ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ كَانَ ذُو الْمَجَازِ وَعُكَاظٌ مَتْجَرَ النَّاسِ فِي الْجَاهِلِيَّةِ، فَلَمَّا جَاءَ الإِسْلاَمُ كَأَنَّهُمْ كَرِهُوا ذَلِكَ حَتَّى نَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ‏}‏ فِي مَوَاسِمِ الْحَجِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1770In-book reference : Book 25, Hadith 246USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 822   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1771,
    "id": 1771,
    "url": "https://sunnah.com/bukhari:1771",
    "bookNumber": 25,
    "hadithNumber": 247,
    "narrator": "Narrated `Aisha:",
    "english": "Safiya got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet (ﷺ) said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\" (Different narrators mentioned that) `Aisha said, \"We set out with Allah''s Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet (ﷺ) said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah''s Apostle! I have not (done the Umra).\" He replied, \"Perform `Umra from Tan`im.\" My brother went with me and we came across the Prophet (ﷺ) in the last part of the night. He said, \"Wait at such and such a place.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ حَاضَتْ صَفِيَّةُ لَيْلَةَ النَّفْرِ، فَقَالَتْ مَا أُرَانِي إِلاَّ حَابِسَتَكُمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَقْرَى حَلْقَى أَطَافَتْ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏.‏   قَالَ أَبُو عَبْدِ اللَّهِ وَزَادَنِي مُحَمَّدٌ حَدَّثَنَا مُحَاضِرٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَذْكُرُ إِلاَّ الْحَجَّ، فَلَمَّا قَدِمْنَا أَمَرَنَا أَنْ نَحِلَّ، فَلَمَّا كَانَتْ لَيْلَةُ النَّفْرِ حَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ حَلْقَى عَقْرَى، مَا أُرَاهَا إِلاَّ حَابِسَتَكُمْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ كُنْتِ طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ إِنِّي لَمْ أَكُنْ حَلَلْتُ‏.‏ قَالَ ‏\"‏ فَاعْتَمِرِي مِنَ التَّنْعِيمِ ‏\"‏‏.‏ فَخَرَجَ مَعَهَا أَخُوهَا، فَلَقِينَاهُ مُدَّلِجًا‏.‏ فَقَالَ ‏\"‏ مَوْعِدُكِ مَكَانَ كَذَا وَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1771, 1772In-book reference : Book 25, Hadith 247USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 823   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1772,
    "id": 1772,
    "url": "https://sunnah.com/bukhari:1772",
    "bookNumber": 25,
    "hadithNumber": 247,
    "narrator": "Narrated `Aisha:",
    "english": "Safiya got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet (ﷺ) said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\" (Different narrators mentioned that) `Aisha said, \"We set out with Allah''s Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet (ﷺ) said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah''s Apostle! I have not (done the Umra).\" He replied, \"Perform `Umra from Tan`im.\" My brother went with me and we came across the Prophet (ﷺ) in the last part of the night. He said, \"Wait at such and such a place.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ حَاضَتْ صَفِيَّةُ لَيْلَةَ النَّفْرِ، فَقَالَتْ مَا أُرَانِي إِلاَّ حَابِسَتَكُمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَقْرَى حَلْقَى أَطَافَتْ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏.‏   قَالَ أَبُو عَبْدِ اللَّهِ وَزَادَنِي مُحَمَّدٌ حَدَّثَنَا مُحَاضِرٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَذْكُرُ إِلاَّ الْحَجَّ، فَلَمَّا قَدِمْنَا أَمَرَنَا أَنْ نَحِلَّ، فَلَمَّا كَانَتْ لَيْلَةُ النَّفْرِ حَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ حَلْقَى عَقْرَى، مَا أُرَاهَا إِلاَّ حَابِسَتَكُمْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ كُنْتِ طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ إِنِّي لَمْ أَكُنْ حَلَلْتُ‏.‏ قَالَ ‏\"‏ فَاعْتَمِرِي مِنَ التَّنْعِيمِ ‏\"‏‏.‏ فَخَرَجَ مَعَهَا أَخُوهَا، فَلَقِينَاهُ مُدَّلِجًا‏.‏ فَقَالَ ‏\"‏ مَوْعِدُكِ مَكَانَ كَذَا وَكَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1771, 1772In-book reference : Book 25, Hadith 247USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 823   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1773,
    "id": 1773,
    "url": "https://sunnah.com/bukhari:1773",
    "bookNumber": 26,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it \nand the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except \nParadise.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا، وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1773In-book reference : Book 26, Hadith 1USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 1   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1774,
    "id": 1774,
    "url": "https://sunnah.com/bukhari:1774",
    "bookNumber": 26,
    "hadithNumber": 2,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ikrima bin Khalid asked Ibn `Umar about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar also said, 'The Prophet (ﷺ) had performed `Umra before performing Hajj.'\"\n\n\nNarrated `Ikrima bin Khalid:\n\n\"I asked Ibn `Umar the same (as above).\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ، سَأَلَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ الْعُمْرَةِ، قَبْلَ الْحَجِّ فَقَالَ لاَ بَأْسَ‏.‏ قَالَ عِكْرِمَةُ قَالَ ابْنُ عُمَرَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي عِكْرِمَةُ بْنُ خَالِدٍ سَأَلْتُ ابْنَ عُمَرَ مِثْلَهُ‏.‏ \nحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ عِكْرِمَةُ بْنُ خَالِدٍ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنه ـ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1774In-book reference : Book 26, Hadith 2USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 2   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1775,
    "id": 1775,
    "url": "https://sunnah.com/bukhari:1775",
    "bookNumber": 26,
    "hadithNumber": 3,
    "narrator": "Narrated Mujahid:",
    "english": "Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ،، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ، وَإِذَا نَاسٌ يُصَلُّونَ فِي الْمَسْجِدِ صَلاَةَ الضُّحَى‏.‏ قَالَ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ‏.‏ فَقَالَ بِدْعَةٌ‏.‏ ثُمَّ قَالَ لَهُ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعً إِحْدَاهُنَّ فِي رَجَبٍ، فَكَرِهْنَا أَنْ نَرُدَّ عَلَيْهِ‏.‏ قَالَ وَسَمِعْنَا اسْتِنَانَ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فِي الْحُجْرَةِ، فَقَالَ عُرْوَةُ يَا أُمَّاهُ، يَا أُمَّ الْمُؤْمِنِينَ‏.‏ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ‏.‏ قَالَتْ مَا يَقُولُ قَالَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرَاتٍ إِحْدَاهُنَّ فِي رَجَبٍ‏.‏ قَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، مَا اعْتَمَرَ عُمْرَةً إِلاَّ وَهُوَ شَاهِدُهُ، وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1775, 1776In-book reference : Book 26, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 4   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1776,
    "id": 1776,
    "url": "https://sunnah.com/bukhari:1776",
    "bookNumber": 26,
    "hadithNumber": 3,
    "narrator": "Narrated Mujahid:",
    "english": "Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked \nto contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ،، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ، وَإِذَا نَاسٌ يُصَلُّونَ فِي الْمَسْجِدِ صَلاَةَ الضُّحَى‏.‏ قَالَ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ‏.‏ فَقَالَ بِدْعَةٌ‏.‏ ثُمَّ قَالَ لَهُ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعً إِحْدَاهُنَّ فِي رَجَبٍ، فَكَرِهْنَا أَنْ نَرُدَّ عَلَيْهِ‏.‏ قَالَ وَسَمِعْنَا اسْتِنَانَ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فِي الْحُجْرَةِ، فَقَالَ عُرْوَةُ يَا أُمَّاهُ، يَا أُمَّ الْمُؤْمِنِينَ‏.‏ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ‏.‏ قَالَتْ مَا يَقُولُ قَالَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرَاتٍ إِحْدَاهُنَّ فِي رَجَبٍ‏.‏ قَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، مَا اعْتَمَرَ عُمْرَةً إِلاَّ وَهُوَ شَاهِدُهُ، وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1775, 1776In-book reference : Book 26, Hadith 3USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 4   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1777,
    "id": 1777,
    "url": "https://sunnah.com/bukhari:1777",
    "bookNumber": 26,
    "hadithNumber": 4,
    "narrator": "Narrated 'Urwa bin Az-Zubair:",
    "english": "I asked `Aisha (whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) \nnever performed any `Umra in Rajab.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَجَبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1777In-book reference : Book 26, Hadith 4USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 5   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1778,
    "id": 1778,
    "url": "https://sunnah.com/bukhari:1778",
    "bookNumber": 26,
    "hadithNumber": 5,
    "narrator": "Narrated Qatada:",
    "english": "I asked Anas how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of \nHudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- \nQa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the \nwar booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he \nperform Hajj?\" He (Anas) replied, \"Once. \"",
    "arabic": "حَدَّثَنَا حَسَّانُ بْنُ حَسَّانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَالَ أَرْبَعٌ عُمْرَةُ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَدَّهُ الْمُشْرِكُونَ، وَعُمْرَةٌ مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَالَحَهُمْ، وَعُمْرَةُ الْجِعْرَانَةِ إِذْ قَسَمَ غَنِيمَةَ أُرَاهُ حُنَيْنٍ‏.‏ قُلْتُ كَمْ حَجَّ قَالَ وَاحِدَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1778In-book reference : Book 26, Hadith 5USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 6   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1779,
    "id": 1779,
    "url": "https://sunnah.com/bukhari:1779",
    "bookNumber": 26,
    "hadithNumber": 6,
    "narrator": "Narrated Qatada:",
    "english": "I asked Anas (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the \npagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, \nand another `Umra in combination with his Hajj.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ فَقَالَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم حَيْثُ رَدُّوهُ، وَمِنَ الْقَابِلِ عُمْرَةَ الْحُدَيْبِيَةِ، وَعُمْرَةً فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1779In-book reference : Book 26, Hadith 6USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 7   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1780,
    "id": 1780,
    "url": "https://sunnah.com/bukhari:1780",
    "bookNumber": 26,
    "hadithNumber": 7,
    "narrator": "Narrated Hammam:",
    "english": "The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed \nwith his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- \nJr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.",
    "arabic": "حَدَّثَنَا هُدْبَةُ، حَدَّثَنَا هَمَّامٌ، وَقَالَ، اعْتَمَرَ أَرْبَعَ عُمَرٍ فِي ذِي الْقَعْدَةِ إِلاَّ الَّتِي اعْتَمَرَ مَعَ حَجَّتِهِ عُمْرَتَهُ مِنَ الْحُدَيْبِيَةِ، وَمِنَ الْعَامِ الْمُقْبِلِ، وَمِنَ الْجِعْرَانَةِ، حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ، وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1780In-book reference : Book 26, Hadith 7USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 8   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1781,
    "id": 1781,
    "url": "https://sunnah.com/bukhari:1781",
    "bookNumber": 26,
    "hadithNumber": 8,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Messenger (ﷺ)). They said, \"Allah's Messenger (ﷺ) \nhad performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \n\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ مَسْرُوقًا وَعَطَاءً وَمُجَاهِدًا‏.‏ فَقَالُوا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، قَبْلَ أَنْ يَحُجَّ مَرَّتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1781In-book reference : Book 26, Hadith 8USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 9   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1782,
    "id": 1782,
    "url": "https://sunnah.com/bukhari:1782",
    "bookNumber": 26,
    "hadithNumber": 9,
    "narrator": "Narrated Ata:",
    "english": "I heard Ibn `Abbas saying, \"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas named her but `Ata' \nforgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel \nand the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us \nto use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan \nis equal to Hajj (in reward),' or said something similar.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُخْبِرُنَا يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِمْرَأَةٍ مِنَ الأَنْصَارِ سَمَّاهَا ابْنُ عَبَّاسٍ، فَنَسِيتُ اسْمَهَا ‏\"‏ مَا مَنَعَكِ أَنْ تَحُجِّي مَعَنَا ‏\"‏‏.‏ قَالَتْ كَانَ لَنَا نَاضِحٌ فَرَكِبَهُ أَبُو فُلاَنٍ وَابْنُهُ ـ لِزَوْجِهَا وَابْنِهَا ـ وَتَرَكَ نَاضِحًا نَنْضَحُ عَلَيْهِ قَالَ ‏\"‏ فَإِذَا كَانَ رَمَضَانُ اعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِي رَمَضَانَ حَجَّةٌ ‏\"‏‏.‏ أَوْ نَحْوًا مِمَّا قَالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1782In-book reference : Book 26, Hadith 9USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 10   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1783,
    "id": 1783,
    "url": "https://sunnah.com/bukhari:1783",
    "bookNumber": 26,
    "hadithNumber": 10,
    "narrator": "Narrated Aisha:",
    "english": "We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the \nmonth of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and \nwhoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for \nsacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added,): So some of us \nassumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for \n`Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) \n(about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for \nHajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed \nIhram for `Umra (and performed it) in lieu of my missed `Umra.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ فَقَالَ لَنَا ‏\"‏ مَنْ أَحَبَّ مِنْكُمْ أَنْ يُهِلَّ بِالْحَجِّ فَلْيُهِلَّ وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ بِعُمْرَةٍ، فَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ قَالَتْ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَأَظَلَّنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْفُضِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ مَكَانَ عُمْرَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1783In-book reference : Book 26, Hadith 10USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 11   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1784,
    "id": 1784,
    "url": "https://sunnah.com/bukhari:1784",
    "bookNumber": 26,
    "hadithNumber": 11,
    "narrator": "Narrated `Amr bin Aus:",
    "english": "`Abdur-Rahman bin Abu Bakr told me that the Prophet (ﷺ) had ordered him to let `Aisha ride behind him \nand to make her perform `Umra from at-Tan`im.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ عَمْرَو بْنَ أَوْسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ، وَيُعْمِرَهَا مِنَ التَّنْعِيمِ‏.‏ قَالَ سُفْيَانُ مَرَّةً سَمِعْتُ عَمْرًا، كَمْ سَمِعْتُهُ مِنْ عَمْرٍو‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1784In-book reference : Book 26, Hadith 11USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 12   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1785,
    "id": 1785,
    "url": "https://sunnah.com/bukhari:1785",
    "bookNumber": 26,
    "hadithNumber": 12,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha had \nthe Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have \nassumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his \ncompanions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the \nKa`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the \nexception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private \norgans of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The \nProphet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I \ndid not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and \nperformed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her \nmenses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) \nare returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur \nRahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the \nmonth of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) \nwhile the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The \nProphet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before \nHajj.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ حَبِيبٍ الْمُعَلِّمِ، عَنْ عَطَاءٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ وَأَصْحَابُهُ بِالْحَجِّ وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ هَدْىٌ، غَيْرَ النَّبِيِّ صلى الله عليه وسلم وَطَلْحَةَ، وَكَانَ عَلِيٌّ قَدِمَ مِنَ الْيَمَنِ، وَمَعَهُ الْهَدْىُ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ لأَصْحَابِهِ أَنْ يَجْعَلُوهَا عُمْرَةً، يَطُوفُوا بِالْبَيْتِ، ثُمَّ يُقَصِّرُوا وَيَحِلُّوا، إِلاَّ مَنْ مَعَهُ الْهَدْىُ، فَقَالُوا نَنْطَلِقُ إِلَى مِنًى وَذَكَرُ أَحَدِنَا يَقْطُرُ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَأَنَّ عَائِشَةَ حَاضَتْ فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، غَيْرَ أَنَّهَا لَمْ تَطُفْ بِالْبَيْتِ قَالَ فَلَمَّا طَهُرَتْ وَطَافَتْ، قَالَتْ يَا رَسُولَ اللَّهِ أَتَنْطَلِقُونَ بِعُمْرَةٍ وَحَجَّةٍ، وَأَنْطَلِقُ بِالْحَجِّ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَخْرُجَ مَعَهَا إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ فِي ذِي الْحَجَّةِ، وَأَنَّ سُرَاقَةَ بْنَ مَالِكِ بْنِ جُعْشُمٍ لَقِيَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْعَقَبَةِ، وَهُوَ يَرْمِيهَا، فَقَالَ أَلَكُمْ هَذِهِ خَاصَّةً، يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ لِلأَبَدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1785In-book reference : Book 26, Hadith 12USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 13   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1786,
    "id": 1786,
    "url": "https://sunnah.com/bukhari:1786",
    "bookNumber": 26,
    "hadithNumber": 13,
    "narrator": "Narrated `Aisha:",
    "english": "We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he \nsaid, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for \nHajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some \nof the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed \nIhram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of \n`Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your \nhair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of \ndeparture from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. \nThe sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for \n`Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa \n(charity), or fasting was obligatory for her.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ، وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِحَجَّةِ فَلْيُهِلَّ، وَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ فَمِنْهُمْ مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنْهُمْ مِنْ أَهَلَّ بِحَجَّةٍ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَحِضْتُ قَبْلَ أَنْ أَدْخُلَ مَكَّةَ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَفَعَلْتُ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَرْدَفَهَا، فَأَهَلَّتْ بِعُمْرَةٍ مَكَانَ عُمْرَتِهَا، فَقَضَى اللَّهُ حَجَّهَا وَعُمْرَتَهَا، وَلَمْ يَكُنْ فِي شَىْءٍ مِنْ ذَلِكَ هَدْىٌ، وَلاَ صَدَقَةٌ، وَلاَ صَوْمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1786In-book reference : Book 26, Hadith 13USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 14   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1787,
    "id": 1787,
    "url": "https://sunnah.com/bukhari:1787",
    "bookNumber": 26,
    "hadithNumber": 14,
    "narrator": "Narrated Al-Aswad:",
    "english": "That `Aisha said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. \nHajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your \nmenses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch \na place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you \nwill undergo while performing it).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَعَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالاَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ فَقِيلَ لَهَا ‏\n\"‏ انْتَظِرِي، فَإِذَا طَهُرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ، فَأَهِلِّي ثُمَّ ائْتِينَا بِمَكَانِ كَذَا، وَلَكِنَّهَا عَلَى قَدْرِ نَفَقَتِكِ، أَوْ نَصَبِكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1787In-book reference : Book 26, Hadith 14USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 15   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1788,
    "id": 1788,
    "url": "https://sunnah.com/bukhari:1788",
    "bookNumber": 26,
    "hadithNumber": 15,
    "narrator": "Narrated `Aisha:",
    "english": "We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We \ndismounted at Sarif and the Prophet (ﷺ) said to his companions, \"Whoever has not got the Hadi with him \nand likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" \nThe Prophet (ﷺ) and some of his wealthy companions had the Hadi with them, so they did not finish \nIhram after performing the `Umra. The Prophet (ﷺ) came to me while I was weeping. He asked me the \nreason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the \n`Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is \nno harm in it as you are one of the daughters of Adam and the same is written for you as for others. \nSo, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, \nI carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- \nRahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and \nafter both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at \nmidnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced \nthe departure and the people set out for the journey and some of them had performed the Tawaf of the \nKa`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مُهِلِّينَ بِالْحَجِّ فِي أَشْهُرِ الْحَجِّ، وَحُرُمِ الْحَجِّ، فَنَزَلْنَا سَرِفَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ، فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَفْعَلْ وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلاَ ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَرِجَالٍ مِنْ أَصْحَابِهِ ذَوِي قُوَّةٍ الْهَدْىُ، فَلَمْ تَكُنْ لَهُمْ عُمْرَةً، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ ‏\"‏‏.‏ قُلْتُ سَمِعْتُكَ تَقُولُ لأَصْحَابِكَ مَا قُلْتَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرَّكِ أَنْتِ مِنْ بَنَاتِ آدَمَ، كُتِبَ عَلَيْكِ مَا كُتِبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ عَسَى اللَّهُ أَنْ يَرْزُقَكِهَا ‏\"‏‏.‏ قَالَتْ فَكُنْتُ حَتَّى نَفَرْنَا مِنْ مِنًى، فَنَزَلْنَا الْمُحَصَّبَ فَدَعَا عَبْدَ الرَّحْمَنِ، فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ الْحَرَمَ، فَلْتُهِلَّ بِعُمْرَةٍ، ثُمَّ افْرُغَا مِنْ طَوَافِكُمَا، أَنْتَظِرْكُمَا هَا هُنَا ‏\"‏‏.‏ فَأَتَيْنَا فِي جَوْفِ اللَّيْلِ‏.‏ فَقَالَ ‏\"‏ فَرَغْتُمَا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَادَى بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ، وَمَنْ طَافَ بِالْبَيْتِ، قَبْلَ صَلاَةِ الصُّبْحِ، ثُمَّ خَرَجَ مُوَجِّهًا إِلَى الْمَدِينَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1788In-book reference : Book 26, Hadith 15USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 16   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1789,
    "id": 1789,
    "url": "https://sunnah.com/bukhari:1789",
    "bookNumber": 26,
    "hadithNumber": 16,
    "narrator": "Narrated Safwan bin Ya`la bin Umaiya from his father who said:",
    "english": "\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of \nKhaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform \nin my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I \nwished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to \nlook at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner \nof the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The \nsnoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the \nquestioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your \nbody and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. \nthe Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ يَعْنِي، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْجِعْرَانَةِ وَعَلَيْهِ جُبَّةٌ وَعَلَيْهِ أَثَرُ الْخَلُوقِ أَوْ قَالَ صُفْرَةٍ فَقَالَ كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي فَأَنْزَلَ اللَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَسُتِرَ بِثَوْبٍ وَوَدِدْتُ أَنِّي قَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْىُ‏.‏ فَقَالَ عُمَرُ تَعَالَ أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَنْزَلَ اللَّهُ الْوَحْىَ قُلْتُ نَعَمْ‏.‏ فَرَفَعَ طَرَفَ الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ وَأَحْسِبُهُ قَالَ كَغَطِيطِ الْبَكْرِ‏.‏ فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏\n\"‏ أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ اخْلَعْ عَنْكَ الْجُبَّةَ وَاغْسِلْ أَثَرَ الْخَلُوقِ عَنْكَ، وَأَنْقِ الصُّفْرَةَ، وَاصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1789In-book reference : Book 26, Hadith 16USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 17   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1790,
    "id": 1790,
    "url": "https://sunnah.com/bukhari:1790",
    "bookNumber": 26,
    "hadithNumber": 17,
    "narrator": "Narrated Hisham Ibn `Urwa from his father who said:",
    "english": "While I was a youngster, I asked `Aisha the wife of the Prophet. \"What about the meaning of the \nStatement of Allah; \n\"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not \nharmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not \nperform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the \nrecitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse \nwas revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which \nwas put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- \nSafa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \n\"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not \nharmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going \n(Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The \nHajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa \nis incomplete in Allah's sight.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَلاَ أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ، لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏ زَادَ سُفْيَانُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلاَ عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1790In-book reference : Book 26, Hadith 17USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 18   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1791,
    "id": 1791,
    "url": "https://sunnah.com/bukhari:1791",
    "bookNumber": 26,
    "hadithNumber": 18,
    "narrator": "Narrated Isma`il:",
    "english": "`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاعْتَمَرْنَا مَعَهُ فَلَمَّا دَخَلَ مَكَّةَ طَافَ وَطُفْنَا مَعَهُ، وَأَتَى الصَّفَا وَالْمَرْوَةَ وَأَتَيْنَاهَا مَعَهُ، وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ‏.‏ فَقَالَ لَهُ صَاحِبٌ لِي أَكَانَ دَخَلَ الْكَعْبَةَ قَالَ لاَ‏.‏ قَالَ فَحَدِّثْنَا مَا، قَالَ لِخَدِيجَةَ‏.‏ قَالَ ‏\n\"‏ بَشِّرُوا خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1791, 1792In-book reference : Book 26, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1792,
    "id": 1792,
    "url": "https://sunnah.com/bukhari:1792",
    "bookNumber": 26,
    "hadithNumber": 18,
    "narrator": "Narrated Isma`il:",
    "english": "`Abdullah bin Abu `Aufa said: \"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along \nwith him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along \nwith him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to \nthem along with him. We were shielding him from the people of Mecca lest they may hit him with an \narrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during \nthat `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet (ﷺ) ) say about \nKhadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a \npalace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاعْتَمَرْنَا مَعَهُ فَلَمَّا دَخَلَ مَكَّةَ طَافَ وَطُفْنَا مَعَهُ، وَأَتَى الصَّفَا وَالْمَرْوَةَ وَأَتَيْنَاهَا مَعَهُ، وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ‏.‏ فَقَالَ لَهُ صَاحِبٌ لِي أَكَانَ دَخَلَ الْكَعْبَةَ قَالَ لاَ‏.‏ قَالَ فَحَدِّثْنَا مَا، قَالَ لِخَدِيجَةَ‏.‏ قَالَ ‏\n\"‏ بَشِّرُوا خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1791, 1792In-book reference : Book 26, Hadith 18USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1793,
    "id": 1793,
    "url": "https://sunnah.com/bukhari:1793",
    "bookNumber": 26,
    "hadithNumber": 19,
    "narrator": "Narrated `Amr bin Dinar:",
    "english": "We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.‏ قَالَ وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1793, 1794In-book reference : Book 26, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 20   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1794,
    "id": 1794,
    "url": "https://sunnah.com/bukhari:1794",
    "bookNumber": 26,
    "hadithNumber": 19,
    "narrator": "Narrated `Amr bin Dinar:",
    "english": "We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not \nperformed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with \nhis wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and \nthen offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) \nbetween As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good \nexample.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go \nnear her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.‏ قَالَ وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1793, 1794In-book reference : Book 26, Hadith 19USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 20   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1795,
    "id": 1795,
    "url": "https://sunnah.com/bukhari:1795",
    "bookNumber": 26,
    "hadithNumber": 20,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you \nintended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have \nyou assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. \nHe said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- \nMarwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between \nAs-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. \nLater I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of \n`Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till \nyou finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) \nhad reached its place of slaughtering (Hajj-al-Qiran).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ وَهُوَ مُنِيخٌ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَحْسَنْتَ‏.‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَحِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ أَتَيْتُ امْرَأَةً مِنْ قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ‏.‏ فَكُنْتُ أُفْتِي بِهِ، حَتَّى كَانَ فِي خِلاَفَةِ عُمَرَ فَقَالَ إِنْ أَخَذْنَا بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ أَخَذْنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم فَإِنَّهُ لَمْ يَحِلَّ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1795In-book reference : Book 26, Hadith 20USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 21   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1796,
    "id": 1796,
    "url": "https://sunnah.com/bukhari:1796",
    "bookNumber": 26,
    "hadithNumber": 21,
    "narrator": "Narrated Al-Aswad:",
    "english": "`Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed \nby Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, \nand at that time we were traveling with light luggage; we had a few riding animals and a little food \nration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had \npassed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- \nMarwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ أَبِي الأَسْوَدِ، أَنَّ عَبْدَ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ حَدَّثَهُ أَنَّهُ، كَانَ يَسْمَعُ أَسْمَاءَ تَقُولُ كُلَّمَا مَرَّتْ بِالْحَجُونِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ لَقَدْ نَزَلْنَا مَعَهُ هَا هُنَا، وَنَحْنُ يَوْمَئِذٍ خِفَافٌ، قَلِيلٌ ظَهْرُنَا، قَلِيلَةٌ أَزْوَادُنَا، فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ، فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا، ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1796In-book reference : Book 26, Hadith 21USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 22   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1797,
    "id": 1797,
    "url": "https://sunnah.com/bukhari:1797",
    "bookNumber": 26,
    "hadithNumber": 22,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at \nevery elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He \nis One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is \nOmnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He \nhas kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1797In-book reference : Book 26, Hadith 22USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 23   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1798,
    "id": 1798,
    "url": "https://sunnah.com/bukhari:1798",
    "bookNumber": 26,
    "hadithNumber": 23,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive \nhim, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَتْهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَآخَرَ خَلْفَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1798In-book reference : Book 26, Hadith 23USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 24   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1799,
    "id": 1799,
    "url": "https://sunnah.com/bukhari:1799",
    "bookNumber": 26,
    "hadithNumber": 24,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he \nreturned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the \nnight there till morning.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ يُصَلِّي فِي مَسْجِدِ الشَّجَرَةِ، وَإِذَا رَجَعَ صَلَّى بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي وَبَاتَ حَتَّى يُصْبِحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1799In-book reference : Book 26, Hadith 24USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 25   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1800,
    "id": 1800,
    "url": "https://sunnah.com/bukhari:1800",
    "bookNumber": 26,
    "hadithNumber": 25,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the \nmorning or in the afternoon.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَطْرُقُ أَهْلَهُ، كَانَ لاَ يَدْخُلُ إِلاَّ غُدْوَةً أَوْ عَشِيَّةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1800In-book reference : Book 26, Hadith 25USC-MSA web (English) reference : Vol. 3, Book 27, Hadith 26   (deprecated numbering scheme)"
  }
]