[
  {
    "hadithGlobalNumber": 1501,
    "id": 1501,
    "url": "https://sunnah.com/bukhari:1501",
    "bookNumber": 24,
    "hadithNumber": 101,
    "narrator": "Narrated Anas:",
    "english": "Some people from `Uraina tribe came to Medina and its climate did not suit them, so Allah's Messenger (ﷺ) \n(p.b.u.h) allowed them to go to the herd of camels (given as Zakat) and they drank their milk and urine \n(as medicine) but they killed the shepherd and drove away all the camels. So Allah's Messenger (ﷺ) sent \n(men) in their pursuit to catch them, and they were brought, and he had their hands and feet cut, and \ntheir eyes were branded with heated pieces of iron and they were left in the Harra (a stony place at \nMedina) biting the stones. (See Hadith No. 234, Vol. 1)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ نَاسًا، مِنْ عُرَيْنَةَ اجْتَوَوُا الْمَدِينَةَ، فَرَخَّصَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَقَتَلُوا الرَّاعِيَ وَاسْتَاقُوا الذَّوْدَ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُتِيَ بِهِمْ، فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَرَ أَعْيُنَهُمْ، وَتَرَكَهُمْ بِالْحَرَّةِ يَعَضُّونَ الْحِجَارَةَ‏.‏ تَابَعَهُ أَبُو قِلاَبَةَ وَحُمَيْدٌ وَثَابِتٌ عَنْ أَنَسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1501In-book reference : Book 24, Hadith 101USC-MSA web (English) reference : Vol. 2, Book 24, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1502,
    "id": 1502,
    "url": "https://sunnah.com/bukhari:1502",
    "bookNumber": 24,
    "hadithNumber": 102,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I took `Abdullah bin Abu Talha to Allah's Messenger (ﷺ) to perform Tahnik for him. (Tahnik was a custom \namong the Muslims that whenever a child was born they used to take it to the Prophet (ﷺ) who would \nchew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet (ﷺ) and he had an \ninstrument for branding in his hands and was branding the camels of Zakat.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو الأَوْزَاعِيُّ، حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ غَدَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ لِيُحَنِّكَهُ، فَوَافَيْتُهُ فِي يَدِهِ الْمِيسَمُ يَسِمُ إِبِلَ الصَّدَقَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1502In-book reference : Book 24, Hadith 102USC-MSA web (English) reference : Vol. 2, Book 24, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1503,
    "id": 1503,
    "url": "https://sunnah.com/bukhari:1503",
    "bookNumber": 24,
    "hadithNumber": 103,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) enjoined the payment of one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr on every \nMuslim slave or free, male or female, young or old, and he ordered that it be paid before the people \nwent out to offer the `Id prayer. (One Sa' = 3 Kilograms approx.)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْعَبْدِ وَالْحُرِّ، وَالذَّكَرِ وَالأُنْثَى، وَالصَّغِيرِ وَالْكَبِيرِ مِنَ الْمُسْلِمِينَ، وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1503In-book reference : Book 24, Hadith 103USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 579   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1504,
    "id": 1504,
    "url": "https://sunnah.com/bukhari:1504",
    "bookNumber": 24,
    "hadithNumber": 104,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) made it incumbent on all the slave or free Muslims, male or female, to pay one Sa' of \ndates or barley as Zakat-ul-Fitr.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ، ذَكَرٍ أَوْ أُنْثَى، مِنَ الْمُسْلِمِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1504In-book reference : Book 24, Hadith 104USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 580   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1505,
    "id": 1505,
    "url": "https://sunnah.com/bukhari:1505",
    "bookNumber": 24,
    "hadithNumber": 105,
    "narrator": "Narrated Abu Sa`id:",
    "english": "We used to give one Sa' of barley as Sadaqat-ul-Fitr (per head).",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُطْعِمُ الصَّدَقَةَ صَاعًا مِنْ شَعِيرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1505In-book reference : Book 24, Hadith 105USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 581   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1506,
    "id": 1506,
    "url": "https://sunnah.com/bukhari:1506",
    "bookNumber": 24,
    "hadithNumber": 106,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "We used to give one Sa' of meal or one Sa' of barley or one Sa' of dates, or one Sa' of cottage cheese \nor one Sa' of Raisins (dried grapes) as Zakat-ul-Fitr.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ الْعَامِرِيِّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يَقُولُ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ أَقِطٍ، أَوْ صَاعًا مِنْ زَبِيبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1506In-book reference : Book 24, Hadith 106USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1507,
    "id": 1507,
    "url": "https://sunnah.com/bukhari:1507",
    "bookNumber": 24,
    "hadithNumber": 107,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) ordered (Muslims) to give one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr. The \npeople rewarded two Mudds of wheat as equal to that.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِزَكَاةِ الْفِطْرِ، صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ‏.‏ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ فَجَعَلَ النَّاسُ عِدْلَهُ مُدَّيْنِ مِنْ حِنْطَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1507In-book reference : Book 24, Hadith 107USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 583   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1508,
    "id": 1508,
    "url": "https://sunnah.com/bukhari:1508",
    "bookNumber": 24,
    "hadithNumber": 108,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "In the lifetime of the Prophet (ﷺ) we used to give one Sa' of food or one Sa' of dates or one Sa' of barley or \none Sa' of Raisins (dried grapes) as Sadaqat-ul-Fitr. And when Muawiya became the Caliph and the \nwheat was (available in abundance) he said, \"I think (observe) that one Mudd (of wheat) equals two \nMudds (of any of the above mentioned things).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ يَزِيدَ الْعَدَنِيَّ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ حَدَّثَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ كُنَّا نُعْطِيهَا فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ زَبِيبٍ، فَلَمَّا جَاءَ مُعَاوِيَةُ وَجَاءَتِ السَّمْرَاءُ قَالَ أُرَى مُدًّا مِنْ هَذَا يَعْدِلُ مُدَّيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1508In-book reference : Book 24, Hadith 108USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 584   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1509,
    "id": 1509,
    "url": "https://sunnah.com/bukhari:1509",
    "bookNumber": 24,
    "hadithNumber": 109,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) ordered the people to pay Zakat-ul-Fitr before going to the `Id prayer.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِزَكَاةِ الْفِطْرِ قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1509In-book reference : Book 24, Hadith 109USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1510,
    "id": 1510,
    "url": "https://sunnah.com/bukhari:1510",
    "bookNumber": 24,
    "hadithNumber": 110,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "In the lifetime of Allah's Messenger (ﷺ) , we used to give one Sa' of food (edible things) as Sadaqat-ul-Fitr \n(to the poor). Our food used to be either of barley, raisins (dried grapes), cottage cheese or dates.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا أَبُو عُمَرَ، عَنْ زَيْدٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ كُنَّا نُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ‏.‏ وَقَالَ أَبُو سَعِيدٍ وَكَانَ طَعَامَنَا الشَّعِيرُ وَالزَّبِيبُ وَالأَقِطُ وَالتَّمْرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1510In-book reference : Book 24, Hadith 110USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 586   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1511,
    "id": 1511,
    "url": "https://sunnah.com/bukhari:1511",
    "bookNumber": 24,
    "hadithNumber": 111,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar said, \"The Prophet (ﷺ) made incumbent on every male or female, free man or slave, the \npayment of one Sa' of dates or barley as Sadaqat-ul-Fitr (or said Sadaqa-Ramadan).\" The people then \nsubstituted half Sa' of wheat for that. Ibn `Umar used to give dates (as Sadaqat-ul-Fitr). Once there \nwas scarcity of dates in Medina and Ibn `Umar gave barley. 'And Ibn `Umar used to give Sadaqat-ul- \nFitr for every young and old person. He even used to give on behalf of my children. Ibn `Umar used to \ngive Sadaqat-ul-Fitr to those who had been officially appointed for its collection. People used to give \nSadaqat-ul-Fitr (even) a day or two before the `Id.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ فَرَضَ النَّبِيُّ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ ـ أَوْ قَالَ رَمَضَانَ ـ عَلَى الذَّكَرِ وَالأُنْثَى، وَالْحُرِّ وَالْمَمْلُوكِ، صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ، فَعَدَلَ النَّاسُ بِهِ نِصْفَ صَاعٍ مِنْ بُرٍّ‏.‏ فَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُعْطِي التَّمْرَ، فَأَعْوَزَ أَهْلُ الْمَدِينَةِ مِنَ التَّمْرِ فَأَعْطَى شَعِيرًا، فَكَانَ ابْنُ عُمَرَ يُعْطِي عَنِ الصَّغِيرِ وَالْكَبِيرِ، حَتَّى إِنْ كَانَ يُعْطِي عَنْ بَنِيَّ، وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُعْطِيهَا الَّذِينَ يَقْبَلُونَهَا، وَكَانُوا يُعْطُونَ قَبْلَ الْفِطْرِ بِيَوْمٍ أَوْ يَوْمَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1511In-book reference : Book 24, Hadith 111USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 587   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1512,
    "id": 1512,
    "url": "https://sunnah.com/bukhari:1512",
    "bookNumber": 24,
    "hadithNumber": 112,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) has made Sadaqat-ul-Fitr obligatory, (and it was), either one Sa' of barley or one Sa' of \ndates (and its payment was obligatory) on young and old people, and on free men as well as on slaves.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنه ـ قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ تَمْرٍ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْمَمْلُوكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1512In-book reference : Book 24, Hadith 112USC-MSA web (English) reference : Vol. 2, Book 25, Hadith 588   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1513,
    "id": 1513,
    "url": "https://sunnah.com/bukhari:1513",
    "bookNumber": 25,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Al-Fadl (his brother) was riding behind Allah's Messenger (ﷺ) and a woman from the tribe of Khath'am came \nand Al-Fadl started looking at her and she started looking at him. The Prophet (ﷺ) turned Al-Fadl's face to \nthe other side. The woman said, \"O Allah's Messenger (ﷺ)! The obligation of Hajj enjoined by Allah on His \ndevotees has become due on my father and he is old and weak, and he cannot sit firm on the Mount; \nmay I perform Hajj on his behalf?\" The Prophet (ﷺ) replied, \"Yes, you may.\" That happened during the \nHajj-al-Wida (of the Prophet (ﷺ) ).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْفَضْلُ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَتِ امْرَأَةٌ مِنْ خَثْعَمَ، فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ، وَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَثْبُتُ عَلَى الرَّاحِلَةِ، أَفَأَحُجُّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1513In-book reference : Book 25, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 589   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1514,
    "id": 1514,
    "url": "https://sunnah.com/bukhari:1514",
    "bookNumber": 25,
    "hadithNumber": 2,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I saw that Allah's Messenger (ﷺ) used to ride on his Mount at Dhul Hulaifa and used to start saying, \n\"Labbaik\" when the Mount stood upright.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَرْكَبُ رَاحِلَتَهُ بِذِي الْحُلَيْفَةِ ثُمَّ يُهِلُّ حَتَّى تَسْتَوِيَ بِهِ قَائِمَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1514In-book reference : Book 25, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 590   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1515,
    "id": 1515,
    "url": "https://sunnah.com/bukhari:1515",
    "bookNumber": 25,
    "hadithNumber": 3,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "that Allah's Messenger (ﷺ) started saying, \"Labbaik\" from Dhul-Hulaifa when his Mount stood upright \ncarrying him .",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، سَمِعَ عَطَاءً، يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ إِهْلاَلَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ ذِي الْحُلَيْفَةِ حِينَ اسْتَوَتْ بِهِ رَاحِلَتُهُ‏.‏ رَوَاهُ أَنَسٌ وَابْنُ عَبَّاسٍ رضى الله عنهم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1515In-book reference : Book 25, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1516,
    "id": 1516,
    "url": "https://sunnah.com/bukhari:1516",
    "bookNumber": 25,
    "hadithNumber": 4,
    "narrator": "Narrated 'Aishah:",
    "english": "The Prophet (ﷺ) sent my brother, 'Abdur Rahman with me to Tan'im for the 'Umra, and he made me ride on the packsaddle (of a camel). 'Umar said, \"Be ready to travel for Hajj as it (Hajj) is one of the two kind of Jihad\".",
    "arabic": "وَقَالَ أَبَانُ حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مَعَهَا أَخَاهَا عَبْدَ الرَّحْمَنِ، فَأَعْمَرَهَا مِنَ التَّنْعِيمِ، وَحَمَلَهَا عَلَى قَتَبٍ‏.‏ وَقَالَ عُمَرُ ـ رضى الله عنه ـ شُدُّوا الرِّحَالَ فِي الْحَجِّ، فَإِنَّهُ أَحَدُ الْجِهَادَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1516In-book reference : Book 25, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1517,
    "id": 1517,
    "url": "https://sunnah.com/bukhari:1517",
    "bookNumber": 25,
    "hadithNumber": 5,
    "narrator": "Narrated Thumama bin `Abdullah bin Anas:",
    "english": "Anas performed the Hajj on a packsaddle and he was not a miser. Anas said, \"Allah's Messenger (ﷺ) \nperformed Hajj on a packsaddle and the same Mount was carrying his baggage too.\"",
    "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ، قَالَ حَجَّ أَنَسٌ عَلَى رَحْلٍ، وَلَمْ يَكُنْ شَحِيحًا، وَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَجَّ عَلَى رَحْلٍ وَكَانَتْ زَامِلَتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1517In-book reference : Book 25, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 592   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1518,
    "id": 1518,
    "url": "https://sunnah.com/bukhari:1518",
    "bookNumber": 25,
    "hadithNumber": 6,
    "narrator": "Narrated Al-Qasim bin Muhammad:",
    "english": "`Aisha said, \"O Allah's Messenger (ﷺ)! You performed `Umra but I did not.\" He said, \"O `Abdur-Rahman! \nGo along with your sister and let her perform `Umra from Tan`im.\" `Abdur-Rahman made her ride \nover the packsaddle of a she-camel and she performed `Umra.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ، حَدَّثَنَا الْقَاسِمُ بْنُ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، اعْتَمَرْتُمْ وَلَمْ أَعْتَمِرْ‏.‏ فَقَالَ ‏\n\"‏ يَا عَبْدَ الرَّحْمَنِ اذْهَبْ بِأُخْتِكَ فَأَعْمِرْهَا مِنَ التَّنْعِيمِ ‏\"‏‏.‏ فَأَحْقَبَهَا عَلَى نَاقَةٍ فَاعْتَمَرَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1518In-book reference : Book 25, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 593   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1519,
    "id": 1519,
    "url": "https://sunnah.com/bukhari:1519",
    "bookNumber": 25,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) was asked, \"Which is the best deed?\" He said, \"To believe in Allah and His Apostle.\" He \nwas then asked, \"Which is the next (in goodness)?\" He said, \"To participate in Jihad in Allah's Cause.\" \nHe was then asked, \"Which is the next?\" He said, \"To perform Hajj-Mabrur. \"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ ‏\"‏ إِيمَانٌ بِاللَّهِ وَرَسُولِهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ جِهَادٌ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ حَجٌّ مَبْرُورٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1519In-book reference : Book 25, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 594   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1520,
    "id": 1520,
    "url": "https://sunnah.com/bukhari:1520",
    "bookNumber": 25,
    "hadithNumber": 8,
    "narrator": "Narrated `Aisha:",
    "english": "(the mother of the faithful believers) I said, \"O Allah's Messenger (ﷺ)! We consider Jihad as the best deed.\" \nThe Prophet (ﷺ) said, \"The best Jihad (for women) is Hajj Mabrur. \"",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا خَالِدٌ، أَخْبَرَنَا حَبِيبُ بْنُ أَبِي عَمْرَةَ، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، نَرَى الْجِهَادَ أَفْضَلَ الْعَمَلِ، أَفَلاَ نُجَاهِدُ قَالَ ‏\n\"‏ لاَ، لَكِنَّ أَفْضَلَ الْجِهَادِ حَجٌّ مَبْرُورٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1520In-book reference : Book 25, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 595   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1521,
    "id": 1521,
    "url": "https://sunnah.com/bukhari:1521",
    "bookNumber": 25,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (p.b.u.h) said, \"Whoever performs Hajj for Allah's pleasure and does not have sexual \nrelations with his wife, and does not do evil or sins then he will return (after Hajj free from all sins) as \nif he were born anew.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَيَّارٌ أَبُو الْحَكَمِ، قَالَ سَمِعْتُ أَبَا حَازِمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ حَجَّ لِلَّهِ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَيَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1521In-book reference : Book 25, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1522,
    "id": 1522,
    "url": "https://sunnah.com/bukhari:1522",
    "bookNumber": 25,
    "hadithNumber": 10,
    "narrator": "Narrated Zaid bin Jubair:",
    "english": "I went to visit `Abdullah bin `Umar at his house which contained many tents made of cotton cloth and \nthese were encircled with Suradik (part of the tent). I asked him from where, should one assume Ihram \nfor Umra. He said, \"Allah's Messenger (ﷺ) had fixed as Miqat (singular of Mawaqit) Qarn for the people of \nNajd, Dhul-Hulaifa for the people of Medina, and Al-Juhfa for the people of Sham.\"",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنِي زَيْدُ بْنُ جُبَيْرٍ، أَنَّهُ أَتَى عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ فِي مَنْزِلِهِ وَلَهُ فُسْطَاطٌ وَسُرَادِقٌ، فَسَأَلْتُهُ مِنْ أَيْنَ يَجُوزُ أَنْ أَعْتَمِرَ قَالَ فَرَضَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ نَجْدٍ قَرْنًا، وَلأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1522In-book reference : Book 25, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1523,
    "id": 1523,
    "url": "https://sunnah.com/bukhari:1523",
    "bookNumber": 25,
    "hadithNumber": 11,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The people of Yemen used to come for Hajj and used not to bring enough provisions with them and \nused to say that they depend on Allah. On their arrival in Medina they used to beg the people, and so \nAllah revealed, \"And take a provision (with you) for the journey, but the best provision is the fear of \nAllah.\" (2.197).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ، حَدَّثَنَا شَبَابَةُ، عَنْ وَرْقَاءَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ أَهْلُ الْيَمَنِ يَحُجُّونَ وَلاَ يَتَزَوَّدُونَ وَيَقُولُونَ نَحْنُ الْمُتَوَكِّلُونَ، فَإِذَا قَدِمُوا مَكَّةَ سَأَلُوا النَّاسَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى‏}‏‏.‏ رَوَاهُ ابْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ مُرْسَلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1523In-book reference : Book 25, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1524,
    "id": 1524,
    "url": "https://sunnah.com/bukhari:1524",
    "bookNumber": 25,
    "hadithNumber": 12,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) made Dhul-Huiaifa as the Miqat for the people of Medina; Al-Juhfa for the \npeople of Sham; Qarn-al-Manazil for the people of Najd; and Yalamlam for the people of Yemen; and \nthese Mawaqit are for the people at those very places, and besides them for those who come thorough \nthose places with the intention of performing Hajj and `Umra; and whoever is living within these \nboundaries can assume lhram from the place he starts, and the people of Mecca can assume Ihram \nfrom Mecca.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم وَقَّتَ لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ، وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ، هُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ، مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ، وَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ، حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1524In-book reference : Book 25, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 599   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1525,
    "id": 1525,
    "url": "https://sunnah.com/bukhari:1525",
    "bookNumber": 25,
    "hadithNumber": 13,
    "narrator": "Narrated Nafi`:",
    "english": "`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, 'The people of Medina should assume lhram from \nDhul-Hulaifa; the people of Sham from Al-Juhfa; and the people of Najd from Qarn.\" And `Abdullah \nadded, \"I was informed that Allah's Messenger (ﷺ) had said, 'The people of Yemen should assume Ihram \nfrom Yalamlam.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ، وَأَهْلُ الشَّأْمِ مِنَ الْجُحْفَةِ، وَأَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏‏.‏ قَالَ عَبْدُ اللَّهِ وَبَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1525In-book reference : Book 25, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 600   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1526,
    "id": 1526,
    "url": "https://sunnah.com/bukhari:1526",
    "bookNumber": 25,
    "hadithNumber": 14,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) had fixed Dhul Hulaifa as the Miqat for the people of Medina; Al-Juhfa for the people \nof Sham; and Qarn Ul-Manazil for the people of Najd; and Yalamlam for the people of Yemen. So, \nthese (above mentioned) are the Mawaqit for all those living at those places, and besides them for \nthose who come through those places with the intention of performing Hajj and `Umra and whoever \nlives within these places should assume Ihram from his dwelling place, and similarly the people of \nMecca can assume lhram from Mecca.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ وَقَّتَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ، وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ، فَهُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ، لِمَنْ كَانَ يُرِيدُ الْحَجَّ وَالْعُمْرَةَ، فَمَنْ كَانَ دُونَهُنَّ فَمُهَلُّهُ مِنْ أَهْلِهِ، وَكَذَاكَ حَتَّى أَهْلُ مَكَّةَ يُهِلُّونَ مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1526In-book reference : Book 25, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 601   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1527,
    "id": 1527,
    "url": "https://sunnah.com/bukhari:1527",
    "bookNumber": 25,
    "hadithNumber": 15,
    "narrator": "Narrated Salim from his father who said:",
    "english": "\"The Prophet (ﷺ) had fixed the Mawaqit as follows: (No. 603)",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَفِظْنَاهُ مِنَ الزُّهْرِيِّ عَنْ سَالِمٍ، عَنْ أَبِيهِ، وَقَّتَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1527In-book reference : Book 25, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 602   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1528,
    "id": 1528,
    "url": "https://sunnah.com/bukhari:1528",
    "bookNumber": 25,
    "hadithNumber": 16,
    "narrator": "Narrated Salim bin `Abdullah from his father:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The Miqat for the people of Medina is Dhul-Hulaifa; for the people of \nSham is Mahita; (i.e. Al-Juhfa); and for the people of Najd is Qarn. And said Ibn `Umar, \"They claim, \nbut I did not hear personally, that the Prophet (ﷺ) said, \"The Miqat for the people of Yemen is \nYalamlam.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مُهَلُّ أَهْلِ الْمَدِينَةِ ذُو الْحُلَيْفَةِ، وَمُهَلُّ أَهْلِ الشَّأْمِ مَهْيَعَةُ وَهِيَ الْجُحْفَةُ، وَأَهْلِ نَجْدٍ قَرْنٌ ‏\"‏‏.‏ قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ زَعَمُوا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ وَلَمْ أَسْمَعْهُ ‏\"‏ وَمُهَلُّ أَهْلِ الْيَمَنِ يَلَمْلَمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1528In-book reference : Book 25, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 603   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1529,
    "id": 1529,
    "url": "https://sunnah.com/bukhari:1529",
    "bookNumber": 25,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa, for the people of \nSham, Yalamlam for the people of Yemen, and Qarn for the people of Najd. And these Mawaqit are \nfor those living at those very places, and besides them for those who come through those places with \nthe intention of performing Hajj and Umra; and whoever is living inside these places can assume \nlhram from his own dwelling place, and the people of Mecca can assume lhram from Mecca.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم وَقَّتَ لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ، وَلأَهْلِ نَجْدٍ قَرْنًا، فَهُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ، مِمَّنْ كَانَ يُرِيدُ الْحَجَّ وَالْعُمْرَةَ فَمَنْ كَانَ دُونَهُنَّ فَمِنْ أَهْلِهِ حَتَّى إِنَّ أَهْلَ مَكَّةَ يُهِلُّونَ مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1529In-book reference : Book 25, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 604   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1530,
    "id": 1530,
    "url": "https://sunnah.com/bukhari:1530",
    "bookNumber": 25,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (p.b.u.h) fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa for the \npeople of Sham, Qarn-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen; and \nthese Mawaqit are for those living at those very places, and besides them for those whom come \nthrough them with the intention of performing Hajj and Umra; and whoever is living within these \nMawaqit should assume lhram from where he starts, and the people of Mecca can assume Ihram from \nMecca.",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم وَقَّتَ لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ، وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ، هُنَّ لأَهْلِهِنَّ وَلِكُلِّ آتٍ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِمْ مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ فَمَنْ كَانَ دُونَ ذَلِكَ، فَمِنْ حَيْثُ أَنْشَأَ حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1530In-book reference : Book 25, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 605   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1531,
    "id": 1531,
    "url": "https://sunnah.com/bukhari:1531",
    "bookNumber": 25,
    "hadithNumber": 19,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When these two towns (Basra and Kufa) were captured, the people went to `Umar and said, \"O the \nChief of the faithful believers! The Prophet (ﷺ) fixed Qarn as the Miqat for the people of Najd, it is \nbeyond our way and it is difficult for us to pass through it.\" He said, \"Take as your Miqat a place \nsituated opposite to Qarn on your usual way. So, he fixed Dhatu-Irq (as their Miqat).\"",
    "arabic": "حَدَّثَنِي عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا فُتِحَ هَذَانِ الْمِصْرَانِ أَتَوْا عُمَرَ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّ لأَهْلِ نَجْدٍ قَرْنًا، وَهُوَ جَوْرٌ عَنْ طَرِيقِنَا، وَإِنَّا إِنْ أَرَدْنَا قَرْنًا شَقَّ عَلَيْنَا‏.‏ قَالَ فَانْظُرُوا حَذْوَهَا مِنْ طَرِيقِكُمْ‏.‏ فَحَدَّ لَهُمْ ذَاتَ عِرْقٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1531In-book reference : Book 25, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 606   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1532,
    "id": 1532,
    "url": "https://sunnah.com/bukhari:1532",
    "bookNumber": 25,
    "hadithNumber": 20,
    "narrator": "Narrated Nafi`:",
    "english": "`Abdullah bin `Umar' said, \"Allah's Messenger (ﷺ) made his camel sit (i.e. he dismounted) at Al-Batha' in \nDhul-Hulaifa and offered the prayer.\" `Abdullah bin `Umar used to do the same.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَاخَ بِالْبَطْحَاءِ بِذِي الْحُلَيْفَةِ فَصَلَّى بِهَا‏.‏ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ يَفْعَلُ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1532In-book reference : Book 25, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 607   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1533,
    "id": 1533,
    "url": "https://sunnah.com/bukhari:1533",
    "bookNumber": 25,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) used to go (for Hajj) via Ash-Shajara way and return via Muarras way; and no doubt, \nwhenever Allah's Messenger (ﷺ) went to Mecca, he used to offer the prayer in the Mosque of Ash-Shajara; \nand on his return, he used to offer the prayer at Dhul-Hulaifa in the middle of the valley, and pass the \nnight there till morning.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْرُجُ مِنْ طَرِيقِ الشَّجَرَةِ، وَيَدْخُلُ مِنْ طَرِيقِ الْمُعَرَّسِ، وَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ يُصَلِّي فِي مَسْجِدِ الشَّجَرَةِ، وَإِذَا رَجَعَ صَلَّى بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي، وَبَاتَ حَتَّى يُصْبِحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1533In-book reference : Book 25, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 608   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1534,
    "id": 1534,
    "url": "https://sunnah.com/bukhari:1534",
    "bookNumber": 25,
    "hadithNumber": 22,
    "narrator": "Narrated `Umar:",
    "english": "In the valley of Al-`Aqiq I heard Allah's Messenger (ﷺ) saying, \"To night a messenger came to me from my \nLord and asked me to pray in this blessed valley and to assume Ihram for Hajj and `Umra together. \"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ، وَبِشْرُ بْنُ بَكْرٍ التِّنِّيسِيُّ، قَالاَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَنِي عِكْرِمَةُ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ إِنَّهُ سَمِعَ عُمَرَ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِوَادِي الْعَقِيقِ يَقُولُ ‏\n\"‏ أَتَانِي اللَّيْلَةَ آتٍ مِنْ رَبِّي فَقَالَ صَلِّ فِي هَذَا الْوَادِي الْمُبَارَكِ وَقُلْ عُمْرَةً فِي حَجَّةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1534In-book reference : Book 25, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 609   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1535,
    "id": 1535,
    "url": "https://sunnah.com/bukhari:1535",
    "bookNumber": 25,
    "hadithNumber": 23,
    "narrator": "Narrated Musa bin `Uqba:",
    "english": "Salim bin `Abdullah's father said, \"The Prophet (ﷺ) said that while resting in the bottom of the valley at \nMuarras in Dhul-Hulaifa, he had been addressed in a dream: 'You are verily in a blessed valley.' \" \nSalim made us to dismount from our camels at the place where `Abdullah used to dismount, aiming at \nthe place where Allah's Messenger (ﷺ) had rested and it was below the Mosque situated in the middle of the \nvalley in between them (the residence) and the road.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ رُئِيَ وَهُوَ فِي مُعَرَّسٍ بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي قِيلَ لَهُ إِنَّكَ بِبَطْحَاءَ مُبَارَكَةٍ‏.‏ وَقَدْ أَنَاخَ بِنَا سَالِمٌ، يَتَوَخَّى بِالْمُنَاخِ الَّذِي كَانَ عَبْدُ اللَّهِ يُنِيخُ، يَتَحَرَّى مُعَرَّسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ أَسْفَلُ مِنَ الْمَسْجِدِ الَّذِي بِبَطْنِ الْوَادِي، بَيْنَهُمْ وَبَيْنَ الطَّرِيقِ وَسَطٌ مِنْ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1535In-book reference : Book 25, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 610   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1536,
    "id": 1536,
    "url": "https://sunnah.com/bukhari:1536",
    "bookNumber": 25,
    "hadithNumber": 24,
    "narrator": "Narrated Safwan bin Ya'la:",
    "english": "Ya'la said to 'Umar, \"Show me the Prophet (ﷺ) when he is being inspired Divinely.\" While the Prophet (ﷺ) was at Ji'rana (in the company of some of his Companions) a person came and asked, \"O Allah's Messenger! What is your verdict regarding that person who assumes Ihram for 'Umra and is scented with perfume ?\" The Prophet (ﷺ) kept quiet for a while and he was Divinely inspired (then). 'Umar beckoned Ya'la. So he came, and the Allah's Messenger (ﷺ) was shaded with sheet. Ya'la put his head in and saw that the face of Allah's Messenger was red and he was snoring. When the state of the Prophet (ﷺ) was over, he (ﷺ) asked, \"Where is the person who asked about 'Umra?\" Then that person was brought and the Prophet (ﷺ) said, \"Wash the perfume off your body thrice and take off the cloak and do the same in 'Umra as you do in Hajj.\"",
    "arabic": "قَالَ أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّ صَفْوَانَ بْنَ يَعْلَى، أَخْبَرَهُ أَنَّ يَعْلَى قَالَ لِعُمَرَ ـ رضى الله عنه ـ أَرِنِي النَّبِيَّ صلى الله عليه وسلم حِينَ يُوحَى إِلَيْهِ قَالَ فَبَيْنَمَا النَّبِيُّ صلى الله عليه وسلم بِالْجِعْرَانَةِ، وَمَعَهُ نَفَرٌ مِنْ أَصْحَابِهِ، جَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحْرَمَ بِعُمْرَةٍ، وَهْوَ مُتَضَمِّخٌ بِطِيبٍ فَسَكَتَ النَّبِيُّ صلى الله عليه وسلم سَاعَةً فَجَاءَهُ الْوَحْىُ، فَأَشَارَ عُمَرُ ـ رضى الله عنه ـ إِلَى يَعْلَى، فَجَاءَ يَعْلَى، وَعَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثَوْبٌ قَدْ أُظِلَّ بِهِ فَأَدْخَلَ رَأْسَهُ، فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُحْمَرُّ الْوَجْهِ، وَهُوَ يَغِطُّ ثُمَّ سُرِّيَ عَنْهُ فَقَالَ ‏\"‏ أَيْنَ الَّذِي سَأَلَ عَنِ الْعُمْرَةِ ‏\"‏ فَأُتِيَ بِرَجُلٍ فَقَالَ ‏\"‏ اغْسِلِ الطِّيبَ الَّذِي بِكَ ثَلاَثَ مَرَّاتٍ، وَانْزِعْ عَنْكَ الْجُبَّةَ، وَاصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجَّتِكَ ‏\"‏‏.‏ قُلْتُ لِعَطَاءٍ أَرَادَ الإِنْقَاءَ حِينَ أَمَرَهُ أَنْ يَغْسِلَ ثَلاَثَ مَرَّاتٍ قَالَ نَعَمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1536In-book reference : Book 25, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 610   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1537,
    "id": 1537,
    "url": "https://sunnah.com/bukhari:1537",
    "bookNumber": 25,
    "hadithNumber": 25,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Umar used to oil his hair. I told that to Ibrahim who said, \"What do you think about this \nstatement: Narrated Aswad from `Aisha: As if I were now observing the glitter of the scent in the \nparting of the hair of the Prophet (ﷺ) while he was Muhrim?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَدَّهِنُ بِالزَّيْتِ‏.‏   فَذَكَرْتُهُ لإِبْرَاهِيمَ قَالَ مَا تَصْنَعُ بِقَوْلِهِ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ مُحْرِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1537, 1538In-book reference : Book 25, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 611   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1538,
    "id": 1538,
    "url": "https://sunnah.com/bukhari:1538",
    "bookNumber": 25,
    "hadithNumber": 25,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "Ibn `Umar used to oil his hair. I told that to Ibrahim who said, \"What do you think about this \nstatement: Narrated Aswad from `Aisha: As if I were now observing the glitter of the scent in the \nparting of the hair of the Prophet (ﷺ) while he was Muhrim?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَدَّهِنُ بِالزَّيْتِ‏.‏   فَذَكَرْتُهُ لإِبْرَاهِيمَ قَالَ مَا تَصْنَعُ بِقَوْلِهِ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ مُحْرِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1537, 1538In-book reference : Book 25, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 611   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1539,
    "id": 1539,
    "url": "https://sunnah.com/bukhari:1539",
    "bookNumber": 25,
    "hadithNumber": 26,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet (p.b.u.h) I used to scent Allah's Messenger (ﷺ) when he wanted to assume Ihram \nand also on finishing Ihram before the Tawaf round the Ka`ba (Tawaf-al-ifada).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صلى الله عليه وسلم لإِحْرَامِهِ حِينَ يُحْرِمُ، وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1539In-book reference : Book 25, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 612   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1540,
    "id": 1540,
    "url": "https://sunnah.com/bukhari:1540",
    "bookNumber": 25,
    "hadithNumber": 27,
    "narrator": "Narrated Salim from his father:",
    "english": "I heard that Allah's Messenger (ﷺ) assumed Ihram with his hair matted together.",
    "arabic": "حَدَّثَنَا أَصْبَغُ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ مُلَبِّدًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1540In-book reference : Book 25, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 613   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1541,
    "id": 1541,
    "url": "https://sunnah.com/bukhari:1541",
    "bookNumber": 25,
    "hadithNumber": 28,
    "narrator": "Narrated Salim bin `Abdullah:",
    "english": "I heard my father saying, \"Never did Allah's Messenger (ﷺ) assume Ihram except at the Mosque, that is, at \nthe Mosque of Dhul-Hulaifa.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ‏.‏ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ مَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ مِنْ عِنْدِ الْمَسْجِدِ يَعْنِي مَسْجِدَ ذِي الْحُلَيْفَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1541In-book reference : Book 25, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 614   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1542,
    "id": 1542,
    "url": "https://sunnah.com/bukhari:1542",
    "bookNumber": 25,
    "hadithNumber": 29,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "A man asked, \"O Allah's Messenger (ﷺ)! What kind of clothes should a Muhrim wear?\" Allah's Messenger (ﷺ) \nreplied, \"He should not wear a shirt, a turban, trousers, a headcloak or leather socks except if he can \nfind no slippers, he then may wear leather socks after cutting off what might cover the ankles. And he \nshould not wear clothes which are scented with saffron or Wars (kinds of Perfumes) . \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَلْبَسُ الْقُمُصَ وَلاَ الْعَمَائِمَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْبَرَانِسَ وَلاَ الْخِفَافَ، إِلاَّ أَحَدٌ لاَ يَجِدُ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ أَوْ وَرْسٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1542In-book reference : Book 25, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 615   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1543,
    "id": 1543,
    "url": "https://sunnah.com/bukhari:1543",
    "bookNumber": 25,
    "hadithNumber": 30,
    "narrator": "Narrated 'Ubaidullah bin `Abdullah:",
    "english": "Ibn `Abbas' said, \"Usama rode behind Allah's Messenger (ﷺ) from `Arafat to Al-Muzdalifa; and then Al-Fadl \nrode behind Allah's Messenger (ﷺ) from Al-Muzdalifa to Mina.\" Ibn `Abbas added, \"Both of them said, 'The \nProphet kept on reciting Talbiya till he did the Rami of Jamrat-Al-`Aqaba.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ الأَيْلِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أُسَامَةَ ـ رضى الله عنه ـ كَانَ رِدْفَ النَّبِيِّ صلى الله عليه وسلم مِنْ عَرَفَةَ إِلَى الْمُزْدَلِفَةِ، ثُمَّ أَرْدَفَ الْفَضْلَ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى‏.‏ قَالَ فَكِلاَهُمَا قَالَ لَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم يُلَبِّي، حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1543, 1544In-book reference : Book 25, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 616   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1544,
    "id": 1544,
    "url": "https://sunnah.com/bukhari:1544",
    "bookNumber": 25,
    "hadithNumber": 30,
    "narrator": "Narrated 'Ubaidullah bin `Abdullah:",
    "english": "Ibn `Abbas' said, \"Usama rode behind Allah's Messenger (ﷺ) from `Arafat to Al-Muzdalifa; and then Al-Fadl \nrode behind Allah's Messenger (ﷺ) from Al-Muzdalifa to Mina.\" Ibn `Abbas added, \"Both of them said, 'The \nProphet kept on reciting Talbiya till he did the Rami of Jamrat-Al-`Aqaba.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ الأَيْلِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أُسَامَةَ ـ رضى الله عنه ـ كَانَ رِدْفَ النَّبِيِّ صلى الله عليه وسلم مِنْ عَرَفَةَ إِلَى الْمُزْدَلِفَةِ، ثُمَّ أَرْدَفَ الْفَضْلَ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى‏.‏ قَالَ فَكِلاَهُمَا قَالَ لَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم يُلَبِّي، حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1543, 1544In-book reference : Book 25, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 616   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1545,
    "id": 1545,
    "url": "https://sunnah.com/bukhari:1545",
    "bookNumber": 25,
    "hadithNumber": 31,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "The Prophet (ﷺ) with his companions started from Medina after combing and oiling his hair and putting \non two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind \nof sheets except the ones colored with saffron because they may leave the scent on the skin. And so in \nthe early morning, the Prophet (ﷺ) mounted his Mount while in Dhul-Hulaifa and set out till they reached \nBaida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid \n(which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all \nthat happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he \nperformed the Tawaf round the Ka`ba and performed the Tawaf between Safa and Marwa. And as he \nhad a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest \nplaces of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka`ba \nafter he performed Tawaf (round it) till he returned from `Arafat. Then he ordered his companions to \nperform the Tawaf round the Ka`ba and then the Tawaf of Safa and Marwa, and to cut short the hair \nof their heads and to finish their Ihram. And that was only for those people who had not garlanded \nBudn. Those who had their wives with them were permitted to contact them (have sexual intercourse), \nand similarly perfume and (ordinary) clothes were permissible for them.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، قَالَ أَخْبَرَنِي كُرَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ، بَعْدَ مَا تَرَجَّلَ وَادَّهَنَ وَلَبِسَ إِزَارَهُ وَرِدَاءَهُ، هُوَ وَأَصْحَابُهُ، فَلَمْ يَنْهَ عَنْ شَىْءٍ مِنَ الأَرْدِيَةِ وَالأُزْرِ تُلْبَسُ إِلاَّ الْمُزَعْفَرَةَ الَّتِي تَرْدَعُ عَلَى الْجِلْدِ، فَأَصْبَحَ بِذِي الْحُلَيْفَةِ، رَكِبَ رَاحِلَتَهُ حَتَّى اسْتَوَى عَلَى الْبَيْدَاءِ، أَهَلَّ هُوَ وَأَصْحَابُهُ وَقَلَّدَ بَدَنَتَهُ، وَذَلِكَ لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، فَقَدِمَ مَكَّةَ لأَرْبَعِ لَيَالٍ خَلَوْنَ مِنْ ذِي الْحَجَّةِ، فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَلَمْ يَحِلَّ مِنْ أَجْلِ بُدْنِهِ لأَنَّهُ قَلَّدَهَا، ثُمَّ نَزَلَ بِأَعْلَى مَكَّةَ عِنْدَ الْحَجُونِ، وَهْوَ مُهِلٌّ بِالْحَجِّ، وَلَمْ يَقْرَبِ الْكَعْبَةَ بَعْدَ طَوَافِهِ بِهَا حَتَّى رَجَعَ مِنْ عَرَفَةَ، وَأَمَرَ أَصْحَابَهُ أَنْ يَطَّوَّفُوا بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ يُقَصِّرُوا مِنْ رُءُوسِهِمْ ثُمَّ يَحِلُّوا، وَذَلِكَ لِمَنْ لَمْ يَكُنْ مَعَهُ بَدَنَةٌ قَلَّدَهَا، وَمَنْ كَانَتْ مَعَهُ امْرَأَتُهُ فَهِيَ لَهُ حَلاَلٌ، وَالطِّيبُ وَالثِّيَابُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1545In-book reference : Book 25, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 617   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1546,
    "id": 1546,
    "url": "https://sunnah.com/bukhari:1546",
    "bookNumber": 25,
    "hadithNumber": 32,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) offered four rak`at in Medina and then two rak`at at Dhul Hulaifa and then passed the \nnight at Dhul-Hulaifa till it was morning and when he mounted his Mount and it stood up, he started \nto recite Talbiya.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم بِالْمَدِينَةِ أَرْبَعًا، وَبِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، ثُمَّ بَاتَ حَتَّى أَصْبَحَ بِذِي الْحُلَيْفَةِ، فَلَمَّا رَكِبَ رَاحِلَتَهُ وَاسْتَوَتْ بِهِ أَهَلَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1546In-book reference : Book 25, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 618   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1547,
    "id": 1547,
    "url": "https://sunnah.com/bukhari:1547",
    "bookNumber": 25,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Qilaba:",
    "english": "Anas bin Malik said, \"The Prophet (ﷺ) offered four rak`at of the Zuhr prayer in Medina and two rak`at of \n`Asr prayer at Dhul-Hulaifa.\" I think that the Prophet (ﷺ) passed the night there till morning.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا، وَصَلَّى الْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، قَالَ وَأَحْسِبُهُ بَاتَ بِهَا حَتَّى أَصْبَحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1547In-book reference : Book 25, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 619   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1548,
    "id": 1548,
    "url": "https://sunnah.com/bukhari:1548",
    "bookNumber": 25,
    "hadithNumber": 34,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) offered four rak`at of the Zuhr prayer in Medina and two rak`at of the `Asr prayer in \nDhul-Hulaifa and I heard them (the companions of the Prophet) reciting Talbiya together loudly to the \nextent of shouting.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم بِالْمَدِينَةِ الظُّهْرَ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، وَسَمِعْتُهُمْ يَصْرُخُونَ بِهِمَا جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1548In-book reference : Book 25, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 620   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1549,
    "id": 1549,
    "url": "https://sunnah.com/bukhari:1549",
    "bookNumber": 25,
    "hadithNumber": 35,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Talbiya of Allah's Messenger (ﷺ) was : 'Labbaika Allahumma labbaik, Labbaika la sharika Laka labbaik, \nInna-l-hamda wan-ni'mata Laka walmulk, La sharika Laka' (I respond to Your call O Allah, I respond \nto Your call, and I am obedient to Your orders, You have no partner, I respond to Your call All the \npraises and blessings are for You, All the sovereignty is for You, And You have no partners with you.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ تَلْبِيَةَ، رَسُولِ اللَّهِ صلى الله عليه وسلم لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1549In-book reference : Book 25, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 621   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1550,
    "id": 1550,
    "url": "https://sunnah.com/bukhari:1550",
    "bookNumber": 25,
    "hadithNumber": 36,
    "narrator": "Narrated `Aisha:",
    "english": "I know how the Prophet (ﷺ) used to say (Talbiya) and it was: 'Labbaika Allahumma Labbaik, Labbaika la \nsharika Laka labbaik, Inna-l-hamda wan-ni'mata Laka walmu Lk, La sharika Laka'.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ أَبِي عَطِيَّةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنِّي لأَعْلَمُ كَيْفَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُلَبِّي لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ‏.‏ تَابَعَهُ أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ‏.‏   وَقَالَ شُعْبَةُ أَخْبَرَنَا سُلَيْمَانُ، سَمِعْتُ خَيْثَمَةَ، عَنْ أَبِي عَطِيَّةَ، سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1550In-book reference : Book 25, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 622   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1551,
    "id": 1551,
    "url": "https://sunnah.com/bukhari:1551",
    "bookNumber": 25,
    "hadithNumber": 37,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) offered four rak`at of Zuhr prayer at Medina and we were in his company, and two \nrak`at of the `Asr prayer at Dhul-Hulaifa and then passed the night there till it was dawn; then he rode, \nand when he reached Al-Baida', he praised and glorified Allah and said Takbir (i.e. Al hamdu-li l-lah \nand Subhanallah(1) and Allahu-Akbar). Then he and the people along with him recited Talbiya with \nthe intention of performing Hajj and Umra. When we reached (Mecca) he ordered us to finish the \nlhram (after performing the Umra) (only those who had no Hadi (animal for sacrifice) with them were \nasked to do so) till the day of Tarwiya that is 8th Dhul-Hijja when they assumed Ihram for Hajj. The \nProphet sacrificed many camels (slaughtering them) with his own hands while standing. While Allah's \nApostle was in Medina he sacrificed two horned rams black and white in color in the Name of Allah.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ مَعَهُ بِالْمَدِينَةِ الظُّهْرَ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، ثُمَّ بَاتَ بِهَا حَتَّى أَصْبَحَ، ثُمَّ رَكِبَ حَتَّى اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ، حَمِدَ اللَّهَ وَسَبَّحَ وَكَبَّرَ، ثُمَّ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ، وَأَهَلَّ النَّاسُ بِهِمَا، فَلَمَّا قَدِمْنَا أَمَرَ النَّاسَ فَحَلُّوا، حَتَّى كَانَ يَوْمُ التَّرْوِيَةِ أَهَلُّوا بِالْحَجِّ قَالَ وَنَحَرَ النَّبِيُّ صلى الله عليه وسلم بَدَنَاتٍ بِيَدِهِ قِيَامًا، وَذَبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ كَبْشَيْنِ أَمْلَحَيْنِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ بَعْضُهُمْ هَذَا عَنْ أَيُّوبَ عَنْ رَجُلٍ عَنْ أَنَسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1551In-book reference : Book 25, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 623   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1552,
    "id": 1552,
    "url": "https://sunnah.com/bukhari:1552",
    "bookNumber": 25,
    "hadithNumber": 38,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (p.b.u.h) recited Talbiya when he had mounted his Mount and was ready to set out.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي صَالِحُ بْنُ كَيْسَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم حِينَ اسْتَوَتْ بِهِ رَاحِلَتُهُ قَائِمَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1552In-book reference : Book 25, Hadith 38USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 624   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1553,
    "id": 1553,
    "url": "https://sunnah.com/bukhari:1553",
    "bookNumber": 25,
    "hadithNumber": 39,
    "narrator": "",
    "english": "Narrated Nafi', 'Whenever Ibn 'Umar finished his morning Salat at Dhul-Hulaifa he would get his Rahila (mount) prepared. Then, he would ride on it, and after it had stood up straight (ready to set out), he would face Al-Qiblah (the Ka,bah at Makkah) while sitting (on his mount) and recite Talbiya. When he had reached the boundaries of the Haram (or Makkah), he would stop recitation of Talbiya till he reached Dhi-Tuwa (near Makkah) where he would pass the night till it was dawn. After offering the morning Salat, he would take a bath. He claimed that Allah's Messenger (ﷺ) had done the same.",
    "arabic": "وَقَالَ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا صَلَّى بِالْغَدَاةِ بِذِي الْحُلَيْفَةِ أَمَرَ بِرَاحِلَتِهِ فَرُحِلَتْ ثُمَّ رَكِبَ، فَإِذَا اسْتَوَتْ بِهِ اسْتَقْبَلَ الْقِبْلَةَ قَائِمًا، ثُمَّ يُلَبِّي حَتَّى يَبْلُغَ الْمَحْرَمَ، ثُمَّ يُمْسِكُ حَتَّى إِذَا جَاءَ ذَا طُوًى بَاتَ بِهِ حَتَّى يُصْبِحَ، فَإِذَا صَلَّى الْغَدَاةَ اغْتَسَلَ، وَزَعَمَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَ ذَلِكَ‏.‏ تَابَعَهُ إِسْمَاعِيلُ عَنْ أَيُّوبَ فِي الْغَسْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1553In-book reference : Book 25, Hadith 39USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 625   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1554,
    "id": 1554,
    "url": "https://sunnah.com/bukhari:1554",
    "bookNumber": 25,
    "hadithNumber": 40,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever Ibn `Umar intended to go to Mecca he used to oil himself with a sort of oil that had no \npleasant smell, then he would go to the Mosque of Al-Hulaita and offer the prayer, and then ride. \nWhen he mounted well on his Mount and the Mount stood up straight, he would proclaim the \nintention of assuming Ihram, and he used to say that he had seen the Prophet (ﷺ) doing the same.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، حَدَّثَنَا فُلَيْحٌ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا أَرَادَ الْخُرُوجَ إِلَى مَكَّةَ ادَّهَنَ بِدُهْنٍ لَيْسَ لَهُ رَائِحَةٌ طَيِّبَةٌ، ثُمَّ يَأْتِي مَسْجِدَ الْحُلَيْفَةِ فَيُصَلِّي ثُمَّ يَرْكَبُ، وَإِذَا اسْتَوَتْ بِهِ رَاحِلَتُهُ قَائِمَةً أَحْرَمَ، ثُمَّ قَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَفْعَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1554In-book reference : Book 25, Hadith 40USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 625   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1555,
    "id": 1555,
    "url": "https://sunnah.com/bukhari:1555",
    "bookNumber": 25,
    "hadithNumber": 41,
    "narrator": "Narrated Mujahid:",
    "english": "I was in the company of Ibn `Abbas and the people talked about Ad-Dajjal and said, \"Ad-Dajjal will \ncome with the word Kafir (non-believer) written in between his eyes.\" On that Ibn `Abbas said, \"I \nhave not heard this from the Prophet (ﷺ) but I heard him saying, 'As if I saw Moses just now entering the \nvalley reciting Talbyia. ' \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، قَالَ كُنَّا عِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ فَذَكَرُوا الدَّجَّالَ أَنَّهُ قَالَ ‏\"‏ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ ‏\"‏‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لَمْ أَسْمَعْهُ وَلَكِنَّهُ قَالَ ‏\"‏ أَمَّا مُوسَى كَأَنِّي أَنْظُرُ إِلَيْهِ إِذِ انْحَدَرَ فِي الْوَادِي يُلَبِّي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1555In-book reference : Book 25, Hadith 41USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 626   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1556,
    "id": 1556,
    "url": "https://sunnah.com/bukhari:1556",
    "bookNumber": 25,
    "hadithNumber": 42,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet (p.b.u.h) We set out with the Prophet (ﷺ) in his last Hajj and we assumed Ihram \nfor Umra. The Prophet (ﷺ) then said, \"Whoever has the Hadi with him should assume Ihram for Hajj \nalong with `Umra and should not finish the Ihram till he finishes both.\" I was menstruating when I \nreached Mecca, and so I neither did Tawaf round the Ka`ba nor Tawaf between Safa and Marwa. I \ncomplained about that to the Prophet (ﷺ) on which he replied, \"Undo and comb your head hair, and \nassume Ihram for Hajj (only) and leave the Umra.\" So, I did so. When we had performed the Hajj, the \nProphet sent me with my brother `Abdur-Rahman bin Abu Bakr to Tan`im. So I performed the `Umra. \nThe Prophet (ﷺ) said to me, \"This `Umra is instead of your missed one.\" Those who had assumed Ihram \nfor `Umra (Hajj-atTamattu) performed Tawaf round the Ka`ba and between Safa and Marwa and then \nfinished their Ihram. After returning from Mina, they performed another Tawaf (between Safa and \nMarwa). Those who had assumed Ihram for Hajj and `Umra together (Hajj-al-Qiran) performed only \none Tawaf (between Safa and Marwa).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهِلَّ بِالْحَجِّ مَعَ الْعُمْرَةِ، ثُمَّ لاَ يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ، وَلَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَشَكَوْتُ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ، وَدَعِي الْعُمْرَةَ ‏\"‏‏.‏ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي النَّبِيُّ صلى الله عليه وسلم مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ ‏\"‏ هَذِهِ مَكَانَ عُمْرَتِكِ ‏\"‏‏.‏ قَالَتْ فَطَافَ الَّذِينَ كَانُوا أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلُّوا، ثُمَّ طَافُوا طَوَافًا وَاحِدًا بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى، وَأَمَّا الَّذِينَ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1556In-book reference : Book 25, Hadith 42USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 627   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1557,
    "id": 1557,
    "url": "https://sunnah.com/bukhari:1557",
    "bookNumber": 25,
    "hadithNumber": 43,
    "narrator": "Narrated Ata:",
    "english": "Jabir said, \"The Prophet (ﷺ) ordered `Ali to keep on assuming his Ihram.\" The narrator then informed \nabout the narration of Suraqa.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ ـ رضى الله عنه ـ أَمَرَ النَّبِيُّ صلى الله عليه وسلم عَلِيًّا ـ رضى الله عنه ـ أَنْ يُقِيمَ عَلَى إِحْرَامِهِ، وَذَكَرَ قَوْلَ سُرَاقَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1557In-book reference : Book 25, Hadith 43USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 628   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1558,
    "id": 1558,
    "url": "https://sunnah.com/bukhari:1558",
    "bookNumber": 25,
    "hadithNumber": 44,
    "narrator": "Narrated Anas bin Malik:",
    "english": "`Ali came to the Prophet (p.b.u.h) from Yemen (to Mecca). The Prophet (ﷺ) asked `Ali, \"With what \nintention have you assumed Ihram?\" `Ali replied, \"I have assumed Ihram with the same intention as \nthat of the Prophet.\" The Prophet (ﷺ) said, \"If I had not the Hadi with me I would have finished the \nIhram.\" Muhammad bin Bakr narrated extra from Ibn Juraij, \"The Prophet (ﷺ) said to `Ali, \"With what \nintention have you assumed the Ihram, O `Ali?\" He replied, \"With the same (intention) as that of the \nProphet.\" The Prophet (ﷺ) said, \"Have a Hadi and keep your Ihram as it is.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ الْهُذَلِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، قَالَ سَمِعْتُ مَرْوَانَ الأَصْفَرَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَلِيٌّ ـ رضى الله عنه ـ عَلَى النَّبِيِّ صلى الله عليه وسلم مِنَ الْيَمَنِ فَقَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَقَالَ ‏\"‏ لَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَزَادَ مُحَمَّدُ بْنُ بَكْرٍ عَنِ ابْنِ جُرَيْجٍ قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَا أَهْلَلْتَ يَا عَلِيُّ ‏\"‏‏.‏ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَأَهْدِ وَامْكُثْ حَرَامًا كَمَا أَنْتَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1558In-book reference : Book 25, Hadith 44USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 629   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1559,
    "id": 1559,
    "url": "https://sunnah.com/bukhari:1559",
    "bookNumber": 25,
    "hadithNumber": 45,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) sent me to some people in Yemen and when I returned, I found him at Al-Batha. He \nasked me, \"With what intention have you assumed Ihram (i.e. for Hajj or for Umra or for both?\") I \nreplied, \"I have assumed Ihram with an intention like that of the Prophet.\" He asked, \"Have you a \nHadi with you?\" I replied in the negative. He ordered me to perform Tawaf round the Ka`ba and \nbetween Safa and Marwa and then to finish my Ihram. I did so and went to a woman from my tribe \nwho combed my hair or washed my head. Then, when `Umar came (i.e. became Caliph) he said, \"If \nwe follow Allah's Book, it orders us to complete Hajj and Umra; as Allah says: \"Perform the Hajj and \nUmra for Allah.\" (2.196). And if we follow the tradition of the Prophet (ﷺ) who did not finish his Ihram \ntill he sacrificed his Hadi.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم إِلَى قَوْمٍ بِالْيَمَنِ فَجِئْتُ وَهْوَ بِالْبَطْحَاءِ فَقَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ أَهْلَلْتُ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ هَلْ مَعَكَ مِنْ هَدْىٍ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ فَأَمَرَنِي فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَمَرَنِي فَأَحْلَلْتُ فَأَتَيْتُ امْرَأَةً مِنْ قَوْمِي فَمَشَطَتْنِي، أَوْ غَسَلَتْ رَأْسِي، فَقَدِمَ عُمَرُ ـ رضى الله عنه ـ فَقَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ قَالَ اللَّهُ ‏{‏وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ‏}‏ وَإِنْ نَأْخُذْ بِسُنَّةِ النَّبِيِّ صلى الله عليه وسلم فَإِنَّهُ لَمْ يَحِلَّ حَتَّى نَحَرَ الْهَدْىَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1559In-book reference : Book 25, Hadith 45USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 630   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1560,
    "id": 1560,
    "url": "https://sunnah.com/bukhari:1560",
    "bookNumber": 25,
    "hadithNumber": 46,
    "narrator": "Narrated Al-Qasim bin Muhammad:",
    "english": "' Aisha said, \"We set out with Allah's Messenger (ﷺ)s in the months of Hajj, and (in) the nights of Hajj, and \nat the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from \nMecca). The Prophet (ﷺ) then addressed his companions and said, \"Anyone who has not got the Hadi and \nlikes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu`) and anyone who has got the Hadi \nshould not finish the Ihram after performing ' `Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The \ncompanions of the Prophet (ﷺ) obeyed the above (order) and some of them (i.e. who did not have Hadi) \nfinished their Ihram after Umra.\" Allah's Messenger (ﷺ) and some of his companions were resourceful and \nhad the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra \nwith one Ihram). Aisha added, \"Allah's Messenger (ﷺ) came to me and saw me weeping and said, \"What \nmakes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I \ncannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers \n(i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and \nAllah has written for you (this state) as He has written it for them. Keep on with your intentions for \nHajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we \nreached Mina and I became clean from my menses. \nThen I went out from Mina and performed Tawaf round the Ka`ba.\" Aisha added, \"I went along with \nthe Prophet (ﷺ) in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside \nMecca), and we too, dismounted with him.\" He called ' `Abdur-Rahman bin Abu Bakr and said to \nhim, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' `Umra, and when \nyou had finished ' `Umra, return to this place and I will wait for you both till you both return to me.' \" ' \nAisha added, \" So we went out of the sanctuary of Mecca and after finishing from the ' `Umra and the \nTawaf we returned to the Prophet (ﷺ) at dawn. He said, 'Have you performed the ' `Umra?' We replied in \nthe affirmative. So he announced the departure amongst his companions and the people set out for the \njourney, and the Prophet: too left for Medina.''",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَشْهُرِ الْحَجِّ، وَلَيَالِي الْحَجِّ وَحُرُمِ الْحَجِّ، فَنَزَلْنَا بِسَرِفَ قَالَتْ فَخَرَجَ إِلَى أَصْحَابِهِ فَقَالَ ‏\"‏ مَنْ لَمْ يَكُنْ مِنْكُمْ مَعَهُ هَدْىٌ فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً فَلْيَفْعَلْ، وَمَنْ كَانَ مَعَهُ الْهَدْىُ فَلاَ ‏\"‏‏.‏ قَالَتْ فَالآخِذُ بِهَا وَالتَّارِكُ لَهَا مِنْ أَصْحَابِهِ قَالَتْ فَأَمَّا رَسُولُ اللَّهِ صلى الله عليه وسلم وَرِجَالٌ مِنْ أَصْحَابِهِ فَكَانُوا أَهْلَ قُوَّةٍ، وَكَانَ مَعَهُمُ الْهَدْىُ، فَلَمْ يَقْدِرُوا عَلَى الْعُمْرَةِ قَالَتْ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ يَا هَنْتَاهْ ‏\"‏‏.‏ قُلْتُ سَمِعْتُ قَوْلَكَ لأَصْحَابِكَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضِيرُكِ، إِنَّمَا أَنْتِ امْرَأَةٌ مِنْ بَنَاتِ آدَمَ كَتَبَ اللَّهُ عَلَيْكِ مَا كَتَبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ، فَعَسَى اللَّهُ أَنْ يَرْزُقَكِيهَا ‏\"‏‏.‏ قَالَتْ فَخَرَجْنَا فِي حَجَّتِهِ حَتَّى قَدِمْنَا مِنًى فَطَهَرْتُ، ثُمَّ خَرَجْتُ مِنْ مِنًى فَأَفَضْتُ بِالْبَيْتِ قَالَتْ ثُمَّ خَرَجَتْ مَعَهُ فِي النَّفْرِ الآخِرِ حَتَّى نَزَلَ الْمُحَصَّبَ، وَنَزَلْنَا مَعَهُ فَدَعَا عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ مِنَ الْحَرَمِ، فَلْتُهِلَّ بِعُمْرَةٍ ثُمَّ افْرُغَا، ثُمَّ ائْتِيَا هَا هُنَا، فَإِنِّي أَنْظُرُكُمَا حَتَّى تَأْتِيَانِي ‏\"‏‏.‏ ـ قَالَتْ ـ فَخَرَجْنَا حَتَّى إِذَا فَرَغْتُ، وَفَرَغْتُ مِنَ الطَّوَافِ ثُمَّ جِئْتُهُ بِسَحَرَ فَقَالَ ‏\"‏ هَلْ فَرَغْتُمْ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَآذَنَ بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ فَمَرَّ مُتَوَجِّهًا إِلَى الْمَدِينَةِ‏.‏ ضَيْرُ مِنْ ضَارَ يَضِيرُ ضَيْرًا، وَيُقَالُ ضَارَ يَضُورُ ضَوْرًا وَضَرَّ يَضُرُّ ضَرًّا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1560In-book reference : Book 25, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 631   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1561,
    "id": 1561,
    "url": "https://sunnah.com/bukhari:1561",
    "bookNumber": 25,
    "hadithNumber": 47,
    "narrator": "Narrated Al-Aswad:",
    "english": "' Aisha said, We went out with the Prophet (from Medina) with the intention of performing Hajj only \nand when we reached Mecca we performed Tawaf round the Ka`ba and then the Prophet (ﷺ) ordered those \nwho had not driven the Hadi along with them to finish their Ihram. So the people who had not driven \nthe Hadi along with them finished their Ihram. The Prophet's wives, too, had not driven the Hadi with \nthem, so they too, finished their Ihram.\" `Aisha added, \"I got my menses and could not perform Tawaf \nround the Ka`ba.\" So when it was the night of Hasba (i.e. when we stopped at Al-Muhassab), I said, \n'O Allah's Messenger (ﷺ)! Everyone is returning after performing Hajj and `Umra but I am returning after \nperforming Hajj only.' He said, 'Didn't you perform Tawaf round the Ka`ba the night we reached \nMecca?' I replied in the negative. He said, 'Go with your brother to Tan`im and assume the Ihram for \n`Umra, (and after performing it) come back to such and such a place.' On that Safiya said, 'I feel that I \nwill detain you all.' The Prophet (ﷺ) said, 'O 'Aqra Halqa! Didn't you perform Tawaf of the Ka`ba on the \nday of sacrifice? (i.e. Tawaf-al-ifada) Safiya replied in the affirmative. He said, (to Safiya). 'There is \nno harm for you to proceed on with us.' \" `Aisha added, \"(after returning from `Umra), the Prophet (ﷺ) \nmet me while he was ascending (from Mecca) and I was descending to it, or I was ascending and he \nwas descending.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَلاَ نُرَى إِلاَّ أَنَّهُ الْحَجُّ، فَلَمَّا قَدِمْنَا تَطَوَّفْنَا بِالْبَيْتِ، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ سَاقَ الْهَدْىَ أَنْ يَحِلَّ، فَحَلَّ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْىَ، وَنِسَاؤُهُ لَمْ يَسُقْنَ فَأَحْلَلْنَ، قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ فَحِضْتُ فَلَمْ أَطُفْ بِالْبَيْتِ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ قَالَتْ يَا رَسُولَ اللَّهِ، يَرْجِعُ النَّاسُ بِعُمْرَةٍ وَحَجَّةٍ وَأَرْجِعُ أَنَا بِحَجَّةٍ قَالَ ‏\"‏ وَمَا طُفْتِ لَيَالِيَ قَدِمْنَا مَكَّةَ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي مَعَ أَخِيكِ إِلَى التَّنْعِيمِ، فَأَهِلِّي بِعُمْرَةٍ ثُمَّ مَوْعِدُكِ كَذَا وَكَذَا ‏\"‏‏.‏ قَالَتْ صَفِيَّةُ مَا أُرَانِي إِلاَّ حَابِسَتَهُمْ‏.‏ قَالَ ‏\"‏ عَقْرَى حَلْقَى، أَوَمَا طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ قُلْتُ بَلَى‏.‏ قَالَ ‏\"‏ لاَ بَأْسَ، انْفِرِي ‏\"‏‏.‏ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ فَلَقِيَنِي النَّبِيُّ صلى الله عليه وسلم وَهُوَ مُصْعِدٌ مِنْ مَكَّةَ، وَأَنَا مُنْهَبِطَةٌ عَلَيْهَا، أَوْ أَنَا مُصْعِدَةٌ وَهْوَ مُنْهَبِطٌ مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1561In-book reference : Book 25, Hadith 47USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 632   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1562,
    "id": 1562,
    "url": "https://sunnah.com/bukhari:1562",
    "bookNumber": 25,
    "hadithNumber": 48,
    "narrator": "Narrated `Aisha:",
    "english": "We set out with Allah's Messenger (ﷺ)s (to Mecca) in the year of the Prophet's Last Hajj. Some of us had \nassumed Ihram for `Umra only, some for both Hajj and `Umra, and others for Hajj only. Allah's \nApostle assumed Ihram for Hajj. So whoever had assumed Ihram for Hajj or for both Hajj and `Umra \ndid not finish the Ihram till the day of sacrifice. (See Hadith No. 631, 636, and 639).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ وَعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَأَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحَجِّ، فَأَمَّا مَنْ أَهَلَّ بِالْحَجِّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ لَمْ يَحِلُّوا حَتَّى كَانَ يَوْمُ النَّحْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1562In-book reference : Book 25, Hadith 48USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 633   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1563,
    "id": 1563,
    "url": "https://sunnah.com/bukhari:1563",
    "bookNumber": 25,
    "hadithNumber": 49,
    "narrator": "Narrated Marwan bin Al-Hakam:",
    "english": "I saw `Uthman and `Ali. `Uthman used to forbid people to perform Hajj-at-Tamattu` and Hajj-al- \nQiran (Hajj and `Umra together), and when `Ali saw (this act of `Uthman), he assumed Ihram for Hajj \nand `Umra together saying, \"Lubbaik for `Umra and Hajj,\" and said, \"I will not leave the tradition of \nthe Prophet (ﷺ) on the saying of somebody.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ، قَالَ شَهِدْتُ عُثْمَانَ وَعَلِيًّا ـ رضى الله عنهما ـ وَعُثْمَانُ يَنْهَى عَنِ الْمُتْعَةِ وَأَنْ يُجْمَعَ بَيْنَهُمَا‏.‏ فَلَمَّا رَأَى عَلِيٌّ، أَهَلَّ بِهِمَا لَبَّيْكَ بِعُمْرَةٍ وَحَجَّةٍ قَالَ مَا كُنْتُ لأَدَعَ سُنَّةَ النَّبِيِّ صلى الله عليه وسلم لِقَوْلِ أَحَدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1563In-book reference : Book 25, Hadith 49USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 634   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1564,
    "id": 1564,
    "url": "https://sunnah.com/bukhari:1564",
    "bookNumber": 25,
    "hadithNumber": 50,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The people (of the Pre-Islamic Period) used to think that to perform `Umra during the months of Hajj \nwas one of the major sins on earth. And also used to consider the month of Safar as a forbidden (i.e. \nsacred) month and they used to say, \"When the wounds of the camel's back heal up (after they return \nfrom Hajj) and the signs of those wounds vanish and the month of Safar passes away then (at that \ntime) `Umra is permissible for the one who wishes to perform it.\" In the morning of the 4th of Dhul- \nHijja, the Prophet (ﷺ) and his companions reached Mecca, assuming Ihram for Hajj and he ordered his \ncompanions to make their intentions of the Ihram for `Umra only (instead of Hajj) so they considered \nhis order as something great and were puzzled, and said, \"O Allah's Messenger (ﷺ)! What kind (of finishing) \nof Ihram is allowed?\" The Prophet (ﷺ) replied, \"Finish the Ihram completely like a non-Muhrim (you are \nallowed everything).\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانُوا يَرَوْنَ أَنَّ الْعُمْرَةَ فِي أَشْهُرِ الْحَجِّ مِنْ أَفْجَرِ الْفُجُورِ فِي الأَرْضِ، وَيَجْعَلُونَ الْمُحَرَّمَ صَفَرًا وَيَقُولُونَ إِذَا بَرَأَ الدَّبَرْ، وَعَفَا الأَثَرْ، وَانْسَلَخَ صَفَرْ، حَلَّتِ الْعُمْرَةُ لِمَنِ اعْتَمَرْ‏.‏ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ صَبِيحَةَ رَابِعَةٍ مُهِلِّينَ بِالْحَجِّ، فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً فَتَعَاظَمَ ذَلِكَ عِنْدَهُمْ فَقَالُوا يَا رَسُولَ اللَّهِ أَىُّ الْحِلِّ قَالَ ‏\n\"‏ حِلٌّ كُلُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1564In-book reference : Book 25, Hadith 50USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 635   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1565,
    "id": 1565,
    "url": "https://sunnah.com/bukhari:1565",
    "bookNumber": 25,
    "hadithNumber": 51,
    "narrator": "Narrated Abu Musa:",
    "english": "came to the Prophet (from Yemen and was assuming Ihram for Hajj) and he ordered me to finish the \nIhram (after performing the `Umra).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ فَأَمَرَهُ بِالْحِلِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1565In-book reference : Book 25, Hadith 51USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 636   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1566,
    "id": 1566,
    "url": "https://sunnah.com/bukhari:1566",
    "bookNumber": 25,
    "hadithNumber": 52,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Hafsa the wife of the Prophet (ﷺ) said, \"O Allah's Messenger (ﷺ)! Why have the people finished their Ihram after \nperforming `Umra but you have not finished your Ihram after performing `Umra?\" He replied, \"I have \nmatted my hair and garlanded my Hadi. So I will not finish my Ihram till I have slaughtered (my \nHadi). \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ،‏.‏ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنهم ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1566In-book reference : Book 25, Hadith 52USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 637   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1567,
    "id": 1567,
    "url": "https://sunnah.com/bukhari:1567",
    "bookNumber": 25,
    "hadithNumber": 53,
    "narrator": "Narrated Shu`ba:",
    "english": "Abu Jamra Nasr bin `Imran Ad-Duba'i said, \"I intended to perform Hajj-at-Tamattu` and the people \nadvised me not to do so. I asked Ibn `Abbas regarding it and he ordered me to perform Hajj-at- \nTammatu'. Later I saw in a dream someone saying to me, 'Hajj-Mabrur (Hajj performed in accordance \nwith the Prophet's tradition without committing sins and accepted by Allah) and an accepted `Umra.' \nSo I told that dream to Ibn `Abbas. He said, 'This is the tradition of Abul-Qasim.' Then he said to me, \n'Stay with me and I shall give you a portion of my property.' \" I (Shu`ba) asked, \"Why (did he invite \nyou)?\" He (Abu Jamra) said, \"Because of the dream which I had seen.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو جَمْرَةَ، نَصْرُ بْنُ عِمْرَانَ الضُّبَعِيُّ قَالَ تَمَتَّعْتُ فَنَهَانِي نَاسٌ، فَسَأَلْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ فَأَمَرَنِي، فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَجُلاً يَقُولُ لِي حَجٌّ مَبْرُورٌ وَعُمْرَةٌ مُتَقَبَّلَةٌ، فَأَخْبَرْتُ ابْنَ عَبَّاسٍ فَقَالَ سُنَّةَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي أَقِمْ عِنْدِي، فَأَجْعَلَ لَكَ سَهْمًا مِنْ مَالِي‏.‏ قَالَ شُعْبَةُ فَقُلْتُ لِمَ فَقَالَ لِلرُّؤْيَا الَّتِي رَأَيْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1567In-book reference : Book 25, Hadith 53USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 638   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1568,
    "id": 1568,
    "url": "https://sunnah.com/bukhari:1568",
    "bookNumber": 25,
    "hadithNumber": 54,
    "narrator": "Narrated Abu Shihab:",
    "english": "I left for Mecca for Hajj-at-Tamattu` assuming Ihram for `Umra. I reached Mecca three days before \nthe day of Tarwiya (8th Dhul-Hijja). Some people of Mecca said to me, \"Your Hajj will be like the \nHajj performed by the people of Mecca (i.e. you will lose the superiority of assuming Ihram from the \nMiqat). So I went to `Ata' asking him his view about it. He said, \"Jabir bin `Abdullah narrated to me, 'I \nperformed Hajj with Allah's Messenger (ﷺ) on the day when he drove camels with him. The people had \nassumed Ihram for Hajj-al-Ifrad. The Prophet (ﷺ) ordered them to finish their Ihram after Tawaf round the \nKa`ba, and between Safa and Marwa and to cut short their hair and then to stay there (in Mecca) as \nnon-Muhrims till the day of Tarwiya (i.e. 8th of Dhul-Hijja) when they would assume Ihram for Hajj \nand they were ordered to make the Ihram with which they had come as for `Umra only. They asked, \n'How can we make it `Umra (Tamattu`) as we have intended to perform Hajj?' The Prophet (ﷺ) said, 'Do \nwhat I have ordered you. Had I not brought the Hadi with me, I would have done the same, but I \ncannot finish my Ihram till the Hadi reaches its destination (i.e. is slaughtered).' So, they did (what he \nordered them to do).\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو شِهَابٍ، قَالَ قَدِمْتُ مُتَمَتِّعًا مَكَّةَ بِعُمْرَةٍ فَدَخَلْنَا قَبْلَ التَّرْوِيَةِ بِثَلاَثَةِ أَيَّامٍ، فَقَالَ لِي أُنَاسٌ مِنْ أَهْلِ مَكَّةَ تَصِيرُ الآنَ حَجَّتُكَ مَكِّيَّةً‏.‏ فَدَخَلْتُ عَلَى عَطَاءٍ أَسْتَفْتِيهِ فَقَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ حَجَّ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ سَاقَ الْبُدْنَ مَعَهُ، وَقَدْ أَهَلُّوا بِالْحَجِّ مُفْرَدًا، فَقَالَ لَهُمْ ‏\"‏ أَحِلُّوا مِنْ إِحْرَامِكُمْ بِطَوَافِ الْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، وَقَصِّرُوا ثُمَّ أَقِيمُوا حَلاَلاً، حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ فَأَهِلُّوا بِالْحَجِّ، وَاجْعَلُوا الَّتِي قَدِمْتُمْ بِهَا مُتْعَةً ‏\"‏‏.‏ فَقَالُوا كَيْفَ نَجْعَلُهَا مُتْعَةً وَقَدْ سَمَّيْنَا الْحَجَّ فَقَالَ ‏\"‏ افْعَلُوا مَا أَمَرْتُكُمْ، فَلَوْلاَ أَنِّي سُقْتُ الْهَدْىَ لَفَعَلْتُ مِثْلَ الَّذِي أَمَرْتُكُمْ، وَلَكِنْ لاَ يَحِلُّ مِنِّي حَرَامٌ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏\"‏‏.‏ فَفَعَلُوا‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ أَبُو شِهَابٍ لَيْسَ لَهُ مُسْنَدٌ إِلَّا هَذَا",
    "reference": "Reference : Sahih al-Bukhari 1568In-book reference : Book 25, Hadith 54USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 639   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1569,
    "id": 1569,
    "url": "https://sunnah.com/bukhari:1569",
    "bookNumber": 25,
    "hadithNumber": 55,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "`Ali and `Uthman differed regarding Hajj-at-Tamattu` while they were at 'Usfan (a familiar place near \nMecca). `Ali said, \"I see you want to forbid people to do a thing that the Prophet (ﷺ) did?\" When `Ali saw \nthat, he assumed Ihram for both Hajj and `Umra.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ الأَعْوَرُ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ اخْتَلَفَ عَلِيٌّ وَعُثْمَانُ ـ رضى الله عنهما ـ وَهُمَا بِعُسْفَانَ فِي الْمُتْعَةِ، فَقَالَ عَلِيٌّ مَا تُرِيدُ إِلاَّ أَنْ تَنْهَى عَنْ أَمْرٍ فَعَلَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَلَمَّا رَأَى ذَلِكَ عَلِيٌّ أَهَلَّ بِهِمَا جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1569In-book reference : Book 25, Hadith 55USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 640   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1570,
    "id": 1570,
    "url": "https://sunnah.com/bukhari:1570",
    "bookNumber": 25,
    "hadithNumber": 56,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "We came with Allah's Messenger (ﷺ) (to Mecca) and we were saying: 'Labbaika Allahumma Labbaik' for \nHajj. Allah's Messenger (ﷺ) ordered us to perform `Umra with that Ihram (instead of Hajj).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَدِمْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَقُولُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ بِالْحَجِّ‏.‏ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلْنَاهَا عُمْرَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1570In-book reference : Book 25, Hadith 56USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 641   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1571,
    "id": 1571,
    "url": "https://sunnah.com/bukhari:1571",
    "bookNumber": 25,
    "hadithNumber": 57,
    "narrator": "Narrated `Imran:",
    "english": "We performed Hajj-at-Tamattu` in the lifetime of Allah's Messenger (ﷺ) and then the Qur'an was revealed \n(regarding Hajj-at-Tamattu`) and somebody said what he wished (regarding Hajj-at-Tamattu`) \naccording his own opinion.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ حَدَّثَنِي مُطَرِّفٌ، عَنْ عِمْرَانَ ـ رضى الله عنه ـ قَالَ تَمَتَّعْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَزَلَ الْقُرْآنُ قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1571In-book reference : Book 25, Hadith 57USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 642   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1572,
    "id": 1572,
    "url": "https://sunnah.com/bukhari:1572",
    "bookNumber": 25,
    "hadithNumber": 58,
    "narrator": "Ibn 'Abbas said that he has been asked regarding Hajj-at-Tamattu' on which he said:",
    "english": "\"The Muhajirin and the Ansar and the wives of the Prophet (ﷺ) and we did the same. When we reached Makkah, Allah's Messenger (ﷺ) said, \"Give up your intention of doing the Hajj (at this moment) and perform 'Umra, except the one who had garlanded the Hady.\" So, we performed Tawaf round the Ka'bah and [Sa'y] between As-safa and Al-MArwa, slept with our wives and wore ordinary (stitched) clothes. The Prophet (ﷺ) added, \"Whoever has garlanded his Hady is not allowed to finish the Ihram till the Hady has reached its destination (has been sacrificed)\". Then on the night of Tarwiya (8th Dhul Hijjah, in the afternoon) he ordered us to assume Ihram for Hajj and when we have performed all the ceremonies of Hajj, we came and performed Tawaf round the Ka'bah and (Sa'y) between As-Safa and Al-Marwa, and then our Hajj was complete, and we had to sacrifice a Hady according to the statement of Allah: \n\n\"... He must slaughter a Hady such as he can afford, but if he cannot afford it, he should observer Saum (fasts) three days during the Hajj and seven days after his return (to his home)….\" (V. 2:196).\n\nAnd the sacrifice of the sheep is sufficient. So, the Prophet (ﷺ) and his Companions joined the two religious deeds, (i.e. Hajj and 'Umra) in one year, for Allah revealed (the permissibility) of such practice in His book and in the Sunna (legal ways) of His Prophet (ﷺ) and rendered it permissible for all the people except those living in Makkah. Allah says: \"This is for him whose family is not present at the Al-Masjid-Al-Haram, (i.e. non resident of Makkah).\" The months of Hajj which Allah mentioned in His book are: Shawwal, Dhul-Qa'da and Dhul-Hijjah. Whoever performed Hajj-at-Tamattu' in those months, then slaughtering or fasting is compulsory for him.\n\nThe words: 1. Ar-Rafatha means sexual intercourse. 2. Al-Fasuq means all kinds of sin, and 3. Al-Jidal means to dispute.",
    "arabic": "وَقَالَ أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو مَعْشَرٍ، حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ سُئِلَ عَنْ مُتْعَةِ الْحَجِّ، فَقَالَ أَهَلَّ الْمُهَاجِرُونَ وَالأَنْصَارُ وَأَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَأَهْلَلْنَا، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْعَلُوا إِهْلاَلَكُمْ بِالْحَجِّ عُمْرَةً إِلاَّ مَنْ قَلَّدَ الْهَدْىَ ‏\"‏‏.‏ فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَأَتَيْنَا النِّسَاءَ، وَلَبِسْنَا الثِّيَابَ وَقَالَ ‏\"‏ مَنْ قَلَّدَ الْهَدْىَ فَإِنَّهُ لاَ يَحِلُّ لَهُ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏\"‏‏.‏ ثُمَّ أَمَرَنَا عَشِيَّةَ التَّرْوِيَةِ أَنْ نُهِلَّ بِالْحَجِّ، فَإِذَا فَرَغْنَا مِنَ الْمَنَاسِكِ جِئْنَا فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فَقَدْ تَمَّ حَجُّنَا، وَعَلَيْنَا الْهَدْىُ كَمَا قَالَ اللَّهُ تَعَالَى ‏{‏فَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ‏}‏ إِلَى أَمْصَارِكُمْ‏.‏ الشَّاةُ تَجْزِي، فَجَمَعُوا نُسُكَيْنِ فِي عَامٍ بَيْنَ الْحَجِّ وَالْعُمْرَةِ، فَإِنَّ اللَّهَ تَعَالَى أَنْزَلَهُ فِي كِتَابِهِ وَسَنَّهُ نَبِيُّهُ صلى الله عليه وسلم وَأَبَاحَهُ لِلنَّاسِ غَيْرَ أَهْلِ مَكَّةَ، قَالَ اللَّهُ ‏{‏ذَلِكَ لِمَنْ لَمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ‏}‏ وَأَشْهُرُ الْحَجِّ الَّتِي ذَكَرَ اللَّهُ تَعَالَى شَوَّالٌ وَذُو الْقَعْدَةِ وَذُو الْحَجَّةِ، فَمَنْ تَمَتَّعَ فِي هَذِهِ الأَشْهُرِ فَعَلَيْهِ دَمٌ أَوْ صَوْمٌ، وَالرَّفَثُ الْجِمَاعُ، وَالْفُسُوقُ الْمَعَاصِي، وَالْجِدَالُ الْمِرَاءُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1572In-book reference : Book 25, Hadith 58USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 643   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1573,
    "id": 1573,
    "url": "https://sunnah.com/bukhari:1573",
    "bookNumber": 25,
    "hadithNumber": 59,
    "narrator": "Narrated Nafi`:",
    "english": "On reaching the sanctuary of Mecca, Ibn `Umar used to stop, reciting Talbiya and then he would pass \nthe night at Dhi-Tuwa and then offer the Fajr prayer and take a bath. He used to say that the Prophet (ﷺ) \nused to do the same.",
    "arabic": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا دَخَلَ أَدْنَى الْحَرَمِ أَمْسَكَ عَنِ التَّلْبِيَةِ، ثُمَّ يَبِيتُ بِذِي طُوًى، ثُمَّ يُصَلِّي بِهِ الصُّبْحَ وَيَغْتَسِلُ، وَيُحَدِّثُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1573In-book reference : Book 25, Hadith 59USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 643   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1574,
    "id": 1574,
    "url": "https://sunnah.com/bukhari:1574",
    "bookNumber": 25,
    "hadithNumber": 60,
    "narrator": "Narrated Nafi`:",
    "english": "' Ibn `Umar said, \"The Prophet (ﷺ) passed the night at Dhi-Tuwa till it was dawn and then he entered \nMecca.\" Ibn `Umar used to do the same.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَاتَ النَّبِيُّ صلى الله عليه وسلم بِذِي طُوًى حَتَّى أَصْبَحَ ثُمَّ دَخَلَ مَكَّةَ‏.‏ وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1574In-book reference : Book 25, Hadith 60USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 644   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1575,
    "id": 1575,
    "url": "https://sunnah.com/bukhari:1575",
    "bookNumber": 25,
    "hadithNumber": 61,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) used to enter Mecca from the high Thaniya and used to leave Mecca from the low \nThaniya.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُ مِنَ الثَّنِيَّةِ الْعُلْيَا، وَيَخْرُجُ مِنَ الثَّنِيَّةِ السُّفْلَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1575In-book reference : Book 25, Hadith 61USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 645   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1576,
    "id": 1576,
    "url": "https://sunnah.com/bukhari:1576",
    "bookNumber": 25,
    "hadithNumber": 62,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) entered Mecca from Kada' from the highest Thaniya which is at Al-Batha' and used to \nleave Mecca from the low Thaniya.",
    "arabic": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ الْبَصْرِيُّ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ مَكَّةَ مِنْ كَدَاءٍ مِنَ الثَّنِيَّةِ الْعُلْيَا الَّتِي بِالْبَطْحَاءِ، وَيَخْرُجُ مِنَ الثَّنِيَّةِ السُّفْلَى‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كَانَ يُقَالُ هُوَ مُسَدَّدٌ كَاسْمِهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ سَمِعْتُ يَحْيَى بْنَ مَعِينٍ يَقُولُ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ لَوْ أَنَّ مُسَدَّدًا أَتَيْتُهُ فِي بَيْتِهِ فَحَدَّثْتُهُ لاَسْتَحَقَّ ذَلِكَ، وَمَا أُبَالِي كُتُبِي كَانَتْ عِنْدِي أَوْ عِنْدَ مُسَدَّدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1576In-book reference : Book 25, Hadith 62USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 646   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1577,
    "id": 1577,
    "url": "https://sunnah.com/bukhari:1577",
    "bookNumber": 25,
    "hadithNumber": 63,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) came to Mecca he entered from its higher side and left from its lower side.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَ مِنْ أَعْلاَهَا وَخَرَجَ مِنْ أَسْفَلِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1577In-book reference : Book 25, Hadith 63USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 647   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1578,
    "id": 1578,
    "url": "https://sunnah.com/bukhari:1578",
    "bookNumber": 25,
    "hadithNumber": 64,
    "narrator": "Narrated `Aisha':",
    "english": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from Kada' and left Mecca from \nKuda, from the higher part of Mecca.",
    "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ الْمَرْوَزِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ، وَخَرَجَ مِنْ كُدًا مِنْ أَعْلَى مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1578In-book reference : Book 25, Hadith 64USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 648   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1579,
    "id": 1579,
    "url": "https://sunnah.com/bukhari:1579",
    "bookNumber": 25,
    "hadithNumber": 65,
    "narrator": "Narrated `Aisha:",
    "english": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from Kada' at the higher place of \nMecca. (Hisham, a sub-narrator said, \" `Urwa used to enter (Mecca) from both Kada' and Kuda and he \noften entered through Kada' which was nearer to his dwelling place.)\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ أَعْلَى مَكَّةَ‏.‏ قَالَ هِشَامٌ وَكَانَ عُرْوَةُ يَدْخُلُ عَلَى كِلْتَيْهِمَا مِنْ كَدَاءٍ وَكُدًا، وَأَكْثَرُ مَا يَدْخُلُ مِنْ كَدَاءٍ، وَكَانَتْ أَقْرَبَهُمَا إِلَى مَنْزِلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1579In-book reference : Book 25, Hadith 65USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 649   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1580,
    "id": 1580,
    "url": "https://sunnah.com/bukhari:1580",
    "bookNumber": 25,
    "hadithNumber": 66,
    "narrator": "Narrated Hisham:",
    "english": "`Urwa said, \"The Prophet (ﷺ) entered Mecca in the year of the conquest of Mecca from the side of Kada' \nwhich is at the higher part of Mecca.\" `Urwa often entered from Kada' which was nearer of the two to \nhis dwelling place.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَاتِمٌ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ مِنْ كَدَاءٍ مِنْ أَعْلَى مَكَّةَ‏.‏ وَكَانَ عُرْوَةُ أَكْثَرَ مَا يَدْخُلُ مِنْ كَدَاءٍ وَكَانَ أَقْرَبَهُمَا إِلَى مَنْزِلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1580In-book reference : Book 25, Hadith 66USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 650   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1581,
    "id": 1581,
    "url": "https://sunnah.com/bukhari:1581",
    "bookNumber": 25,
    "hadithNumber": 67,
    "narrator": "Narrated Hisham from his father:",
    "english": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from the side of Kada. `Urwa used to \nenter through both places and he often entered through Kada' which was nearer of the two to his \ndwelling place.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ مِنْ كَدَاءٍ‏.‏ وَكَانَ عُرْوَةُ يَدْخُلُ مِنْهُمَا كِلَيْهِمَا وَأَكْثَرُ مَا يَدْخُلُ مِنْ كَدَاءٍ أَقْرَبِهِمَا إِلَى مَنْزِلِهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كَدَاءٌ وَكُدًا مَوْضِعَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1581In-book reference : Book 25, Hadith 67USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 651   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1582,
    "id": 1582,
    "url": "https://sunnah.com/bukhari:1582",
    "bookNumber": 25,
    "hadithNumber": 68,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "When the Ka`ba was built, the Prophet (ﷺ) and `Abbas went to bring stones (for its construction). Al \n`Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet (ﷺ) \ntook it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist \nsheet.\" And he covered himself with it.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا بُنِيَتِ الْكَعْبَةُ ذَهَبَ النَّبِيُّ صلى الله عليه وسلم وَعَبَّاسٌ يَنْقُلاَنِ الْحِجَارَةَ فَقَالَ الْعَبَّاسُ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ إِزَارَكَ عَلَى رَقَبَتِكَ‏.‏ فَخَرَّ إِلَى الأَرْضِ، وَطَمَحَتْ عَيْنَاهُ إِلَى السَّمَاءِ فَقَالَ ‏\n\"‏ أَرِنِي إِزَارِي ‏\"‏‏.‏ فَشَدَّهُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1582In-book reference : Book 25, Hadith 68USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 652   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1583,
    "id": 1583,
    "url": "https://sunnah.com/bukhari:1583",
    "bookNumber": 25,
    "hadithNumber": 69,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) that Allah's Messenger (ﷺ) said to her, \"Do you know that when your people \n(Quraish) rebuilt the Ka`ba, they decreased it from its original foundation laid by Abraham?\" I said, \n\"O Allah's Messenger (ﷺ)! Why don't you rebuild it on its original foundation laid by Abraham?\" He replied, \n\"Were it not for the fact that your people are close to the Pre-Islamic Period of ignorance (i.e. they \nhave recently become Muslims) I would have done so.\" The sub-narrator, `Abdullah (bin `Umar ) \nstated: `Aisha 'must have heard this from Allah's Messenger (ﷺ) for in my opinion Allah's Messenger (ﷺ) had not \nplaced his hand over the two corners of the Ka`ba opposite Al-Hijr only because the Ka`ba was not \nrebuilt on its original foundations laid by Abraham.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ ـ رضى الله عنهم ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهَا ‏\"‏ أَلَمْ تَرَىْ أَنَّ قَوْمَكِ لَمَّا بَنَوُا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلاَ تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏ قَالَ ‏\"‏ لَوْلاَ حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَفَعَلْتُ ‏\"‏‏.‏ فَقَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ لَئِنْ كَانَتْ عَائِشَةُ ـ رضى الله عنها ـ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ اسْتِلاَمَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ، إِلاَّ أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1583In-book reference : Book 25, Hadith 69USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 653   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1584,
    "id": 1584,
    "url": "https://sunnah.com/bukhari:1584",
    "bookNumber": 25,
    "hadithNumber": 70,
    "narrator": "Narrated `Aisha:",
    "english": "I asked the Prophet (ﷺ) whether the round wall (near Ka`ba) was part of the Ka`ba. The Prophet (ﷺ) replied in \nthe affirmative. I further said, \"What is wrong with them, why have they not included it in the building \nof the Ka`ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could \nnot include it inside the building of Ka`ba)?\" I asked, \"What about its gate? Why is it so high?\" He \nreplied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they \nliked. Were your people not close to the Pre-Islamic Period of ignorance (i.e. they have recently \nembraced Islam) and were I not afraid that they would dislike it, surely I would have included the \n(area of the) wall inside the building of the Ka`ba and I would have lowered its gate to the level of the \nground.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا أَشْعَثُ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الْجَدْرِ أَمِنَ الْبَيْتِ هُوَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ فَمَا لَهُمْ لَمْ يُدْخِلُوهُ فِي الْبَيْتِ قَالَ ‏\"‏ إِنَّ قَوْمَكِ قَصَّرَتْ بِهِمُ النَّفَقَةُ ‏\"‏‏.‏ قُلْتُ فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا قَالَ ‏\"‏ فَعَلَ ذَلِكِ قَوْمُكِ لِيُدْخِلُوا مَنْ شَاءُوا وَيَمْنَعُوا مَنْ شَاءُوا، وَلَوْلاَ أَنَّ قَوْمَكِ حَدِيثٌ عَهْدُهُمْ بِالْجَاهِلِيَّةِ فَأَخَافُ أَنْ تُنْكِرَ قُلُوبُهُمْ أَنْ أُدْخِلَ الْجَدْرَ فِي الْبَيْتِ وَأَنْ أُلْصِقَ بَابَهُ بِالأَرْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1584In-book reference : Book 25, Hadith 70USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 654   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1585,
    "id": 1585,
    "url": "https://sunnah.com/bukhari:1585",
    "bookNumber": 25,
    "hadithNumber": 71,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said to me, \"Were your people not close to the Pre-Islamic period of ignorance, I \nwould have demolished the Ka`ba and would have rebuilt it on its original foundations laid by \nAbraham (for Quraish had curtailed its building), and I would have built a back door (too).\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْلاَ حَدَاثَةُ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْبَيْتَ ثُمَّ لَبَنَيْتُهُ عَلَى أَسَاسِ إِبْرَاهِيمَ ـ عَلَيْهِ السَّلاَمُ ـ فَإِنَّ قُرَيْشًا اسْتَقْصَرَتْ بِنَاءَهُ ـ وَجَعَلْتُ لَهُ خَلْفًا ‏\"‏‏.‏ قَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ خَلْفًا يَعْنِي بَابًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1585In-book reference : Book 25, Hadith 71USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 655   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1586,
    "id": 1586,
    "url": "https://sunnah.com/bukhari:1586",
    "bookNumber": 25,
    "hadithNumber": 72,
    "narrator": "Narrated Yazid bin Ruman from `Urwa:",
    "english": "`Aisha said that the Prophet (ﷺ) said to her, \"O Aisha! Were your nation not close to the Pre-Islamic \nPeriod of Ignorance, I would have had the Ka`ba demolished and would have included in it the portion \nwhich had been left, and would have made it at a level with the ground and would have made two \ndoors for it, one towards the east and the other towards the west, and then by doing this it would have \nbeen built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair to demolish the \nKa`ba. Jazz said, \"I saw Ibn-Az-Zubair when he demolished and rebuilt the Ka`ba and included in it a \nportion of Al-Hijr (the unroofed portion of Ka`ba which is at present in the form of a compound \ntowards the northwest of the Ka`ba). I saw the original foundations of Abraham which were of stones \nresembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz \nsaid, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and Jazz \npointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or \nso.\"",
    "arabic": "حَدَّثَنَا بَيَانُ بْنُ عَمْرٍو، حَدَّثَنَا يَزِيدُ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا يَزِيدُ بْنُ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏\n\"‏ يَا عَائِشَةُ لَوْلاَ أَنَّ قَوْمَكِ حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ لأَمَرْتُ بِالْبَيْتِ فَهُدِمَ، فَأَدْخَلْتُ فِيهِ مَا أُخْرِجَ مِنْهُ وَأَلْزَقْتُهُ بِالأَرْضِ، وَجَعَلْتُ لَهُ بَابَيْنِ بَابًا شَرْقِيًّا وَبَابًا غَرْبِيًّا، فَبَلَغْتُ بِهِ أَسَاسَ إِبْرَاهِيمَ ‏\"‏‏.‏ فَذَلِكَ الَّذِي حَمَلَ ابْنَ الزُّبَيْرِ ـ رضى الله عنهما ـ عَلَى هَدْمِهِ‏.‏ قَالَ يَزِيدُ وَشَهِدْتُ ابْنَ الزُّبَيْرِ حِينَ هَدَمَهُ وَبَنَاهُ وَأَدْخَلَ فِيهِ مِنَ الْحِجْرِ، وَقَدْ رَأَيْتُ أَسَاسَ إِبْرَاهِيمَ حِجَارَةً كَأَسْنِمَةِ الإِبِلِ‏.‏ قَالَ جَرِيرٌ فَقُلْتُ لَهُ أَيْنَ مَوْضِعُهُ قَالَ أُرِيكَهُ الآنَ‏.‏ فَدَخَلْتُ مَعَهُ الْحِجْرَ فَأَشَارَ إِلَى مَكَانٍ فَقَالَ هَا هُنَا‏.‏ قَالَ جَرِيرٌ فَحَزَرْتُ مِنَ الْحِجْرِ سِتَّةَ أَذْرُعٍ أَوْ نَحْوَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1586In-book reference : Book 25, Hadith 72USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 656   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1587,
    "id": 1587,
    "url": "https://sunnah.com/bukhari:1587",
    "bookNumber": 25,
    "hadithNumber": 73,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "On the Day of the Conquest of Mecca, Allah's Messenger (ﷺ) said, \"Allah has made this town a sanctuary. \nIts thorny bushes should not be cut, its game should not be chased, and its fallen things should not be \npicked up except by one who would announce it publicly.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ ‏\n\"‏ إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللَّهُ، لاَ يُعْضَدُ شَوْكُهُ، وَلاَ يُنَفَّرُ صَيْدُهُ، وَلاَ يَلْتَقِطُ لُقَطَتَهُ إِلاَّ مَنْ عَرَّفَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1587In-book reference : Book 25, Hadith 73USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 657   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1588,
    "id": 1588,
    "url": "https://sunnah.com/bukhari:1588",
    "bookNumber": 25,
    "hadithNumber": 74,
    "narrator": "Narrated 'Usama bin Zaid:",
    "english": "I asked, \"O Allah's Messenger (ﷺ)! Where will you stay in Mecca? Will you stay in your house in Mecca?\" \nHe replied, \"Has `Aqil left any property or house?\" `Aqil along with Talib had inherited the property \nof Abu Talib. Jafar and `Ali did not inherit anything as they were Muslims and the other two were \nnon-believers. `Umar bin Al-Khattab used to say, \"A believer cannot inherit (anything from an) \ninfidel.\" Ibn Shihab, (a sub-narrator) said, \"They (`Umar and others) derived the above verdict from \nAllah's Statement: \"Verily! those who believed and Emigrated and strove with their life And property \nin Allah's Cause, And those who helped (the emigrants) And gave them their places to live in, These \nare (all) allies to one another.\" (8.72)",
    "arabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ، أَيْنَ تَنْزِلُ فِي دَارِكَ بِمَكَّةَ‏.‏ فَقَالَ ‏\"‏ وَهَلْ تَرَكَ عَقِيلٌ مِنْ رِبَاعٍ أَوْ دُورٍ ‏\"‏‏.‏ وَكَانَ عَقِيلٌ وَرِثَ أَبَا طَالِبٍ هُوَ وَطَالِبٌ وَلَمْ يَرِثْهُ جَعْفَرٌ وَلاَ عَلِيٌّ ـ رضى الله عنهما ـ شَيْئًا لأَنَّهُمَا كَانَا مُسْلِمَيْنِ، وَكَانَ عَقِيلٌ وَطَالِبٌ كَافِرَيْنِ، فَكَانَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ لاَ يَرِثُ الْمُؤْمِنُ الْكَافِرَ‏.‏ قَالَ ابْنُ شِهَابٍ وَكَانُوا يَتَأَوَّلُونَ قَوْلَ اللَّهِ تَعَالَى ‏{‏إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1588In-book reference : Book 25, Hadith 74USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 658   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1589,
    "id": 1589,
    "url": "https://sunnah.com/bukhari:1589",
    "bookNumber": 25,
    "hadithNumber": 75,
    "narrator": "Narrated Abu Huraira:",
    "english": "When Allah's Messenger (ﷺ) intended to enter Mecca he said, \"Our destination tomorrow, if Allah wished, \nwill be Khaif Bani Kinana where (the pagans) had taken the oath of Kufr.\" (Against the Prophet (ﷺ) i.e. to \nbe loyal to heathenism by boycotting Bani Hashim, the Prophet's folk) (See Hadith 3882)",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَرَادَ قُدُومَ مَكَّةَ ‏\n\"‏ مَنْزِلُنَا غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1589In-book reference : Book 25, Hadith 75USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 659   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1590,
    "id": 1590,
    "url": "https://sunnah.com/bukhari:1590",
    "bookNumber": 25,
    "hadithNumber": 76,
    "narrator": "Narrated Abu Huraira:",
    "english": "On the Day of Nahr at Mina, the Prophet (ﷺ) said, \"Tomorrow we shall stay at Khaif Bani Kinana where \nthe pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the \nQuraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani `Abdul-Muttalib or \nBani Al-Muttalib that they would not intermarry with them or deal with them in business until they \nhanded over the Prophet (ﷺ) to them.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْغَدِ يَوْمَ النَّحْرِ وَهُوَ بِمِنًى ‏\n\"‏ نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏ يَعْنِي ذَلِكَ الْمُحَصَّبَ، وَذَلِكَ أَنَّ قُرَيْشًا وَكِنَانَةَ تَحَالَفَتْ عَلَى بَنِي هَاشِمٍ وَبَنِي عَبْدِ الْمُطَّلِبِ، أَوْ بَنِي الْمُطَّلِبِ أَنْ لاَ يُنَاكِحُوهُمْ، وَلاَ يُبَايِعُوهُمْ حَتَّى يُسْلِمُوا إِلَيْهِمُ النَّبِيَّ صلى الله عليه وسلم‏.‏ وَقَالَ سَلاَمَةُ عَنْ عُقَيْلٍ وَيَحْيَى بْنُ الضَّحَّاكِ عَنِ الأَوْزَاعِيِّ أَخْبَرَنِي ابْنُ شِهَابٍ وَقَالاَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ بَنِي الْمُطَّلِبِ أَشْبَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1590In-book reference : Book 25, Hadith 76USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 660   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1591,
    "id": 1591,
    "url": "https://sunnah.com/bukhari:1591",
    "bookNumber": 25,
    "hadithNumber": 77,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet;; said, \"Dhus-Suwaiqa-tain (literally: One with two lean legs) from Ethiopia will \ndemolish the Ka`ba.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا زِيَادُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1591In-book reference : Book 25, Hadith 77USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 661   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1592,
    "id": 1592,
    "url": "https://sunnah.com/bukhari:1592",
    "bookNumber": 25,
    "hadithNumber": 78,
    "narrator": "Narrated `Aisha:",
    "english": "The people used to fast on 'Ashura (the tenth day of the month of Muharram) before the fasting of \nRamadan was made obligatory. And on that day the Ka`ba used to be covered with a cover. When \nAllah made the fasting of the month of Ramadan compulsory, Allah's Messenger (ﷺ) said, \"Whoever wishes \nto fast (on the day of 'Ashura') may do so; and whoever wishes to leave it can do so.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ ـ هُوَ ابْنُ الْمُبَارَكِ ـ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانُوا يَصُومُونَ عَاشُورَاءَ قَبْلَ أَنْ يُفْرَضَ رَمَضَانُ، وَكَانَ يَوْمًا تُسْتَرُ فِيهِ الْكَعْبَةُ، فَلَمَّا فَرَضَ اللَّهُ رَمَضَانَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ شَاءَ أَنْ يَصُومَهُ فَلْيَصُمْهُ، وَمَنْ شَاءَ أَنْ يَتْرُكَهُ فَلْيَتْرُكْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1592In-book reference : Book 25, Hadith 78USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 662   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1593,
    "id": 1593,
    "url": "https://sunnah.com/bukhari:1593",
    "bookNumber": 25,
    "hadithNumber": 79,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said \"The people will continue performing the Hajj and `Umra to the Ka`ba even after the \nappearance of Gog and Magog.\" \nNarrated Shu`ba extra: \nThe Hour (Day of Judgment) will not be established till the Hajj (to the Ka`ba) is abandoned.",
    "arabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا أَبِي، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الْحَجَّاجِ بْنِ حَجَّاجٍ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيُحَجَّنَّ الْبَيْتُ وَلَيُعْتَمَرَنَّ بَعْدَ خُرُوجِ يَأْجُوجَ وَمَأْجُوجَ ‏\"‏‏.‏ تَابَعَهُ أَبَانُ وَعِمْرَانُ عَنْ قَتَادَةَ‏.‏ وَقَالَ عَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى لاَ يُحَجَّ الْبَيْتُ ‏\"‏‏.‏ وَالأَوَّلُ أَكْثَرُ، سَمِعَ قَتَادَةُ عَبْدَ اللَّهِ وَعَبْدُ اللَّهِ أَبَا سَعِيدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1593In-book reference : Book 25, Hadith 79USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 663   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1594,
    "id": 1594,
    "url": "https://sunnah.com/bukhari:1594",
    "bookNumber": 25,
    "hadithNumber": 80,
    "narrator": "Narrated Abu Wail:",
    "english": "(One day) I sat along with Shaiba on the chair inside the Ka`ba. He (Shaiba) said, \"No doubt, `Umar \nsat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the \nKa`ba) undistributed.' I said (to `Umar), 'But your two companions (i.e. The Prophet (ﷺ) and Abu Bakr) \ndid not do so.' `Umar said, They are the two persons whom I always follow.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، عَنْ أَبِي وَائِلٍ، قَالَ جِئْتُ إِلَى شَيْبَةَ‏.‏ وَحَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، قَالَ جَلَسْتُ مَعَ شَيْبَةَ عَلَى الْكُرْسِيِّ فِي الْكَعْبَةِ فَقَالَ لَقَدْ جَلَسَ هَذَا الْمَجْلِسَ عُمَرُ ـ رضى الله عنه ـ فَقَالَ لَقَدْ هَمَمْتُ أَنْ لاَ أَدَعَ فِيهَا صَفْرَاءَ وَلاَ بَيْضَاءَ إِلاَّ قَسَمْتُهُ‏.‏ قُلْتُ إِنَّ صَاحِبَيْكَ لَمْ يَفْعَلاَ‏.‏ قَالَ هُمَا الْمَرْآنِ أَقْتَدِي بِهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1594In-book reference : Book 25, Hadith 80USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 664   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1595,
    "id": 1595,
    "url": "https://sunnah.com/bukhari:1595",
    "bookNumber": 25,
    "hadithNumber": 81,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"As if I were looking at him, a black person with thin legs plucking the stones of the \nKa`ba one after another. \"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الأَخْنَسِ، حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَأَنِّي بِهِ أَسْوَدَ أَفْحَجَ، يَقْلَعُهَا حَجَرًا حَجَرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1595In-book reference : Book 25, Hadith 81USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 665   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1596,
    "id": 1596,
    "url": "https://sunnah.com/bukhari:1596",
    "bookNumber": 25,
    "hadithNumber": 82,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Dhus-Suwaiqatain (the thin legged man) from Ethiopia will demolish the \nKa`ba.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1596In-book reference : Book 25, Hadith 82USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 666   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1597,
    "id": 1597,
    "url": "https://sunnah.com/bukhari:1597",
    "bookNumber": 25,
    "hadithNumber": 83,
    "narrator": "Narrated `Abis bin Rabi`a:",
    "english": "`Umar came near the Black Stone and kissed it and said \"No doubt, I know that you are a stone and \ncan neither benefit anyone nor harm anyone. Had I not seen Allah's Messenger (ﷺ) kissing you I would not \nhave kissed you.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَابِسِ بْنِ رَبِيعَةَ، عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّهُ جَاءَ إِلَى الْحَجَرِ الأَسْوَدِ فَقَبَّلَهُ، فَقَالَ إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لاَ تَضُرُّ وَلاَ تَنْفَعُ، وَلَوْلاَ أَنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُقَبِّلُكَ مَا قَبَّلْتُكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1597In-book reference : Book 25, Hadith 83USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 667   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1598,
    "id": 1598,
    "url": "https://sunnah.com/bukhari:1598",
    "bookNumber": 25,
    "hadithNumber": 84,
    "narrator": "Narrated Salim that his father said:",
    "english": "\"Allah's Messenger (ﷺ), Usama bin Zaid, Bilal, and `Uthman bin abu Talha entered the Ka`ba and then \nclosed its door. When they opened the door I was the first person to enter (the Ka`ba). I met Bilal and \nasked him, \"Did Allah's Messenger (ﷺ) offer a prayer inside (the Ka`ba)?\" Bilal replied in the affirmative and \nsaid, \"(The Prophet (ﷺ) offered the prayer) in between the two right pillars.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ، وَبِلاَلٌ، وَعُثْمَانُ بْنُ طَلْحَةَ، فَأَغْلَقُوا عَلَيْهِمْ فَلَمَّا فَتَحُوا، كُنْتُ أَوَّلَ مَنْ وَلَجَ، فَلَقِيتُ بِلاَلاً فَسَأَلْتُهُ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ، بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1598In-book reference : Book 25, Hadith 84USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 668   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1599,
    "id": 1599,
    "url": "https://sunnah.com/bukhari:1599",
    "bookNumber": 25,
    "hadithNumber": 85,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever Ibn `Umar entered the Ka`ba he used to walk straight keeping the door at his back on \nentering, and used to proceed on till about three cubits from the wall in front of him, and then he \nwould offer the prayer there aiming at the place where Allah's Messenger (ﷺ) prayed, as Bilal had told him. \nThere is no harm for any person to offer the prayer at any place inside the Ka`ba.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ إِذَا دَخَلَ الْكَعْبَةَ مَشَى قِبَلَ الْوَجْهِ حِينَ يَدْخُلُ، وَيَجْعَلُ الْبَابَ قِبَلَ الظَّهْرِ، يَمْشِي حَتَّى يَكُونَ بَيْنَهُ وَبَيْنَ الْجِدَارِ الَّذِي قِبَلَ وَجْهِهِ قَرِيبًا مِنْ ثَلاَثِ أَذْرُعٍ، فَيُصَلِّي يَتَوَخَّى الْمَكَانَ الَّذِي أَخْبَرَهُ بِلاَلٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِيهِ، وَلَيْسَ عَلَى أَحَدٍ بَأْسٌ أَنْ يُصَلِّيَ فِي أَىِّ نَوَاحِي الْبَيْتِ شَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1599In-book reference : Book 25, Hadith 85USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 669   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1600,
    "id": 1600,
    "url": "https://sunnah.com/bukhari:1600",
    "bookNumber": 25,
    "hadithNumber": 86,
    "narrator": "Narrated Isma'li bin Abu Khalid:",
    "english": "`Abdullah bin Abu `Aufa said, \"Allah's Messenger (ﷺ) performed the `Umra. He performed Tawaf of the \nKa`ba and offered two rak`at behind the Maqam (Abraham's place) and was accompanied by those \nwho were screening him from the people.\" Somebody asked `Abdullah, \"Did Allah's Messenger (ﷺ) enter the \nKa`ba?\" `Abdullah replied in the negative.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَمَعَهُ مَنْ يَسْتُرُهُ مِنَ النَّاسِ فَقَالَ لَهُ رَجُلٌ أَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكَعْبَةَ قَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1600In-book reference : Book 25, Hadith 86USC-MSA web (English) reference : Vol. 2, Book 26, Hadith 670   (deprecated numbering scheme)"
  }
]