[
  {
    "hadithGlobalNumber": 6403,
    "id": 6403,
    "url": "https://sunnah.com/bukhari:6403",
    "bookNumber": 80,
    "hadithNumber": 98,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said,\" Whoever says: \"La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul- \nhamd wa huwa 'ala kulli shai'in qadir,\" one hundred times will get the same reward as given for \nmanumitting ten slaves; and one hundred good deeds will be written in his accounts, and one hundred \nsins will be deducted from his accounts, and it (his saying) will be a shield for him from Satan on that \nday till night, and nobody will be able to do a better deed except the one who does more than he.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ‏.‏ فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ، حَتَّى يُمْسِيَ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6403In-book reference : Book 80, Hadith 98USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 412   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6404,
    "id": 6404,
    "url": "https://sunnah.com/bukhari:6404",
    "bookNumber": 80,
    "hadithNumber": 99,
    "narrator": "Narrated `Amr bin Maimun:",
    "english": "Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted \none of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet (ﷺ) saying, \n\"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ مَنْ قَالَ عَشْرًا كَانَ كَمَنْ أَعْتَقَ رَقَبَةً مِنْ وَلَدِ إِسْمَاعِيلَ‏.‏ قَالَ عُمَرُ بْنُ أَبِي زَائِدَةَ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنِ الشَّعْبِيِّ عَنْ رَبِيعِ بْنِ خُثَيْمٍ مِثْلَهُ‏.‏ فَقُلْتُ لِلرَّبِيعِ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنْ عَمْرِو بْنِ مَيْمُونٍ‏.‏ فَأَتَيْتُ عَمْرَو بْنَ مَيْمُونٍ فَقُلْتُ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنِ ابْنِ أَبِي لَيْلَى‏.‏ فَأَتَيْتُ ابْنَ أَبِي لَيْلَى فَقُلْتُ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ يُحَدِّثُهُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي أَيُّوبَ قَوْلَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏     وَقَالَ مُوسَى حَدَّثَنَا وُهَيْبٌ، عَنْ دَاوُدَ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ إِسْمَاعِيلُ عَنِ الشَّعْبِيِّ عَنِ الرَّبِيعِ قَوْلَهُ‏.‏ وَقَالَ آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ سَمِعْتُ هِلاَلَ بْنَ يَسَافٍ عَنِ الرَّبِيعِ بْنِ خُثَيْمٍ وَعَمْرِو بْنِ مَيْمُونٍ عَنِ ابْنِ مَسْعُودٍ قَوْلَهُ‏.‏ وَقَالَ الأَعْمَشُ وَحُصَيْنٌ عَنْ هِلاَلٍ عَنِ الرَّبِيعِ عَنْ عَبْدِ اللَّهِ قَوْلَهُ‏.‏ وَرَوَاهُ أَبُو مُحَمَّدٍ الْحَضْرَمِيُّ عَنْ أَبِي أَيُّوبَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏ كَانَ كَمَنْ أَعْتَقَ رَقَبَةً مِنْ وَلَدِ إِسْمَاعِيلِ  قَالَ أَبُو عَبْد اللَّهِ وَالصَّحِيحُ قَوْلُ عَبْدِ الْمَلِكِ بْنِ عَمْرٍو.‏",
    "reference": "Reference : Sahih al-Bukhari 6404In-book reference : Book 80, Hadith 99USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 413   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6405,
    "id": 6405,
    "url": "https://sunnah.com/bukhari:6405",
    "bookNumber": 80,
    "hadithNumber": 100,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever says, 'Subhan Allah wa bihamdihi,' one hundred times a day, will be \nforgiven all his sins even if they were as much as the foam of the sea.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ‏.‏ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ، وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6405In-book reference : Book 80, Hadith 100USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 414   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6406,
    "id": 6406,
    "url": "https://sunnah.com/bukhari:6406",
    "bookNumber": 80,
    "hadithNumber": 101,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"There are two expressions which are very easy for the tongue to say, but they are \nvery heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- \n`Azim and 'Subhan Allah wa bihamdihi.'\"",
    "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ، سُبْحَانَ اللَّهِ الْعَظِيمِ، سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6406In-book reference : Book 80, Hadith 101USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 415   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6407,
    "id": 6407,
    "url": "https://sunnah.com/bukhari:6407",
    "bookNumber": 80,
    "hadithNumber": 102,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"The example of the one who celebrates the Praises of his Lord (Allah) in \ncomparison to the one who does not celebrate the Praises of his Lord, is that of a living creature \ncompared to a dead one.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِي لاَ يَذْكُرُ مَثَلُ الْحَىِّ وَالْمَيِّتِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6407In-book reference : Book 80, Hadith 102USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 416   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6408,
    "id": 6408,
    "url": "https://sunnah.com/bukhari:6408",
    "bookNumber": 80,
    "hadithNumber": 103,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah 's Apostle said, \"Allah has some angels who look for those who celebrate the Praises of Allah \non the roads and paths. And when they find some people celebrating the Praises of Allah, they call \neach other, saying, \"Come to the object of your pursuit.' \" He added, \"Then the angels encircle them \nwith their wings up to the sky of the world.\" He added. \"(after those people celebrated the Praises of \nAllah, and the angels go back), their Lord, asks them (those angels)----though He knows better than \nthem----'What do My slaves say?' The angels reply, 'They say: Subhan Allah, Allahu Akbar, and \nAlham-du-li l-lah, Allah then says 'Did they see Me?' The angels reply, 'No! By Allah, they didn't see \nYou.' \nAllah says, How it would have been if they saw Me?' The angels reply, 'If they saw You, they would \nworship You more devoutly and celebrate Your Glory more deeply, and declare Your freedom from \nany resemblance to anything more often.' Allah says (to the angels), 'What do they ask Me for?' The \nangels reply, 'They ask You for Paradise.' Allah says (to the angels), 'Did they see it?' The angels say, \n'No! By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The \nangels say, 'If they saw it, they would have greater covetousness for it and would seek It with greater \nzeal and would have greater desire for it.' Allah says, 'From what do they seek refuge?' The angels \nreply, 'They seek refuge from the (Hell) Fire.' Allah says, 'Did they see it?' The angels say, 'No By \nAllah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels \nsay, 'If they saw it they would flee from it with the extreme fleeing and would have extreme fear from \nit.' Then Allah says, 'I make you witnesses that I have forgiven them.\"' Allah's Messenger (ﷺ) added, \"One of \nthe angels would say, 'There was so-and-so amongst them, and he was not one of them, but he had just \ncome for some need.' Allah would say, 'These are those people whose companions will not be reduced \nto misery.' \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ لِلَّهِ مَلاَئِكَةً يَطُوفُونَ فِي الطُّرُقِ، يَلْتَمِسُونَ أَهْلَ الذِّكْرِ، فَإِذَا وَجَدُوا قَوْمًا يَذْكُرُونَ اللَّهَ تَنَادَوْا هَلُمُّوا إِلَى حَاجَتِكُمْ‏.‏ قَالَ فَيَحُفُّونَهُمْ بِأَجْنِحَتِهِمْ إِلَى السَّمَاءِ الدُّنْيَا‏.‏ قَالَ فَيَسْأَلُهُمْ رَبُّهُمْ وَهْوَ أَعْلَمُ مِنْهُمْ مَا يَقُولُ عِبَادِي قَالُوا يَقُولُونَ يُسَبِّحُونَكَ، وَيُكَبِّرُونَكَ، وَيَحْمَدُونَكَ وَيُمَجِّدُونَكَ‏.‏ قَالَ فَيَقُولُ هَلْ رَأَوْنِي قَالَ فَيَقُولُونَ لاَ وَاللَّهِ مَا رَأَوْكَ‏.‏ قَالَ فَيَقُولُ وَكَيْفَ لَوْ رَأَوْنِي قَالَ يَقُولُونَ لَوْ رَأَوْكَ كَانُوا أَشَدَّ لَكَ عِبَادَةً، وَأَشَدَّ لَكَ تَمْجِيدًا، وَأَكْثَرَ لَكَ تَسْبِيحًا‏.‏ قَالَ يَقُولُ فَمَا يَسْأَلُونِي قَالَ يَسْأَلُونَكَ الْجَنَّةَ‏.‏ قَالَ يَقُولُ وَهَلْ رَأَوْهَا قَالَ يَقُولُونَ لاَ وَاللَّهِ يَا رَبِّ مَا رَأَوْهَا‏.‏ قَالَ يَقُولُ فَكَيْفَ لَوْ أَنَّهُمْ رَأَوْهَا قَالَ يَقُولُونَ لَوْ أَنَّهُمْ رَأَوْهَا كَانُوا أَشَدَّ عَلَيْهَا حِرْصًا، وَأَشَدَّ لَهَا طَلَبًا، وَأَعْظَمَ فِيهَا رَغْبَةً‏.‏ قَالَ فَمِمَّ يَتَعَوَّذُونَ قَالَ يَقُولُونَ مِنَ النَّارِ‏.‏ قَالَ يَقُولُ وَهَلْ رَأَوْهَا قَالَ يَقُولُونَ لاَ وَاللَّهِ مَا رَأَوْهَا‏.‏ قَالَ يَقُولُ فَكَيْفَ لَوْ رَأَوْهَا قَالَ يَقُولُونَ لَوْ رَأَوْهَا كَانُوا أَشَدَّ مِنْهَا فِرَارًا، وَأَشَدَّ لَهَا مَخَافَةً‏.‏ قَالَ فَيَقُولُ فَأُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لَهُمْ‏.‏ قَالَ يَقُولُ مَلَكٌ مِنَ الْمَلاَئِكَةِ فِيهِمْ فُلاَنٌ لَيْسَ مِنْهُمْ إِنَّمَا جَاءَ لِحَاجَةٍ‏.‏ قَالَ هُمُ الْجُلَسَاءُ لاَ يَشْقَى بِهِمْ جَلِيسُهُمْ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنِ الأَعْمَشِ وَلَمْ يَرْفَعْهُ‏.‏ وَرَوَاهُ سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6408In-book reference : Book 80, Hadith 103USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 417   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6409,
    "id": 6409,
    "url": "https://sunnah.com/bukhari:6409",
    "bookNumber": 80,
    "hadithNumber": 104,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) started ascending a high place or hill. A man (amongst his companions) ascended it and \nshouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Messenger (ﷺ) was riding \nhis mule. Allah's Messenger (ﷺ) said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu \nMusa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He \nsaid, \"La haul a wala quwwata illa billah,\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ أَخَذَ النَّبِيُّ صلى الله عليه وسلم فِي عَقَبَةٍ ـ أَوْ قَالَ فِي ثَنِيَّةٍ، قَالَ ـ فَلَمَّا عَلاَ عَلَيْهَا رَجُلٌ نَادَى فَرَفَعَ صَوْتَهُ لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ‏.‏ قَالَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى بَغْلَتِهِ قَالَ ‏\"‏ فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ يَا أَبَا مُوسَى ـ أَوْ يَا عَبْدَ اللَّهِ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كَنْزِ الْجَنَّةِ ‏\"‏‏.‏ قُلْتُ بَلَى‏.‏ قَالَ ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6409In-book reference : Book 80, Hadith 104USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 418   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6410,
    "id": 6410,
    "url": "https://sunnah.com/bukhari:6410",
    "bookNumber": 80,
    "hadithNumber": 105,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah has ninety-nine Names, i.e., one hundred minus one, and whoever believes in their meanings \nand acts accordingly, will enter Paradise; and Allah is witr (one) and loves 'the witr' (i.e., odd \nnumbers).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ أَبِي الزِّنَادِ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً قَالَ ‏\n\"‏ لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا، مِائَةٌ إِلاَّ وَاحِدًا، لاَ يَحْفَظُهَا أَحَدٌ إِلاَّ دَخَلَ الْجَنَّةَ، وَهْوَ وَتْرٌ يُحِبُّ الْوَتْرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6410In-book reference : Book 80, Hadith 105USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 419   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6411,
    "id": 6411,
    "url": "https://sunnah.com/bukhari:6411",
    "bookNumber": 80,
    "hadithNumber": 106,
    "narrator": "Narrated Shaqiq:",
    "english": "While we were waiting for `Abdullah (bin Mas`ud). Yazid bin Muawiya came. I said (to him), \"Will \nyou sit down?\" He said, \"No, but I will go into the house (of Ibn Mas`ud) and let your companion (Ibn \nMas`ud) come out to you; and if he should not (come out), I will come out and sit (with you).\" Then \n`Abdullah came out, holding the hand of Yazid, addressed us, saying, \"I know that you are assembled \nhere, but the reason that prevents me from coming out to you, is that Allah's Messenger (ﷺ) used to preach to \nus at intervals during the days, lest we should become bored.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ كُنَّا نَنْتَظِرُ عَبْدَ اللَّهِ إِذْ جَاءَ يَزِيدُ بْنُ مُعَاوِيَةَ فَقُلْنَا أَلاَ تَجْلِسُ قَالَ لاَ وَلَكِنْ أَدْخُلُ فَأُخْرِجُ إِلَيْكُمْ صَاحِبَكُمْ، وَإِلاَّ جِئْتُ أَنَا‏.‏ فَجَلَسْتُ فَخَرَجَ عَبْدُ اللَّهِ وَهْوَ آخِذٌ بِيَدِهِ فَقَامَ عَلَيْنَا فَقَالَ أَمَا إِنِّي أَخْبَرُ بِمَكَانِكُمْ، وَلَكِنَّهُ يَمْنَعُنِي مِنَ الْخُرُوجِ إِلَيْكُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ، كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6411In-book reference : Book 80, Hadith 106USC-MSA web (English) reference : Vol. 8, Book 75, Hadith 420   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6412,
    "id": 6412,
    "url": "https://sunnah.com/bukhari:6412",
    "bookNumber": 81,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said: \"There are two blessings that many people are deceived into losing: health and free time.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ ـ هُوَ ابْنُ أَبِي هِنْدٍ ـ عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ، الصِّحَّةُ وَالْفَرَاغُ ‏\"‏‏.‏\nقَالَ عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِيهِ، سَمِعْتُ ابْنَ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6412In-book reference : Book 81, Hadith 1USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 421   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6413,
    "id": 6413,
    "url": "https://sunnah.com/bukhari:6413",
    "bookNumber": 81,
    "hadithNumber": 2,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"O Allah! There is no life worth living except the life of the Hereafter, so (please) \nmake righteous the Ansar and the Emigrants.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ لاَ عَيْشَ إِلاَّ عَيْشُ الآخِرَة، فَأَصْلِحِ الأَنْصَارَ وَالْمُهَاجِرَة ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6413In-book reference : Book 81, Hadith 2USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 422   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6414,
    "id": 6414,
    "url": "https://sunnah.com/bukhari:6414",
    "bookNumber": 81,
    "hadithNumber": 3,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
    "english": "We were in the company of Allah's Messenger (ﷺ) in (the battle of) Al-Khandaq, and he was digging the \ntrench while we were carrying the earth away. He looked at us and said, \"O Allah! There is no life \nworth living except the life of the Hereafter, so (please) forgive the Ansar and the Emigrants.\"",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ، كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْخَنْدَقِ وَهْوَ يَحْفِرُ وَنَحْنُ نَنْقُلُ التُّرَابَ وَيَمُرُّ بِنَا فَقَالَ ‏\n\"‏ اللَّهُمَّ لاَ عَيْشَ إِلاَّ عَيْشُ الآخِرَهْ، فَاغْفِرْ لِلأَنْصَارِ وَالْمُهَاجِرَهْ ‏\"‏‏.‏ تَابَعَهُ سَهْلُ بْنُ سَعْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6414In-book reference : Book 81, Hadith 3USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 423   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6415,
    "id": 6415,
    "url": "https://sunnah.com/bukhari:6415",
    "bookNumber": 81,
    "hadithNumber": 4,
    "narrator": "Narrated Sahl:",
    "english": "I heard the Prophet (ﷺ) saying, \"A (small) place equal to an area occupied by a whip in Paradise is better \nthan the (whole) world and whatever is in it; and an undertaking (journey) in the forenoon or in the \nafternoon for Allah's Cause, is better than the whole world and whatever is in it.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَوْضِعُ سَوْطٍ فِي الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَغَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6415In-book reference : Book 81, Hadith 4USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 424   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6416,
    "id": 6416,
    "url": "https://sunnah.com/bukhari:6416",
    "bookNumber": 81,
    "hadithNumber": 5,
    "narrator": "Narrated Mujahid:",
    "english": "`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) took hold of my shoulder and said, 'Be in this world as if \nyou were a stranger or a traveler.\" The sub-narrator added: Ibn `Umar used to say, \"If you survive till \nthe evening, do not expect to be alive in the morning, and if you survive till the morning, do not \nexpect to be alive in the evening, and take from your health for your sickness, and (take) from your \nlife for your death.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو الْمُنْذِرِ الطُّفَاوِيُّ، عَنْ سُلَيْمَانَ الأَعْمَشِ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْكِبِي فَقَالَ ‏\n\"‏ كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ، أَوْ عَابِرُ سَبِيلٍ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ إِذَا أَمْسَيْتَ فَلاَ تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلاَ تَنْتَظِرِ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لِمَوْتِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6416In-book reference : Book 81, Hadith 5USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 425   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6417,
    "id": 6417,
    "url": "https://sunnah.com/bukhari:6417",
    "bookNumber": 81,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) drew a square and then drew a line in the middle of it and let it extend outside the square \nand then drew several small lines attached to that central line, and said, \"This is the human being, and \nthis, (the square) in his lease of life, encircles him from all sides (or has encircled him), and this (line), \nwhich is outside (the square), is his hope, and these small lines are the calamities and troubles (which \nmay befall him), and if one misses him, an-other will snap (i.e. overtake) him, and if the other misses \nhim, a third will snap (i.e. overtake) him.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبِي، عَنْ مُنْذِرٍ، عَنْ رَبِيعِ بْنِ خُثَيْمٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ خَطَّ النَّبِيُّ صلى الله عليه وسلم خَطًّا مُرَبَّعًا، وَخَطَّ خَطًّا فِي الْوَسَطِ خَارِجًا مِنْهُ، وَخَطَّ خُطُطًا صِغَارًا إِلَى هَذَا الَّذِي فِي الْوَسَطِ، مِنْ جَانِبِهِ الَّذِي فِي الْوَسَطِ وَقَالَ ‏\n\"‏ هَذَا الإِنْسَانُ، وَهَذَا أَجَلُهُ مُحِيطٌ بِهِ ـ أَوْ قَدْ أَحَاطَ بِهِ ـ وَهَذَا الَّذِي هُوَ خَارِجٌ أَمَلُهُ، وَهَذِهِ الْخُطُطُ الصِّغَارُ الأَعْرَاضُ، فَإِنْ أَخْطَأَهُ هَذَا نَهَشَهُ هَذَا، وَإِنْ أَخْطَأَهُ هَذَا نَهَشَهُ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6417In-book reference : Book 81, Hadith 6USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 426   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6418,
    "id": 6418,
    "url": "https://sunnah.com/bukhari:6418",
    "bookNumber": 81,
    "hadithNumber": 7,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) drew a few lines and said, \"This is (man's) hope, and this is the instant of his death, and \nwhile he is in this state (of hope), the nearer line (death) comes to Him.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ، قَالَ خَطَّ النَّبِيُّ صلى الله عليه وسلم خُطُوطًا فَقَالَ ‏\n\"‏ هَذَا الأَمَلُ وَهَذَا أَجَلُهُ، فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ جَاءَهُ الْخَطُّ الأَقْرَبُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6418In-book reference : Book 81, Hadith 7USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 427   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6419,
    "id": 6419,
    "url": "https://sunnah.com/bukhari:6419",
    "bookNumber": 81,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah will not accept the excuse of any person whose instant of death is delayed till \nhe is sixty years of age.\"",
    "arabic": "حَدَّثَنِي عَبْدُ السَّلاَمِ بْنُ مُطَهَّرٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ مَعْنِ بْنِ مُحَمَّدٍ الْغِفَارِيِّ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَعْذَرَ اللَّهُ إِلَى امْرِئٍ أَخَّرَ أَجَلَهُ حَتَّى بَلَّغَهُ سِتِّينَ سَنَةً ‏\"‏‏.‏ تَابَعَهُ أَبُو حَازِمٍ وَابْنُ عَجْلاَنَ عَنِ الْمَقْبُرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6419In-book reference : Book 81, Hadith 8USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 428   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6420,
    "id": 6420,
    "url": "https://sunnah.com/bukhari:6420",
    "bookNumber": 81,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The heart of an old man remains young in two respects, i.e., his love \nfor the world (its wealth, amusements and luxuries) and his incessant hope.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَزَالُ قَلْبُ الْكَبِيرِ شَابًّا فِي اثْنَتَيْنِ فِي حُبِّ الدُّنْيَا، وَطُولِ الأَمَلِ ‏\"‏‏.‏ قَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ وَابْنُ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدٌ وَأَبُو سَلَمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6420In-book reference : Book 81, Hadith 9USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 429   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6421,
    "id": 6421,
    "url": "https://sunnah.com/bukhari:6421",
    "bookNumber": 81,
    "hadithNumber": 10,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"The son of Adam (i.e. man) grows old and so also two (desires) grow old with \nhim, i.e., love for wealth and (a wish for) a long life.\"",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَكْبَرُ ابْنُ آدَمَ وَيَكْبَرُ مَعَهُ اثْنَانِ حُبُّ الْمَالِ، وَطُولُ الْعُمُرِ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6421In-book reference : Book 81, Hadith 10USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6422,
    "id": 6422,
    "url": "https://sunnah.com/bukhari:6422",
    "bookNumber": 81,
    "hadithNumber": 11,
    "narrator": "Narrated Mahmud bin Ar-Rabi'a:",
    "english": "I remember that the Allah's Messenger (ﷺ) took water from a bucket (which was in our home used for getting water out of well) with his mouth (and threw it on my face).",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، وَزَعَمَ، مَحْمُودٌ أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَالَ وَعَقَلَ مَجَّةً مَجَّهَا مِنْ دَلْوٍ كَانَتْ فِي دَارِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6422In-book reference : Book 81, Hadith 11USC-MSA web (English) reference : Vol. 1, Book 76, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6423,
    "id": 6423,
    "url": "https://sunnah.com/bukhari:6423",
    "bookNumber": 81,
    "hadithNumber": 12,
    "narrator": "Narrated `Utban bin Malik Al-Ansari:",
    "english": "who was one of the men of the tribe of Bani Salim: Allah's Messenger (ﷺ) came to me and said, \"If anybody \ncomes on the Day of Resurrection who has said: La ilaha illal-lah, sincerely, with the intention to win \nAllah's Pleasure, Allah will make the Hell-Fire forbidden for him.\"",
    "arabic": "قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيَّ، ثُمَّ أَحَدَ بَنِي سَالِمٍ قَالَ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَنْ يُوَافِيَ عَبْدٌ يَوْمَ الْقِيَامَةِ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِهِ وَجْهَ اللَّهِ، إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6423In-book reference : Book 81, Hadith 12USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 431   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6424,
    "id": 6424,
    "url": "https://sunnah.com/bukhari:6424",
    "bookNumber": 81,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah says, 'I have nothing to give but Paradise as a reward to my believer \nslave, who, if I cause his dear friend (or relative) to die, remains patient (and hopes for Allah's \nReward).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقُولُ اللَّهُ تَعَالَى مَا لِعَبْدِي الْمُؤْمِنِ عِنْدِي جَزَاءٌ، إِذَا قَبَضْتُ صَفِيَّهُ مِنْ أَهْلِ الدُّنْيَا، ثُمَّ احْتَسَبَهُ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6424In-book reference : Book 81, Hadith 13USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6425,
    "id": 6425,
    "url": "https://sunnah.com/bukhari:6425",
    "bookNumber": 81,
    "hadithNumber": 14,
    "narrator": "Narrated `Amr bin `Auf:",
    "english": "(An ally of the tribe of Bani 'Amir bin Lu'ai and one of those who had witnessed the battle of Badr \nwith Allah's Messenger (ﷺ)) Allah's Messenger (ﷺ) sent Abu 'Ubaida bin AlJarrah to Bahrain to collect the Jizya \ntax. Allah's Messenger (ﷺ) had concluded a peace treaty with the people of Bahrain and appointed Al 'Ala \nbin Al-Hadrami as their chief; Abu Ubaida arrived from Bahrain with the money. The Ansar heard of \nAbu 'Ubaida's arrival which coincided with the Fajr (morning) prayer led by Allah's Messenger (ﷺ). When \nthe Prophet (ﷺ) finished the prayer, they came to him. Allah's Messenger (ﷺ) smiled when he saw them and said, \n\"I think you have heard of the arrival of Abu 'Ubaida and that he has brought something.\" They \nreplied, \"Yes, O Allah's Messenger (ﷺ)! \" He said, \"Have the good news, and hope for what will please you. \nBy Allah, I am not afraid that you will become poor, but I am afraid that worldly wealth will be given \nto you in abundance as it was given to those (nations) before you, and you will start competing each \nother for it as the previous nations competed for it, and then it will divert you (from good) as it \ndiverted them.\" '",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهْوَ حَلِيفٌ لِبَنِي عَامِرِ بْنِ لُؤَىٍّ كَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ إِلَى الْبَحْرَيْنِ يَأْتِي بِجِزْيَتِهَا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ صَالَحَ أَهْلَ الْبَحْرَيْنِ، وَأَمَّرَ عَلَيْهِمُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، فَقَدِمَ أَبُو عُبَيْدَةَ بِمَالٍ مِنَ الْبَحْرَيْنِ، فَسَمِعَتِ الأَنْصَارُ بِقُدُومِهِ فَوَافَتْهُ صَلاَةَ الصُّبْحِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا انْصَرَفَ تَعَرَّضُوا لَهُ فَتَبَسَّمَ حِينَ رَآهُمْ وَقَالَ ‏\"‏ أَظُنُّكُمْ سَمِعْتُمْ بِقُدُومِ أَبِي عُبَيْدَةَ، وَأَنَّهُ جَاءَ بِشَىْءٍ ‏\"‏‏.‏ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ، فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ، وَلَكِنْ أَخْشَى عَلَيْكُمْ أَنْ تُبْسَطَ عَلَيْكُمُ الدُّنْيَا، كَمَا بُسِطَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ، فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا وَتُلْهِيَكُمْ كَمَا أَلْهَتْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6425In-book reference : Book 81, Hadith 14USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 433   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6426,
    "id": 6426,
    "url": "https://sunnah.com/bukhari:6426",
    "bookNumber": 81,
    "hadithNumber": 15,
    "narrator": "Narrated `Uqba bin 'Amir:",
    "english": "The Prophet (ﷺ) went out and offered the funeral prayer for the martyrs of the (battle of) Uhud and then \nascended the pulpit and said, \"I am your predecessor and I am a witness against you. By Allah, I am \nnow looking at my Tank-lake (Al-Kauthar) and I have been given the keys of the treasures of the earth \n(or the keys of the earth). By Allah! I am not afraid that after me you will worship others besides \nAllah, but I am afraid that you will start competing for (the pleasures of) this world.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطُكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي قَدْ أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنِّي أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6426In-book reference : Book 81, Hadith 15USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6427,
    "id": 6427,
    "url": "https://sunnah.com/bukhari:6427",
    "bookNumber": 81,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"The thing I am afraid of most for your sake, is the worldly blessings which \nAllah will bring forth to you.\" It was said, \"What are the blessings of this world?\" The Prophet (ﷺ) said, \n\"The pleasures of the world.\" A man said, \"Can the good bring forth evil?\" The Prophet (ﷺ) kept quiet for \na while till we thought that he was being inspired divinely. Then he started removing the sweat from \nhis forehead and said,\" Where is the questioner?\" That man said, \"I (am present).\" Abu Sa`id added: \nWe thanked the man when the result (of his question) was such. The Prophet (ﷺ) said, \"Good never brings \nforth but good. This wealth (of the world) is (like) green and sweet (fruit), and all the vegetation \nwhich grows on the bank of a stream either kills or nearly kills the animal that eats too much of it, \nexcept the animal that eats the Khadira (a kind of vegetation). Such an animal eats till its stomach is \nfull and then it faces the sun and starts ruminating and then it passes out dung and urine and goes to \neat again. This worldly wealth is (like) sweet (fruit), and if a person earns it (the wealth) in a legal way \nand spends it properly, then it is an excellent helper, and whoever earns it in an illegal way, he will be \nlike the one who eats but is never satisfied.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَكْثَرَ مَا أَخَافُ عَلَيْكُمْ مَا يُخْرِجُ اللَّهُ لَكُمْ مِنْ بَرَكَاتِ الأَرْضِ ‏\"‏‏.‏ قِيلَ وَمَا بَرَكَاتُ الأَرْضِ قَالَ ‏\"‏ زَهْرَةُ الدُّنْيَا ‏\"‏‏.‏ فَقَالَ لَهُ رَجُلٌ هَلْ يَأْتِي الْخَيْرُ بِالشَّرِّ فَصَمَتَ النَّبِيُّ صلى الله عليه وسلم حَتَّى ظَنَنَّا أَنَّهُ يُنْزَلُ عَلَيْهِ، ثُمَّ جَعَلَ يَمْسَحُ عَنْ جَبِينِهِ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏‏.‏ قَالَ أَنَا‏.‏ قَالَ أَبُو سَعِيدٍ لَقَدْ حَمِدْنَاهُ حِينَ طَلَعَ ذَلِكَ‏.‏ قَالَ ‏\"‏ لاَ يَأْتِي الْخَيْرُ إِلاَّ بِالْخَيْرِ، إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، وَإِنَّ كُلَّ مَا أَنْبَتَ الرَّبِيعُ يَقْتُلُ حَبَطًا أَوْ يُلِمُّ، إِلاَّ آكِلَةَ الْخَضِرَةِ، أَكَلَتْ حَتَّى إِذَا امْتَدَّتْ خَاصِرَتَاهَا اسْتَقْبَلَتِ الشَّمْسَ، فَاجْتَرَّتْ وَثَلَطَتْ وَبَالَتْ، ثُمَّ عَادَتْ فَأَكَلَتْ، وَإِنَّ هَذَا الْمَالَ حُلْوَةٌ، مَنْ أَخَذَهُ بِحَقِّهِ وَوَضَعَهُ فِي حَقِّهِ، فَنِعْمَ الْمَعُونَةُ هُوَ، وَمَنْ أَخَذَهُ بِغَيْرِ حَقِّهِ، كَانَ الَّذِي يَأْكُلُ وَلاَ يَشْبَعُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6427In-book reference : Book 81, Hadith 16USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6428,
    "id": 6428,
    "url": "https://sunnah.com/bukhari:6428",
    "bookNumber": 81,
    "hadithNumber": 17,
    "narrator": "Narrated Zahdam bin Mudarrib:",
    "english": "`Imran bin Husain said: The Prophet (ﷺ) said, \"The best people are my contemporaries (i.e., the present \n(my) generation) and then those who come after them (i.e., the next generation).\" `Imran added: I am \nnot sure whether the Prophet (ﷺ) repeated the statement twice after his first saying. The Prophet (ﷺ) added, \n\"And after them there will come people who will bear witness, though they will not be asked to give \ntheir witness; and they will be treacherous and nobody will trust them, and they will make vows, but \nwill not fulfill them, and fatness will appear among them.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا جَمْرَةَ، قَالَ حَدَّثَنِي زَهْدَمُ بْنُ مُضَرِّبٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ خَيْرُكُمْ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ فَمَا أَدْرِي قَالَ النَّبِيُّ صلى الله عليه وسلم بَعْدَ قَوْلِهِ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏\"‏ ثُمَّ يَكُونُ بَعْدَهُمْ قَوْمٌ يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَنْذِرُونَ وَلاَ يَفُونَ وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6428In-book reference : Book 81, Hadith 17USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 436   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6429,
    "id": 6429,
    "url": "https://sunnah.com/bukhari:6429",
    "bookNumber": 81,
    "hadithNumber": 18,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"The best people are those of my generation, and then those who will come after \nthem (the next generation), and then those who will come after them (i.e. the next generation), and \nthen after them, there will come people whose witness will precede their oaths, and whose oaths will \nprecede their witness.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ مِنْ بَعْدِهِمْ قَوْمٌ تَسْبِقُ شَهَادَتُهُمْ أَيْمَانَهُمْ وَأَيْمَانُهُمْ شَهَادَتَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6429In-book reference : Book 81, Hadith 18USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 437   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6430,
    "id": 6430,
    "url": "https://sunnah.com/bukhari:6430",
    "bookNumber": 81,
    "hadithNumber": 19,
    "narrator": "Narrated Qais:",
    "english": "I heard Khabbab, who had branded his `Abdomen with seven brands, saying, \"Had Allah's Messenger (ﷺ) not \nforbidden us to invoke Allah for death, I would have invoked Allah for death. The companions of \nMuhammad have left this world without taking anything of their reward in it (i.e., they will have \nperfect reward in the Hereafter), but we have collected of the worldly wealth what we cannot spend \nbut on earth (i.e. on building houses).",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ خَبَّابًا، وَقَدِ اكْتَوَى يَوْمَئِذٍ سَبْعًا فِي بَطْنِهِ وَقَالَ لَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِالْمَوْتِ، إِنَّ أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم مَضَوْا وَلَمْ تَنْقُصْهُمُ الدُّنْيَا بِشَىْءٍ، وَإِنَّا أَصَبْنَا مِنَ الدُّنْيَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6430In-book reference : Book 81, Hadith 19USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 438   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6431,
    "id": 6431,
    "url": "https://sunnah.com/bukhari:6431",
    "bookNumber": 81,
    "hadithNumber": 20,
    "narrator": "Narrated Qais:",
    "english": "I came to Khabbab while he was building a wall, and he (Khabbab) said, \"Our companions who have \nleft this world, did not enjoy anything of their reward therein, while we have collected after them, \nmuch wealth that we cannot spend but on earth (i.e., on building).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، قَالَ أَتَيْتُ خَبَّابًا وَهْوَ يَبْنِي حَائِطًا لَهُ فَقَالَ إِنَّ أَصْحَابَنَا الَّذِينَ مَضَوْا لَمْ تَنْقُصْهُمُ الدُّنْيَا شَيْئًا، وَإِنَّا أَصَبْنَا مِنْ بَعْدِهِمْ شَيْئًا، لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6431In-book reference : Book 81, Hadith 20USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 439   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6432,
    "id": 6432,
    "url": "https://sunnah.com/bukhari:6432",
    "bookNumber": 81,
    "hadithNumber": 21,
    "narrator": "Narrated Khabbab:",
    "english": "We migrated with the Prophet..(This narration is related in the chapter of migration).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ خَبَّاب ٍ ـ رضى الله عنه ـ قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6432In-book reference : Book 81, Hadith 21USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 440   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6433,
    "id": 6433,
    "url": "https://sunnah.com/bukhari:6433",
    "bookNumber": 81,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He \nperformed the ablution in a perfect way and said, \"I saw the Prophet (ﷺ) performing the ablution in this \nplace and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done \nthis time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting \nfor the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet (ﷺ) \nfurther added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
    "arabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْقُرَشِيِّ، قَالَ أَخْبَرَنِي مُعَاذُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ ابْنَ أَبَانَ، أَخْبَرَهُ قَالَ أَتَيْتُ عُثْمَانَ بِطَهُورٍ وَهْوَ جَالِسٌ عَلَى الْمَقَاعِدِ، فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ وَهْوَ فِي هَذَا الْمَجْلِسِ، فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ ‏\"‏ مَنْ تَوَضَّأَ مِثْلَ هَذَا الْوُضُوءِ، ثُمَّ أَتَى الْمَسْجِدَ فَرَكَعَ رَكْعَتَيْنِ، ثُمَّ جَلَسَ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ قَالَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَغْتَرُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6433In-book reference : Book 81, Hadith 22USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 441   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6434,
    "id": 6434,
    "url": "https://sunnah.com/bukhari:6434",
    "bookNumber": 81,
    "hadithNumber": 23,
    "narrator": "Narrated Mirdas Al-Aslami:",
    "english": "The Prophet (ﷺ) said, \"The righteous (pious people will depart (die) in succession one after the other, and \nthere will remain (on the earth) useless people like the useless husk of barley seeds or bad dates.",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ بَيَانٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ مِرْدَاسٍ الأَسْلَمِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَذْهَبُ الصَّالِحُونَ الأَوَّلُ فَالأَوَّلُ، وَيَبْقَى حُفَالَةٌ كَحُفَالَةِ الشَّعِيرِ أَوِ التَّمْرِ، لاَ يُبَالِيهِمُ اللَّهُ بَالَةً ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ حُفَالَةٌ وَحُثَالَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6434In-book reference : Book 81, Hadith 23USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 442   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6435,
    "id": 6435,
    "url": "https://sunnah.com/bukhari:6435",
    "bookNumber": 81,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Perish the slave of Dinar, Dirham, Qatifa (thick soft cloth), and Khamisa (a \ngarment), for if he is given, he is pleased; otherwise he is dissatisfied.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَعِسَ عَبْدُ الدِّينَارِ وَالدِّرْهَمِ وَالْقَطِيفَةِ وَالْخَمِيصَةِ، إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6435In-book reference : Book 81, Hadith 24USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 443   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6436,
    "id": 6436,
    "url": "https://sunnah.com/bukhari:6436",
    "bookNumber": 81,
    "hadithNumber": 25,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I heard the Prophet (ﷺ) saying, \"If the son of Adam (the human being) had two valleys of money, he would \nwish for a third, for nothing can fill the belly of Adam's son except dust, and Allah forgives him who \nrepents to Him.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَوْ كَانَ لاِبْنِ آدَمَ وَادِيَانِ مِنْ مَالٍ لاَبْتَغَى ثَالِثًا، وَلاَ يَمْلأُ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6436In-book reference : Book 81, Hadith 25USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 444   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6437,
    "id": 6437,
    "url": "https://sunnah.com/bukhari:6437",
    "bookNumber": 81,
    "hadithNumber": 26,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"If the son of Adam had money equal to a valley, then he will wish for \nanother similar to it, for nothing can satisfy the eye of Adam's son except dust. And Allah forgives \nhim who repents to Him.\" Ibn `Abbas said: I do not know whether this saying was quoted from the \nQur'an or not. `Ata' said, \"I heard Ibn AzZubair saying this narration while he was on the pulpit.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَوْ أَنَّ لاِبْنِ آدَمَ مِثْلَ وَادٍ مَالاً لأَحَبَّ أَنَّ لَهُ إِلَيْهِ مِثْلَهُ، وَلاَ يَمْلأُ عَيْنَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ فَلاَ أَدْرِي مِنَ الْقُرْآنِ هُوَ أَمْ لاَ‏.‏ قَالَ وَسَمِعْتُ ابْنَ الزُّبَيْرِ يَقُولُ ذَلِكَ عَلَى الْمِنْبَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6437In-book reference : Book 81, Hadith 26USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 445   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6438,
    "id": 6438,
    "url": "https://sunnah.com/bukhari:6438",
    "bookNumber": 81,
    "hadithNumber": 27,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "I heard Ibn Az-Zubair who was on the pulpit at Mecca, delivering a sermon, saying, \"O men! The \nProphet used to say, \"If the son of Adam were given a valley full of gold, he would love to have a \nsecond one; and if he were given the second one, he would love to have a third, for nothing fills the \nbelly of Adam's son except dust. And Allah forgives he who repents to Him.\" Ubai said, \"We \nconsidered this as a saying from the Qur'an till the Sura (beginning with) 'The mutual rivalry for piling \nup of worldly things diverts you..' (102.1) was revealed.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ الْغَسِيلِ، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، عَلَى الْمِنْبَرِ بِمَكَّةَ فِي خُطْبَتِهِ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ لَوْ أَنَّ ابْنَ آدَمَ أُعْطِيَ وَادِيًا مَلأً مِنْ ذَهَبٍ أَحَبَّ إِلَيْهِ ثَانِيًا، وَلَوْ أُعْطِيَ ثَانِيًا أَحَبَّ إِلَيْهِ ثَالِثًا، وَلاَ يَسُدُّ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6438In-book reference : Book 81, Hadith 27USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6439,
    "id": 6439,
    "url": "https://sunnah.com/bukhari:6439",
    "bookNumber": 81,
    "hadithNumber": 28,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"If Adam's son had a valley full of gold, he would like to have two valleys, for \nnothing fills his mouth except dust. And Allah forgives him who repents to Him.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ أَنَّ لاِبْنِ آدَمَ وَادِيًا مِنْ ذَهَبٍ أَحَبَّ أَنْ يَكُونَ لَهُ وَادِيَانِ، وَلَنْ يَمْلأَ فَاهُ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6439In-book reference : Book 81, Hadith 28USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6440,
    "id": 6440,
    "url": "https://sunnah.com/bukhari:6440",
    "bookNumber": 81,
    "hadithNumber": 29,
    "narrator": "'Ubayy said (referring to the hadith above), \"We considered this as a saying from the Qur'an till the Surah (beginning with):",
    "english": "\"The mutual rivalry (for piling up of worldly things) diverts you' (102:1) was revealed.\"",
    "arabic": "وَقَالَ لَنَا أَبُو الْوَلِيدِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أُبَىٍّ، قَالَ كُنَّا نَرَى هَذَا مِنَ الْقُرْآنِ حَتَّى نَزَلَتْ ‏{‏أَلْهَاكُمُ التَّكَاثُرُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 6440In-book reference : Book 81, Hadith 29USC-MSA web (English) reference : Vol. 1, Book 76, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6441,
    "id": 6441,
    "url": "https://sunnah.com/bukhari:6441",
    "bookNumber": 81,
    "hadithNumber": 30,
    "narrator": "Narrated Hakim bin Hizam:",
    "english": "I asked the Prophet (for some money) and he gave me, and then again I asked him and he gave me, \nand then again I asked him and he gave me and he then said, \"This wealth is (like) green and sweet \n(fruit), and whoever takes it without greed, Allah will bless it for him, but whoever takes it with greed, \nAllah will not bless it for him, and he will be like the one who eats but is never satisfied. And the \nupper (giving) hand is better than the lower (taking) hand.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ أَخْبَرَنِي عُرْوَةُ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ قَالَ ‏\n\"‏ هَذَا الْمَالُ ـ وَرُبَّمَا قَالَ سُفْيَانُ قَالَ لِي يَا حَكِيمُ ـ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6441In-book reference : Book 81, Hadith 30USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 448   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6442,
    "id": 6442,
    "url": "https://sunnah.com/bukhari:6442",
    "bookNumber": 81,
    "hadithNumber": 31,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Who among you considers the wealth of his heirs dearer to him than his own \nwealth?\" They replied, \"O Allah's Messenger (ﷺ)! There is none among us but loves his own wealth more.\" \nThe Prophet (ﷺ) said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good \ndeeds) while the wealth of his heirs is whatever he leaves after his death.\"",
    "arabic": "حَدَّثَنِي عُمَرُ بْنُ حَفْصٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ التَّيْمِيُّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، قَالَ عَبْدُ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّكُمْ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا مِنَّا أَحَدٌ إِلاَّ مَالُهُ أَحَبُّ إِلَيْهِ‏.‏ قَالَ ‏\"‏ فَإِنَّ مَالَهُ مَا قَدَّمَ، وَمَالُ وَارِثِهِ مَا أَخَّرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6442In-book reference : Book 81, Hadith 31USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6443,
    "id": 6443,
    "url": "https://sunnah.com/bukhari:6443",
    "bookNumber": 81,
    "hadithNumber": 32,
    "narrator": "Narrated Abu Dhar:",
    "english": "Once I went out at night and found Allah's Messenger (ﷺ) walking all alone accompanied by nobody, and I \nthought that perhaps he disliked that someone should accompany him. So I walked in the shade, away \nfrom the moonlight, but the Prophet (ﷺ) looked behind and saw me and said, \"Who is that?\" I replied, \n\"Abu Dhar, let Allah get me sacrificed for you!\" He said, \"O Abu Dhar, come here!\" So I \naccompanied him for a while and then he said, \"The rich are in fact the poor (little rewarded) on the \nDay of Resurrection except him whom Allah gives wealth which he gives (in charity) to his right, left, \nfront and back, and does good deeds with it. I walked with him a little longer. Then he said to me, \"Sit \ndown here.\" So he made me sit in an open space surrounded by rocks, and said to me, \"Sit here till I \ncome back to you.\" He went towards Al-Harra till I could not see him, and he stayed away for a long \nperiod, and then I heard him saying, while he was coming, \"Even if he had committed theft, and even \nif he had committed illegal sexual intercourse?\" When he came, I could not remain patient and asked \nhim, \"O Allah's Prophet! Let Allah get me sacrificed for you! Whom were you speaking to by the side \nof Al-Harra? I did not hear anybody responding to your talk.\" He said, \"It was Gabriel who appeared \nto me beside Al-Harra and said, 'Give the good news to your followers that whoever dies without \nhaving worshipped anything besides Allah, will enter Paradise.' I said, 'O Gabriel! Even if he had \ncommitted theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has \ncommitted theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has \ncommitted theft or committed illegal sexual intercourse?' He said, 'Yes.' \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ خَرَجْتُ لَيْلَةً مِنَ اللَّيَالِي فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي وَحْدَهُ، وَلَيْسَ مَعَهُ إِنْسَانٌ ـ قَالَ ـ فَظَنَنْتُ أَنَّهُ يَكْرَهُ أَنْ يَمْشِيَ مَعَهُ أَحَدٌ ـ قَالَ ـ فَجَعَلْتُ أَمْشِي فِي ظِلِّ الْقَمَرِ فَالْتَفَتَ فَرَآنِي فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏‏.‏ قُلْتُ أَبُو ذَرٍّ جَعَلَنِي اللَّهُ فِدَاءَكَ‏.‏ قَالَ ‏\"‏ يَا أَبَا ذَرٍّ تَعَالَهْ ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ ‏\"‏ إِنَّ الْمُكْثِرِينَ هُمُ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ، إِلاَّ مَنْ أَعْطَاهُ اللَّهُ خَيْرًا، فَنَفَحَ فِيهِ يَمِينَهُ وَشِمَالَهُ وَبَيْنَ يَدَيْهِ وَوَرَاءَهُ، وَعَمِلَ فِيهِ خَيْرًا ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا ‏\"‏‏.‏ قَالَ فَأَجْلَسَنِي فِي قَاعٍ حَوْلَهُ حِجَارَةٌ فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا حَتَّى أَرْجِعَ إِلَيْكَ ‏\"‏‏.‏ قَالَ فَانْطَلَقَ فِي الْحَرَّةِ حَتَّى لاَ أَرَاهُ فَلَبِثَ عَنِّي فَأَطَالَ اللُّبْثَ، ثُمَّ إِنِّي سَمِعْتُهُ وَهْوَ مُقْبِلٌ وَهْوَ يَقُولُ ‏\"‏ وَإِنْ سَرَقَ وَإِنْ زَنَى ‏\"‏‏.‏ قَالَ فَلَمَّا جَاءَ لَمْ أَصْبِرْ حَتَّى قُلْتُ يَا نَبِيَّ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ مَنْ تُكَلِّمُ فِي جَانِبِ الْحَرَّةِ مَا سَمِعْتُ أَحَدًا يَرْجِعُ إِلَيْكَ شَيْئًا‏.‏ قَالَ ‏\"‏ ذَلِكَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ عَرَضَ لِي فِي جَانِبِ الْحَرَّةِ، قَالَ بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ، قُلْتُ يَا جِبْرِيلُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ‏.‏ قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ، وَإِنْ شَرِبَ الْخَمْرَ. قَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، وَحَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، وَالأَعْمَشُ، وَعَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، بِهَذَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ حَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي الدَّرْدَاءِ، مُرْسَلٌ، لاَ يَصِحُّ، إِنَّمَا أَرَدْنَا لِلْمَعْرِفَةِ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ قِيلَ لأَبِي عَبْدِ اللَّهِ حَدِيثُ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي الدَّرْدَاءِ قَالَ مُرْسَلٌ أَيْضًا لاَ يَصِحُّ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ وَقَالَ اضْرِبُوا عَلَى حَدِيثِ أَبِي الدَّرْدَاءِ هَذَا‏.‏ إِذَا مَاتَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عِنْدَ الْمَوْتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6443In-book reference : Book 81, Hadith 32USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 450   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6444,
    "id": 6444,
    "url": "https://sunnah.com/bukhari:6444",
    "bookNumber": 81,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Dhar:",
    "english": "While I was walking with the Prophet (ﷺ) in the Harra of Medina, Uhud came in sight. The Prophet (ﷺ) said, \n\"O Abu Dhar!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"I would not like to have gold equal to \nthis mountain of Uhud, unless nothing of it, not even a single Dinar of it remains with me for more \nthan three days, except something which I will keep for repaying debts. I would have spent all of it \n(distributed it) amongst Allah's Slaves like this, and like this, and like this.\" The Prophet (ﷺ) pointed out \nwith his hand towards his right, his left and his back (while illustrating it). He proceeded with his walk \nand said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except those who \nspend their wealth like this, and like this, and like this, to their right, left and back, but such people are \nfew in number.\" Then he said to me, \"Stay at your place and do not leave it till I come back.\" Then he \nproceeded in the darkness of the night till he went out of sight, and then I heard a loud voice, and was \nafraid that something might have happened to the Prophet (ﷺ) .1 intended to go to him, but I remembered \nwhat he had said to me, i.e. 'Don't leave your place till I come back to you,' so I remained at my place \ntill he came back to me. I said, \"O Allah's Messenger (ﷺ)! I heard a voice and I was afraid.\" So I mentioned \nthe whole story to him. He said, \"Did you hear it?\" I replied, \"Yes.\" He said, \"It was Gabriel who \ncame to me and said, 'Whoever died without joining others in worship with Allah, will enter Paradise.' \nI asked (Gabriel), 'Even if he had committed theft or committed illegal sexual intercourse? Gabriel \nsaid, 'Yes, even if he had committed theft or committed illegal sexual intercourse.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ قَالَ أَبُو ذَرٍّ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرَّةِ الْمَدِينَةِ فَاسْتَقْبَلَنَا أُحُدٌ فَقَالَ ‏\"‏ يَا أَبَا ذَرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ مَا يَسُرُّنِي أَنَّ عِنْدِي مِثْلَ أُحُدٍ هَذَا ذَهَبًا، تَمْضِي عَلَىَّ ثَالِثَةٌ وَعِنْدِي مِنْهُ دِينَارٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ، إِلاَّ أَنْ أَقُولَ بِهِ فِي عِبَادِ اللَّهِ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ‏.‏ ثُمَّ مَشَى فَقَالَ ‏\"‏ إِنَّ الأَكْثَرِينَ هُمُ الأَقَلُّونَ يَوْمَ الْقِيَامَةِ إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ـ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ ـ وَقَلِيلٌ مَا هُمْ ‏\"‏‏.‏ ثُمَّ قَالَ لِي ‏\"‏ مَكَانَكَ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏‏.‏ ثُمَّ انْطَلَقَ فِي سَوَادِ اللَّيْلِ حَتَّى تَوَارَى فَسَمِعْتُ صَوْتًا قَدِ ارْتَفَعَ، فَتَخَوَّفْتُ أَنْ يَكُونَ قَدْ عَرَضَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَرَدْتُ أَنْ آتِيَهُ فَذَكَرْتُ قَوْلَهُ لِي ‏\"‏ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏ فَلَمْ أَبْرَحْ حَتَّى أَتَانِي، قُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ سَمِعْتُ صَوْتًا تَخَوَّفْتُ، فَذَكَرْتُ لَهُ فَقَالَ ‏\"‏ وَهَلْ سَمِعْتَهُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ ذَاكَ جِبْرِيلُ أَتَانِي فَقَالَ مَنْ مَاتَ مِنْ أُمَّتِكَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6444In-book reference : Book 81, Hadith 33USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6445,
    "id": 6445,
    "url": "https://sunnah.com/bukhari:6445",
    "bookNumber": 81,
    "hadithNumber": 34,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah Apostle said, \"If I had gold equal to the mountain of Uhud, it would not please me that anything \nof it should remain with me after three nights (i.e., I would spend all of it in Allah's Cause) except \nwhat I would keep for repaying debts.\"",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا لَسَرَّنِي أَنْ لاَ تَمُرَّ عَلَىَّ ثَلاَثُ لَيَالٍ وَعِنْدِي مِنْهُ شَىْءٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6445In-book reference : Book 81, Hadith 34USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6446,
    "id": 6446,
    "url": "https://sunnah.com/bukhari:6446",
    "bookNumber": 81,
    "hadithNumber": 35,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Wealth is not in having many possessions, but rather (true) wealth is feeling sufficiency in the soul.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ، وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6446In-book reference : Book 81, Hadith 35USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 453   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6447,
    "id": 6447,
    "url": "https://sunnah.com/bukhari:6447",
    "bookNumber": 81,
    "hadithNumber": 36,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`id:",
    "english": "A man passed by Allah's Messenger (ﷺ) and the Prophet (ﷺ) asked a man sitting beside him, \"What is your \nopinion about this (passer-by)?\" He replied, \"This (passer-by) is from the noble class of people. By \nAllah, if he should ask for a lady's hand in marriage, he ought to be given her in marriage, and if he \nintercedes for somebody, his intercession will be accepted. Allah's Messenger (ﷺ) kept quiet, and then \nanother man passed by and Allah's Messenger (ﷺ) asked the same man (his companion) again, \"What is your \nopinion about this (second) one?\" He said, \"O Allah's Messenger (ﷺ)! This person is one of the poor \nMuslims. If he should ask a lady's hand in marriage, no-one will accept him, and if he intercedes for \nsomebody, no one will accept his intercession, and if he talks, no-one will listen to his talk.\" Then \nAllah's Messenger (ﷺ) said, \"This (poor man) is better than such a large number of the first type (i.e. rich \nmen) as to fill the earth.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّهُ قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ جَالِسٍ ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ أَشْرَافِ النَّاسِ، هَذَا وَاللَّهِ حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ‏.‏ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ مَرَّ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ مِنْ فُقَرَاءِ الْمُسْلِمِينَ، هَذَا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْمَعَ لِقَوْلِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6447In-book reference : Book 81, Hadith 36USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 454   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6448,
    "id": 6448,
    "url": "https://sunnah.com/bukhari:6448",
    "bookNumber": 81,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Wail:",
    "english": "We paid a visit to Khabbab who was sick, and he said, \"We migrated with the Prophet (ﷺ) for Allah's \nSake and our wages became due on Allah. Some of us died without having received anything of the \nwages, and one of them was Mus`ab bin `Umar, who was martyred on the day of the battle of Uhud, \nleaving only one sheet (to shroud him in). If we covered his head with it, his feet became uncovered, \nand if we covered his feet with it, his head became uncovered. So the Prophet (ﷺ) ordered us to cover his \nhead with it and put some Idhkhir (a kind of grass) over his feet. On the other hand, some of us have \nhad the fruits (of our good deed) and are plucking them (in this world).",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ عُدْنَا خَبَّابًا فَقَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نُرِيدُ وَجْهَ اللَّهِ، فَوَقَعَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَضَى لَمْ يَأْخُذْ مِنْ أَجْرِهِ، مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ، وَتَرَكَ نَمِرَةً فَإِذَا غَطَّيْنَا رَأْسَهُ بَدَتْ رِجْلاَهُ، وَإِذَا غَطَّيْنَا رِجْلَيْهِ بَدَا رَأْسُهُ، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُغَطِّيَ رَأْسَهُ، وَنَجْعَلَ عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدُبُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6448In-book reference : Book 81, Hadith 37USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6449,
    "id": 6449,
    "url": "https://sunnah.com/bukhari:6449",
    "bookNumber": 81,
    "hadithNumber": 38,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "The Prophet (ﷺ) said, \"I looked into Paradise and found that the majority of its dwellers were the poor \npeople, and I looked into the (Hell) Fire and found that the majority of its dwellers were women.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ تَابَعَهُ أَيُّوبُ وَعَوْفٌ، وَقَالَ صَخْرٌ وَحَمَّادُ بْنُ نَجِيحٍ عَنْ أَبِي رَجَاءٍ عَنِ ابْنِ عَبَّاسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6449In-book reference : Book 81, Hadith 38USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6450,
    "id": 6450,
    "url": "https://sunnah.com/bukhari:6450",
    "bookNumber": 81,
    "hadithNumber": 39,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) did not eat at a table till he died, and he did not eat a thin nicely baked wheat bread till he \ndied.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمْ يَأْكُلِ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ حَتَّى مَاتَ، وَمَا أَكَلَ خُبْزًا مُرَقَّقًا حَتَّى مَاتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6450In-book reference : Book 81, Hadith 39USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 457   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6451,
    "id": 6451,
    "url": "https://sunnah.com/bukhari:6451",
    "bookNumber": 81,
    "hadithNumber": 40,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) died, nothing which can be eaten by a living creature was left on my shelf except \nsome barley grain. I ate of it for a period and when I measured it, it finished.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَقَدْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَمَا فِي رَفِّي مِنْ شَىْءٍ يَأْكُلُهُ ذُو كَبِدٍ، إِلاَّ شَطْرُ شَعِيرٍ فِي رَفٍّ لِي، فَأَكَلْتُ مِنْهُ حَتَّى طَالَ عَلَىَّ، فَكِلْتُهُ، فَفَنِيَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6451In-book reference : Book 81, Hadith 40USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6452,
    "id": 6452,
    "url": "https://sunnah.com/bukhari:6452",
    "bookNumber": 81,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Huraira:",
    "english": "By Allah except Whom none has the right to- be worshipped, (sometimes) I used to lay (sleep) on the \nground on my liver (abdomen) because of hunger, and (sometimes) I used to bind a stone over my \nbelly because of hunger. One day I sat by the way from where they (the Prophet (ﷺ) and his companions) \nused to come out. When Abu Bakr passed by, I asked him about a Verse from Allah's Book and I \nasked him only that he might satisfy my hunger, but he passed by and did not do so. Then `Umar \npassed by me and I asked him about a Verse from Allah's Book, and I asked him only that he might \nsatisfy my hunger, but he passed by without doing so. Finally Abu-l-Qasim (the Prophet (ﷺ) ) passed by \nme and he smiled when he saw me, for he knew what was in my heart and on my face. He said, \"O \nAba Hirr (Abu Huraira)!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said to me, \"Follow me.\" He left \nand I followed him. \nThen he entered the house and I asked permission to enter and was admitted. He found milk in a bowl \nand said, \"From where is this milk?\" They said, \"It has been presented to you by such-and-such man \n(or by such and such woman).\" He said, \"O Aba Hirr!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \n\"Go and call the people of Suffa to me.\" These people of Suffa were the guests of Islam who had no \nfamilies, nor money, nor anybody to depend upon, and whenever an object of charity was brought to \nthe Prophet, he would send it to them and would not take anything from it, and whenever any present \nwas given to him, he used to send some for them and take some of it for himself. The order of the \nProphet upset me, and I said to myself, \"How will this little milk be enough for the people of As- \nSuffa? though I was more entitled to drink from that milk in order to strengthen myself\", but behold! \nThe Prophet (ﷺ) came to order me to give that milk to them. I wondered what will remain of that milk for \nme, but anyway, I could not but obey Allah and His Apostle so I went to the people of As-Suffa and \ncalled them, and they came and asked the Prophet's permission to enter. They were admitted and took \ntheir seats in the house. \nThe Prophet (ﷺ) said, \"O Aba-Hirr!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"Take it and give it to \nthem.\" So I took the bowl (of milk) and started giving it to one man who would drink his fill and \nreturn it to me, whereupon I would give it to another man who, in his turn, would drink his fill and \nreturn it to me, and I would then offer it to another man who would drink his fill and return it to me. \nFinally, after the whole group had drunk their fill, I reached the Prophet (ﷺ) who took the bowl and put it \non his hand, looked at me and smiled and said. \"O Aba Hirr!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ)!\" \nHe said, \"There remain you and I.\" I said, \"You have said the truth, O Allah's Messenger (ﷺ)!\" He said, \"Sit \ndown and drink.\" I sat down and drank. He said, \"Drink,\" and I drank. He kept on telling me \nrepeatedly to drink, till I said, \"No. by Allah Who sent you with the Truth, I have no space for it (in \nmy stomach).\" He said, \"Hand it over to me.\" When I gave him the bowl, he praised Allah and \npronounced Allah's Name on it and drank the remaining milk.",
    "arabic": "حَدَّثَنِي أَبُو نُعَيْمٍ، بِنَحْوٍ مِنْ نِصْفِ هَذَا الْحَدِيثِ حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، حَدَّثَنَا مُجَاهِدٌ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ آللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنْ كُنْتُ لأَعْتَمِدُ بِكَبِدِي عَلَى الأَرْضِ مِنَ الْجُوعِ، وَإِنْ كُنْتُ لأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنَ الْجُوعِ، وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمُ الَّذِي يَخْرُجُونَ مِنْهُ، فَمَرَّ أَبُو بَكْرٍ، فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ وَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ فَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي أَبُو الْقَاسِمِ صلى الله عليه وسلم فَتَبَسَّمَ حِينَ رَآنِي وَعَرَفَ، مَا فِي نَفْسِي وَمَا فِي وَجْهِي ثُمَّ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ ‏\"‏‏.‏ وَمَضَى فَتَبِعْتُهُ، فَدَخَلَ فَاسْتَأْذَنَ، فَأَذِنَ لِي، فَدَخَلَ فَوَجَدَ لَبَنًا فِي قَدَحٍ فَقَالَ ‏\"‏ مِنْ أَيْنَ هَذَا اللَّبَنُ ‏\"‏‏.‏ قَالُوا أَهْدَاهُ لَكَ فُلاَنٌ أَوْ فُلاَنَةُ‏.‏ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ لِي ‏\"‏‏.‏ قَالَ وَأَهْلُ الصُّفَّةِ أَضْيَافُ الإِسْلاَمِ، لاَ يَأْوُونَ إِلَى أَهْلٍ وَلاَ مَالٍ، وَلاَ عَلَى أَحَدٍ، إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ، وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا، وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ، وَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا، فَسَاءَنِي ذَلِكَ فَقُلْتُ وَمَا هَذَا اللَّبَنُ فِي أَهْلِ الصُّفَّةِ كُنْتُ أَحَقُّ أَنَا أَنْ أُصِيبَ مِنْ هَذَا اللَّبَنِ شَرْبَةً أَتَقَوَّى بِهَا، فَإِذَا جَاءَ أَمَرَنِي فَكُنْتُ أَنَا أُعْطِيهِمْ، وَمَا عَسَى أَنْ يَبْلُغَنِي مِنْ هَذَا اللَّبَنِ، وَلَمْ يَكُنْ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ صلى الله عليه وسلم بُدٌّ، فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَأَقْبَلُوا، فَاسْتَأْذَنُوا فَأَذِنَ لَهُمْ، وَأَخَذُوا مَجَالِسَهُمْ مِنَ الْبَيْتِ قَالَ ‏\"‏ يَا أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ خُذْ فَأَعْطِهِمْ ‏\"‏‏.‏ قَالَ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، فَأُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، حَتَّى انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ رَوِيَ الْقَوْمُ كُلُّهُمْ، فَأَخَذَ الْقَدَحَ فَوَضَعَهُ عَلَى يَدِهِ فَنَظَرَ إِلَىَّ فَتَبَسَّمَ فَقَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَقِيتُ أَنَا وَأَنْتَ ‏\"‏‏.‏ قُلْتُ صَدَقْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اقْعُدْ فَاشْرَبْ ‏\"‏‏.‏ فَقَعَدْتُ فَشَرِبْتُ‏.‏ فَقَالَ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ فَشَرِبْتُ، فَمَا زَالَ يَقُولُ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ حَتَّى قُلْتُ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا أَجِدُ لَهُ مَسْلَكًا‏.‏ قَالَ ‏\"‏ فَأَرِنِي ‏\"‏‏.‏ فَأَعْطَيْتُهُ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى، وَشَرِبَ الْفَضْلَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6452In-book reference : Book 81, Hadith 41USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6453,
    "id": 6453,
    "url": "https://sunnah.com/bukhari:6453",
    "bookNumber": 81,
    "hadithNumber": 42,
    "narrator": "Narrated Sa`d:",
    "english": "I was the first man among the Arabs to throw an arrow for Allah's Cause. We used to fight in Allah's \nCause while we had nothing to eat except the leaves of the Hubla and the Sumur trees (desert trees) so \nthat we discharged excrement like that of sheep (i.e. unmixed droppings). Today the (people of the) \ntribe of Bani Asad teach me the laws of Islam. If so, then I am lost, and all my efforts of that hard time \nhad gone in vain.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ سَمِعْتُ سَعْدًا، يَقُولُ إِنِّي لأَوَّلُ الْعَرَبِ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَرَأَيْتُنَا نَغْزُو، وَمَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ وَهَذَا السَّمُرُ، وَإِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ، مَا لَهُ خِلْطٌ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خِبْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6453In-book reference : Book 81, Hadith 42USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 460   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6454,
    "id": 6454,
    "url": "https://sunnah.com/bukhari:6454",
    "bookNumber": 81,
    "hadithNumber": 43,
    "narrator": "Narrated `Aisha:",
    "english": "The family of Muhammad had never eaten their fill of wheat bread for three successive days since \nthey had migrated to Medina till the death of the Prophet.",
    "arabic": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ بُرٍّ ثَلاَثَ لَيَالٍ تِبَاعًا حَتَّى قُبِضَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6454In-book reference : Book 81, Hadith 43USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 461   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6455,
    "id": 6455,
    "url": "https://sunnah.com/bukhari:6455",
    "bookNumber": 81,
    "hadithNumber": 44,
    "narrator": "Narrated `Aisha:",
    "english": "The family of Muhammad did not eat two meals on one day, but one of the two was of dates.",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا إِسْحَاقُ ـ هُوَ الأَزْرَقُ ـ عَنْ مِسْعَرِ بْنِ كِدَامٍ، عَنْ هِلاَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا أَكَلَ آلُ مُحَمَّدٍ صلى الله عليه وسلم أَكْلَتَيْنِ فِي يَوْمٍ، إِلاَّ إِحْدَاهُمَا تَمْرٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6455In-book reference : Book 81, Hadith 44USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 462   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6456,
    "id": 6456,
    "url": "https://sunnah.com/bukhari:6456",
    "bookNumber": 81,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "The bed mattress of the Prophet (ﷺ) was made of a leather case stuffed with palm fibres.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ فِرَاشُ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَدَمٍ، وَحَشْوُهُ مِنْ لِيفٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6456In-book reference : Book 81, Hadith 45USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 463   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6457,
    "id": 6457,
    "url": "https://sunnah.com/bukhari:6457",
    "bookNumber": 81,
    "hadithNumber": 46,
    "narrator": "Narrated Qatada:",
    "english": "We used to go to Anas bin Malik and see his baker standing (preparing the bread). Anas said, \"Eat. I \nhave not known that the Prophet (ﷺ) ever saw a thin well-baked loaf of bread till he died, and he never \nsaw a roasted sheep with his eyes.\"",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ وَخَبَّازُهُ قَائِمٌ وَقَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا، حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6457In-book reference : Book 81, Hadith 46USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 464   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6458,
    "id": 6458,
    "url": "https://sunnah.com/bukhari:6458",
    "bookNumber": 81,
    "hadithNumber": 47,
    "narrator": "Narrated `Aisha:",
    "english": "A complete month would pass by during which we would not make a fire (for cooking), and our food \nused to be only dates and water unless we were given a present of some meat.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَأْتِي عَلَيْنَا الشَّهْرُ مَا نُوقِدُ فِيهِ نَارًا، إِنَّمَا هُوَ التَّمْرُ وَالْمَاءُ، إِلاَّ أَنْ نُؤْتَى بِاللُّحَيْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6458In-book reference : Book 81, Hadith 47USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 465   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6459,
    "id": 6459,
    "url": "https://sunnah.com/bukhari:6459",
    "bookNumber": 81,
    "hadithNumber": 48,
    "narrator": "Narrated `Aisha:",
    "english": "that she said to `Urwa, \"O, the son of my sister! We used to see three crescents in two months, and no \nfire used to be made in the houses of Allah's Messenger (ﷺ) (i.e. nothing used to be cooked).\" `Urwa said, \n\"What used to sustain you?\" `Aisha said, \"The two black things i.e. dates and water, except that \nAllah's Messenger (ﷺ) had neighbors from the Ansar who had some milch she-camels, and they used to give \nthe Prophet (ﷺ) some milk from their house, and he used to make us drink it.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لِعُرْوَةَ ابْنَ أُخْتِي إِنْ كُنَّا لَنَنْظُرُ إِلَى الْهِلاَلِ ثَلاَثَةَ أَهِلَّةٍ فِي شَهْرَيْنِ، وَمَا أُوقِدَتْ فِي أَبْيَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَارٌ‏.‏ فَقُلْتُ مَا كَانَ يُعِيشُكُمْ قَالَتِ الأَسْوَدَانِ التَّمْرُ وَالْمَاءُ إِلاَّ أَنَّهُ قَدْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جِيرَانٌ مِنَ الأَنْصَارِ كَانَ لَهُمْ مَنَائِحُ، وَكَانُوا يَمْنَحُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ أَبْيَاتِهِمْ، فَيَسْقِينَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6459In-book reference : Book 81, Hadith 48USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6460,
    "id": 6460,
    "url": "https://sunnah.com/bukhari:6460",
    "bookNumber": 81,
    "hadithNumber": 49,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"O Allah! Give food to the family of Muhammad.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ ارْزُقْ آلَ مُحَمَّدٍ قُوتًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6460In-book reference : Book 81, Hadith 49USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 467   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6461,
    "id": 6461,
    "url": "https://sunnah.com/bukhari:6461",
    "bookNumber": 81,
    "hadithNumber": 50,
    "narrator": "Narrated Masruq:",
    "english": "I asked `Aisha \"What deed was the most beloved to the Prophet?\" She said, \"The regular constant \none.\" I said, \"At what time did he use to get up at night (for the Tahajjud night prayer)?' She said, \"He \nused to get up on hearing (the crowing of) the cock (the last third of the night).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبِي، عَنْ شُعْبَةَ، عَنْ أَشْعَثَ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ مَسْرُوقًا، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَتِ الدَّائِمُ‏.‏ قَالَ قُلْتُ فَأَىَّ حِينٍ كَانَ يَقُومُ قَالَتْ كَانَ يَقُومُ إِذَا سَمِعَ الصَّارِخَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6461In-book reference : Book 81, Hadith 50USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 468   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6462,
    "id": 6462,
    "url": "https://sunnah.com/bukhari:6462",
    "bookNumber": 81,
    "hadithNumber": 51,
    "narrator": "Narrated `Aisha:",
    "english": "The most beloved action to Allah's Messenger (ﷺ) was that whose doer did it continuously and regularly.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6462In-book reference : Book 81, Hadith 51USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 469   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6463,
    "id": 6463,
    "url": "https://sunnah.com/bukhari:6463",
    "bookNumber": 81,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The deeds of anyone of you will not save you (from the (Hell) Fire).\" They said, \n\"Even you (will not be saved by your deeds), O Allah's Messenger (ﷺ)?\" He said, \"No, even I (will not be \nsaved) unless and until Allah bestows His Mercy on me. Therefore, do good deeds properly, sincerely \nand moderately, and worship Allah in the forenoon and in the afternoon and during a part of the night, \nand always adopt a middle, moderate, regular course whereby you will reach your target (Paradise).",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَنْ يُنَجِّيَ أَحَدًا مِنْكُمْ عَمَلُهُ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا، إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِرَحْمَةٍ، سَدِّدُوا وَقَارِبُوا، وَاغْدُوا وَرُوحُوا، وَشَىْءٌ مِنَ الدُّلْجَةِ‏.‏ وَالْقَصْدَ الْقَصْدَ تَبْلُغُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6463In-book reference : Book 81, Hadith 52USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 470   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6464,
    "id": 6464,
    "url": "https://sunnah.com/bukhari:6464",
    "bookNumber": 81,
    "hadithNumber": 53,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"Do good deeds properly, sincerely and moderately and know that your deeds \nwill not make you enter Paradise, and that the most beloved deed to Allah is the most regular and \nconstant even if it were little.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَدِّدُوا وَقَارِبُوا، وَاعْلَمُوا أَنْ لَنْ يُدْخِلَ أَحَدَكُمْ عَمَلُهُ الْجَنَّةَ، وَأَنَّ أَحَبَّ الأَعْمَالِ أَدْوَمُهَا إِلَى اللَّهِ، وَإِنْ قَلَّ ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 6464In-book reference : Book 81, Hadith 53USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 471   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6465,
    "id": 6465,
    "url": "https://sunnah.com/bukhari:6465",
    "bookNumber": 81,
    "hadithNumber": 54,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) was asked, \"What deeds are loved most by Allah?\" He said, \"The most regular constant \ndeeds even though they may be few.\" He added, 'Don't take upon yourselves, except the deeds which \nare within your ability.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ أَدْوَمُهَا وَإِنْ قَلَّ ‏\"‏‏.‏ وَقَالَ ‏\"‏ اكْلَفُوا مِنَ الأَعْمَالِ مَا تُطِيقُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6465In-book reference : Book 81, Hadith 54USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 472   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6466,
    "id": 6466,
    "url": "https://sunnah.com/bukhari:6466",
    "bookNumber": 81,
    "hadithNumber": 55,
    "narrator": "Narrated 'Alqama:",
    "english": "I asked `Aisha, mother of the believers, \"O mother of the believers! How were the deeds of the \nProphet? Did he use to do extra deeds of worship on special days?\" She said, \"No, but his deeds were \nregular and constant, and who among you is able to do what the Prophet (ﷺ) was able to do (i.e. in \nworshipping Allah)?\"",
    "arabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ سَأَلْتُ أُمَّ الْمُؤْمِنِينَ عَائِشَةَ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ كَيْفَ كَانَ عَمَلُ النَّبِيِّ صلى الله عليه وسلم هَلْ كَانَ يَخُصُّ شَيْئًا مِنَ الأَيَّامِ قَالَتْ لاَ، كَانَ عَمَلُهُ دِيمَةً، وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَسْتَطِيعُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6466In-book reference : Book 81, Hadith 55USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 473   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6467,
    "id": 6467,
    "url": "https://sunnah.com/bukhari:6467",
    "bookNumber": 81,
    "hadithNumber": 56,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"Do good deeds properly, sincerely and moderately, and receive good news because \none's good deeds will not make him enter Paradise.\" They asked, \"Even you, O Allah's Messenger (ﷺ)?\" He \nsaid, \"Even I, unless and until Allah bestows His pardon and Mercy on me.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ سَدِّدُوا وَقَارِبُوا، وَأَبْشِرُوا، فَإِنَّهُ لاَ يُدْخِلُ أَحَدًا الْجَنَّةَ عَمَلُهُ ‏\"‏‏.‏ قَالُوا وَلاَ، أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏‏.‏ قَالَ أَظُنُّهُ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ‏.‏   \nوَقَالَ عَفَّانُ حَدَّثَنَا وُهَيْبٌ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ سَدِّدُوا وَأَبْشِرُوا ‏\"‏‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏قَوْلاً سَدِيدًا‏}‏ وَسَدَادًا صِدْقًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6467In-book reference : Book 81, Hadith 56USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 474   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6468,
    "id": 6468,
    "url": "https://sunnah.com/bukhari:6468",
    "bookNumber": 81,
    "hadithNumber": 57,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once Allah's Messenger (ﷺ) led us in prayer and then (after finishing it) ascended the pulpit and pointed with \nhis hand towards the Qibla of the mosque and said, \"While I was leading you in prayer, both Paradise \nand Hell were displayed in front of me in the direction of this wall. I had never seen a better thing \n(than Paradise) and a worse thing (than Hell) as I have seen today, I had never seen a better thing and \na worse thing as I have seen today.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى لَنَا يَوْمًا الصَّلاَةَ، ثُمَّ رَقِيَ الْمِنْبَرَ فَأَشَارَ بِيَدِهِ قِبَلَ قِبْلَةِ الْمَسْجِدِ، فَقَالَ ‏\n\"‏ قَدْ أُرِيتُ الآنَ ـ مُنْذُ صَلَّيْتُ لَكُمُ الصَّلاَةَ ـ الْجَنَّةَ وَالنَّارَ مُمَثَّلَتَيْنِ فِي قُبُلِ هَذَا الْجِدَارِ، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6468In-book reference : Book 81, Hadith 57USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6469,
    "id": 6469,
    "url": "https://sunnah.com/bukhari:6469",
    "bookNumber": 81,
    "hadithNumber": 58,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, Verily Allah created Mercy. The day He created it, He made it into one \nhundred parts. He withheld with Him ninety-nine parts, and sent its one part to all His creatures. Had \nthe non-believer known of all the Mercy which is in the Hands of Allah, he would not lose hope of \nentering Paradise, and had the believer known of all the punishment which is present with Allah, he \nwould not consider himself safe from the Hell-Fire.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ خَلَقَ الرَّحْمَةَ يَوْمَ خَلَقَهَا مِائَةَ رَحْمَةٍ، فَأَمْسَكَ عِنْدَهُ تِسْعًا وَتِسْعِينَ رَحْمَةً، وَأَرْسَلَ فِي خَلْقِهِ كُلِّهِمْ رَحْمَةً وَاحِدَةً، فَلَوْ يَعْلَمُ الْكَافِرُ بِكُلِّ الَّذِي عِنْدَ اللَّهِ مِنَ الرَّحْمَةِ لَمْ يَيْأَسْ مِنَ الْجَنَّةِ، وَلَوْ يَعْلَمُ الْمُؤْمِنُ بِكُلِّ الَّذِي عِنْدَ اللَّهِ مِنَ الْعَذَابِ لَمْ يَأْمَنْ مِنَ النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6469In-book reference : Book 81, Hadith 58USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 476   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6470,
    "id": 6470,
    "url": "https://sunnah.com/bukhari:6470",
    "bookNumber": 81,
    "hadithNumber": 59,
    "narrator": "Narrated Abu Sa`id:",
    "english": "Some people from the Ansar asked Allah's Messenger (ﷺ) (to give them something) and he gave to everyone \nof them, who asked him, until all that he had was finished. When everything was finished and he had \nspent all that was in his hand, he said to them, '\"(Know) that if I have any wealth, I will not withhold it \nfrom you (to keep for somebody else); And (know) that he who refrains from begging others (or doing \nprohibited deeds), Allah will make him contented and not in need of others; and he who remains \npatient, Allah will bestow patience upon him, and he who is satisfied with what he has, Allah will \nmake him self-sufficient. And there is no gift better and vast (you may be given) than patience.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا سَعِيدٍ، أَخْبَرَهُ أَنَّ أُنَاسًا مِنَ الأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَلَمْ يَسْأَلْهُ أَحَدٌ مِنْهُمْ إِلاَّ أَعْطَاهُ حَتَّى نَفِدَ مَا عِنْدَهُ فَقَالَ لَهُمْ حِينَ نَفِدَ كُلُّ شَىْءٍ أَنْفَقَ بِيَدَيْهِ ‏\n\"‏ مَا يَكُنْ عِنْدِي مِنْ خَيْرٍ لاَ أَدَّخِرْهُ عَنْكُمْ، وَإِنَّهُ مَنْ يَسْتَعِفَّ يُعِفُّهُ اللَّهُ، وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ، وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ، وَلَنْ تُعْطَوْا عَطَاءً خَيْرًا وَأَوْسَعَ مِنَ الصَّبْرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6470In-book reference : Book 81, Hadith 59USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6471,
    "id": 6471,
    "url": "https://sunnah.com/bukhari:6471",
    "bookNumber": 81,
    "hadithNumber": 60,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "The Prophet (ﷺ) used to pray so much that his feet used to become edematous or swollen, and when he \nwas asked as to why he prays so much, he would say, \"Shall I not be a thankful slave (to Allah)?\"",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي حَتَّى تَرِمَ ـ أَوْ تَنْتَفِخَ ـ قَدَمَاهُ فَيُقَالُ لَهُ، فَيَقُولُ ‏\n\"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6471In-book reference : Book 81, Hadith 60USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6472,
    "id": 6472,
    "url": "https://sunnah.com/bukhari:6472",
    "bookNumber": 81,
    "hadithNumber": 61,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) said, \"Seventy thousand people of my followers will enter Paradise without accounts, \nand they are those who do not practice Ar-Ruqya and do not see an evil omen in things, and put their \ntrust in their Lord.",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ حُصَيْنَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ كُنْتُ قَاعِدًا عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَقَالَ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ، هُمُ الَّذِينَ لاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6472In-book reference : Book 81, Hadith 61USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6473,
    "id": 6473,
    "url": "https://sunnah.com/bukhari:6473",
    "bookNumber": 81,
    "hadithNumber": 62,
    "narrator": "Narrated Warrad:",
    "english": "(the clerk of Al-Mughira bin Shu`ba) Muawiya wrote to Al-Mughira: \"Write to me a narration you \nhave heard from Allah's Messenger (ﷺ).\" So Al-Mughira wrote to him, \"I heard him saying the following \nafter each prayer: 'La ilaha illal-lahu wahdahu la sharika lahu, lahu-l-mulk wa lahuI-hamd, wa huwa \n'ala kulli Shai-in qadir.' He also used to forbid idle talk, asking too many questions (in religion), \nwasting money, preventing what should be given, and asking others for something (except in great \nneed), being undutiful to mothers, and burying one's little daughters (alive).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا غَيْرُ، وَاحِدٍ، مِنْهُمْ مُغِيرَةُ وَفُلاَنٌ وَرَجُلٌ ثَالِثٌ أَيْضًا عَنِ الشَّعْبِيِّ عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ مُعَاوِيَةَ كَتَبَ إِلَى الْمُغِيرَةِ أَنِ اكْتُبْ إِلَىَّ بِحَدِيثٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَكَتَبَ إِلَيْهِ الْمُغِيرَةُ أَنِّي سَمِعْتُهُ يَقُولُ عِنْدَ انْصِرَافِهِ مِنَ الصَّلاَةِ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ قَالَ وَكَانَ يَنْهَى عَنْ قِيلَ وَقَالَ وَكَثْرَةِ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ، وَمَنْعٍ وَهَاتِ، وَعُقُوقِ الأُمَّهَاتِ، وَوَأْدِ الْبَنَاتِ‏.‏ وَعَنْ هُشَيْمٍ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ قَالَ سَمِعْتُ وَرَّادًا يُحَدِّثُ هَذَا الْحَدِيثَ عَنِ الْمُغِيرَةِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6473In-book reference : Book 81, Hadith 62USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 480   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6474,
    "id": 6474,
    "url": "https://sunnah.com/bukhari:6474",
    "bookNumber": 81,
    "hadithNumber": 63,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever can guarantee (the chastity of) what is between his two jaw-bones and \nwhat is between his two legs (i.e. his tongue and his private parts), I guarantee Paradise for him.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، سَمِعَ أَبَا حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ يَضْمَنْ لِي مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ أَضْمَنْ لَهُ الْجَنَّةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6474In-book reference : Book 81, Hadith 63USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 481   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6475,
    "id": 6475,
    "url": "https://sunnah.com/bukhari:6475",
    "bookNumber": 81,
    "hadithNumber": 64,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever believes in Allah and the Last Day should talk what is good or keep \nquiet, and whoever believes in Allah and the Last Day should not hurt (or insult) his neighbor; and \nwhoever believes in Allah and the Last Day, should entertain his guest generously.\"",
    "arabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا، أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6475In-book reference : Book 81, Hadith 64USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 482   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6476,
    "id": 6476,
    "url": "https://sunnah.com/bukhari:6476",
    "bookNumber": 81,
    "hadithNumber": 65,
    "narrator": "Narrated Abu Shuraih Al-Khuza`i:",
    "english": "My ears heard and my heart grasped (the statement which) the Prophet (ﷺ) said, \"The period for keeping \none's guest is three days (and don't forget) his reward.\" It was asked, \"What is his reward?\" He said, \n\"In the first night and the day he should be given a high class quality of meals; and whoever believes \nin Allah and the Last Day, should entertain his guest generously; and whoever believes in Allah and \nthe Last Day should talk what is good (sense) or keep quiet.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثٌ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، قَالَ سَمِعَ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ جَائِزَتُهُ ‏\"‏‏.‏ قِيلَ مَا جَائِزَتُهُ قَالَ ‏\"‏ يَوْمٌ وَلَيْلَةٌ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا، أَوْ لِيَسْكُتْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6476In-book reference : Book 81, Hadith 65USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 483   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6477,
    "id": 6477,
    "url": "https://sunnah.com/bukhari:6477",
    "bookNumber": 81,
    "hadithNumber": 66,
    "narrator": "Narrated Abu Huraira:",
    "english": "That he heard Allah's Messenger (ﷺ) saying, \"A slave of Allah may utter a word without thinking whether it \nis right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ التَّيْمِيِّ، عَنْ أَبِي هُرَيْرَةَ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مَا يَتَبَيَّنُ فِيهَا، يَزِلُّ بِهَا فِي النَّارِ أَبْعَدَ مِمَّا بَيْنَ الْمَشْرِقِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6477In-book reference : Book 81, Hadith 66USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 484   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6478,
    "id": 6478,
    "url": "https://sunnah.com/bukhari:6478",
    "bookNumber": 81,
    "hadithNumber": 67,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet; said, \"A slave (of Allah) may utter a word which pleases Allah without giving it much \nimportance, and because of that Allah will raise him to degrees (of reward): a slave (of Allah) may \nutter a word (carelessly) which displeases Allah without thinking of its gravity and because of that he \nwill be thrown into the Hell-Fire.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا النَّضْرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ ـ يَعْنِي ابْنَ دِينَارٍ ـ عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ لاَ يُلْقِي لَهَا بَالاً، يَرْفَعُ اللَّهُ بِهَا دَرَجَاتٍ، وَإِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ لاَ يُلْقِي لَهَا بَالاً يَهْوِي بِهَا فِي جَهَنَّمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6478In-book reference : Book 81, Hadith 67USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6479,
    "id": 6479,
    "url": "https://sunnah.com/bukhari:6479",
    "bookNumber": 81,
    "hadithNumber": 68,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said Allah will give shade to seven (types of people) under His Shade (on the Day of \nResurrection). (one of them will be) a person who remembers Allah and his eyes are then flooded with \ntears.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ، رَجُلٌ ذَكَرَ اللَّهَ فَفَاضَتْ عَيْنَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6479In-book reference : Book 81, Hadith 68USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 486   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6480,
    "id": 6480,
    "url": "https://sunnah.com/bukhari:6480",
    "bookNumber": 81,
    "hadithNumber": 69,
    "narrator": "Narrated Hudhaifa:",
    "english": "The Prophet (ﷺ) said, \"There was a man amongst the people who had suspicion as to the righteousness of \nhis deeds. Therefore he said to his family, 'If I die, take me and burn my corpse and throw my ashes \ninto the sea on a hot (or windy) day.' They did so, but Allah, collected his particles and asked (him), \nWhat made you do what you did?' He replied, 'The only thing that made me do it, was that I was \nafraid of You.' So Allah forgave him.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ يُسِيءُ الظَّنَّ بِعَمَلِهِ، فَقَالَ لأَهْلِهِ إِذَا أَنَا مُتُّ فَخُذُونِي فَذَرُّونِي، فِي الْبَحْرِ فِي يَوْمٍ صَائِفٍ، فَفَعَلُوا بِهِ، فَجَمَعَهُ اللَّهُ ثُمَّ قَالَ مَا حَمَلَكَ عَلَى الَّذِي صَنَعْتَ قَالَ مَا حَمَلَنِي إِلاَّ مَخَافَتُكَ‏.‏ فَغَفَرَ لَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6480In-book reference : Book 81, Hadith 69USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 487   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6481,
    "id": 6481,
    "url": "https://sunnah.com/bukhari:6481",
    "bookNumber": 81,
    "hadithNumber": 70,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The Prophet (ﷺ) mentioned a man from the previous generation or from the people preceding your age \nwhom Allah had given both wealth and children. The Prophet (ﷺ) said, \"When the time of his death \napproached, he asked his children, 'What type of father have I been to you?' They replied: You have \nbeen a good father. He said, 'But he (i.e. your father) has not stored any good deeds with Allah (for the \nHereafter): if he should face Allah, Allah will punish him. So listen, (O my children), when I die, burn \nmy body till I become mere coal and then grind it into powder, and when there is a stormy wind, \nthrow me (my ashes) in it.' So he took a firm promise from his children (to follow his instructions). \nAnd by Allah they (his sons) did accordingly(fulfilled their promise.) Then Allah said, \"Be\"' and \nbehold! That man was standing there! Allah then said. \"O my slave! What made you do what you \ndid?\" That man said, \"Fear of You.\" So Allah forgave him.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، عَنْ عُقْبَةَ بْنِ عَبْدِ الْغَافِرِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ذَكَرَ رَجُلاً فِيمَنْ كَانَ سَلَفَ أَوْ قَبْلَكُمْ آتَاهُ اللَّهُ مَالاً وَوَلَدًا ـ يَعْنِي أَعْطَاهُ قَالَ ـ فَلَمَّا حُضِرَ قَالَ لِبَنِيهِ أَىَّ أَبٍ كُنْتُ قَالُوا خَيْرَ أَبٍ‏.‏ قَالَ فَإِنَّهُ لَمْ يَبْتَئِرْ عِنْدَ اللَّهِ خَيْرًا ـ فَسَّرَهَا قَتَادَةُ لَمْ يَدَّخِرْ ـ وَإِنْ يَقْدَمْ عَلَى اللَّهِ يُعَذِّبْهُ فَانْظُرُوا، فَإِذَا مُتُّ فَأَحْرِقُونِي، حَتَّى إِذَا صِرْتُ فَحْمًا فَاسْحَقُونِي ـ أَوْ قَالَ فَاسْهَكُونِي ـ ثُمَّ إِذَا كَانَ رِيحٌ عَاصِفٌ فَأَذْرُونِي فِيهَا‏.‏ فَأَخَذَ مَوَاثِيقَهُمْ عَلَى ذَلِكَ وَرَبِّي فَفَعَلُوا فَقَالَ اللَّهُ كُنْ‏.‏ فَإِذَا رَجُلٌ قَائِمٌ، ثُمَّ قَالَ أَىْ عَبْدِي مَا حَمَلَكَ عَلَى مَا فَعَلْتَ قَالَ مَخَافَتُكَ ـ أَوْ فَرَقٌ مِنْكَ ـ فَمَا تَلاَفَاهُ أَنْ رَحِمَهُ اللَّهُ ‏\"‏‏.‏ فَحَدَّثْتُ أَبَا عُثْمَانَ فَقَالَ سَمِعْتُ سَلْمَانَ غَيْرَ أَنَّهُ زَادَ فَأَذْرُونِي فِي الْبَحْرِ‏.‏ أَوْ كَمَا حَدَّثَ‏.‏ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعْتُ عُقْبَةَ، سَمِعْتُ أَبَا سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6481In-book reference : Book 81, Hadith 70USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6482,
    "id": 6482,
    "url": "https://sunnah.com/bukhari:6482",
    "bookNumber": 81,
    "hadithNumber": 71,
    "narrator": "Narrated Abu Musa:",
    "english": "Allah's Messenger (ﷺ) said. \"My example and the example of the message with which Allah has sent me is \nlike that of a man who came to some people and said, \"I have seen with my own eyes the enemy \nforces, and I am a naked warner (to you) so save yourself, save yourself! A group of them obeyed him \nand went out at night, slowly and stealthily and were safe, while another group did not believe him \nand thus the army took them in the morning and destroyed them.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلِي وَمَثَلُ مَا بَعَثَنِي اللَّهُ كَمَثَلِ رَجُلٍ أَتَى قَوْمًا فَقَالَ رَأَيْتُ الْجَيْشَ بِعَيْنَىَّ، وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَا النَّجَاءَ‏.‏ فَأَطَاعَتْهُ طَائِفَةٌ فَأَدْلَجُوا عَلَى مَهْلِهِمْ فَنَجَوْا، وَكَذَّبَتْهُ طَائِفَةٌ فَصَبَّحَهُمُ الْجَيْشُ فَاجْتَاحَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6482In-book reference : Book 81, Hadith 71USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 489   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6483,
    "id": 6483,
    "url": "https://sunnah.com/bukhari:6483",
    "bookNumber": 81,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"My example and the example of the people is that of a man who made \na fire, and when it lighted what was around it, Moths and other insects started falling into the fire. The \nman tried (his best) to prevent them, (from falling in the fire) but they overpowered him and rushed \ninto the fire. The Prophet (ﷺ) added: Now, similarly, I take hold of the knots at your waist (belts) to \nprevent you from falling into the Fire, but you insist on falling into it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، أَنَّهُ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا مَثَلِي وَمَثَلُ النَّاسِ كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا، فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي تَقَعُ فِي النَّارِ يَقَعْنَ فِيهَا، فَجَعَلَ يَنْزِعُهُنَّ وَيَغْلِبْنَهُ فَيَقْتَحِمْنَ فِيهَا، فَأَنَا آخُذُ بِحُجَزِكُمْ عَنِ النَّارِ، وَأَنْتُمْ تَقْتَحِمُونَ فِيهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6483In-book reference : Book 81, Hadith 72USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 490   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6484,
    "id": 6484,
    "url": "https://sunnah.com/bukhari:6484",
    "bookNumber": 81,
    "hadithNumber": 73,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with his tongue or his hands. \nAnd a Muhajir (an emigrant) is the one who gives up (abandons) all what Allah has forbidden.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6484In-book reference : Book 81, Hadith 73USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6485,
    "id": 6485,
    "url": "https://sunnah.com/bukhari:6485",
    "bookNumber": 81,
    "hadithNumber": 74,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If you knew that which I know you would laugh little and weep much.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً، وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6485In-book reference : Book 81, Hadith 74USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6486,
    "id": 6486,
    "url": "https://sunnah.com/bukhari:6486",
    "bookNumber": 81,
    "hadithNumber": 75,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"If you knew that which I know, you would laugh little and weep much.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 6486In-book reference : Book 81, Hadith 75USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 493   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6487,
    "id": 6487,
    "url": "https://sunnah.com/bukhari:6487",
    "bookNumber": 81,
    "hadithNumber": 76,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The (Hell) Fire is surrounded by all kinds of desires and passions, while \nParadise is surrounded by all kinds of disliked undesirable things.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ حُجِبَتِ النَّارُ بِالشَّهَوَاتِ، وَحُجِبَتِ الْجَنَّةُ بِالْمَكَارِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6487In-book reference : Book 81, Hadith 76USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6488,
    "id": 6488,
    "url": "https://sunnah.com/bukhari:6488",
    "bookNumber": 81,
    "hadithNumber": 77,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Paradise is nearer to any of you than the Shirak (leather strap) of his shoe, and so is \nthe (Hell) Fire.",
    "arabic": "حَدَّثَنِي مُوسَى بْنُ مَسْعُودٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْجَنَّةُ أَقْرَبُ إِلَى أَحَدِكُمْ مِنْ شِرَاكِ نَعْلِهِ، وَالنَّارُ مِثْلُ ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6488In-book reference : Book 81, Hadith 77USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6489,
    "id": 6489,
    "url": "https://sunnah.com/bukhari:6489",
    "bookNumber": 81,
    "hadithNumber": 78,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The truest poetic verse ever said by a poet, is: Indeed! Everything except Allah, is \nperishable.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَصْدَقُ بَيْتٍ قَالَهُ الشَّاعِرُ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6489In-book reference : Book 81, Hadith 78USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6490,
    "id": 6490,
    "url": "https://sunnah.com/bukhari:6490",
    "bookNumber": 81,
    "hadithNumber": 79,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If anyone of you looked at a person who was made superior to him in property \nand (in good) appearance, then he should also look at the one who is inferior to him.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَظَرَ أَحَدُكُمْ إِلَى مَنْ فُضِّلَ عَلَيْهِ فِي الْمَالِ وَالْخَلْقِ، فَلْيَنْظُرْ إِلَى مَنْ هُوَ أَسْفَلَ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6490In-book reference : Book 81, Hadith 79USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 497   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6491,
    "id": 6491,
    "url": "https://sunnah.com/bukhari:6491",
    "bookNumber": 81,
    "hadithNumber": 80,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) narrating about his Lord I'm and said, \"Allah ordered (the appointed angels over you) that \nthe good and the bad deeds be written, and He then showed (the way) how (to write). If somebody \nintends to do a good deed and he does not do it, then Allah will write for him a full good deed (in his \naccount with Him); and if he intends to do a good deed and actually did it, then Allah will write for \nhim (in his account) with Him (its reward equal) from ten to seven hundred times to many more times: \nand if somebody intended to do a bad deed and he does not do it, then Allah will write a full good \ndeed (in his account) with Him, and if he intended to do it (a bad deed) and actually did it, then Allah \nwill write one bad deed (in his account) .\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا جَعْدٌ أَبُو عُثْمَانَ، حَدَّثَنَا أَبُو رَجَاءٍ الْعُطَارِدِيُّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِي عَنْ رَبِّهِ عَزَّ وَجَلَّ قَالَ قَالَ ‏\n\"‏ إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ لَهُ سَيِّئَةً وَاحِدَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6491In-book reference : Book 81, Hadith 80USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 498   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6492,
    "id": 6492,
    "url": "https://sunnah.com/bukhari:6492",
    "bookNumber": 81,
    "hadithNumber": 81,
    "narrator": "Narrated Ghailan:",
    "english": "Anas said \"You people do (bad) deeds (commit sins) which seem in your eyes as tiny (minute) than \nhair while we used to consider those (very deeds) during the life-time of the Prophet (ﷺ) as destructive \nsins.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا مَهْدِيٌّ، عَنْ غَيْلاَنَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ لَتَعْمَلُونَ أَعْمَالاً هِيَ أَدَقُّ فِي أَعْيُنِكُمْ مِنَ الشَّعَرِ، إِنْ كُنَّا نَعُدُّهَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم الْمُوبِقَاتِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يَعْنِي بِذَلِكَ الْمُهْلِكَاتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6492In-book reference : Book 81, Hadith 81USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 499   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6493,
    "id": 6493,
    "url": "https://sunnah.com/bukhari:6493",
    "bookNumber": 81,
    "hadithNumber": 82,
    "narrator": "Narrated Sa`d bin Sahl As-Sa`idi:",
    "english": "The Prophet (ﷺ) looked at a man fighting against the pagans and he was one of the most competent \npersons fighting on behalf of the Muslims. The Prophet (ﷺ) said, \"Let him who wants to look at a man \nfrom the dwellers of the (Hell) Fire, look at this (man).\" Another man followed him and kept on \nfollowing him till he (the fighter) was injured and, seeking to die quickly, he placed the blade tip of \nhis sword between his breasts and leaned over it till it passed through his shoulders (i.e., committed \nsuicide).\" The Prophet (ﷺ) added, \"A person may do deeds that seem to the people as the deeds of the \npeople of Paradise while in fact, he is from the dwellers of the (Hell) Fire: and similarly a person may \ndo deeds that seem to the people as the deeds of the people of the (Hell) Fire while in fact, he is from \nthe dwellers of Paradise. Verily, the (results of) deeds done, depend upon the last actions.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ نَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَى رَجُلٍ يُقَاتِلُ الْمُشْرِكِينَ، وَكَانَ مِنْ أَعْظَمِ الْمُسْلِمِينَ غَنَاءً عَنْهُمْ فَقَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ النَّارِ فَلْيَنْظُرْ إِلَى هَذَا ‏\"‏‏.‏ فَتَبِعَهُ رَجُلٌ فَلَمْ يَزَلْ عَلَى ذَلِكَ حَتَّى جُرِحَ، فَاسْتَعْجَلَ الْمَوْتَ‏.‏ فَقَالَ بِذُبَابَةِ سَيْفِهِ، فَوَضَعَهُ بَيْنَ ثَدْيَيْهِ، فَتَحَامَلَ عَلَيْهِ، حَتَّى خَرَجَ مِنْ بَيْنِ كَتِفَيْهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْعَبْدَ لَيَعْمَلُ فِيمَا يَرَى النَّاسُ عَمَلَ أَهْلِ الْجَنَّةِ، وَإِنَّهُ لَمِنْ أَهْلِ النَّارِ، وَيَعْمَلُ فِيمَا يَرَى النَّاسُ عَمَلَ أَهْلِ النَّارِ وَهْوَ مِنْ أَهْلِ الْجَنَّةِ، وَإِنَّمَا الأَعْمَالُ بِخَوَاتِيمِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6493In-book reference : Book 81, Hadith 82USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 500   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6494,
    "id": 6494,
    "url": "https://sunnah.com/bukhari:6494",
    "bookNumber": 81,
    "hadithNumber": 83,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "A bedouin came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Who is the best of mankind!\" The \nProphet said, \"A man who strives for Allah's Cause with his life and property, and also a man who \nlives (all alone) in a mountain path among the mountain paths to worship his Lord and save the people \nfrom his evil.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا سَعِيدٍ، حَدَّثَهُ قَالَ قِيلَ يَا رَسُولَ اللَّهِ‏.‏ وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ النَّاسِ خَيْرٌ قَالَ ‏\n\"‏ رَجُلٌ جَاهَدَ بِنَفْسِهِ وَمَالِهِ، وَرَجُلٌ فِي شِعْبٍ مِنَ الشِّعَابِ يَعْبُدُ رَبَّهُ، وَيَدَعُ النَّاسَ مِنْ شَرِّهِ ‏\"‏‏.‏ تَابَعَهُ الزُّبَيْدِيُّ وَسُلَيْمَانُ بْنُ كَثِيرٍ وَالنُّعْمَانُ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَطَاءٍ أَوْ عُبَيْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ يُونُسُ وَابْنُ مُسَافِرٍ وَيَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَطَاءٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6494In-book reference : Book 81, Hadith 83USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 501   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6495,
    "id": 6495,
    "url": "https://sunnah.com/bukhari:6495",
    "bookNumber": 81,
    "hadithNumber": 84,
    "narrator": "Narrated Abu Sa`id:",
    "english": "I heard from the Prophet (ﷺ) saying, \"There will come a time upon the people when the best property of a \nMuslim will be sheep which he will take to the tops of mountains and to the places of rainfall, run \naway with his religion (in order to save it) from afflictions.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا الْمَاجِشُونُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَهُ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ خَيْرُ مَالِ الرَّجُلِ الْمُسْلِمِ الْغَنَمُ، يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6495In-book reference : Book 81, Hadith 84USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 502   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6496,
    "id": 6496,
    "url": "https://sunnah.com/bukhari:6496",
    "bookNumber": 81,
    "hadithNumber": 85,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When honesty is lost, then wait for the Hour.\" It was asked, \"How will honesty \nbe lost, O Allah's Messenger (ﷺ)?\" He said, \"When authority is given to those who do not deserve it, then \nwait for the Hour.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِذَا أُسْنِدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ، فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6496In-book reference : Book 81, Hadith 85USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 503   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6497,
    "id": 6497,
    "url": "https://sunnah.com/bukhari:6497",
    "bookNumber": 81,
    "hadithNumber": 86,
    "narrator": "Narrated Hudhaifa:",
    "english": "Allah's Messenger (ﷺ) narrated to us two narrations, one of which I have seen (happening) and I am waiting \nfor the other. He narrated that honesty was preserved in the roots of the hearts of men (in the \nbeginning) and then they learnt it (honesty) from the Qur'an, and then they learnt it from the \n(Prophet's) Sunna (tradition). He also told us about its disappearance, saying, \"A man will go to sleep \nwhereupon honesty will be taken away from his heart, and only its trace will remain, resembling the \ntraces of fire. He then will sleep whereupon the remainder of the honesty will also be taken away \n(from his heart) and its trace will resemble a blister which is raised over the surface of skin, when an \nember touches one's foot; and in fact, this blister does not contain anything. So there will come a day \nwhen people will deal in business with each other but there will hardly be any trustworthy persons \namong them. Then it will be said that in such-and-such a tribe there is such-and-such person who is \nhonest, and a man will be admired for his intelligence, good manners and strength, though indeed he \nwill not have belief equal to a mustard seed in his heart.\" The narrator added: There came upon me a \ntime when I did not mind dealing with anyone of you, for if he was a Muslim, his religion would \nprevent him from cheating; and if he was a Christian, his Muslim ruler would prevent him from \ncheating; but today I cannot deal except with so-and-so and so-and-so. (See Hadith No. 208, Vol. 9)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ زَيْدِ بْنِ وَهْبٍ، حَدَّثَنَا حُذَيْفَةُ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الآخَرَ، حَدَّثَنَا ‏\"‏ أَنَّ الأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ، ثُمَّ عَلِمُوا مِنَ الْقُرْآنِ، ثُمَّ عَلِمُوا مِنَ السُّنَّةِ ‏\"‏‏.‏ وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ ‏\"‏ يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الأَمَانَةُ مِنْ قَلْبِهِ، فَيَظَلُّ أَثَرُهَا مِثْلَ أَثَرِ الْوَكْتِ، ثُمَّ يَنَامُ النَّوْمَةَ فَتُقْبَضُ فَيَبْقَى أَثَرُهَا مِثْلَ الْمَجْلِ، كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ، فَتَرَاهُ مُنْتَبِرًا، وَلَيْسَ فِيهِ شَىْءٌ، فَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ فَلاَ يَكَادُ أَحَدٌ يُؤَدِّي الأَمَانَةَ، فَيُقَالُ إِنَّ فِي بَنِي فُلاَنٍ رَجُلاً أَمِينًا‏.‏ وَيُقَالُ لِلرَّجُلِ مَا أَعْقَلَهُ وَمَا أَظْرَفَهُ وَمَا أَجْلَدَهُ‏.‏ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ، وَلَقَدْ أَتَى عَلَىَّ زَمَانٌ وَمَا أُبَالِي أَيَّكُمْ بَايَعْتُ لَئِنْ كَانَ مُسْلِمًا رَدَّهُ الإِسْلاَمُ، وَإِنْ كَانَ نَصْرَانِيًّا رَدَّهُ عَلَىَّ سَاعِيهِ، فَأَمَّا الْيَوْمَ فَمَا كُنْتُ أُبَايِعُ إِلاَّ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ قَالَ الْفِرَبْرِيُّ قَالَ أَبُو جَعْفَرٍ حَدَّثْتُ أَبَا عَبْدِ اللَّهِ فَقَالَ سَمِعْتُ أَحْمَدَ بْنَ عَاصِمٍ يَقُولُ سَمِعْتُ أَبَا عُبَيْدٍ يَقُولُ قَالَ الأَصْمَعِيُّ وَأَبُو عَمْرٍو وَغَيْرُهُمَا جَذْرُ قُلُوبِ الرِّجَالِ الْجَذْرُ الأَصْلُ مِنْ كُلِّ شَىْءٍ، وَالْوَكْتُ أَثَرُ الشَّىْءِ الْيَسِيرُ مِنْهُ، وَالْمَجْلُ أَثَرُ الْعَمَلِ فِي الْكَفِّ إِذَا غَلُظَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6497In-book reference : Book 81, Hadith 86USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 504   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6498,
    "id": 6498,
    "url": "https://sunnah.com/bukhari:6498",
    "bookNumber": 81,
    "hadithNumber": 87,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"People are just like camels, out of one hundred, one can hardly find a \nsingle camel suitable to ride.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا النَّاسُ كَالإِبِلِ الْمِائَةُ لاَ تَكَادُ تَجِدُ فِيهَا رَاحِلَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6498In-book reference : Book 81, Hadith 87USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 505   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6499,
    "id": 6499,
    "url": "https://sunnah.com/bukhari:6499",
    "bookNumber": 81,
    "hadithNumber": 88,
    "narrator": "Narrated Jundub:",
    "english": "The Prophet (ﷺ) said, \"He who lets the people hear of his good deeds intentionally, to win their praise, \nAllah will let the people know his real intention (on the Day of Resurrection), and he who does good \nthings in public to show off and win the praise of the people, Allah will disclose his real intention (and \nhumiliate him).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ،‏.‏ وَحَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ جُنْدَبًا، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم وَلَمْ أَسْمَعْ أَحَدًا يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم غَيْرَهُ فَدَنَوْتُ مِنْهُ فَسَمِعْتُهُ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ، وَمَنْ يُرَائِي يُرَائِي اللَّهُ بِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6499In-book reference : Book 81, Hadith 88USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 506   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6500,
    "id": 6500,
    "url": "https://sunnah.com/bukhari:6500",
    "bookNumber": 81,
    "hadithNumber": 89,
    "narrator": "Narrated Mu`adh bin Jabal:",
    "english": "While I was riding behind the Prophet (ﷺ) as a companion rider and there was nothing between me and \nhim except the back of the saddle, he said, \"O Mu`adh!\" I replied, \"Labbaik O Allah's Messenger (ﷺ)! And \nSa`daik!\" He proceeded for a while and then said, \"O Mu`adh!\" I said, \"Labbaik and Sa`daik, O \nAllah's Messenger (ﷺ)!\" He then proceeded for another while and said, \"O Mu`adh bin Jabal!\" I replied, \n\"Labbaik, O Allah's Messenger (ﷺ), and Sa`daik!\" He said, \"Do you know what is Allah's right on His \nslaves?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on his slaves is that \nthey should worship Him and not worship anything besides Him.\" He then proceeded for a while, and \nagain said, \"O Mu`adh bin Jabal!\" I replied. \"Labbaik, O Allah's Messenger (ﷺ), and Sa`daik.\" He said, \"Do \nyou know what is (Allah's) slaves' (people's) right on Allah if they did that?\" I replied, \"Allah and His \nApostle know better.\" He said, \"The right of (Allah's) slaves on Allah is that He should not punish \nthem (if they did that).",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا أَنَا رَدِيفُ النَّبِيِّ، صلى الله عليه وسلم لَيْسَ بَيْنِي وَبَيْنَهُ إِلاَّ آخِرَةُ الرَّحْلِ فَقَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ، ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ، ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ‏:‏ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى عِبَادِهِ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ اللَّهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ، وَلاَ يُشْرِكُوا بِهِ شَيْئًا ‏\"‏‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوهُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لاَ يُعَذِّبَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6500In-book reference : Book 81, Hadith 89USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 507   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6501,
    "id": 6501,
    "url": "https://sunnah.com/bukhari:6501",
    "bookNumber": 81,
    "hadithNumber": 90,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) had a she-camel called Al-`Adba' and it was too fast to surpass in speed. There came a \nbedouin riding a camel of his, and that camel outstripped it (i.e. Al-Aqba'). That result was hard on the \nMuslims who said sorrowfully, \"Al- Adba has been outstripped.\" Allah's Messenger (ﷺ) said, \"It is due from \nAllah that nothing would be raised high in this world except that He lowers or puts it down.\"",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ كَانَ لِلنَّبِيِّ صلى الله عليه وسلم نَاقَةٌ‏.‏ قَالَ وَحَدَّثَنِي مُحَمَّدٌ أَخْبَرَنَا الْفَزَارِيُّ وَأَبُو خَالِدٍ الأَحْمَرُ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسٍ قَالَ كَانَتْ نَاقَةٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم تُسَمَّى الْعَضْبَاءَ، وَكَانَتْ لاَ تُسْبَقُ، فَجَاءَ أَعْرَابِيٌّ عَلَى قَعُودٍ لَهُ فَسَبَقَهَا، فَاشْتَدَّ ذَلِكَ عَلَى الْمُسْلِمِينَ وَقَالُوا سُبِقَتِ الْعَضْبَاءُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ حَقًّا عَلَى اللَّهِ أَنْ لاَ يَرْفَعَ شَيْئًا مِنَ الدُّنْيَا إِلاَّ وَضَعَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6501In-book reference : Book 81, Hadith 90USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 508   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6502,
    "id": 6502,
    "url": "https://sunnah.com/bukhari:6502",
    "bookNumber": 81,
    "hadithNumber": 91,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah said, 'I will declare war against him who shows hostility to a pious \nworshipper of Mine. And the most beloved things with which My slave comes nearer to Me, is what I \nhave enjoined upon him; and My slave keeps on coming closer to Me through performing Nawafil \n(praying or doing extra deeds besides what is obligatory) till I love him, so I become his sense of \nhearing with which he hears, and his sense of sight with which he sees, and his hand with which he \ngrips, and his leg with which he walks; and if he asks Me, I will give him, and if he asks My \nprotection (Refuge), I will protect him; (i.e. give him My Refuge) and I do not hesitate to do anything \nas I hesitate to take the soul of the believer, for he hates death, and I hate to disappoint him.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُثْمَانَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ قَالَ مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَىَّ عَبْدِي بِشَىْءٍ أَحَبَّ إِلَىَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَىَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَىْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ الْمُؤْمِنِ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6502In-book reference : Book 81, Hadith 91USC-MSA web (English) reference : Vol. 8, Book 76, Hadith 509   (deprecated numbering scheme)"
  }
]