[
  {
    "hadithGlobalNumber": 3901,
    "id": 3901,
    "url": "https://sunnah.com/bukhari:3901",
    "bookNumber": 63,
    "hadithNumber": 126,
    "narrator": "Narrated Aisha:",
    "english": "Sa`d said, \"O Allah! You know that there is none against whom I am eager to fight more willingly for \nYour Cause than those people who disbelieved Your Apostle and drove him out (of his city). O Allah! \nI think that You have ended the fight between us and them.\"",
    "arabic": "حَدَّثَنِي زَكَرِيَّاءُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ هِشَامٌ فَأَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ سَعْدًا، قَالَ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنَّهُ لَيْسَ أَحَدٌ أَحَبَّ إِلَىَّ أَنْ أُجَاهِدَهُمْ فِيكَ مِنْ قَوْمٍ كَذَّبُوا رَسُولَكَ صلى الله عليه وسلم وَأَخْرَجُوهُ، اللَّهُمَّ فَإِنِّي أَظُنُّ أَنَّكَ قَدْ وَضَعْتَ الْحَرْبَ بَيْنَنَا وَبَيْنَهُمْ‏.‏ وَقَالَ أَبَانُ بْنُ يَزِيدَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ أَخْبَرَتْنِي عَائِشَةُ مِنْ قَوْمٍ كَذَّبُوا نَبِيَّكَ وَأَخْرَجُوهُ مِنْ قُرَيْشٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3901In-book reference : Book 63, Hadith 126USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3902,
    "id": 3902,
    "url": "https://sunnah.com/bukhari:3902",
    "bookNumber": 63,
    "hadithNumber": 127,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) started receiving the Divine Inspiration at the age of forty. Then he stayed in Mecca \nfor thirteen years, receiving the Divine Revelation. Then he was ordered to migrate and he lived as an \nEmigrant for ten years and then died at the age of sixty-three (years).",
    "arabic": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بُعِثَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَرْبَعِينَ سَنَةً، فَمَكُثَ بِمَكَّةَ ثَلاَثَ عَشْرَةَ سَنَةً يُوحَى إِلَيْهِ، ثُمَّ أُمِرَ بِالْهِجْرَةِ فَهَاجَرَ عَشْرَ سِنِينَ، وَمَاتَ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3902In-book reference : Book 63, Hadith 127USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3903,
    "id": 3903,
    "url": "https://sunnah.com/bukhari:3903",
    "bookNumber": 63,
    "hadithNumber": 128,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) stayed in Mecca for thirteen years (after receiving the first Divine Inspiration) and \ndied at the age of sixty-three.",
    "arabic": "حَدَّثَنِي مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَكَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ ثَلاَثَ عَشْرَةَ، وَتُوُفِّيَ وَهْوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3903In-book reference : Book 63, Hadith 128USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3904,
    "id": 3904,
    "url": "https://sunnah.com/bukhari:3904",
    "bookNumber": 63,
    "hadithNumber": 129,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) sat on the pulpit and said, \"Allah has given one of His Slaves the choice of receiving \nthe splendor and luxury of the worldly life whatever he likes or to accept the good (of the Hereafter) \nwhich is with Allah. So he has chosen that good which is with Allah.\" On that Abu Bakr wept and \nsaid, \"Our fathers and mothers be sacrificed for you.\" We became astonished at this. The people said, \n\"Look at this old man! Allah's Messenger (ﷺ) talks about a Slave of Allah to whom He has given the option \nto choose either the splendor of this worldly life or the good which is with Him, while he says. 'our \nfathers and mothers be sacrifice(i for you.\" But it was Allah's Messenger (ﷺ) who had been given option, \nand Abu Bakr knew it better than we. Allah's Messenger (ﷺ) added, \"No doubt, I am indebted to Abu Bakr \nmore than to anybody else regarding both his companionship and his wealth. And if I had to take a \nKhalil from my followers, I would certainly have taken Abu Bakr, but the fraternity of Islam is. \nsufficient. Let no door (i.e. Khoukha) of the Mosque remain open, except the door of Abu Bakr.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عُبَيْدٍ ـ يَعْنِي ابْنَ حُنَيْنٍ ـ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَلَسَ عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ إِنَّ عَبْدًا خَيَّرَهُ اللَّهُ بَيْنَ أَنْ يُؤْتِيَهُ مِنْ زَهْرَةِ الدُّنْيَا مَا شَاءَ، وَبَيْنَ مَا عِنْدَهُ، فَاخْتَارَ مَا عِنْدَهُ ‏\"‏‏.‏ فَبَكَى أَبُو بَكْرٍ وَقَالَ فَدَيْنَاكَ بِآبَائِنَا وَأُمَّهَاتِنَا‏.‏ فَعَجِبْنَا لَهُ، وَقَالَ النَّاسُ انْظُرُوا إِلَى هَذَا الشَّيْخِ، يُخْبِرُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَبْدٍ خَيَّرَهُ اللَّهُ بَيْنَ أَنْ يُؤْتِيَهُ مِنْ زَهْرَةِ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ وَهْوَ يَقُولُ فَدَيْنَاكَ بِآبَائِنَا وَأُمَّهَاتِنَا‏.‏ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ الْمُخَيَّرَ، وَكَانَ أَبُو بَكْرٍ هُوَ أَعْلَمَنَا بِهِ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَمَنِّ النَّاسِ عَلَىَّ فِي صُحْبَتِهِ وَمَالِهِ أَبَا بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلاً مِنْ أُمَّتِي لاَتَّخَذْتُ أَبَا بَكْرٍ، إِلاَّ خُلَّةَ الإِسْلاَمِ، لاَ يَبْقَيَنَّ فِي الْمَسْجِدِ خَوْخَةٌ إِلاَّ خَوْخَةُ أَبِي بَكْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3904In-book reference : Book 63, Hadith 129USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3905,
    "id": 3905,
    "url": "https://sunnah.com/bukhari:3905",
    "bookNumber": 63,
    "hadithNumber": 130,
    "narrator": "Narrated 'Aisha:",
    "english": "(the wife of the Prophet) I never remembered my parents believing in any religion other than the true religion (i.e. Islam), and (I don't remember) a single day passing without our being visited by Allah's Messenger (ﷺ) in the morning and in the evening. When the Muslims were put to test (i.e. troubled by the pagans), Abu Bakr set out migrating to the land of Ethiopia, and when he reached Bark-al-Ghimad, Ibn Ad-Daghina, the chief of the tribe of Qara, met him and said, \"O Abu Bakr! Where are you going?\" Abu Bakr replied, \"My people have turned me out (of my country), so I want to wander on the earth and worship my Lord.\" Ibn Ad-Daghina said, \"O Abu Bakr! A man like you should not leave his home-land, nor should he be driven out, because you help the destitute, earn their livings, and you keep good relations with your Kith and kin, help the weak and poor, entertain guests generously, and help the calamity-stricken persons. Therefore I am your protector. Go back and worship your Lord in your town.\" \n\n \n\n  So Abu Bakr returned and Ibn Ad-Daghina accompanied him. In the evening Ibn Ad-Daghina visited the nobles of Quraish and said to them. \"A man like Abu Bakr should not leave his homeland, nor should he be driven out. Do you (i.e. Quraish) drive out a man who helps the destitute, earns their living, keeps good relations with his Kith and kin, helps the weak and poor, entertains guests generously and helps the calamity-stricken persons?\" So the people of Quraish could not refuse Ibn Ad-Daghina's protection, and they said to Ibn Ad-Daghina, \"Let Abu Bakr worship his Lord in his house. He can pray and recite there whatever he likes, but he should not hurt us with it, and should not do it publicly, because we are afraid that he may affect our women and children.\" Ibn Ad-Daghina told Abu Bakr of all that. Abu Bakr stayed in that state, worshipping his Lord in his house. He did not pray publicly, nor did he recite Quran outside his house.  Then a thought occurred to Abu Bakr to build a mosque in front of his house, and there he used to pray and recite the Quran. The women and children of the pagans began to gather around him in great number. They used to wonder at him and look at him. Abu Bakr was a man who used to weep too much, and he could not help weeping on reciting the Quran. That situation scared the nobles of the pagans of Quraish, so they sent for Ibn Ad-Daghina. When he came to them, they said, \"We accepted your protection of Abu Bakr on condition that he should worship his Lord in his house, but he has violated the conditions and he has built a mosque in front of his house where he prays and recites the Quran publicly. We are now afraid that he may affect our women and children unfavorably. So, prevent him from that. If he likes to confine the worship of his Lord to his house, he may do so, but if he insists on doing that openly, ask him to release you from your obligation to protect him, for we dislike to break our pact with you, but we deny Abu Bakr the right to announce his act publicly.\" Ibn Ad-Daghina went to Abu- Bakr and said, (\"O Abu Bakr!) You know well what contract I have made on your behalf; now, you are either to abide by it, or else release me from my obligation of protecting you, because I do not want the 'Arabs hear that my people have dishonored a contract I have made on behalf of another man.\" Abu Bakr replied, \"I release you from your pact to protect me, and am pleased with the protection from Allah.\" \n\n \n\n   At that time the Prophet (ﷺ) was in Mecca, and he said to the Muslims, \"In a dream I have been shown your migration place, a land of date palm trees, between two mountains, the two stony tracts.\" So, some people migrated to Medina, and most of those people who had previously migrated to the land of Ethiopia, returned to Medina. Abu Bakr also prepared to leave for Medina, but Allah's Messenger (ﷺ) said to him, \"Wait for a while, because I hope that I will be allowed to migrate also.\" Abu Bakr said, \"Do you indeed expect this? Let my father be sacrificed for you!\" The Prophet (ﷺ) said, \"Yes.\" So Abu Bakr did not migrate for the sake of Allah's Messenger (ﷺ) in order to accompany him. He fed two she-camels he possessed with the leaves of As-Samur tree that fell on being struck by a stick for four months. \n\n \n\n   One day, while we were sitting in Abu Bakr's house at noon, someone said to Abu Bakr, \"This is Allah's Messenger (ﷺ) with his head covered coming at a time at which he never used to visit us before.\" Abu Bakr said, \"May my parents be sacrificed for him. By Allah, he has not come at this hour except for a great necessity.\" So Allah's Messenger (ﷺ) came and asked permission to enter, and he was allowed to enter. When he entered, he said to Abu Bakr. \"Tell everyone who is present with you to go away.\" Abu Bakr replied, \"There are none but your family. May my father be sacrificed for you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"i have been given permission to migrate.\" Abu Bakr said, \"Shall I accompany you? May my father be sacrificed for you, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"Yes.\" Abu Bakr said, \"O Allah's Messenger (ﷺ)! May my father be sacrificed for you, take one of these two she-camels of mine.\" Allah's Messenger (ﷺ) replied, \"(I will accept it) with payment.\" So we prepared the baggage quickly and put some journey food in a leather bag for them. Asma, Abu Bakr's daughter, cut a piece from her waist belt and tied the mouth of the leather bag with it, and for that reason she was named Dhat-un-Nitaqain (i.e. the owner of two belts). \n\n \n\n   Then Allah's Messenger (ﷺ) and Abu Bakr reached a cave on the mountain of Thaur and stayed there for three nights. 'Abdullah bin Abi Bakr who was intelligent and a sagacious youth, used to stay (with them) aver night. He used to leave them before day break so that in the morning he would be with Quraish as if he had spent the night in Mecca. He would keep in mind any plot made against them, and when it became dark he would (go and) inform them of it. 'Amir bin Fuhaira, the freed slave of Abu Bakr, used to bring the milch sheep (of his master, Abu Bakr) to them a little while after nightfall in order to rest the sheep there. So they always had fresh milk at night, the milk of their sheep, and the milk which they warmed by throwing heated stones in it. 'Amir bin Fuhaira would then call the herd away when it was still dark (before daybreak). He did the same in each of those three nights. Allah's Messenger (ﷺ) and Abu Bakr had hired a man from the tribe of Bani Ad-Dail from the family of Bani Abd bin Adi as an expert guide, and he was in alliance with the family of Al-'As bin Wail As-Sahmi and he was on the religion of the infidels of Quraish. The Prophet (ﷺ) and Abu Bakr trusted him and gave him their two she-camels and took his promise to bring their two she camels to the cave of the mountain of Thaur in the morning after three nights later. And (when they set out), 'Amir bin Fuhaira and the guide went along with them and the guide led them along the sea-shore.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ قَطُّ إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ، وَلَمْ يَمُرَّ عَلَيْنَا يَوْمٌ إِلاَّ يَأْتِينَا فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم طَرَفَىِ النَّهَارِ بُكْرَةً وَعَشِيَّةً، فَلَمَّا ابْتُلِيَ الْمُسْلِمُونُ خَرَجَ أَبُو بَكْرٍ مُهَاجِرًا نَحْوَ أَرْضِ الْحَبَشَةِ، حَتَّى بَلَغَ بَرْكَ الْغِمَادِ لَقِيَهُ ابْنُ الدَّغِنَةِ وَهْوَ سَيِّدُ الْقَارَةِ‏.‏ فَقَالَ أَيْنَ تُرِيدُ يَا أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَخْرَجَنِي قَوْمِي، فَأُرِيدُ أَنْ أَسِيحَ فِي الأَرْضِ وَأَعْبُدَ رَبِّي‏.‏ قَالَ ابْنُ الدَّغِنَةِ فَإِنَّ مِثْلَكَ يَا أَبَا بَكْرٍ لاَ يَخْرُجُ وَلاَ يُخْرَجُ، إِنَّكَ تَكْسِبُ الْمَعْدُومَ، وَتَصِلُ الرَّحِمَ وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ، فَأَنَا لَكَ جَارٌ، ارْجِعْ وَاعْبُدْ رَبَّكَ بِبَلَدِكَ‏.‏ فَرَجَعَ وَارْتَحَلَ مَعَهُ ابْنُ الدَّغِنَةِ، فَطَافَ ابْنُ الدَّغِنَةِ عَشِيَّةً فِي أَشْرَافِ قُرَيْشٍ، فَقَالَ لَهُمْ إِنَّ أَبَا بَكْرٍ لاَ يَخْرُجُ مِثْلُهُ وَلاَ يُخْرَجُ، أَتُخْرِجُونَ رَجُلاً يَكْسِبُ الْمَعْدُومَ، وَيَصِلُ الرَّحِمَ، وَيَحْمِلُ الْكَلَّ، وَيَقْرِي الضَّيْفَ، وَيُعِينُ عَلَى نَوَائِبِ الْحَقِّ فَلَمْ تُكَذِّبْ قُرَيْشٌ بِجِوَارِ ابْنِ الدَّغِنَةِ، وَقَالُوا لاِبْنِ الدَّغِنَةِ مُرْ أَبَا بَكْرٍ فَلْيَعْبُدْ رَبَّهُ فِي دَارِهِ، فَلْيُصَلِّ فِيهَا وَلْيَقْرَأْ مَا شَاءَ، وَلاَ يُؤْذِينَا بِذَلِكَ، وَلاَ يَسْتَعْلِنْ بِهِ، فَإِنَّا نَخْشَى أَنْ يَفْتِنَ نِسَاءَنَا وَأَبْنَاءَنَا‏.‏ فَقَالَ ذَلِكَ ابْنُ الدَّغِنَةِ لأَبِي بَكْرٍ، فَلَبِثَ أَبُو بَكْرٍ بِذَلِكَ يَعْبُدُ رَبَّهُ فِي دَارِهِ، وَلاَ يَسْتَعْلِنُ بِصَلاَتِهِ، وَلاَ يَقْرَأُ فِي غَيْرِ دَارِهِ، ثُمَّ بَدَا لأَبِي بَكْرٍ فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ وَكَانَ يُصَلِّي فِيهِ وَيَقْرَأُ الْقُرْآنَ، فَيَنْقَذِفُ عَلَيْهِ نِسَاءُ الْمُشْرِكِينَ وَأَبْنَاؤُهُمْ، وَهُمْ يَعْجَبُونَ مِنْهُ، وَيَنْظُرُونَ إِلَيْهِ، وَكَانَ أَبُو بَكْرٍ رَجُلاً بَكَّاءً، لاَ يَمْلِكُ عَيْنَيْهِ إِذَا قَرَأَ الْقُرْآنَ، وَأَفْزَعَ ذَلِكَ أَشْرَافَ قُرَيْشٍ مِنَ الْمُشْرِكِينَ، فَأَرْسَلُوا إِلَى ابْنِ الدَّغِنَةِ، فَقَدِمَ عَلَيْهِمْ‏.‏ فَقَالُوا إِنَّا كُنَّا أَجَرْنَا أَبَا بَكْرٍ بِجِوَارِكَ، عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ، فَقَدْ جَاوَزَ ذَلِكَ، فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، فَأَعْلَنَ بِالصَّلاَةِ وَالْقِرَاءَةِ فِيهِ، وَإِنَّا قَدْ خَشِينَا أَنْ يَفْتِنَ نِسَاءَنَا وَأَبْنَاءَنَا فَانْهَهُ، فَإِنْ أَحَبَّ أَنْ يَقْتَصِرَ عَلَى أَنْ يَعْبُدَ رَبَّهُ فِي دَارِهِ فَعَلَ، وَإِنْ أَبَى إِلاَّ أَنْ يُعْلِنَ بِذَلِكَ فَسَلْهُ أَنْ يَرُدَّ إِلَيْكَ ذِمَّتَكَ، فَإِنَّا قَدْ كَرِهْنَا أَنْ نُخْفِرَكَ، وَلَسْنَا مُقِرِّينَ لأَبِي بَكْرٍ الاِسْتِعْلاَنَ‏.‏ قَالَتْ عَائِشَةُ فَأَتَى ابْنُ الدَّغِنَةِ إِلَى أَبِي بَكْرٍ فَقَالَ قَدْ عَلِمْتَ الَّذِي عَاقَدْتُ لَكَ عَلَيْهِ، فَإِمَّا أَنْ تَقْتَصِرَ عَلَى ذَلِكَ، وَإِمَّا أَنْ تَرْجِعَ إِلَىَّ ذِمَّتِي، فَإِنِّي لاَ أُحِبُّ أَنْ تَسْمَعَ الْعَرَبُ أَنِّي أُخْفِرْتُ فِي رَجُلٍ عَقَدْتُ لَهُ‏.‏ فَقَالَ أَبُو بَكْرٍ فَإِنِّي أَرُدُّ إِلَيْكَ جِوَارَكَ وَأَرْضَى بِجِوَارِ اللَّهِ عَزَّ وَجَلَّ‏.‏ وَالنَّبِيُّ صلى الله عليه وسلم يَوْمَئِذٍ بِمَكَّةَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِلْمُسْلِمِينَ ‏\"‏ إِنِّي أُرِيتُ دَارَ هِجْرَتِكُمْ ذَاتَ نَخْلٍ بَيْنَ لاَبَتَيْنِ ‏\"‏‏.‏ وَهُمَا الْحَرَّتَانِ، فَهَاجَرَ مَنْ هَاجَرَ قِبَلَ الْمَدِينَةِ، وَرَجَعَ عَامَّةُ مَنْ كَانَ هَاجَرَ بِأَرْضِ الْحَبَشَةِ إِلَى الْمَدِينَةِ، وَتَجَهَّزَ أَبُو بَكْرٍ قِبَلَ الْمَدِينَةِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكَ، فَإِنِّي أَرْجُو أَنْ يُؤْذَنَ لِي ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ وَهَلْ تَرْجُو ذَلِكَ بِأَبِي أَنْتَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَحَبَسَ أَبُو بَكْرٍ نَفْسَهُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِيَصْحَبَهُ، وَعَلَفَ رَاحِلَتَيْنِ كَانَتَا عِنْدَهُ وَرَقَ السَّمُرِ وَهْوَ الْخَبَطُ أَرْبَعَةَ أَشْهُرٍ‏.‏ قَالَ ابْنُ شِهَابٍ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَبَيْنَمَا نَحْنُ يَوْمًا جُلُوسٌ فِي بَيْتِ أَبِي بَكْرٍ فِي نَحْرِ الظَّهِيرَةِ قَالَ قَائِلٌ لأَبِي بَكْرٍ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُتَقَنِّعًا ـ فِي سَاعَةٍ لَمْ يَكُنْ يَأْتِينَا فِيهَا ـ فَقَالَ أَبُو بَكْرٍ فِدَاءٌ لَهُ أَبِي وَأُمِّي، وَاللَّهِ مَا جَاءَ بِهِ فِي هَذِهِ السَّاعَةِ إِلاَّ أَمْرٌ‏.‏ قَالَتْ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنَ، فَأُذِنَ لَهُ فَدَخَلَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي بَكْرٍ ‏\"‏ أَخْرِجْ مَنْ عِنْدَكَ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّمَا هُمْ أَهْلُكَ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنِّي قَدْ أُذِنَ لِي فِي الْخُرُوجِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ الصَّحَابَةُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ فَخُذْ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ إِحْدَى رَاحِلَتَىَّ هَاتَيْنِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِالثَّمَنِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَجَهَّزْنَاهُمَا أَحَثَّ الْجَهَازِ، وَصَنَعْنَا لَهُمَا سُفْرَةً فِي جِرَابٍ، فَقَطَعَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قِطْعَةً مَنْ نِطَاقِهَا فَرَبَطَتْ بِهِ عَلَى فَمِ الْجِرَابِ، فَبِذَلِكَ سُمِّيَتْ ذَاتَ النِّطَاقِ ـ قَالَتْ ـ ثُمَّ لَحِقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ بِغَارٍ فِي جَبَلِ ثَوْرٍ فَكَمَنَا فِيهِ ثَلاَثَ لَيَالٍ، يَبِيتُ عِنْدَهُمَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ وَهْوَ غُلاَمٌ شَابٌّ ثَقِفٌ لَقِنٌ، فَيُدْلِجُ مِنْ عِنْدِهِمَا بِسَحَرٍ، فَيُصْبِحُ مَعَ قُرَيْشٍ بِمَكَّةَ كَبَائِتٍ، فَلاَ يَسْمَعُ أَمْرًا يُكْتَادَانِ بِهِ إِلاَّ وَعَاهُ، حَتَّى يَأْتِيَهُمَا بِخَبَرِ ذَلِكَ حِينَ يَخْتَلِطُ الظَّلاَمُ، وَيَرْعَى عَلَيْهِمَا عَامِرُ بْنُ فُهَيْرَةَ مَوْلَى أَبِي بَكْرٍ مِنْحَةً مِنْ غَنَمٍ، فَيُرِيحُهَا عَلَيْهِمَا حِينَ يَذْهَبُ سَاعَةٌ مِنَ الْعِشَاءِ، فَيَبِيتَانِ فِي رِسْلٍ وَهْوَ لَبَنُ مِنْحَتِهِمَا وَرَضِيفِهِمَا، حَتَّى يَنْعِقَ بِهَا عَامِرُ بْنُ فُهَيْرَةَ بِغَلَسٍ، يَفْعَلُ ذَلِكَ فِي كُلِّ لَيْلَةٍ مِنْ تِلْكَ اللَّيَالِي الثَّلاَثِ، وَاسْتَأْجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ، وَهْوَ مِنْ بَنِي عَبْدِ بْنِ عَدِيٍّ هَادِيًا خِرِّيتًا ـ وَالْخِرِّيتُ الْمَاهِرُ بِالْهِدَايَةِ ـ قَدْ غَمَسَ حِلْفًا فِي آلِ الْعَاصِ بْنِ وَائِلٍ السَّهْمِيِّ، وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ فَأَمِنَاهُ، فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَاعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ بِرَاحِلَتَيْهِمَا صُبْحَ ثَلاَثٍ، وَانْطَلَقَ مَعَهُمَا عَامِرُ بْنُ فُهَيْرَةَ وَالدَّلِيلُ فَأَخَذَ بِهِمْ طَرِيقَ السَّوَاحِلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3905In-book reference : Book 63, Hadith 130USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3906,
    "id": 3906,
    "url": "https://sunnah.com/bukhari:3906",
    "bookNumber": 63,
    "hadithNumber": 131,
    "narrator": "The nephew of Suraqa bin Ju'sham said that his father informed him that he heard Suraqa bin Ju'sham saying, \"The messengers of the heathens of Quraish came to us declaring that they had assigned for the persons why would kill or arrest Allah's Messenger (ﷺ) and Abu Bakr, a reward equal to their bloodmoney. While I was sitting in one of the gatherings of my tribe. Bani Mudlij, a man from them came to us and stood up while we were sitting, and said, \"O Suraqa! No doubt, I have just seen some people far away on the seashore, and I think they are Muhammad and his companions.\" Suraqa added, \"I too realized that it must have been they. But I said 'No, it is not they, but you have seen so-and-so, and so-and-so whom we saw set out.' I stayed in the gathering for a while and then got up and left for my home. and ordered my slave-girl to get my horse which was behind a hillock, and keep it ready for me. \n\n \n\n   Then I took my spear and left by the back door of my house dragging the lower end of the spear on the ground and keeping it low. Then I reached my horse, mounted it and made it gallop. When I approached them (i.e. Muhammad and Abu Bakr), my horse stumbled and I fell down from it, Then I stood up, got hold of my quiver and took out the divining arrows and drew lots as to whether I should harm them (i.e. the Prophet (ﷺ) and Abu Bakr) or not, and the lot which I disliked came out. But I remounted my horse and let it gallop, giving no importance to the divining arrows. When I heard the recitation of the Quran by Allah's Messenger (ﷺ) who did not look hither and thither while Abu Bakr was doing it often, suddenly the forelegs of my horse sank into the ground up to the knees, and I fell down from it. Then I rebuked it and it got up but could hardly take out its forelegs from the ground, and when it stood up straight again, its fore-legs caused dust to rise up in the sky like smoke. Then again I drew lots with the divining arrows, and the lot which I disliked, came out. So I called upon them to feel secure. They stopped, and I remounted my horse and went to them. When I saw how I had been hampered from harming them, it came to my mind that the cause of Allah's Messenger (ﷺ) (i.e. Islam) will become victorious. So I said to him, \"Your people have assigned a reward equal to the bloodmoney for your head.\" Then I told them all the plans the people of Mecca had made concerning them. Then I offered them some journey food and goods but they refused to take anything and did not ask for anything, but the Prophet (ﷺ) said, \"Do not tell others about us.\" Then I requested him to write for me a statement of security and peace. He ordered 'Amr bin Fuhaira who wrote it for me on a parchment, and then Allah's Messenger (ﷺ) proceeded on his way. \n\n \n\n   Narrated 'Urwa bin Az-Zubair:",
    "english": "Allah's Messenger (ﷺ) met Az-Zubair in a caravan of Muslim merchants who were returning from Sham. Az-Zubair provided Allah's Messenger (ﷺ) and Abu Bakr with white clothes to wear. When the Muslims of Medina heard the news of the departure of Allah's Messenger (ﷺ) from Mecca (towards Medina), they started going to the Harra every morning . They would wait for him till the heat of the noon forced them to return. One day, after waiting for a long while, they returned home, and when they went into their houses, a Jew climbed up the roof of one of the forts of his people to look for some thing, and he saw Allah's Messenger (ﷺ) and his companions dressed in white clothes, emerging out of the desert mirage.  The Jew could not help shouting at the top of his voice, \"O you 'Arabs! Here is your great man whom you have been waiting for!\" So all the Muslims rushed to their arms and received Allah's Messenger (ﷺ) on the summit of Harra. The Prophet (ﷺ) turned with them to the right and alighted at the quarters of Bani 'Amr bin 'Auf, and this was on Monday in the month of Rabi-ul-Awal. Abu Bakr stood up, receiving the people while Allah's Messenger (ﷺ) sat down and kept silent. Some of the Ansar who came and had not seen Allah's Messenger (ﷺ) before, began greeting Abu Bakr, but when the sunshine fell on Allah's Messenger (ﷺ) and Abu Bakr came forward and shaded him with his sheet only then the people came to know Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) stayed with Bani 'Amr bin 'Auf for ten nights and established the mosque (mosque of Quba) which was founded on piety. Allah's Messenger (ﷺ) prayed in it and then mounted his she-camel and proceeded on, accompanied by the people till his she-camel knelt down at (the place of) the Mosque of Allah's Messenger (ﷺ) at Medina. Some Muslims used to pray there in those days, and that place was a yard for drying dates belonging to Suhail and Sahl, the orphan boys who were under the guardianship of 'Asad bin Zurara. When his she-camel knelt down, Allah's Messenger (ﷺ) said, \"This place, Allah willing, will be our abiding place.\" Allah's Messenger (ﷺ) then called the two boys and told them to suggest a price for that yard so that he might take it as a mosque. The two boys said, \"No, but we will give it as a gift, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) then built a mosque there. The Prophet (ﷺ) himself started carrying unburnt bricks for its building and while doing so, he was saying \"This load is better than the load of Khaibar, for it is more pious in the Sight of Allah and purer and better rewardable.\" He was also saying, \"O Allah! The actual reward is the reward in the Hereafter, so bestow Your Mercy on the Ansar and the Emigrants.\" Thus the Prophet (ﷺ) recited (by way of proverb) the poem of some Muslim poet whose name is unknown to me. \n\n (Ibn Shibab said, \"In the Hadiths it does not occur that Allah's Apostle \n\n recited a complete poetic verse other than this one.\")",
    "arabic": "قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ مَالِكٍ الْمُدْلِجِيُّ ـ وَهْوَ ابْنُ أَخِي سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ ـ أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، سَمِعَ سُرَاقَةَ بْنَ جُعْشُمٍ، يَقُولُ جَاءَنَا رُسُلُ كُفَّارِ قُرَيْشٍ يَجْعَلُونَ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ دِيَةَ كُلِّ وَاحِدٍ مِنْهُمَا، مَنْ قَتَلَهُ أَوْ أَسَرَهُ، فَبَيْنَمَا أَنَا جَالِسٌ فِي مَجْلِسٍ مِنْ مَجَالِسِ قَوْمِي بَنِي مُدْلِجٍ أَقْبَلَ رَجُلٌ مِنْهُمْ حَتَّى قَامَ عَلَيْنَا وَنَحْنُ جُلُوسٌ، فَقَالَ يَا سُرَاقَةُ، إِنِّي قَدْ رَأَيْتُ آنِفًا أَسْوِدَةً بِالسَّاحِلِ ـ أُرَاهَا مُحَمَّدًا وَأَصْحَابَهُ‏.‏ قَالَ سُرَاقَةُ فَعَرَفْتُ أَنَّهُمْ هُمْ، فَقُلْتُ لَهُ إِنَّهُمْ لَيْسُوا بِهِمْ، وَلَكِنَّكَ رَأَيْتَ فُلاَنًا وَفُلاَنًا انْطَلَقُوا بِأَعْيُنِنَا‏.‏ ثُمَّ لَبِثْتُ فِي الْمَجْلِسِ سَاعَةً، ثُمَّ قُمْتُ فَدَخَلْتُ فَأَمَرْتُ جَارِيَتِي أَنْ تَخْرُجَ بِفَرَسِي وَهْىَ مِنْ وَرَاءِ أَكَمَةٍ فَتَحْبِسَهَا عَلَىَّ، وَأَخَذْتُ رُمْحِي، فَخَرَجْتُ بِهِ مِنْ ظَهْرِ الْبَيْتِ، فَحَطَطْتُ بِزُجِّهِ الأَرْضَ، وَخَفَضْتُ عَالِيَهُ حَتَّى أَتَيْتُ فَرَسِي فَرَكِبْتُهَا، فَرَفَعْتُهَا تُقَرَّبُ بِي حَتَّى دَنَوْتُ مِنْهُمْ، فَعَثَرَتْ بِي فَرَسِي، فَخَرَرْتُ عَنْهَا فَقُمْتُ، فَأَهْوَيْتُ يَدِي إِلَى كِنَانَتِي فَاسْتَخْرَجْتُ مِنْهَا الأَزْلاَمَ، فَاسْتَقْسَمْتُ بِهَا أَضُرُّهُمْ أَمْ لاَ فَخَرَجَ الَّذِي أَكْرَهُ، فَرَكِبْتُ فَرَسِي، وَعَصَيْتُ الأَزْلاَمَ، تُقَرِّبُ بِي حَتَّى إِذَا سَمِعْتُ قِرَاءَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ لاَ يَلْتَفِتُ، وَأَبُو بَكْرٍ يُكْثِرُ الاِلْتِفَاتَ سَاخَتْ يَدَا فَرَسِي فِي الأَرْضِ حَتَّى بَلَغَتَا الرُّكْبَتَيْنِ، فَخَرَرْتُ عَنْهَا ثُمَّ زَجَرْتُهَا فَنَهَضَتْ، فَلَمْ تَكَدْ تُخْرِجُ يَدَيْهَا، فَلَمَّا اسْتَوَتْ قَائِمَةً، إِذَا لأَثَرِ يَدَيْهَا عُثَانٌ سَاطِعٌ فِي السَّمَاءِ مِثْلُ الدُّخَانِ، فَاسْتَقْسَمْتُ بِالأَزْلاَمِ، فَخَرَجَ الَّذِي أَكْرَهُ، فَنَادَيْتُهُمْ بِالأَمَانِ فَوَقَفُوا، فَرَكِبْتُ فَرَسِي حَتَّى جِئْتُهُمْ، وَوَقَعَ فِي نَفْسِي حِينَ لَقِيتُ مَا لَقِيتُ مِنَ الْحَبْسِ عَنْهُمْ أَنْ سَيَظْهَرُ أَمْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ إِنَّ قَوْمَكَ قَدْ جَعَلُوا فِيكَ الدِّيَةَ‏.‏ وَأَخْبَرْتُهُمْ أَخْبَارَ مَا يُرِيدُ النَّاسُ بِهِمْ، وَعَرَضْتُ عَلَيْهِمِ الزَّادَ وَالْمَتَاعَ، فَلَمْ يَرْزَآنِي وَلَمْ يَسْأَلاَنِي إِلاَّ أَنْ قَالَ أَخْفِ عَنَّا‏.‏ فَسَأَلْتُهُ أَنْ يَكْتُبَ لِي كِتَابَ أَمْنٍ، فَأَمَرَ عَامِرَ بْنَ فُهَيْرَةَ، فَكَتَبَ فِي رُقْعَةٍ مِنْ أَدِيمٍ، ثُمَّ مَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَقِيَ الزُّبَيْرَ فِي رَكْبٍ مِنَ الْمُسْلِمِينَ كَانُوا تِجَارًا قَافِلِينَ مِنَ الشَّأْمِ، فَكَسَا الزُّبَيْرُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ ثِيَابَ بَيَاضٍ، وَسَمِعَ الْمُسْلِمُونَ بِالْمَدِينَةِ مَخْرَجَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ مَكَّةَ، فَكَانُوا يَغْدُونَ كُلَّ غَدَاةٍ إِلَى الْحَرَّةِ فَيَنْتَظِرُونَهُ، حَتَّى يَرُدَّهُمْ حَرُّ الظَّهِيرَةِ، فَانْقَلَبُوا يَوْمًا بَعْدَ مَا أَطَالُوا انْتِظَارَهُمْ، فَلَمَّا أَوَوْا إِلَى بُيُوتِهِمْ، أَوْفَى رَجُلٌ مِنْ يَهُودَ عَلَى أُطُمٍ مِنْ آطَامِهِمْ لأَمْرٍ يَنْظُرُ إِلَيْهِ، فَبَصُرَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَأَصْحَابِهِ مُبَيَّضِينَ يَزُولُ بِهِمُ السَّرَابُ، فَلَمْ يَمْلِكِ الْيَهُودِيُّ أَنْ قَالَ بِأَعْلَى صَوْتِهِ يَا مَعَاشِرَ الْعَرَبِ هَذَا جَدُّكُمُ الَّذِي تَنْتَظِرُونَ‏.‏ فَثَارَ الْمُسْلِمُونَ إِلَى السِّلاَحِ، فَتَلَقَّوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بِظَهْرِ الْحَرَّةِ، فَعَدَلَ بِهِمْ ذَاتَ الْيَمِينِ حَتَّى نَزَلَ بِهِمْ فِي بَنِي عَمْرِو بْنِ عَوْفٍ، وَذَلِكَ يَوْمَ الاِثْنَيْنِ مِنْ شَهْرِ رَبِيعٍ الأَوَّلِ، فَقَامَ أَبُو بَكْرٍ لِلنَّاسِ، وَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَامِتًا، فَطَفِقَ مَنْ جَاءَ مِنَ الأَنْصَارِ مِمَّنْ لَمْ يَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُحَيِّي أَبَا بَكْرٍ، حَتَّى أَصَابَتِ الشَّمْسُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ أَبُو بَكْرٍ حَتَّى ظَلَّلَ عَلَيْهِ بِرِدَائِهِ، فَعَرَفَ النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ، فَلَبِثَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَنِي عَمْرِو بْنِ عَوْفٍ بِضْعَ عَشْرَةَ لَيْلَةً وَأُسِّسَ الْمَسْجِدُ الَّذِي أُسِّسَ عَلَى التَّقْوَى، وَصَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم، ثُمَّ رَكِبَ رَاحِلَتَهُ فَسَارَ يَمْشِي مَعَهُ النَّاسُ حَتَّى بَرَكَتْ عِنْدَ مَسْجِدِ الرَّسُولِ صلى الله عليه وسلم بِالْمَدِينَةِ، وَهْوَ يُصَلِّي فِيهِ يَوْمَئِذٍ رِجَالٌ مِنَ الْمُسْلِمِينَ، وَكَانَ مِرْبَدًا لِلتَّمْرِ لِسُهَيْلٍ وَسَهْلٍ غُلاَمَيْنِ يَتِيمَيْنِ فِي حَجْرِ أَسْعَدَ بْنِ زُرَارَةَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ بَرَكَتْ بِهِ رَاحِلَتُهُ ‏\"‏ هَذَا إِنْ شَاءَ اللَّهُ الْمَنْزِلُ ‏\"‏‏.‏ ثُمَّ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْغُلاَمَيْنِ، فَسَاوَمَهُمَا بِالْمِرْبَدِ لِيَتَّخِذَهُ مَسْجِدًا، فَقَالاَ لاَ بَلْ نَهَبُهُ لَكَ يَا رَسُولَ اللَّهِ، ثُمَّ بَنَاهُ مَسْجِدًا، وَطَفِقَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْقُلُ مَعَهُمُ اللَّبِنَ فِي بُنْيَانِهِ، وَيَقُولُ وَهُوَ يَنْقُلُ اللَّبِنَ ‏\"‏ هَذَا الْحِمَالُ لاَ حِمَالَ خَيْبَرْ هَذَا أَبَرُّ رَبَّنَا وَأَطْهَرْ ‏\"‏‏.‏ وَيَقُولُ ‏\"‏ اللَّهُمَّ إِنَّ الأَجْرَ أَجْرُ الآخِرَهْ فَارْحَمِ الأَنْصَارَ وَالْمُهَاجِرَهْ ‏\"‏‏.‏ فَتَمَثَّلَ بِشِعْرِ رَجُلٍ مِنَ الْمُسْلِمِينَ لَمْ يُسَمَّ لِي‏.‏ قَالَ ابْنُ شِهَابٍ وَلَمْ يَبْلُغْنَا فِي الأَحَادِيثِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَمَثَّلَ بِبَيْتِ شِعْرٍ تَامٍّ غَيْرِ هذه الآيات",
    "reference": "Reference : Sahih al-Bukhari 3906In-book reference : Book 63, Hadith 131USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3907,
    "id": 3907,
    "url": "https://sunnah.com/bukhari:3907",
    "bookNumber": 63,
    "hadithNumber": 132,
    "narrator": "Narrated Asma:",
    "english": "I prepared the journey food for the Prophet (ﷺ) and Abu Bakr when they wanted (to migrate to) Medina. I \nsaid to my father (Abu Bakr), \"I do not have anything to tie the container of the journey food with \nexcept my waist belt.\" He said, \"Divide it lengthwise into two.\" I did so, and for this reason I was \nnamed 'Dhat-un-Nitaqain' (i.e. the owner of two belts). (Ibn `Abbas said, \"Asma', Dhat-un-Nitaq.\")",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، وَفَاطِمَةَ، عَنْ أَسْمَاءَ، رضى الله عنها صَنَعْتُ سُفْرَةً لِلنَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ حِينَ أَرَادَا الْمَدِينَةَ، فَقُلْتُ لأَبِي مَا أَجِدُ شَيْئًا أَرْبُطُهُ إِلاَّ نِطَاقِي‏.‏ قَالَ فَشُقِّيهِ‏.‏ فَفَعَلْتُ، فَسُمِّيتُ ذَاتَ النِّطَاقَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3907In-book reference : Book 63, Hadith 132USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3908,
    "id": 3908,
    "url": "https://sunnah.com/bukhari:3908",
    "bookNumber": 63,
    "hadithNumber": 133,
    "narrator": "Narrated Al-Bara:",
    "english": "When the Prophet (ﷺ) migrated to Medina, Suraqa bin Malik bin Ju'sham pursued him. The Prophet (ﷺ) \ninvoked evil on him, therefore the forelegs of his horse sank into the ground. Suraqa said (to the \nProphet ), \"Invoke Allah to rescue me, and I will not harm you. \"The Prophet (ﷺ) invoked Allah for him. \nThen Allah's Messenger (ﷺ) felt thirsty and he passed by a shepherd. Abu Bakr said, \"I took a bowl and \nmilked a little milk in it and brought it to the Prophet (ﷺ) and he drank till I was pleased.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ لَمَّا أَقْبَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ تَبِعَهُ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ، فَدَعَا عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَسَاخَتْ بِهِ فَرَسُهُ‏.‏ قَالَ ادْعُ اللَّهَ لِي وَلاَ أَضُرُّكَ‏.‏ فَدَعَا لَهُ‏.‏ قَالَ فَعَطِشَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَرَّ بِرَاعٍ، قَالَ أَبُو بَكْرٍ فَأَخَذْتُ قَدَحًا فَحَلَبْتُ فِيهِ كُثْبَةً مِنْ لَبَنٍ، فَأَتَيْتُهُ فَشَرِبَ حَتَّى رَضِيتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3908In-book reference : Book 63, Hadith 133USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3909,
    "id": 3909,
    "url": "https://sunnah.com/bukhari:3909",
    "bookNumber": 63,
    "hadithNumber": 134,
    "narrator": "Narrated Asma:",
    "english": "That she conceived `Abdullah bin Az-Zubair. She added, \"I migrated to Medina while I was at full \nterm of pregnancy and alighted at Quba where I gave birth to him. Then I brought him to the Prophet (ﷺ) \nand put him in his lap. The Prophet (ﷺ) asked for a date, chewed it, and put some of its juice in the child's \nmouth. So, the first thing that entered the child's stomach was the saliva of Allah's Messenger (ﷺ). Then the \nProphet rubbed the child's palate with a date and invoked for Allah's Blessings on him, and he was the \nfirst child born amongst the Emigrants in the Islamic Land (i.e. Medina).",
    "arabic": "حَدَّثَنِي زَكَرِيَّاءُ بْنُ يَحْيَى، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ ـ رضى الله عنها ـ أَنَّهَا حَمَلَتْ بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَتْ فَخَرَجْتُ وَأَنَا مُتِمٌّ، فَأَتَيْتُ الْمَدِينَةَ، فَنَزَلْتُ بِقُبَاءٍ، فَوَلَدْتُهُ بِقُبَاءٍ، ثُمَّ أَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَوَضَعْتُهُ فِي حَجْرِهِ، ثُمَّ دَعَا بِتَمْرَةٍ، فَمَضَغَهَا، ثُمَّ تَفَلَ فِي فِيهِ، فَكَانَ أَوَّلَ شَىْءٍ دَخَلَ جَوْفَهُ رِيقُ رَسُولِ اللَّهِ صلى الله عليه وسلم، ثُمَّ حَنَّكَهُ بِتَمْرَةٍ ثُمَّ دَعَا لَهُ وَبَرَّكَ عَلَيْهِ، وَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الإِسْلاَمِ‏.‏ تَابَعَهُ خَالِدُ بْنُ مَخْلَدٍ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ ـ رضى الله عنها ـ أَنَّهَا هَاجَرَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْىَ حُبْلَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3909In-book reference : Book 63, Hadith 134USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3910,
    "id": 3910,
    "url": "https://sunnah.com/bukhari:3910",
    "bookNumber": 63,
    "hadithNumber": 135,
    "narrator": "Narrated Aisha:",
    "english": "The first child who was born in the Islamic Land (i.e. Medina) amongst the Emigrants, was `Abdullah \nbin Az-Zubair. They brought him to the Prophet. The Prophet (ﷺ) took a date, and after chewing it, put its \njuice in his mouth. So the first thing that went into the child's stomach, was the saliva of the Prophet.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَوَّلُ مَوْلُودٍ وُلِدَ فِي الإِسْلاَمِ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، أَتَوْا بِهِ النَّبِيَّ صلى الله عليه وسلم فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم تَمْرَةً فَلاَكَهَا ثُمَّ أَدْخَلَهَا فِي فِيهِ، فَأَوَّلُ مَا دَخَلَ بَطْنَهُ رِيقُ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3910In-book reference : Book 63, Hadith 135USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3911,
    "id": 3911,
    "url": "https://sunnah.com/bukhari:3911",
    "bookNumber": 63,
    "hadithNumber": 136,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) arrived at Medina with Abu Bakr, riding behind him on the same camel. Abu Bakr \nwas an elderly man known to the people, while Allah's Messenger (ﷺ) was a youth that was unknown. Thus, \nif a man met Abu Bakr, he would say, \"O Abu Bakr! Who is this man in front of you?\" Abu Bakr \nwould say, \"This man shows me the Way,\" One would think that Abu Bakr meant the road, while in \nfact, Abu Bakr meant the way of virtue and good. Then Abu Bakr looked behind and saw a horse-rider \npursuing them. He said, \"O Allah's Messenger (ﷺ)! This is a horse-rider pursuing us.\" The Prophet (ﷺ) looked \nbehind and said, \"O Allah! Cause him to fall down.\" So the horse threw him down and got up \nneighing. After that the rider, Suraqa said, \"O Allah's Prophet! Order me whatever you want.\" The \nProphet said, \"Stay where you are and do not allow anybody to reach us.\" So, in the first part of the \nday Suraqa was an enemy of Allah's Prophet and in the last part of it, he was a protector. Then Allah's \nApostle alighted by the side of the Al-Harra and sent a message to the Ansar, and they came to Allah's \nProphet and Abu Bakr, and having greeted them, they said, \"Ride (your she-camels) safe and obeyed.\" \nAllah's Messenger (ﷺ) and Abu Bakr rode and the Ansar, carrying their arms, surrounded them. The news \nthat Allah's Prophet had come circulated in Medina. The people came out and were eagerly looking \nand saying \"Allah's Prophet has come! Allah's Prophet has come! So the Prophet (ﷺ) went on till he \nalighted near the house of Abu Ayub. While the Prophet (ﷺ) was speaking with the family members of \nAbu Ayub, `Abdullah bin Salam heard the news of his arrival while he himself was picking the dates \nfor his family from his family garden. He hurried to the Prophet (ﷺ) carrying the dates which he had \ncollected for his family from the garden. He listened to Allah's Prophet and then went home. \nThen Allah's Prophet said, \"Which is the nearest of the houses of our kith and kin?\" Abu Ayub \nreplied, \"Mine, O Allah's Prophet! This is my house and this is my gate.\" The Prophet (ﷺ) said, \"Go and \nprepare a place for our midday rest.\" Abu Ayub said, \"Get up (both of you) with Allah's Blessings.\" \nSo when Allah's Prophet went into the house, `Abdullah bin Salam came and said \"I testify that you \n(i.e. Muhammad) are Apostle of Allah and that you have come with the Truth. The Jews know well \nthat I am their chief and the son of their chief and the most learned amongst them and the son of the \nmost learned amongst them. So send for them (i.e. Jews) and ask them about me before they know \nthat I have embraced Islam, for if they know that they will say about me things which are not correct.\" \nSo Allah's Messenger (ﷺ) sent for them, and they came and entered. Allah's Messenger (ﷺ) said to them, \"O (the \ngroup of) Jews! Woe to you: be afraid of Allah. By Allah except Whom none has the right to be \nworshipped, you people know for certain, that I am Apostle of Allah and that I have come to you with \nthe Truth, so embrace Islam.\" The Jews replied, \"We do not know this.\" So they said this to the \nProphet and he repeated it thrice. Then he said, \"What sort of a man is `Abdullah bin Salam amongst \nyou?\" They said, \"He is our chief and the son of our chief and the most learned man, and the son of \nthe most learned amongst us.\" He said, \"What would you think if he should embrace Islam?\" They \nsaid, \"Allah forbid! He can not embrace Islam.\" He said, \" What would you think if he should \nembrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"What would you \nthink if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"O \nIbn Salam! Come out to them.\" He came out and said, \"O (the group of) Jews! Be afraid of Allah \nexcept Whom none has the right to be worshipped. You know for certain that he is Apostle of Allah \nand that he has brought a True Religion!' They said, \"You tell a lie.\" On that Allah's Messenger (ﷺ) turned \nthem out.",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَقْبَلَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلَى الْمَدِينَةِ وَهْوَ مُرْدِفٌ أَبَا بَكْرٍ، وَأَبُو بَكْرٍ شَيْخٌ يُعْرَفُ، وَنَبِيُّ اللَّهِ صلى الله عليه وسلم شَابٌّ لاَ يُعْرَفُ، قَالَ فَيَلْقَى الرَّجُلُ أَبَا بَكْرٍ فَيَقُولُ يَا أَبَا بَكْرٍ، مَنْ هَذَا الرَّجُلُ الَّذِي بَيْنَ يَدَيْكَ فَيَقُولُ هَذَا الرَّجُلُ يَهْدِينِي السَّبِيلَ‏.‏ قَالَ فَيَحْسِبُ الْحَاسِبُ أَنَّهُ إِنَّمَا يَعْنِي الطَّرِيقَ، وَإِنَّمَا يَعْنِي سَبِيلَ الْخَيْرِ، فَالْتَفَتَ أَبُو بَكْرٍ، فَإِذَا هُوَ بِفَارِسٍ قَدْ لَحِقَهُمْ، فَقَالَ يَا رَسُولَ اللَّهِ، هَذَا فَارِسٌ قَدْ لَحِقَ بِنَا‏.‏ فَالْتَفَتَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ اللَّهُمَّ اصْرَعْهُ ‏\"‏‏.‏ فَصَرَعَهُ الْفَرَسُ، ثُمَّ قَامَتْ تُحَمْحِمُ فَقَالَ يَا نَبِيَّ اللَّهِ مُرْنِي بِمَا شِئْتَ‏.‏ قَالَ ‏\"‏ فَقِفْ مَكَانَكَ، لاَ تَتْرُكَنَّ أَحَدًا يَلْحَقُ بِنَا ‏\"‏‏.‏ قَالَ فَكَانَ أَوَّلَ النَّهَارِ جَاهِدًا عَلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم، وَكَانَ آخِرَ النَّهَارِ مَسْلَحَةً لَهُ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَانِبَ الْحَرَّةِ، ثُمَّ بَعَثَ إِلَى الأَنْصَارِ، فَجَاءُوا إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَسَلَّمُوا عَلَيْهِمَا، وَقَالُوا ارْكَبَا آمِنَيْنِ مُطَاعَيْنِ‏.‏ فَرَكِبَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، وَحَفُّوا دُونَهُمَا بِالسِّلاَحِ، فَقِيلَ فِي الْمَدِينَةِ جَاءَ نَبِيُّ اللَّهِ، جَاءَ نَبِيُّ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَشْرَفُوا يَنْظُرُونَ وَيَقُولُونَ جَاءَ نَبِيُّ اللَّهِ، جَاءَ نَبِيُّ اللَّهِ‏.‏ فَأَقْبَلَ يَسِيرُ حَتَّى نَزَلَ جَانِبَ دَارِ أَبِي أَيُّوبَ، فَإِنَّهُ لَيُحَدِّثُ أَهْلَهُ، إِذْ سَمِعَ بِهِ عَبْدُ اللَّهِ بْنُ سَلاَمٍ وَهْوَ فِي نَخْلٍ لأَهْلِهِ يَخْتَرِفُ لَهُمْ، فَعَجِلَ أَنْ يَضَعَ الَّذِي يَخْتَرِفُ لَهُمْ فِيهَا، فَجَاءَ وَهْىَ مَعَهُ، فَسَمِعَ مِنْ نَبِيِّ اللَّهِ صلى الله عليه وسلم ثُمَّ رَجَعَ إِلَى أَهْلِهِ، فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىُّ بُيُوتِ أَهْلِنَا أَقْرَبُ ‏\"‏‏.‏ فَقَالَ أَبُو أَيُّوبَ أَنَا يَا نَبِيَّ اللَّهِ، هَذِهِ دَارِي، وَهَذَا بَابِي‏.‏ قَالَ ‏\"‏ فَانْطَلِقْ فَهَيِّئْ لَنَا مَقِيلاً ‏\"‏‏.‏ قَالَ قُومَا عَلَى بَرَكَةِ اللَّهِ‏.‏ فَلَمَّا جَاءَ نَبِيُّ اللَّهِ صلى الله عليه وسلم جَاءَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ، وَأَنَّكَ جِئْتَ بِحَقٍّ، وَقَدْ عَلِمَتْ يَهُودُ أَنِّي سَيِّدُهُمْ وَابْنُ سَيِّدِهِمْ، وَأَعْلَمُهُمْ وَابْنُ أَعْلَمِهِمْ، فَادْعُهُمْ فَاسْأَلْهُمْ عَنِّي قَبْلَ أَنْ يَعْلَمُوا أَنِّي قَدْ أَسْلَمْتُ، فَإِنَّهُمْ إِنْ يَعْلَمُوا أَنِّي قَدْ أَسْلَمْتُ قَالُوا فِيَّ مَا لَيْسَ فِيَّ‏.‏ فَأَرْسَلَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَأَقْبَلُوا فَدَخَلُوا عَلَيْهِ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا مَعْشَرَ الْيَهُودِ، وَيْلَكُمُ اتَّقُوا اللَّهَ، فَوَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنَّكُمْ لَتَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ حَقًّا، وَأَنِّي جِئْتُكُمْ بِحَقٍّ فَأَسْلِمُوا ‏\"‏‏.‏ قَالُوا مَا نَعْلَمُهُ‏.‏ قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم قَالَهَا ثَلاَثَ مِرَارٍ‏.‏ قَالَ ‏\"‏ فَأَىُّ رَجُلٍ فِيكُمْ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ قَالُوا ذَاكَ سَيِّدُنَا وَابْنُ سَيِّدِنَا، وَأَعْلَمُنَا وَابْنُ أَعْلَمِنَا‏.‏ قَالَ ‏\"‏ أَفَرَأَيْتُمْ إِنْ أَسْلَمَ ‏\"‏‏.‏ قَالُوا حَاشَا لِلَّهِ، مَا كَانَ لِيُسْلِمَ‏.‏ قَالَ ‏\"‏ أَفَرَأَيْتُمْ إِنْ أَسْلَمَ ‏\"‏‏.‏ قَالُوا حَاشَا لِلَّهِ، مَا كَانَ لِيُسْلِمَ‏.‏ قَالَ ‏\"‏ يَا ابْنَ سَلاَمٍ، اخْرُجْ عَلَيْهِمْ ‏\"‏‏.‏ فَخَرَجَ فَقَالَ يَا مَعْشَرَ الْيَهُودِ، اتَّقُوا اللَّهَ، فَوَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنَّكُمْ لَتَعْلَمُونَ أَنَّهُ رَسُولُ اللَّهِ، وَأَنَّهُ جَاءَ بِحَقٍّ‏.‏ فَقَالُوا كَذَبْتَ‏.‏ فَأَخْرَجَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3911In-book reference : Book 63, Hadith 136USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3912,
    "id": 3912,
    "url": "https://sunnah.com/bukhari:3912",
    "bookNumber": 63,
    "hadithNumber": 137,
    "narrator": "Narrated Ibn `Umar:",
    "english": "`Umar bin Al-Khattab fixed a grant of 4000 (Dirhams) for every Early Emigrant (i.e. Muhajir) and \nfixed a grant of 3500 (Dirhams) only for Ibn `Umar. Somebody said to `Umar, \"Ibn `Umar is also one \nof the Early Emigrants; why do you give him less than four-thousand?\" `Umar replied, \"His parents \ntook him with them when they migrated, so he was not like the one who had migrated by himself.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ يَعْنِي، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، رضى الله عنه قَالَ كَانَ فَرَضَ لِلْمُهَاجِرِينَ الأَوَّلِينَ أَرْبَعَةَ آلاَفٍ فِي أَرْبَعَةٍ، وَفَرَضَ لاِبْنِ عُمَرَ ثَلاَثَةَ آلاَفٍ وَخَمْسَمِائَةٍ فَقِيلَ لَهُ هُوَ مِنَ الْمُهَاجِرِينَ، فَلِمَ نَقَصْتَهُ مِنْ أَرْبَعَةِ آلاَفٍ فَقَالَ إِنَّمَا هَاجَرَ بِهِ أَبَوَاهُ‏.‏ يَقُولُ لَيْسَ هُوَ كَمَنْ هَاجَرَ بِنَفْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3912In-book reference : Book 63, Hadith 137USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3913,
    "id": 3913,
    "url": "https://sunnah.com/bukhari:3913",
    "bookNumber": 63,
    "hadithNumber": 138,
    "narrator": "Narrated Khabbab:",
    "english": "We migrated with Allah's Messenger (ﷺ) (See Hadith No. 253 below).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ خَبَّابٍ، قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3913In-book reference : Book 63, Hadith 138USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3914,
    "id": 3914,
    "url": "https://sunnah.com/bukhari:3914",
    "bookNumber": 63,
    "hadithNumber": 139,
    "narrator": "Narrated Khabbab:",
    "english": "We migrated with Allah's Messenger (ﷺ) seeking Allah's Countenance, so our rewards became due and sure \nwith Allah. Some of us passed away without eating anything of their rewards in this world. One of \nthese was Mus`ab bin `Umar who was martyred on the day of the battle of Uhud. We did not find \nanything to shroud his body with except a striped cloak. When we covered his head with it, his feet \nremained uncovered, and when we covered his feet with it, his head remained uncovered. So Allah's \nApostle ordered us to cover his head with it and put some Idhkhir (i.e. a kind of grass) over his feet. \nAnd there are some amongst us whose fruits have ripened and they are collecting them (i.e. they have \nreceived their rewards in this world).",
    "arabic": "وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ شَقِيقَ بْنَ سَلَمَةَ، قَالَ حَدَّثَنَا خَبَّابٌ، قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَغِي وَجْهَ اللَّهِ، وَوَجَبَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَضَى لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا، مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ، قُتِلَ يَوْمَ أُحُدٍ فَلَمْ نَجِدْ شَيْئًا نُكَفِّنُهُ فِيهِ، إِلاَّ نَمِرَةً كُنَّا إِذَا غَطَّيْنَا بِهَا رَأْسَهُ خَرَجَتْ رِجْلاَهُ، فَإِذَا غَطَّيْنَا رِجْلَيْهِ خَرَجَ رَأْسُهُ، فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نُغْطِيَ رَأْسَهُ بِهَا، وَنَجْعَلَ عَلَى رِجْلَيْهِ مِنْ إِذْخِرٍ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدِبُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3914In-book reference : Book 63, Hadith 139USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3915,
    "id": 3915,
    "url": "https://sunnah.com/bukhari:3915",
    "bookNumber": 63,
    "hadithNumber": 140,
    "narrator": "Narrated Abu Burda Bin Abi Musa Al-Ash`ari:",
    "english": "`Abdullah bin `Umar said to me, \"Do you know what my father said to your father once?\" I said, \n\"No.\" He said, \"My father said to your father, 'O Abu Musa, will it please you that we will be \nrewarded for our conversion to Islam with Allah's Messenger (ﷺ) and our migration with him, and our Jihad \nwith him and all our good deeds which we did, with him, and that all the deeds we did after his death \nwill be disregarded whether good or bad?' Your father (i.e. Abu Musa) said, 'No, by Allah, we took \npart in Jihad after Allah's Messenger (ﷺ) , prayed and did plenty of good deeds, and many people have \nembraced Islam at our hands, and no doubt, we expect rewards from Allah for these good deeds.' On \nthat my father (i.e. `Umar) said, 'As for myself, By Him in Whose Hand `Umar's soul is, I wish that \nthe deeds done by us at the time of the Prophet (ﷺ) remain rewardable while whatsoever we did after the \ndeath of the Prophet (ﷺ) be enough to save us from Punishment in that the good deeds compensate for the \nbad ones.' \" On that I said (to Ibn `Umar), \"By Allah, your father was better than my father!\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا عَوْفٌ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى الأَشْعَرِيُّ، قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ هَلْ تَدْرِي مَا قَالَ أَبِي لأَبِيكَ قَالَ قُلْتُ لاَ‏.‏ قَالَ فَإِنَّ أَبِي قَالَ لأَبِيكَ يَا أَبَا مُوسَى، هَلْ يَسُرُّكَ إِسْلاَمُنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِجْرَتُنَا مَعَهُ، وَجِهَادُنَا مَعَهُ، وَعَمَلُنَا كُلُّهُ مَعَهُ، بَرَدَ لَنَا، وَأَنَّ كُلَّ عَمَلٍ عَمِلْنَاهُ بَعْدَهُ نَجَوْنَا مِنْهُ كَفَافًا رَأْسًا بِرَأْسٍ فَقَالَ أَبِي لاَ وَاللَّهِ، قَدْ جَاهَدْنَا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَصَلَّيْنَا، وَصُمْنَا، وَعَمِلْنَا خَيْرًا كَثِيرًا، وَأَسْلَمَ عَلَى أَيْدِينَا بَشَرٌ كَثِيرٌ، وَإِنَّا لَنَرْجُو ذَلِكَ‏.‏ فَقَالَ أَبِي لَكِنِّي أَنَا وَالَّذِي نَفْسُ عُمَرَ بِيَدِهِ لَوَدِدْتُ أَنَّ ذَلِكَ بَرَدَ لَنَا، وَأَنَّ كُلَّ شَىْءٍ عَمِلْنَاهُ بَعْدُ نَجَوْنَا مِنْهُ كَفَافًا رَأْسًا بِرَأْسٍ‏.‏ فَقُلْتُ إِنَّ أَبَاكَ وَاللَّهِ خَيْرٌ مِنْ أَبِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3915In-book reference : Book 63, Hadith 140USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3916,
    "id": 3916,
    "url": "https://sunnah.com/bukhari:3916",
    "bookNumber": 63,
    "hadithNumber": 141,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I heard that Ibn `Umar used to become angry if someone mentioned that he had migrated before his \nfather (`Umar), and he used to say, \" `Umar and I came to Allah's Messenger (ﷺ) and found him having his \nmidday rest, so we returned home. Then `Umar sent me again (to the Prophet (ﷺ) ) and said, 'Go and see \nwhether he is awake.' I went to him and entered his place and gave him the pledge of allegiance. Then \nI went back to `Umar and informed him that the Prophet (ﷺ) was awake. So we both went, running \nslowly, and when `Umar entered his place, he gave him the pledge of allegiance and thereafter I too \ngave him the pledge of allegiance.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ صَبَّاحٍ ـ أَوْ بَلَغَنِي عَنْهُ ـ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ إِذَا قِيلَ لَهُ هَاجَرَ قَبْلَ أَبِيهِ يَغْضَبُ، قَالَ وَقَدِمْتُ أَنَا وَعُمَرُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدْنَاهُ قَائِلاً فَرَجَعْنَا إِلَى الْمَنْزِلِ، فَأَرْسَلَنِي عُمَرُ وَقَالَ اذْهَبْ فَانْظُرْ هَلِ اسْتَيْقَظَ فَأَتَيْتُهُ، فَدَخَلْتُ عَلَيْهِ فَبَايَعْتُهُ، ثُمَّ انْطَلَقْتُ إِلَى عُمَرَ، فَأَخْبَرْتُهُ أَنَّهُ قَدِ اسْتَيْقَظَ، فَانْطَلَقْنَا إِلَيْهِ نُهَرْوِلُ هَرْوَلَةً حَتَّى دَخَلَ عَلَيْهِ فَبَايَعَهُ ثُمَّ بَايَعْتُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3916In-book reference : Book 63, Hadith 141USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3917,
    "id": 3917,
    "url": "https://sunnah.com/bukhari:3917",
    "bookNumber": 63,
    "hadithNumber": 142,
    "narrator": "Narrated Al-Bara:",
    "english": "Abu Bakr bought a (camel's) saddle from `Azib, and I carried it for him. `Azib (i.e. my father) asked \nAbu Bakr regarding the journey of the migration of Allah's Messenger (ﷺ). Abu Bakr said, \"Close observers \nwere appointed by our enemies to watch us. So we went out at night and travelled throughout the \nnight and the following day till it was noon, then we perceived a rock and went towards it, and there \nwas some shade under it. I spread a cloak I had with me for Allah's Messenger (ﷺ) and then the Prophet (ﷺ) layed \non it. I went out to guard him and all of a sudden I saw a shepherd coming with his sheep looking for \nthe same, the shade of the rock as we did, I asked him, 'O boy, to whom do you belong?' He replied, 'I \nbelong to so-and-so.' I asked him, 'Is there some milk in your sheep?' He replied in the affirmative. I \nasked him, 'Will you milk?' He replied in the affirmative. Then he got hold of one of his sheep. I said \nto him, 'Remove the dust from its udder.' Then he milked a little milk. I had a water-skin with me \nwhich was tied with a piece of cloth. I had prepared the water-skin for Allah's Messenger (ﷺ) . So I poured \nsome water over the milk (container) till its bottom became cold. Then I brought the milk to the \nProphet and said, 'Drink, O Allah's Messenger (ﷺ).' Allah's Messenger (ﷺ) drank till I became pleased. Then we \ndeparted and the pursuers were following us.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يُحَدِّثُ قَالَ ابْتَاعَ أَبُو بَكْرٍ مِنْ عَازِبٍ رَحْلاً فَحَمَلْتُهُ مَعَهُ قَالَ فَسَأَلَهُ عَازِبٌ عَنْ مَسِيرِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أُخِذَ عَلَيْنَا بِالرَّصَدِ، فَخَرَجْنَا لَيْلاً، فَأَحْثَثْنَا لَيْلَتَنَا وَيَوْمَنَا حَتَّى قَامَ قَائِمُ الظَّهِيرَةِ، ثُمَّ رُفِعَتْ لَنَا صَخْرَةٌ، فَأَتَيْنَاهَا وَلَهَا شَىْءٌ مِنْ ظِلٍّ قَالَ فَفَرَشْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرْوَةً مَعِي، ثُمَّ اضْطَجَعَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَانْطَلَقْتُ أَنْفُضُ مَا حَوْلَهُ، فَإِذَا أَنَا بِرَاعٍ قَدْ أَقْبَلَ فِي غُنَيْمَةٍ يُرِيدُ مِنَ الصَّخْرَةِ مِثْلَ الَّذِي أَرَدْنَا فَسَأَلْتُهُ لِمَنْ أَنْتَ يَا غُلاَمُ فَقَالَ أَنَا لِفُلاَنٍ‏.‏ فَقُلْتُ لَهُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ‏.‏ قُلْتُ لَهُ هَلْ أَنْتَ حَالِبٌ قَالَ نَعَمْ‏.‏ فَأَخَذَ شَاةً مِنْ غَنَمِهِ فَقُلْتُ لَهُ انْفُضِ الضَّرْعَ‏.‏ قَالَ فَحَلَبَ كُثْبَةً مِنْ لَبَنٍ، وَمَعِي إِدَاوَةٌ مِنْ مَاءٍ عَلَيْهَا خِرْقَةٌ قَدْ رَوَّأْتُهَا لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَصَبَبْتُ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، ثُمَّ أَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى رَضِيتُ، ثُمَّ ارْتَحَلْنَا وَالطَّلَبُ فِي إِثْرِنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3917In-book reference : Book 63, Hadith 142USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3918,
    "id": 3918,
    "url": "https://sunnah.com/bukhari:3918",
    "bookNumber": 63,
    "hadithNumber": 143,
    "narrator": "Al-Bara added:",
    "english": "I then went with Abu Bakr into his \nhome (carrying that saddle) and there I saw his daughter `Aisha Lying in a bed because of heavy fever \nand I saw her father Abu Bakr kissing her cheek and saying, \"How are you, little daughter?\"",
    "arabic": "قَالَ الْبَرَاءُ فَدَخَلْتُ مَعَ أَبِي بَكْرٍ عَلَى أَهْلِهِ، فَإِذَا عَائِشَةُ ابْنَتُهُ مُضْطَجِعَةٌ، قَدْ أَصَابَتْهَا حُمَّى، فَرَأَيْتُ أَبَاهَا فَقَبَّلَ خَدَّهَا، وَقَالَ كَيْفَ أَنْتِ يَا بُنَيَّةُ",
    "reference": "Reference : Sahih al-Bukhari 3918In-book reference : Book 63, Hadith 143USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3919,
    "id": 3919,
    "url": "https://sunnah.com/bukhari:3919",
    "bookNumber": 63,
    "hadithNumber": 144,
    "narrator": "Narrated Anas:",
    "english": "(the servant of the Prophet) When the Prophet (ﷺ) arrived (at Medina), there was not a single companion \nof the Prophet (ﷺ) who had grey and black hair except Abu Bakr, and he dyed his hair with Henna' and \nKatam (i.e. plants used for dying hair).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا مُحَمَّدُ بْنُ حِمْيَرَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ، أَنَّ عُقْبَةَ بْنَ وَسَّاجٍ، حَدَّثَهُ عَنْ أَنَسٍ، خَادِمِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَلَيْسَ فِي أَصْحَابِهِ أَشْمَطُ غَيْرَ أَبِي بَكْرٍ، فَغَلَفَهَا بِالْحِنَّاءِ وَالْكَتَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3919In-book reference : Book 63, Hadith 144USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3920,
    "id": 3920,
    "url": "https://sunnah.com/bukhari:3920",
    "bookNumber": 63,
    "hadithNumber": 145,
    "narrator": "Through another group of narrators, Anas bin Malik said:",
    "english": "\"When the Prophet (ﷺ) arrived at Medina, the eldest amongst his companions was Abu Bakr. He dyed his \nhair with Hinna and Katam till it became of dark red color.",
    "arabic": "وَقَالَ دُحَيْمٌ حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي أَبُو عُبَيْدٍ، عَنْ عُقْبَةَ بْنِ وَسَّاجٍ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ، فَكَانَ أَسَنَّ أَصْحَابِهِ أَبُو بَكْرٍ، فَغَلَفَهَا بِالْحِنَّاءِ وَالْكَتَمِ حَتَّى قَنَأَ لَوْنُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3920In-book reference : Book 63, Hadith 145USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3921,
    "id": 3921,
    "url": "https://sunnah.com/bukhari:3921",
    "bookNumber": 63,
    "hadithNumber": 146,
    "narrator": "Narrate Aisha:",
    "english": "Abu Bakr married a woman from the tribe of Bani Kalb, called Um Bakr. When Abu Bakr migrated to \nMedina, he divorced her and she was married by her cousin, the poet who said the following poem \nlamenting the infidels of Quraish: \n\"What is there kept in the well, The well of Badr, (The owners of) the trays of Roasted camel humps? \nWhat is there kept in the well, The well of Badr, (The owners of) lady singers And friends of the \nhonorable companions; who used to drink (wine) together, Um Bakr greets us With the greeting of \npeace, But can I find peace After my people have gone? The Apostle tells us that We shall live again, \nBut what sort of life will owls and skulls live?:",
    "arabic": "حَدَّثَنَا أَصْبَغُ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ تَزَوَّجَ امْرَأَةً مِنْ كَلْبٍ يُقَالُ لَهَا أُمُّ بَكْرٍ، فَلَمَّا هَاجَرَ أَبُو بَكْرٍ طَلَّقَهَا، فَتَزَوَّجَهَا ابْنُ عَمِّهَا، هَذَا الشَّاعِرُ الَّذِي قَالَ هَذِهِ الْقَصِيدَةَ، رَثَى كُفَّارَ قُرَيْشٍ وَمَاذَا بِالْقَلِيبِ قَلِيبِ بَدْرٍ مِنَ الشِّيزَى تُزَيَّنُ بِالسَّنَامِ وَمَاذَا بِالْقَلِيبِ، قَلِيبِ بَدْرٍ مِنَ الْقَيْنَاتِ وَالشَّرْبِ الْكِرَامِ تُحَيِّي بِالسَّلاَمَةِ أُمُّ بَكْرٍ وَهَلْ لِي بَعْدَ قَوْمِي مِنْ سَلاَمِ يُحَدِّثُنَا الرَّسُولُ بِأَنْ سَنَحْيَا وَكَيْفَ حَيَاةُ أَصْدَاءٍ وَهَامِ",
    "reference": "Reference : Sahih al-Bukhari 3921In-book reference : Book 63, Hadith 146USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3922,
    "id": 3922,
    "url": "https://sunnah.com/bukhari:3922",
    "bookNumber": 63,
    "hadithNumber": 147,
    "narrator": "Narrated Abu Bakr:",
    "english": "I was with the Prophet (ﷺ) in the Cave. When I raised my head, I saw the feet of the people. I said, \"O \nAllah's Messenger (ﷺ)! If some of them should look down, they will see us.\" The Prophet (ﷺ) said, \"O Abu Bakr, \nbe quiet! (For we are) two and Allah is the Third of us.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْغَارِ فَرَفَعْتُ رَأْسِي، فَإِذَا أَنَا بِأَقْدَامِ الْقَوْمِ، فَقُلْتُ يَا نَبِيَّ اللَّهِ، لَوْ أَنَّ بَعْضَهُمْ طَأْطَأَ بَصَرَهُ رَآنَا‏.‏ قَالَ ‏\n\"‏ اسْكُتْ يَا أَبَا بَكْرٍ، اثْنَانِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3922In-book reference : Book 63, Hadith 147USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3923,
    "id": 3923,
    "url": "https://sunnah.com/bukhari:3923",
    "bookNumber": 63,
    "hadithNumber": 148,
    "narrator": "Narrated Abu Sa`id:",
    "english": "Once a bedouin came to the Prophet (ﷺ) and asked him about the migration. The Prophet (ﷺ) said, \"Mercy of \nAllah be on you! The migration is a quite difficult matter. Have you got some camels?\" He replied in \nthe affirmative. Then the Prophet (ﷺ) said, \"Do you give their Zakat?\" He replied in the affirmative. The \nProphet said, \"Do you let others benefit by their milk gratis?\" He replied in the affirmative. Then the \nProphet asked, \"Do you milk them on their watering days and give their milk to the poor and needy?\" \nHe replied in the affirmative. The Prophet, said, \"Go on doing like this from beyond the seas, and \nthere is no doubt that Allah will not overlook any of your good deeds.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ،‏.‏ وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، قَالَ حَدَّثَنِي أَبُو سَعِيدٍ ـ رضى الله عنه ـ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ عَنِ الْهِجْرَةِ فَقَالَ ‏\"‏ وَيْحَكَ إِنَّ الْهِجْرَةَ شَأْنُهَا شَدِيدٌ، فَهَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَتُعْطِي صَدَقَتَهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَهَلْ تَمْنَحُ مِنْهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَتَحْلُبُهَا يَوْمَ وُرُودِهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ، فَإِنَّ اللَّهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3923In-book reference : Book 63, Hadith 148USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3924,
    "id": 3924,
    "url": "https://sunnah.com/bukhari:3924",
    "bookNumber": 63,
    "hadithNumber": 149,
    "narrator": "Narrated Al-Bara:",
    "english": "The first people who came to us (in Medina) were Mus`ab bin `Umar and Ibn Um Maktum. Then \ncame to us `Ammar bin Yasir and Bilal.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ أَوَّلُ مَنْ قَدِمَ عَلَيْنَا مُصْعَبُ بْنُ عُمَيْرٍ وَابْنُ أُمِّ مَكْتُومٍ، ثُمَّ قَدِمَ عَلَيْنَا عَمَّارُ بْنُ يَاسِرٍ وَبِلاَلٌ رضى الله عنهم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3924In-book reference : Book 63, Hadith 149USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3925,
    "id": 3925,
    "url": "https://sunnah.com/bukhari:3925",
    "bookNumber": 63,
    "hadithNumber": 150,
    "narrator": "Narrated Al-Bara bin Azib:",
    "english": "The first people who came to us (in Medina) were Mus`ab bin `Umar and Ibn Um Maktum who were \nteaching Qur'an to the people. Then their came Bilal. Sa`d and `Ammar bin Yasir. After that `Umar \nbin Al-Khattab came along with twenty other companions of the Prophet. Later on the Prophet (ﷺ) himself \n(to Medina) and I had never seen the people of Medina so joyful as they were on the arrival of Allah's \nApostle, for even the slave girls were saying, \"Allah's Messenger (ﷺ) has arrived!\" And before his arrival I \nhad read the Sura starting with:-- \"Glorify the Name of your Lord, the Most High\" (87.1) together \nwith other Suras of Al-Mufassal.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَوَّلُ مَنْ قَدِمَ عَلَيْنَا مُصْعَبُ بْنُ عُمَيْرٍ وَابْنُ أُمِّ مَكْتُومٍ، وَكَانَا يُقْرِئَانِ النَّاسَ، فَقَدِمَ بِلاَلٌ وَسَعْدٌ وَعَمَّارُ بْنُ يَاسِرٍ، ثُمَّ قَدِمَ عُمَرُ بْنُ الْخَطَّابِ فِي عِشْرِينَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَدِمَ النَّبِيُّ صلى الله عليه وسلم، فَمَا رَأَيْتُ أَهْلَ الْمَدِينَةِ فَرِحُوا بِشَىْءٍ فَرَحَهُمْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم، حَتَّى جَعَلَ الإِمَاءُ يَقُلْنَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَا قَدِمَ حَتَّى قَرَأْتُ ‏{‏سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ فِي سُوَرٍ مِنَ الْمُفَصَّلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3925In-book reference : Book 63, Hadith 150USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3926,
    "id": 3926,
    "url": "https://sunnah.com/bukhari:3926",
    "bookNumber": 63,
    "hadithNumber": 151,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) came to Medina, Abu Bakr and Bilal got fever, and I went to both of them and \nsaid, \"O my father, how do you feel? O Bilal, how do you feel?\" Whenever Abu Bakr's fever got \nworse, he would say, \"Every man will meet his death once in one morning while he will be among his \nfamily, for death is really nearer to him than his leather shoe laces (to his feet).\" And whenever fever \ndeserted Bilal, he would say aloud, \"Would that I know whether I shall spend a night in the valley (of \nMecca) with Idhkhir and Jalil (i.e. kinds of grass) around me, and whether I shall drink one day the \nwater of Mijannah, and whether I shall see once again the hills of Shamah and Tafil?\" Then I went to \nAllah's Messenger (ﷺ) and told him of that. He said, \"O Allah, make us love Medina as much as or more than \nwe used to love Mecca, O Allah, make it healthy and bless its Sa' and Mud (i.e. measures), and take \naway its fever to Al-Juhfa.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ ـ قَالَتْ ـ فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ، كَيْفَ تَجِدُكَ قَالَتْ فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أَقْلَعَ عَنْهُ الْحُمَّى يَرْفَعُ عَقِيرَتَهُ وَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا، وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3926In-book reference : Book 63, Hadith 151USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3927,
    "id": 3927,
    "url": "https://sunnah.com/bukhari:3927",
    "bookNumber": 63,
    "hadithNumber": 152,
    "narrator": "Narrated 'Ubaidullah bin Ad bin Khiyair:",
    "english": "I went to `Uthman. After reciting Tashah-hud, he said,. \"Then after no doubt, Allah sent Muhammad \nwith the Truth, and I was amongst those who responded to the Call of Allah and His Prophet and \nbelieved in the message of Muhammad. Then took part in the two migrations. I became the son-in-law \nof Allah's Messenger (ﷺ) and gave the pledge of allegiance to him By Allah, I never disobeyed him, nor did I \ndeceive him till Allah took him unto Him.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيٍّ، أَخْبَرَهُ دَخَلْتُ، عَلَى عُثْمَانَ‏.‏ وَقَالَ بِشْرُ بْنُ شُعَيْبٍ حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ خِيَارٍ، أَخْبَرَهُ قَالَ دَخَلْتُ عَلَى عُثْمَانَ فَتَشَهَّدَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ، وَكُنْتُ مِمَّنِ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ، وَآمَنَ بِمَا بُعِثَ بِهِ مُحَمَّدٌ صلى الله عليه وسلم، ثُمَّ هَاجَرْتُ هِجْرَتَيْنِ، وَنِلْتُ صِهْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَبَايَعْتُهُ، فَوَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ‏.‏ تَابَعَهُ إِسْحَاقُ الْكَلْبِيُّ حَدَّثَنِي الزُّهْرِيُّ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3927In-book reference : Book 63, Hadith 152USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3928,
    "id": 3928,
    "url": "https://sunnah.com/bukhari:3928",
    "bookNumber": 63,
    "hadithNumber": 153,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "During the last Hajj led by `Umar, `Abdur-Rahman bin `Auf returned to his family at Mina and met \nme there. `AbdurRahman said (to `Umar), \"O chief of the believers! The season of Hajj is the season \nwhen there comes the scum of the people (besides the good amongst them), so I recommend that you \nshould wait till you go back to Medina, for it is the place of Migration and Sunna (i.e. the Prophet's \ntradition), and there you will be able to refer the matter to the religious scholars and the nobles and the \npeople of wise opinions.\" `Umar said, \"I will speak of it in Medina on my very first sermon I will \ndeliver there.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنَا مَالِكٌ،‏.‏ وَأَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ رَجَعَ إِلَى أَهْلِهِ وَهْوَ بِمِنًى، فِي آخِرِ حَجَّةٍ حَجَّهَا عُمَرُ، فَوَجَدَنِي، فَقَالَ عَبْدُ الرَّحْمَنِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ الْمَوْسِمَ يَجْمَعُ رَعَاعَ النَّاسِ، وَإِنِّي أَرَى أَنْ تُمْهِلَ حَتَّى تَقْدَمَ الْمَدِينَةَ، فَإِنَّهَا دَارُ الْهِجْرَةِ وَالسُّنَّةِ، وَتَخْلُصَ لأَهْلِ الْفِقْهِ وَأَشْرَافِ النَّاسِ وَذَوِي رَأْيِهِمْ‏.‏ قَالَ عُمَرُ لأَقُومَنَّ فِي أَوَّلِ مَقَامٍ أَقُومُهُ بِالْمَدِينَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3928In-book reference : Book 63, Hadith 153USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3929,
    "id": 3929,
    "url": "https://sunnah.com/bukhari:3929",
    "bookNumber": 63,
    "hadithNumber": 154,
    "narrator": "Narrated 'Um Al-`Ala:",
    "english": "An Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) that the Ansar drew lots \nconcerning the dwelling of the Emigrants. `Uthman bin Maz'un was decided to dwell with them (i.e. \nUm Al-`Ala's family), `Uthman fell ill and I nursed him till he died, and we covered him with his \nclothes. Then the Prophet (ﷺ) came to us and I (addressing the dead body) said, \"O Abu As-Sa'ib, may \nAllah's Mercy be on you! I bear witness that Allah has honored you.\" On that the Prophet (ﷺ) said, \"How \ndo you know that Allah has honored him?\" I replied, \"I do not know. May my father and my mother \nbe sacrificed for you, O Allah's Messenger (ﷺ)! But who else is worthy of it (if not `Uthman)?\" He said, \"As \nto him, by Allah, death has overtaken him, and I hope the best for him. By Allah, though I am the \nApostle of Allah, yet I do not know what Allah will do to me,\" By Allah, I will never assert the piety \nof anyone after him. That made me sad, and when I slept I saw in a dream a flowing stream for \n`Uthman bin Maz'un. I went to Allah's Messenger (ﷺ) and told him of it. He remarked, \"That symbolizes his \n(good) deeds.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، أَنَّ أُمَّ الْعَلاَءِ ـ امْرَأَةً مِنْ نِسَائِهِمْ بَايَعَتِ النَّبِيَّ صلى الله عليه وسلم ـ أَخْبَرَتْهُ أَنَّ عُثْمَانَ بْنَ مَظْعُونٍ طَارَ لَهُمْ فِي السُّكْنَى حِينَ اقْتَرَعَتِ الأَنْصَارُ عَلَى سُكْنَى الْمُهَاجِرِينَ، قَالَتْ أُمُّ الْعَلاَءِ فَاشْتَكَى عُثْمَانُ عِنْدَنَا، فَمَرَّضْتُهُ حَتَّى تُوُفِّيَ، وَجَعَلْنَاهُ فِي أَثْوَابِهِ، فَدَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، شَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ ‏\"‏‏.‏ قَالَتْ قُلْتُ لاَ أَدْرِي بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ فَمَنْ قَالَ ‏\"‏ أَمَّا هُوَ فَقَدْ جَاءَهُ وَاللَّهِ الْيَقِينُ، وَاللَّهِ إِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَمَا أَدْرِي وَاللَّهِ وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي ‏\"‏‏.‏ قَالَتْ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ قَالَتْ فَأَحْزَنَنِي ذَلِكَ فَنِمْتُ فَأُرِيتُ لِعُثْمَانَ بْنِ مَظْعُونٍ عَيْنًا تَجْرِي، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ‏.‏ فَقَالَ ‏\"‏ ذَلِكَ عَمَلُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3929In-book reference : Book 63, Hadith 154USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3930,
    "id": 3930,
    "url": "https://sunnah.com/bukhari:3930",
    "bookNumber": 63,
    "hadithNumber": 155,
    "narrator": "Narrated `Aisha:",
    "english": "The day of Bu'ath was a day (i.e. battle) which Allah caused to take place just before the mission of \nHis Apostle so that when Allah's Messenger (ﷺ) came to Medina, they (the tribes) had divided (into hostile \ngroups) and their nobles had been killed; and all that facilitated their conversion to Islam.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ بُعَاثٍ يَوْمًا قَدَّمَهُ اللَّهُ عَزَّ وَجَلَّ لِرَسُولِهِ صلى الله عليه وسلم، فَقَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَقَدِ افْتَرَقَ مَلَؤُهُمْ، وَقُتِلَتْ سَرَاتُهُمْ فِي دُخُولِهِمْ فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3930In-book reference : Book 63, Hadith 155USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 267   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3931,
    "id": 3931,
    "url": "https://sunnah.com/bukhari:3931",
    "bookNumber": 63,
    "hadithNumber": 156,
    "narrator": "Narrated Aisha:",
    "english": "That once Abu Bakr came to her on the day of `Id-ul-Fitr or `Id ul Adha while the Prophet (ﷺ) was with \nher and there were two girl singers with her, singing songs of the Ansar about the day of Buath. Abu \nBakr said twice. \"Musical instrument of Satan!\" But the Prophet (ﷺ) said, \"Leave them Abu Bakr, for \nevery nation has an `Id (i.e. festival) and this day is our `Id.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ، دَخَلَ عَلَيْهَا وَالنَّبِيُّ صلى الله عليه وسلم عِنْدَهَا يَوْمَ فِطْرٍ أَوْ أَضْحًى، وَعِنْدَهَا قَيْنَتَانِ ‏{‏تُغَنِّيَانِ‏}‏ بِمَا تَقَاذَفَتِ الأَنْصَارُ يَوْمَ بُعَاثَ‏.‏ فَقَالَ أَبُو بَكْرٍ مِزْمَارُ الشَّيْطَانِ مَرَّتَيْنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ، إِنَّ لِكُلِّ قَوْمٍ عِيدًا، وَإِنَّ عِيدَنَا هَذَا الْيَوْمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3931In-book reference : Book 63, Hadith 156USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3932,
    "id": 3932,
    "url": "https://sunnah.com/bukhari:3932",
    "bookNumber": 63,
    "hadithNumber": 157,
    "narrator": "Narrated Anas bin Malik:",
    "english": "When Allah's Messenger (ﷺ) arrived at Medina, he alighted at the upper part of Medina among the people \ncalled Bani `Amr bin `Auf and he stayed with them for fourteen nights. Then he sent for the chiefs of \nBani An-Najjar, and they came, carrying their swords. As if I am just now looking at Allah's Messenger (ﷺ) \non his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Bani An- \nNajjar around him till he dismounted in the courtyard of Abu Aiyub's home. The Prophet (ﷺ) used to offer \nthe prayer wherever the prayer was due, and he would pray even in sheepfolds. Then he ordered that \nthe mosque be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said, \"O Banu \nAn-Najjar! Suggest to me the price of this garden of yours.\" They replied \"No! By Allah, we do not \ndemand its price except from Allah.\" In that garden there were the (following) things that I will tell \nyou: Graves of pagans, unleveled land with holes and pits etc., and date-palm trees. Allah's Messenger (ﷺ) \nordered that the graves of the pagans be dug up and, the unleveled land be leveled and the date-palm \ntrees be cut down. The trunks of the trees were arranged so as to form the wall facing the Qibla. The \nStone pillars were built at the sides of its gate. The companions of the Prophet (ﷺ) were carrying the \nstones and reciting some lyrics, and Allah's Messenger (ﷺ) . . was with them and they were saying, \"O Allah! \nThere is no good Excel the good of the Hereafter, so bestow victory on the Ansar and the Emigrants. \"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ،‏.‏ وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، حَدَّثَنَا أَبُو التَّيَّاحِ، يَزِيدُ بْنُ حُمَيْدٍ الضُّبَعِيُّ قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، نَزَلَ فِي عُلْوِ الْمَدِينَةِ فِي حَىٍّ يُقَالُ لَهُمْ بَنُو عَمْرِو بْنِ عَوْفٍ ـ قَالَ ـ فَأَقَامَ فِيهِمْ أَرْبَعَ عَشْرَةَ لَيْلَةً، ثُمَّ أَرْسَلَ إِلَى مَلإِ بَنِي النَّجَّارِ ـ قَالَ ـ فَجَاءُوا مُتَقَلِّدِي سُيُوفِهِمْ، قَالَ وَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى رَاحِلَتِهِ، وَأَبُو بَكْرٍ رِدْفَهُ، وَمَلأُ بَنِي النَّجَّارِ حَوْلَهُ حَتَّى أَلْقَى بِفِنَاءِ أَبِي أَيُّوبَ، قَالَ فَكَانَ يُصَلِّي حَيْثُ أَدْرَكَتْهُ الصَّلاَةُ، وَيُصَلِّي فِي مَرَابِضِ الْغَنَمِ، قَالَ ثُمَّ إِنَّهُ أَمَرَ بِبِنَاءِ الْمَسْجِدِ، فَأَرْسَلَ إِلَى مَلإِ بَنِي النَّجَّارِ، فَجَاءُوا فَقَالَ ‏\n\"‏ يَا بَنِي النَّجَّارِ، ثَامِنُونِي حَائِطَكُمْ هَذَا ‏\"‏‏.‏ فَقَالُوا لاَ، وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏ قَالَ فَكَانَ فِيهِ مَا أَقُولُ لَكُمْ كَانَتْ فِيهِ قُبُورُ الْمُشْرِكِينَ، وَكَانَتْ فِيهِ خِرَبٌ، وَكَانَ فِيهِ نَخْلٌ، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقُبُورِ الْمُشْرِكِينَ فَنُبِشَتْ، وَبِالْخِرَبِ فَسُوِّيَتْ، وَبِالنَّخْلِ فَقُطِعَ، قَالَ فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ ـ قَالَ ـ وَجَعَلُوا عِضَادَتَيْهِ حِجَارَةً‏.‏ قَالَ قَالَ جَعَلُوا يَنْقُلُونَ ذَاكَ الصَّخْرَ وَهُمْ يَرْتَجِزُونَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم مَعَهُمْ يَقُولُونَ اللَّهُمَّ إِنَّهُ لاَ خَيْرَ إِلاَّ خَيْرُ الآخِرَهْ فَانْصُرِ الأَنْصَارَ وَالْمُهَاجِرَهْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3932In-book reference : Book 63, Hadith 157USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3933,
    "id": 3933,
    "url": "https://sunnah.com/bukhari:3933",
    "bookNumber": 63,
    "hadithNumber": 158,
    "narrator": "Narrated `Abdur-Rahman bin Humaid Az-Zuhri:",
    "english": "I heard `Umar bin `Abdul-Aziz asking As-Sa'ib, the nephew of An-Nimr. \"What have you heard about \nresiding in Mecca?\" The other said, \"I heard Al-Ala bin Al-Hadrami saying, Allah's Messenger (ﷺ) said: An \nEmigrant is allowed to stay in Mecca for three days after departing from Mina (i.e. after performing \nall the ceremonies of Hajj)\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا حَاتِمٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الزُّهْرِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَسْأَلُ السَّائِبَ ابْنَ أُخْتِ النَّمِرِ مَا سَمِعْتَ فِي، سُكْنَى مَكَّةَ قَالَ سَمِعْتُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثٌ لِلْمُهَاجِرِ بَعْدَ الصَّدَرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3933In-book reference : Book 63, Hadith 158USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3934,
    "id": 3934,
    "url": "https://sunnah.com/bukhari:3934",
    "bookNumber": 63,
    "hadithNumber": 159,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The Prophet's companions did not take as a starting date for the Muslim calendar, the day, the Prophet (ﷺ) \nhad been sent as an Apostle or the day of his death, but the day of his arrival at Medina.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ مَا عَدُّوا مِنْ مَبْعَثِ النَّبِيِّ صلى الله عليه وسلم وَلاَ مِنْ وَفَاتِهِ، مَا عَدُّوا إِلاَّ مِنْ مَقْدَمِهِ الْمَدِينَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3934In-book reference : Book 63, Hadith 159USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3935,
    "id": 3935,
    "url": "https://sunnah.com/bukhari:3935",
    "bookNumber": 63,
    "hadithNumber": 160,
    "narrator": "Narrated `Aisha:",
    "english": "Originally, two rak`at were prescribed in every prayer. When the Prophet (ﷺ) migrated (to Medina) four \nrak`at were enjoined, while the journey prayer remained unchanged(i.e. two rak`at).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ فُرِضَتِ الصَّلاَةُ رَكْعَتَيْنِ، ثُمَّ هَاجَرَ النَّبِيُّ صلى الله عليه وسلم فَفُرِضَتْ أَرْبَعًا، وَتُرِكَتْ صَلاَةُ السَّفَرِ عَلَى الأُولَى‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3935In-book reference : Book 63, Hadith 160USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3936,
    "id": 3936,
    "url": "https://sunnah.com/bukhari:3936",
    "bookNumber": 63,
    "hadithNumber": 161,
    "narrator": "Narrated Sa`d bin Malik:",
    "english": "In the year of Hajjat-ul-Wada` the Prophet (ﷺ) visited me when I fell ill and was about to die because of \nthat illness. I said, \"O Allah's Messenger (ﷺ)! I am very ill as you see, and I am a rich man and have no heir \nexcept my only daughter. Shall I give 2/3 of my property in charity?\" He said, \"No.\" I said, \"Shall I \nthen give one half of it in charity?\" He said, \"O Sa`d! Give 1/3 (in charity) and even 1/3 is too much. \nNo doubt, it is better to leave your children rich than to leave them poor, reduced to begging from \nothers. And Allah will reward you for whatever you spend with the intention of gaining Allah's \nPleasure even if it were a mouthful of food you put into your wives mouth.\" I said, \"O Allah's \nApostle! Am I to be left behind (in Mecca) after my companions have gone?\" He said, \"If you should \nbe left behind, you will be upgraded and elevated for every deed you will do with a desire to achieve \nAllah's Pleasure. I hope that you will live long so that some people will benefit by you while others \nwill be harmed. O Allah! Please fulfill the migration of my companions and do not make them turn \nback on their heels. But (we feel sorry for) the unlucky Sa`d bin Khaulah.\" Allah's Messenger (ﷺ) lamented \nhis death in Mecca.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ عَادَنِي النَّبِيُّ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ مِنْ مَرَضٍ أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ، بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى، وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأَتَصَدَّقُ بِشَطْرِهِ قَالَ ‏\"‏ الثُّلُثُ يَا سَعْدُ، وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ ذُرِّيَّتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ ‏\"‏‏.‏ قَالَ أَحْمَدُ بْنُ يُونُسَ عَنْ إِبْرَاهِيمَ ‏\"‏ أَنْ تَذَرَ ذُرِّيَّتَكَ، وَلَسْتَ بِنَافِقٍ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ آجَرَكَ اللَّهُ بِهَا، حَتَّى اللُّقْمَةَ تَجْعَلُهَا فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتَ يَا رَسُولَ اللَّهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُوُفِّيَ بِمَكَّةَ ‏\"‏‏.‏ وَقَالَ أَحْمَدُ بْنُ يُونُسَ وَمُوسَى عَنْ إِبْرَاهِيمَ ‏\"‏ أَنْ تَذَرَ وَرَثَتَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3936In-book reference : Book 63, Hadith 161USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3937,
    "id": 3937,
    "url": "https://sunnah.com/bukhari:3937",
    "bookNumber": 63,
    "hadithNumber": 162,
    "narrator": "Narrated Anas:",
    "english": "When `Abdur-Rahman bin `Auf came to Medina and the Prophet (ﷺ) established the bond of brotherhood \nbetween him and Sa`d bin Ar-Rabi-al-Ansari, Saud suggested that `Abdur-Rahman should accept half \nof his property and family. `Abdur Rahman said, \"May Allah bless you in your family and property; \nguide me to the market.\" So `Abdur-Rahman (while doing business in the market) made some profit \nof some condensed dry yoghurt and butter. After a few days the Prophet (ﷺ) saw him wearing clothes \nstained with yellow perfume. The Prophet (ﷺ) asked, \"What is this, O `Abdur-Rahman?\" He said, \"O \nAllah's Messenger (ﷺ)! I have married an Ansar' woman.\" The Prophet (ﷺ) asked, \"What have you given her as \nMahr?\" He (i.e. `Abdur-Rahman) said, \"A piece of gold, about the weight of a date stone.\" Then the \nProphet said, Give a banquet, even though of a sheep.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، فَعَرَضَ عَلَيْهِ أَنْ يُنَاصِفَهُ أَهْلَهُ وَمَالَهُ، فَقَالَ عَبْدُ الرَّحْمَنِ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، دُلَّنِي عَلَى السُّوقِ‏.‏ فَرَبِحَ شَيْئًا مِنْ أَقِطٍ وَسَمْنٍ، فَرَآهُ النَّبِيُّ صلى الله عليه وسلم بَعْدَ أَيَّامٍ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْيَمْ يَا عَبْدَ الرَّحْمَنِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ فَمَا سُقْتَ فِيهَا ‏\"‏‏.‏ فَقَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3937In-book reference : Book 63, Hadith 162USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3938,
    "id": 3938,
    "url": "https://sunnah.com/bukhari:3938",
    "bookNumber": 63,
    "hadithNumber": 163,
    "narrator": "Narrated Anas:",
    "english": "When the news of the arrival of the Prophet (ﷺ) at Medina reached `Abdullah bin Salam, he went to him \nto ask him about certain things, He said, \"I am going to ask you about three things which only a \nProphet can answer: What is the first sign of The Hour? What is the first food which the people of \nParadise will eat? Why does a child attract the similarity to his father or to his mother?\" The Prophet (ﷺ) \nreplied, \"Gabriel has just now informed me of that.\" Ibn Salam said, \"He (i.e. Gabriel) is the enemy of \nthe Jews amongst the angels. The Prophet (ﷺ) said, \"As for the first sign of The Hour, it will be a fire that \nwill collect the people from the East to the West. As for the first meal which the people of Paradise \nwill eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man's discharge \nproceeds the woman's discharge, the child attracts the similarity to the man, and if the woman's \ndischarge proceeds the man's, then the child attracts the similarity to the woman.\" \nOn this, `Abdullah bin Salam said, \"I testify that None has the right to be worshipped except Allah, \nand that you are the Messenger of Allah.\" and added, \"O Allah's Messenger (ﷺ)! Jews invent such lies as make \none astonished, so please ask them about me before they know about my conversion to I slam . \" The \nJews came, and the Prophet (ﷺ) said, \"What kind of man is `Abdullah bin Salam among you?\" They \nreplied, \"The best of us and the son of the best of us and the most superior among us, and the son of \nthe most superior among us. \"The Prophet (ﷺ) said, \"What would you think if `Abdullah bin Salam should \nembrace Islam?\" They said, \"May Allah protect him from that.\" The Prophet (ﷺ) repeated his question and \nthey gave the same answer. Then `Abdullah came out to them and said, \"I testify that None has the \nright to be worshipped except Allah and that Muhammad is the Messenger of Allah!\" On this, the Jews \nsaid, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded \nhim. On this, he (i.e. `Abdullah bin Salam) said, \"It is this that I was afraid of, O Allah's Messenger (ﷺ).",
    "arabic": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ، عَنْ بِشْرِ بْنِ الْمُفَضَّلِ، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا أَنَسٌ، أَنَّ عَبْدَ اللَّهِ بْنَ سَلاَمٍ، بَلَغَهُ مَقْدَمُ النَّبِيِّ صلى الله عليه وسلم الْمَدِينَةَ، فَأَتَاهُ يَسْأَلُهُ عَنْ أَشْيَاءَ، فَقَالَ إِنِّي سَائِلُكَ عَنْ ثَلاَثٍ لاَ يَعْلَمُهُنَّ إِلاَّ نَبِيٌّ مَا أَوَّلُ أَشْرَاطِ السَّاعَةِ وَمَا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ وَمَا بَالُ الْوَلَدِ يَنْزِعُ إِلَى أَبِيهِ أَوْ إِلَى أُمِّهِ قَالَ ‏\"‏ أَخْبَرَنِي بِهِ جِبْرِيلُ آنِفًا ‏\"‏‏.‏ قَالَ ابْنُ سَلاَمٍ ذَاكَ عَدُوُّ الْيَهُودِ مِنَ الْمَلاَئِكَةِ‏.‏ قَالَ ‏\"‏ أَمَّا أَوَّلُ أَشْرَاطِ السَّاعَةِ فَنَارٌ تَحْشُرُهُمْ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ، وَأَمَّا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ، فَزِيَادَةُ كَبِدِ الْحُوتِ، وَأَمَّا الْوَلَدُ، فَإِذَا سَبَقَ مَاءُ الرَّجُلِ مَاءَ الْمَرْأَةِ نَزَعَ الْوَلَدَ، وَإِذَا سَبَقَ مَاءُ الْمَرْأَةِ مَاءَ الرَّجُلِ نَزَعَتِ الْوَلَدَ ‏\"‏‏.‏ قَالَ أَشْهَدُ أَنَّ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّكَ رَسُولُ اللَّهِ‏.‏ قَالَ يَا رَسُولَ اللَّهِ، إِنَّ الْيَهُودَ قَوْمٌ بُهُتٌ، فَاسْأَلْهُمْ عَنِّي قَبْلَ أَنْ يَعْلَمُوا بِإِسْلاَمِي، فَجَاءَتِ الْيَهُودُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَىُّ رَجُلٍ عَبْدُ اللَّهِ بْنُ سَلاَمٍ فِيكُمْ ‏\"‏‏.‏ قَالُوا خَيْرُنَا وَابْنُ خَيْرِنَا وَأَفْضَلُنَا وَابْنُ أَفْضَلِنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتُمْ إِنْ أَسْلَمَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ قَالُوا أَعَاذَهُ اللَّهُ مِنْ ذَلِكَ‏.‏ فَأَعَادَ عَلَيْهِمْ، فَقَالُوا مِثْلَ ذَلِكَ، فَخَرَجَ إِلَيْهِمْ عَبْدُ اللَّهِ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ قَالُوا شَرُّنَا وَابْنُ شَرِّنَا‏.‏ وَتَنَقَّصُوهُ‏.‏ قَالَ هَذَا كُنْتُ أَخَافُ يَا رَسُولَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3938In-book reference : Book 63, Hadith 163USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3939,
    "id": 3939,
    "url": "https://sunnah.com/bukhari:3939",
    "bookNumber": 63,
    "hadithNumber": 164,
    "narrator": "Narrated Abu Al-Minhal `AbdurRahman bin Mut`im:",
    "english": "A partner of mine sold some Dirhams on credit in the market. I said, \"Glorified be Allah! Is this \nlegal?\" He replied, \"Glorified be Allah! By Allah, when I sold them in the market, nobody objected to \nit.\" Then I asked Al-Bara' bin `Azib (about it) he said, \"We used to make such a transaction when the \nProphet came to Medina. So he said, 'There is no harm in it if it is done from hand to hand, but it is \nnot allowed on credit.' Go to Zaid bin Al- Arqam and ask him about it for he was the greatest trader of \nall of us.\" So I asked Zaid bin Al-Arqam., and he said the same (as Al-Bara) did.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ أَبَا الْمِنْهَالِ عَبْدَ الرَّحْمَنِ بْنَ مُطْعِمٍ، قَالَ بَاعَ شَرِيكٌ لِي دَرَاهِمَ فِي السُّوقِ نَسِيئَةً فَقُلْتُ سُبْحَانَ اللَّهِ أَيَصْلُحُ هَذَا فَقَالَ سُبْحَانَ اللَّهِ، وَاللَّهِ لَقَدْ بِعْتُهَا فِي السُّوقِ فَمَا عَابَهُ أَحَدٌ، فَسَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَتَبَايَعُ هَذَا الْبَيْعَ، فَقَالَ ‏\n\"‏ مَا كَانَ يَدًا بِيَدٍ فَلَيْسَ بِهِ بَأْسٌ، وَمَا كَانَ نَسِيئَةً فَلاَ يَصْلُحُ ‏\"‏‏.‏ وَالْقَ زَيْدَ بْنَ أَرْقَمَ فَاسْأَلْهُ فَإِنَّهُ كَانَ أَعْظَمَنَا تِجَارَةً، فَسَأَلْتُ زَيْدَ بْنَ أَرْقَمَ فَقَالَ مِثْلَهُ‏.‏ وَقَالَ سُفْيَانُ مَرَّةً فَقَالَ قَدِمَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَتَبَايَعُ، وَقَالَ نَسِيئَةً إِلَى الْمَوْسِمِ أَوِ الْحَجِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3939, 3940In-book reference : Book 63, Hadith 164USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3940,
    "id": 3940,
    "url": "https://sunnah.com/bukhari:3940",
    "bookNumber": 63,
    "hadithNumber": 164,
    "narrator": "Narrated Abu Al-Minhal `AbdurRahman bin Mut`im:",
    "english": "A partner of mine sold some Dirhams on credit in the market. I said, \"Glorified be Allah! Is this \nlegal?\" He replied, \"Glorified be Allah! By Allah, when I sold them in the market, nobody objected to \nit.\" Then I asked Al-Bara' bin `Azib (about it) he said, \"We used to make such a transaction when the \nProphet came to Medina. So he said, 'There is no harm in it if it is done from hand to hand, but it is \nnot allowed on credit.' Go to Zaid bin Al- Arqam and ask him about it for he was the greatest trader of \nall of us.\" So I asked Zaid bin Al-Arqam., and he said the same (as Al-Bara) did.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ أَبَا الْمِنْهَالِ عَبْدَ الرَّحْمَنِ بْنَ مُطْعِمٍ، قَالَ بَاعَ شَرِيكٌ لِي دَرَاهِمَ فِي السُّوقِ نَسِيئَةً فَقُلْتُ سُبْحَانَ اللَّهِ أَيَصْلُحُ هَذَا فَقَالَ سُبْحَانَ اللَّهِ، وَاللَّهِ لَقَدْ بِعْتُهَا فِي السُّوقِ فَمَا عَابَهُ أَحَدٌ، فَسَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَتَبَايَعُ هَذَا الْبَيْعَ، فَقَالَ ‏\n\"‏ مَا كَانَ يَدًا بِيَدٍ فَلَيْسَ بِهِ بَأْسٌ، وَمَا كَانَ نَسِيئَةً فَلاَ يَصْلُحُ ‏\"‏‏.‏ وَالْقَ زَيْدَ بْنَ أَرْقَمَ فَاسْأَلْهُ فَإِنَّهُ كَانَ أَعْظَمَنَا تِجَارَةً، فَسَأَلْتُ زَيْدَ بْنَ أَرْقَمَ فَقَالَ مِثْلَهُ‏.‏ وَقَالَ سُفْيَانُ مَرَّةً فَقَالَ قَدِمَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَتَبَايَعُ، وَقَالَ نَسِيئَةً إِلَى الْمَوْسِمِ أَوِ الْحَجِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3939, 3940In-book reference : Book 63, Hadith 164USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3941,
    "id": 3941,
    "url": "https://sunnah.com/bukhari:3941",
    "bookNumber": 63,
    "hadithNumber": 165,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Had only ten Jews (amongst their chiefs) believe me, all the Jews would definitely \nhave believed me.\"",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا قُرَّةُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ آمَنَ بِي عَشَرَةٌ مِنَ الْيَهُودِ لآمَنَ بِي الْيَهُودُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3941In-book reference : Book 63, Hadith 165USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3942,
    "id": 3942,
    "url": "https://sunnah.com/bukhari:3942",
    "bookNumber": 63,
    "hadithNumber": 166,
    "narrator": "Narrated Abu Musa:",
    "english": "When the Prophet (ﷺ) arrived at Medina, he noticed that some people among the Jews used to respect \nAshura' (i.e. 10th of Muharram) and fast on it. The Prophet (ﷺ) then said, \"We have more right to observe \nfast on this day.\" and ordered that fasting should be observed on it.",
    "arabic": "حَدَّثَنِي أَحْمَدُ ـ أَوْ مُحَمَّدُ ـ بْنُ عُبَيْدِ اللَّهِ الْغُدَانِيُّ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَإِذَا أُنَاسٌ مِنَ الْيَهُودِ يُعَظِّمُونَ عَاشُورَاءَ وَيَصُومُونَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ نَحْنُ أَحَقُّ بِصَوْمِهِ ‏\"‏‏.‏ فَأَمَرَ بِصَوْمِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3942In-book reference : Book 63, Hadith 166USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3943,
    "id": 3943,
    "url": "https://sunnah.com/bukhari:3943",
    "bookNumber": 63,
    "hadithNumber": 167,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) arrived at Medina he found that the Jews observed fast on the day of 'Ashura'. They \nwere asked the reason for the fast. They replied, \"This is the day when Allah caused Moses and the \nchildren of Israel to have victory over Pharaoh, so we fast on this day as a sign of glorifying it.\" \nAllah's Messenger (ﷺ) said, \"We are closer to Moses than you.\" Then he ordered that fasting on this day \nshould be observed.",
    "arabic": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَجَدَ الْيَهُودَ يَصُومُونَ عَاشُورَاءَ، فَسُئِلُوا عَنْ ذَلِكَ، فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْفَرَ اللَّهُ فِيهِ مُوسَى وَبَنِي إِسْرَائِيلَ عَلَى فِرْعَوْنَ، وَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ ‏\"‏‏.‏ ثُمَّ أَمَرَ بِصَوْمِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3943In-book reference : Book 63, Hadith 167USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3944,
    "id": 3944,
    "url": "https://sunnah.com/bukhari:3944",
    "bookNumber": 63,
    "hadithNumber": 168,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "The Prophet (ﷺ) used to keep his hair falling loose while the pagans used to part their hair, and the People \nof the Scriptures used to keep their hair falling loose, and the Prophet (ﷺ) liked to follow the People of the \nScriptures in matters about which he had not been instructed differently, but later on the Prophet (ﷺ) \nstarted parting his hair.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَسْدِلُ شَعْرَهُ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ، وَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ رُءُوسَهُمْ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ بِشَىْءٍ، ثُمَّ فَرَقَ النَّبِيُّ صلى الله عليه وسلم رَأْسَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3944In-book reference : Book 63, Hadith 168USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3945,
    "id": 3945,
    "url": "https://sunnah.com/bukhari:3945",
    "bookNumber": 63,
    "hadithNumber": 169,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "They, the people of the Scriptures, divided this Scripture into parts, believing in some portions of it \nand disbelieving the others. (See 15:91)",
    "arabic": "حَدَّثَنِي زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ هُمْ أَهْلُ الْكِتَابِ، جَزَّءُوهُ أَجْزَاءً، فَآمَنُوا بِبَعْضِهِ وَكَفَرُوا بِبَعْضِهِ‏.‏ ‏{‏يَعْنِي قَوْلَ اللَّهِ تَعَالَى ‏{‏الَّذِينَ جَعَلُوا الْقُرْآنَ عِضِينَ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3945In-book reference : Book 63, Hadith 169USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3946,
    "id": 3946,
    "url": "https://sunnah.com/bukhari:3946",
    "bookNumber": 63,
    "hadithNumber": 170,
    "narrator": "Narrated Salman Al-Farisi:",
    "english": "That he was sold (as a slave) by one master to another for more than ten times (i.e between 13 and \n19).",
    "arabic": "حَدَّثَنِي الْحَسَنُ بْنُ عُمَرَ بْنِ شَقِيقٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ أَبِي وَحَدَّثَنَا أَبُو عُثْمَانَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، أَنَّهُ تَدَاوَلَهُ بِضْعَةَ عَشَرَ مِنْ رَبٍّ إِلَى رَبٍّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3946In-book reference : Book 63, Hadith 170USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3947,
    "id": 3947,
    "url": "https://sunnah.com/bukhari:3947",
    "bookNumber": 63,
    "hadithNumber": 171,
    "narrator": "Narrated Salman:",
    "english": "I am from Ram-Hurmuz (i.e. a Persian town).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَوْفٍ، عَنْ أَبِي عُثْمَانَ، قَالَ سَمِعْتُ سَلْمَانَ ـ رضى الله عنه ـ يَقُولُ أَنَا مِنْ، رَامَ هُرْمُزَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3947In-book reference : Book 63, Hadith 171USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3948,
    "id": 3948,
    "url": "https://sunnah.com/bukhari:3948",
    "bookNumber": 63,
    "hadithNumber": 172,
    "narrator": "Narrated Salman:",
    "english": "The interval between Jesus and Muhammad was six hundred years.",
    "arabic": "حَدَّثَنِي الْحَسَنُ بْنُ مُدْرِكٍ، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ، عَنْ سَلْمَانَ، قَالَ فَتْرَةٌ بَيْنَ عِيسَى وَمُحَمَّدٍ صلى الله عليه وسلم سِتُّمِائَةِ سَنَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3948In-book reference : Book 63, Hadith 172USC-MSA web (English) reference : Vol. 5, Book 58, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3949,
    "id": 3949,
    "url": "https://sunnah.com/bukhari:3949",
    "bookNumber": 64,
    "hadithNumber": 1,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "Once, while I was sitting beside Zaid bin Al-Arqam, he was asked, \"How many Ghazwat did the \nProphet undertake?\" Zaid replied, \"Nineteen.\" They said, \"In how many Ghazwat did you join him?\" \nHe replied, \"Seventeen.\" I asked, \"Which of these was the first?\" He replied, \"Al-`Ashira or Al- \n`Ashiru.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، كُنْتُ إِلَى جَنْبِ زَيْدِ بْنِ أَرْقَمَ، فَقِيلَ لَهُ كَمْ غَزَا النَّبِيُّ صلى الله عليه وسلم مِنْ غَزْوَةٍ قَالَ تِسْعَ عَشْرَةَ‏.‏ قِيلَ كَمْ غَزَوْتَ أَنْتَ مَعَهُ قَالَ سَبْعَ عَشْرَةَ‏.‏ قُلْتُ فَأَيُّهُمْ كَانَتْ أَوَّلَ قَالَ الْعُسَيْرَةُ أَوِ الْعُشَيْرُ‏.‏ فَذَكَرْتُ لِقَتَادَةَ فَقَالَ الْعُشَيْرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3949In-book reference : Book 64, Hadith 1USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3950,
    "id": 3950,
    "url": "https://sunnah.com/bukhari:3950",
    "bookNumber": 64,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "From Sa`d bin Mu`adh: Sa`d bin Mu`adh was an intimate friend of Umaiya bin Khalaf and whenever \nUmaiya passed through Medina, he used to stay with Sa`d, and whenever Sa`d went to Mecca, he used \nto stay with Umaiya. When Allah's Messenger (ﷺ) arrived at Medina, Sa`d went to perform `Umra and \nstayed at Umaiya's home in Mecca. He said to Umaiya, \"Tell me of a time when (the Mosque) is \nempty so that I may be able to perform Tawaf around the Ka`ba.\" So Umaiya went with him about \nmidday. Abu Jahl met them and said, \"O Abu Safwan! Who is this man accompanying you?\" He said, \n\"He is Sa`d.\" Abu Jahl addressed Sa`d saying, \"I see you wandering about safely in Mecca inspite of \nthe fact that you have given shelter to the people who have changed their religion (i.e. became \nMuslims) and have claimed that you will help them and support them. By Allah, if you were not in the \ncompany of Abu Safwan, you would not be able to go your family safely.\" Sa`d, raising his voice, \nsaid to him, \"By Allah, if you should stop me from doing this (i.e. performing Tawaf) I would \ncertainly prevent you from something which is more valuable for you, that is, your passage through \nMedina.\" On this, Umaiya said to him, \"O Sa`d do not raise your voice before Abu-l-Hakam, the chief \nof the people of the Valley (of Mecca).\" Sa`d said, \"O Umaiya, stop that! By Allah, I have heard \nAllah's Messenger (ﷺ) predicting that the Muslim will kill you.\" Umaiya asked, \"In Mecca?\" Sa`d said, \"I do \nnot know.\" Umaiya was greatly scared by that news. \nWhen Umaiya returned to his family, he said to his wife, \"O Um Safwan! Don't you know what Sa`d \ntold me? \"She said, \"What has he told you?\" He replied, \"He claims that Muhammad has informed \nthem (i.e. companions that they will kill me. I asked him, 'In Mecca?' He replied, 'I do not know.\" \nThen Umaiya added, \"By Allah, I will never go out of Mecca.\" But when the day of (the Ghazwa of) \nBadr came, Abu Jahl called the people to war, saying, \"Go and protect your caravan.\" But Umaiya \ndisliked to go out (of Mecca). Abu Jahl came to him and said, \"O Abu Safwan! If the people see you \nstaying behind though you are the chief of the people of the Valley, then they will remain behind with \nyou.\" Abu Jahl kept on urging him to go until he (i.e. Umaiya) said, \"As you have forced me to \nchange my mind, by Allah, I will buy the best camel in Mecca. Then Umaiya said (to his wife). \"O \nUm Safwan, prepare what I need (for the journey).\" She said to him, \"O Abu Safwan! Have you \nforgotten what your Yathribi brother told you?\" He said, \"No, but I do not want to go with them but \nfor a short distance.\" So when Umaiya went out, he used to tie his camel wherever he camped. He \nkept on doing that till Allah caused him to be killed at Badr.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ـ رضى الله عنه ـ حَدَّثَ عَنْ سَعْدِ بْنِ مُعَاذٍ، أَنَّهُ قَالَ كَانَ صَدِيقًا لأُمَيَّةَ بْنِ خَلَفٍ، وَكَانَ أُمَيَّةُ إِذَا مَرَّ بِالْمَدِينَةِ نَزَلَ عَلَى سَعْدٍ، وَكَانَ سَعْدٌ إِذَا مَرَّ بِمَكَّةَ نَزَلَ عَلَى أُمَيَّةَ، فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ انْطَلَقَ سَعْدٌ مُعْتَمِرًا، فَنَزَلَ عَلَى أُمَيَّةَ بِمَكَّةَ، فَقَالَ لأُمَيَّةَ انْظُرْ لِي سَاعَةَ خَلْوَةٍ لَعَلِّي أَنْ أَطُوفَ بِالْبَيْتِ‏.‏ فَخَرَجَ بِهِ قَرِيبًا مِنْ نِصْفِ النَّهَارِ فَلَقِيَهُمَا أَبُو جَهْلٍ فَقَالَ يَا أَبَا صَفْوَانَ، مَنْ هَذَا مَعَكَ فَقَالَ هَذَا سَعْدٌ‏.‏ فَقَالَ لَهُ أَبُو جَهْلٍ أَلاَ أَرَاكَ تَطُوفُ بِمَكَّةَ آمِنًا، وَقَدْ أَوَيْتُمُ الصُّبَاةَ، وَزَعَمْتُمْ أَنَّكُمْ تَنْصُرُونَهُمْ وَتُعِينُونَهُمْ، أَمَا وَاللَّهِ لَوْلاَ أَنَّكَ مَعَ أَبِي صَفْوَانَ مَا رَجَعْتَ إِلَى أَهْلِكَ سَالِمًا‏.‏ فَقَالَ لَهُ سَعْدٌ وَرَفَعَ صَوْتَهُ عَلَيْهِ أَمَا وَاللَّهِ لَئِنْ مَنَعْتَنِي هَذَا لأَمْنَعَنَّكَ مَا هُوَ أَشَدُّ عَلَيْكَ مِنْهُ طَرِيقَكَ عَلَى الْمَدِينَةِ‏.‏ فَقَالَ لَهُ أُمَيَّةُ لاَ تَرْفَعْ صَوْتَكَ يَا سَعْدُ عَلَى أَبِي الْحَكَمِ سَيِّدِ أَهْلِ الْوَادِي‏.‏ فَقَالَ سَعْدٌ دَعْنَا عَنْكَ يَا أُمَيَّةُ، فَوَاللَّهِ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ إِنَّهُمْ قَاتِلُوكَ‏.‏ قَالَ بِمَكَّةَ قَالَ لاَ أَدْرِي‏.‏ فَفَزِعَ لِذَلِكَ أُمَيَّةُ فَزَعًا شَدِيدًا، فَلَمَّا رَجَعَ أُمَيَّةُ إِلَى أَهْلِهِ قَالَ يَا أُمَّ صَفْوَانَ، أَلَمْ تَرَىْ مَا قَالَ لِي سَعْدٌ قَالَتْ وَمَا قَالَ لَكَ قَالَ زَعَمَ أَنَّ مُحَمَّدًا أَخْبَرَهُمْ أَنَّهُمْ قَاتِلِيَّ، فَقُلْتُ لَهُ بِمَكَّةَ قَالَ لاَ أَدْرِي‏.‏ فَقَالَ أُمَيَّةُ وَاللَّهِ لاَ أَخْرُجُ مِنْ مَكَّةَ، فَلَمَّا كَانَ يَوْمَ بَدْرٍ اسْتَنْفَرَ أَبُو جَهْلٍ النَّاسَ قَالَ أَدْرِكُوا عِيرَكُمْ‏.‏ فَكَرِهَ أُمَيَّةُ أَنْ يَخْرُجَ، فَأَتَاهُ أَبُو جَهْلٍ فَقَالَ يَا أَبَا صَفْوَانَ، إِنَّكَ مَتَى مَا يَرَاكَ النَّاسُ قَدْ تَخَلَّفْتَ وَأَنْتَ سَيِّدُ أَهْلِ الْوَادِي تَخَلَّفُوا مَعَكَ، فَلَمْ يَزَلْ بِهِ أَبُو جَهْلٍ حَتَّى قَالَ أَمَّا إِذْ غَلَبْتَنِي، فَوَاللَّهِ لأَشْتَرِيَنَّ أَجْوَدَ بَعِيرٍ بِمَكَّةَ ثُمَّ قَالَ أُمَيَّةُ يَا أُمَّ صَفْوَانَ جَهِّزِينِي‏.‏ فَقَالَتْ لَهُ يَا أَبَا صَفْوَانَ وَقَدْ نَسِيتَ مَا قَالَ لَكَ أَخُوكَ الْيَثْرِبِيُّ قَالَ لاَ، مَا أُرِيدُ أَنْ أَجُوزَ مَعَهُمْ إِلاَّ قَرِيبًا‏.‏ فَلَمَّا خَرَجَ أُمَيَّةُ أَخَذَ لاَ يَنْزِلُ مَنْزِلاً إِلاَّ عَقَلَ بَعِيرَهُ، فَلَمْ يَزَلْ بِذَلِكَ حَتَّى قَتَلَهُ اللَّهُ عَزَّ وَجَلَّ بِبَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3950In-book reference : Book 64, Hadith 2USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3951,
    "id": 3951,
    "url": "https://sunnah.com/bukhari:3951",
    "bookNumber": 64,
    "hadithNumber": 3,
    "narrator": "Narrated Ka`b bin Malik:",
    "english": "I never failed to join Allah's Messenger (ﷺ) in any of his Ghazawat except in the Ghazwa of Tabuk. \nHowever, I did not take part in the Ghazwa of Badr, but none who failed to take part in it, was \nblamed, for Allah's Messenger (ﷺ) had gone out to meet the caravans of (Quraish, but Allah caused them (i.e. \nMuslims) to meet their enemy unexpectedly (with no previous intention) .",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا إِلاَّ فِي غَزْوَةِ تَبُوكَ، غَيْرَ أَنِّي تَخَلَّفْتُ عَنْ غَزْوَةِ بَدْرٍ، وَلَمْ يُعَاتَبْ أَحَدٌ تَخَلَّفَ عَنْهَا، إِنَّمَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ عِيرَ قُرَيْشٍ، حَتَّى جَمَعَ اللَّهُ بَيْنَهُمْ وَبَيْنَ عَدُوِّهِمْ عَلَى غَيْرِ مِيعَادٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3951In-book reference : Book 64, Hadith 3USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3952,
    "id": 3952,
    "url": "https://sunnah.com/bukhari:3952",
    "bookNumber": 64,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn Masud:",
    "english": "I witnessed Al-Miqdad bin Al-Aswad in a scene which would have been dearer to me than anything \nhad I been the hero of that scene. He (i.e. Al-Miqdad) came to the Prophet (ﷺ) while the Prophet (ﷺ) was \nurging the Muslims to fight with the pagans. Al-Miqdad said, \"We will not say as the People of Moses \nsaid: Go you and your Lord and fight you two. (5.27). But we shall fight on your right and on your left \nand in front of you and behind you.\" I saw the face of the Prophet (ﷺ) getting bright with happiness, for \nthat saying delighted him.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مُخَارِقٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ شَهِدْتُ مِنَ الْمِقْدَادِ بْنِ الأَسْوَدِ مَشْهَدًا، لأَنْ أَكُونَ صَاحِبَهُ أَحَبُّ إِلَىَّ مِمَّا عُدِلَ بِهِ، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ يَدْعُو عَلَى الْمُشْرِكِينَ فَقَالَ لاَ نَقُولُ كَمَا قَالَ قَوْمُ مُوسَى ‏{‏اذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلاَ‏}‏ وَلَكِنَّا نُقَاتِلُ عَنْ يَمِينِكَ وَعَنْ شِمَالِكَ وَبَيْنَ يَدَيْكَ وَخَلْفَكَ‏.‏ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أَشْرَقَ وَجْهُهُ وَسَرَّهُ‏.‏ يَعْنِي قَوْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3952In-book reference : Book 64, Hadith 4USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3953,
    "id": 3953,
    "url": "https://sunnah.com/bukhari:3953",
    "bookNumber": 64,
    "hadithNumber": 5,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "On the day of the battle of Badr, the Prophet (ﷺ) said, \"O Allah! I appeal to You (to fulfill) Your \nCovenant and Promise. O Allah! If Your Will is that none should worship You (then give victory to \nthe pagans).\" Then Abu Bakr took hold of him by the hand and said, \"This is sufficient for you.\" The \nProphet came out saying, \"Their multitude will be put to flight and they will show their backs.\" \n(54.45)",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ بَدْرٍ ‏\"‏ اللَّهُمَّ أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ شِئْتَ لَمْ تُعْبَدْ ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ فَقَالَ حَسْبُكَ‏.‏ فَخَرَجَ وَهْوَ يَقُولُ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3953In-book reference : Book 64, Hadith 5USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3954,
    "id": 3954,
    "url": "https://sunnah.com/bukhari:3954",
    "bookNumber": 64,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The believers who failed to join the Ghazwa of Badr and those who took part in it are not equal (in \nreward).",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَبْدُ الْكَرِيمِ، أَنَّهُ سَمِعَ مِقْسَمًا، مَوْلَى عَبْدِ اللَّهِ بْنِ الْحَارِثِ يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ سَمِعَهُ يَقُولُ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ عَنْ بَدْرٍ، وَالْخَارِجُونَ، إِلَى بَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3954In-book reference : Book 64, Hadith 6USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 290   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3955,
    "id": 3955,
    "url": "https://sunnah.com/bukhari:3955",
    "bookNumber": 64,
    "hadithNumber": 7,
    "narrator": "Narrated Al-Bara:",
    "english": "I and Ibn `Umar were considered too young to take part in the battle of Badr.",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اسْتُصْغِرْتُ أَنَا وَابْنُ، عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3955In-book reference : Book 64, Hadith 7USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 291   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3956,
    "id": 3956,
    "url": "https://sunnah.com/bukhari:3956",
    "bookNumber": 64,
    "hadithNumber": 8,
    "narrator": "Narrated Al-Bara:",
    "english": "I and Ibn `Umar were considered too young (to take part) in the battle of Badr, and the number of the \nEmigrant warriors were over sixty (men) and the Ansar were over 249.",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا وَهْبٌ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اسْتُصْغِرْتُ أَنَا وَابْنُ عُمَرَ يَوْمَ بَدْرٍ، وَكَانَ الْمُهَاجِرُونَ يَوْمَ بَدْرٍ نَيِّفًا عَلَى سِتِّينَ، وَالأَنْصَارُ نَيِّفًا وَأَرْبَعِينَ وَمِائَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3956In-book reference : Book 64, Hadith 8USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 292   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3957,
    "id": 3957,
    "url": "https://sunnah.com/bukhari:3957",
    "bookNumber": 64,
    "hadithNumber": 9,
    "narrator": "Narrated Al-Bara:",
    "english": "The companions of (the Prophet) Muhammad who took part in Badr, told me that their number was \nthat of Saul's (i.e. Talut's) companions who crossed the river (of Jordan) with him and they were over \nthree-hundred-and-ten men. By Allah, none crossed the river with him but a believer. (See Qur'an \n2:249)",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ حَدَّثَنِي أَصْحَابُ، مُحَمَّدٍ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا أَنَّهُمْ كَانُوا عِدَّةَ أَصْحَابِ طَالُوتَ الَّذِينَ جَازُوا مَعَهُ النَّهَرَ، بِضْعَةَ عَشَرَ وَثَلاَثَمِائَةٍ‏.‏ قَالَ الْبَرَاءُ لاَ وَاللَّهِ مَا جَاوَزَ مَعَهُ النَّهَرَ إِلاَّ مُؤْمِنٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3957In-book reference : Book 64, Hadith 9USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3958,
    "id": 3958,
    "url": "https://sunnah.com/bukhari:3958",
    "bookNumber": 64,
    "hadithNumber": 10,
    "narrator": "Narrated Al-Bara:",
    "english": "We, the Companions of Muhammad used to say that the number of the warriors of Badr was the same \nas the number of Saul's companions who crossed the river (of Jordan) with him, and none crossed the \nriver with him but a believer, and the were over three-hundred-and-ten men.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كُنَّا أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم نَتَحَدَّثُ أَنَّ عِدَّةَ أَصْحَابِ بَدْرٍ عَلَى عِدَّةِ أَصْحَابِ طَالُوتَ الَّذِينَ جَاوَزُوا مَعَهُ النَّهَرَ، وَلَمْ يُجَاوِزْ مَعَهُ إِلاَّ مُؤْمِنٌ، بِضْعَةَ عَشَرَ وَثَلاَثَمِائَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3958In-book reference : Book 64, Hadith 10USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 294   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3959,
    "id": 3959,
    "url": "https://sunnah.com/bukhari:3959",
    "bookNumber": 64,
    "hadithNumber": 11,
    "narrator": "Narrated Al-Bara:",
    "english": "We used to say that the warriors of Badr were over three-hundred-and-ten, as many as the \nCompanions of Saul who crossed the river with him; and none crossed the river with him but a \nbeliever.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ،‏.‏ وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ كُنَّا نَتَحَدَّثُ أَنَّ أَصْحَابَ بَدْرٍ ثَلاَثُمِائَةٍ وَبِضْعَةَ عَشَرَ، بِعِدَّةِ أَصْحَابِ طَالُوتَ الَّذِينَ جَاوَزُوا مَعَهُ النَّهَرَ، وَمَا جَاوَزَ مَعَهُ إِلاَّ مُؤْمِنٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3959In-book reference : Book 64, Hadith 11USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3960,
    "id": 3960,
    "url": "https://sunnah.com/bukhari:3960",
    "bookNumber": 64,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "The Prophet (ﷺ) faced the Ka`ba and invoked evil on some people of Quraish, on Shaiba bin Rabi`a, \n`Utba bin Rabi`a, Al-Walid bin `Utba and Abu Jahl bin Hisham. I bear witness, by Allah, that I saw \nthem all dead, putrefied by the sun as that day was a very hot day.",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ اسْتَقْبَلَ النَّبِيُّ صلى الله عليه وسلم الْكَعْبَةَ فَدَعَا عَلَى نَفَرٍ مِنْ قُرَيْشٍ، عَلَى شَيْبَةَ بْنِ رَبِيعَةَ، وَعُتْبَةَ بْنِ رَبِيعَةَ وَالْوَلِيدِ بْنِ عُتْبَةَ، وَأَبِي جَهْلِ بْنِ هِشَامٍ‏.‏ فَأَشْهَدُ بِاللَّهِ لَقَدْ رَأَيْتُهُمْ صَرْعَى، قَدْ غَيَّرَتْهُمُ الشَّمْسُ، وَكَانَ يَوْمًا حَارًّا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3960In-book reference : Book 64, Hadith 12USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3961,
    "id": 3961,
    "url": "https://sunnah.com/bukhari:3961",
    "bookNumber": 64,
    "hadithNumber": 13,
    "narrator": "Narrated `Abdullah That he came across Abu Jahl while he was on the point of death on the day of:",
    "english": "Badr. Abu Jahl said, \"You should not be proud that you have killed me nor I am ashamed of being \nkilled by my own folk.\"",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا قَيْسٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه أَنَّهُ أَتَى أَبَا جَهْلٍ وَبِهِ رَمَقٌ يَوْمَ بَدْرٍ، فَقَالَ أَبُو جَهْلٍ هَلْ أَعْمَدُ مِنْ رَجُلٍ قَتَلْتُمُوهُ",
    "reference": "Reference : Sahih al-Bukhari 3961In-book reference : Book 64, Hadith 13USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 298   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3962,
    "id": 3962,
    "url": "https://sunnah.com/bukhari:3962",
    "bookNumber": 64,
    "hadithNumber": 14,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found \nthat the two sons of 'Afra had struck him fatally (and he was in his last breaths). `Abdullah bin Mas`ud \nsaid, \"Are you Abu Jahl?\" And took him by the beard. Abu Jahl said, \"Can there be a man superior to \none you have killed or one whom his own folk have killed?\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، أَنَّ أَنَسًا، حَدَّثَهُمْ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ح وَحَدَّثَنِي عَمْرُو بْنُ خَالِدٍ حَدَّثَنَا زُهَيْرٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَنْظُرُ مَا صَنَعَ أَبُو جَهْلٍ ‏\"‏ فَانْطَلَقَ ابْنُ مَسْعُودٍ، فَوَجَدَهُ قَدْ ضَرَبَهُ ابْنَا عَفْرَاءَ حَتَّى بَرَدَ قَالَ آأَنْتَ أَبُو جَهْلٍ قَالَ فَأَخَذَ بِلِحْيَتِهِ‏.‏ قَالَ وَهَلْ فَوْقَ رَجُلٍ قَتَلْتُمُوهُ أَوْ رَجُلٍ قَتَلَهُ قَوْمُهُ? قَالَ أَحْمَدُ بْنُ يُونُسَ أَنْتَ أَبُو جَهْلٍ‏?",
    "reference": "Reference : Sahih al-Bukhari 3962In-book reference : Book 64, Hadith 14USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 300   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3963,
    "id": 3963,
    "url": "https://sunnah.com/bukhari:3963",
    "bookNumber": 64,
    "hadithNumber": 15,
    "narrator": "Narrated Anas:",
    "english": "On the day of Badr, the Prophet (ﷺ) said, \"Who will go and see what has happened to Abu Jahl?\" Ibn \nMas`ud went and found that the two sons of 'Afra had struck him fatally. `Abdullah bin Mas`ud got \nhold of his beard and said, \"'Are you Abu Jahl?\" He replied, \"Can there be a man more superior to one \nwhom his own folk have killed (or you have killed)?\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسٍ، رضى الله عنه قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ بَدْرٍ ‏\n\"‏ مَنْ يَنْظُرُ مَا فَعَلَ أَبُو جَهْلٍ ‏\"‏‏.‏ فَانْطَلَقَ ابْنُ مَسْعُودٍ، فَوَجَدَهُ قَدْ ضَرَبَهُ ابْنَا عَفْرَاءَ حَتَّى بَرَدَ، فَأَخَذَ بِلِحْيَتِهِ فَقَالَ أَنْتَ أَبَا جَهْلٍ قَالَ وَهَلْ فَوْقَ رَجُلٍ قَتَلَهُ قَوْمُهُ أَوْ قَالَ قَتَلْتُمُوهُ‏.",
    "reference": "Reference : Sahih al-Bukhari 3963In-book reference : Book 64, Hadith 15USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 301   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3964,
    "id": 3964,
    "url": "https://sunnah.com/bukhari:3964",
    "bookNumber": 64,
    "hadithNumber": 17,
    "narrator": "Narrated `Abdur-Rahman bin `Auf:",
    "english": "(the grandfather of Salih bin Ibrahim) the story of Badr, namely, the narration regarding the sons of \n'Afra'.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ كَتَبْتُ عَنْ يُوسُفَ بْنِ الْمَاجِشُونِ، عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، فِي بَدْرٍ‏.‏ يَعْنِي حَدِيثَ ابْنَىْ عَفْرَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3964In-book reference : Book 64, Hadith 17USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 303   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3965,
    "id": 3965,
    "url": "https://sunnah.com/bukhari:3965",
    "bookNumber": 64,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Mijlaz:",
    "english": "From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), \nthe Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also \nsaid, \"The following Verse was revealed in their connection:-- \n\"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) \nQais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu \n'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي يَقُولُ، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ أَنَا أَوَّلُ، مَنْ يَجْثُو بَيْنَ يَدَىِ الرَّحْمَنِ لِلْخُصُومَةِ يَوْمَ الْقِيَامَةِ‏.‏ وَقَالَ قَيْسُ بْنُ عُبَادٍ وَفِيهِمْ أُنْزِلَتْ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ قَالَ هُمُ الَّذِينَ تَبَارَزُوا يَوْمَ بَدْرٍ حَمْزَةُ وَعَلِيٌّ وَعُبَيْدَةُ أَوْ أَبُو عُبَيْدَةَ بْنُ الْحَارِثِ وَشَيْبَةُ بْنُ رَبِيعَةَ وَعُتْبَةُ وَالْوَلِيدُ بْنُ عُتْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3965In-book reference : Book 64, Hadith 18USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 304   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3966,
    "id": 3966,
    "url": "https://sunnah.com/bukhari:3966",
    "bookNumber": 64,
    "hadithNumber": 19,
    "narrator": "Narrated Abu Dhar:",
    "english": "The following Holy Verse:-- \n\"These two opponents (believers & disbelievers) dispute with each other about their Lord,\" \n(22.19) was revealed concerning six men from Quraish, namely, `Ali, Hamza, 'Ubaida bin Al-Harith; \nShaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ نَزَلَتْ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ فِي سِتَّةٍ مِنْ قُرَيْشٍ عَلِيٍّ وَحَمْزَةَ وَعُبَيْدَةَ بْنِ الْحَارِثِ وَشَيْبَةَ بْنِ رَبِيعَةَ وَعُتْبَةَ بْنِ رَبِيعَةَ وَالْوَلِيدِ بْنِ عُتْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3966In-book reference : Book 64, Hadith 19USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 305   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3967,
    "id": 3967,
    "url": "https://sunnah.com/bukhari:3967",
    "bookNumber": 64,
    "hadithNumber": 20,
    "narrator": "Narrated `Ali:",
    "english": "The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each \nother about their Lord.\" (22.19) was revealed concerning us.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الصَّوَّافُ، حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ ـ كَانَ يَنْزِلُ فِي بَنِي ضُبَيْعَةَ وَهْوَ مَوْلًى لِبَنِي سَدُوسَ ـ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه فِينَا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3967In-book reference : Book 64, Hadith 20USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 306   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3968,
    "id": 3968,
    "url": "https://sunnah.com/bukhari:3968",
    "bookNumber": 64,
    "hadithNumber": 21,
    "narrator": "Narrated Qais bin Ubad:",
    "english": "I heard Abu Dhar swearing that these Holy Verses were revealed in connection with those six persons \non the day of Badr.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ جَعْفَرٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، سَمِعْتُ أَبَا ذَرٍّ ـ رضى الله عنه ـ يُقْسِمُ لَنَزَلَتْ هَؤُلاَءِ الآيَاتُ فِي هَؤُلاَءِ الرَّهْطِ السِّتَّةِ يَوْمَ بَدْرٍ‏.‏ نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3968In-book reference : Book 64, Hadith 21USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 307   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3969,
    "id": 3969,
    "url": "https://sunnah.com/bukhari:3969",
    "bookNumber": 64,
    "hadithNumber": 22,
    "narrator": "Narrated Qais:",
    "english": "I heard Abu Dhar swearing that the following Holy verse:-- \"These two opponents (believers and \ndisbelievers) disputing with each other about their Lord,\" (22.19) was revealed concerning those men \nwho fought on the day of Badr, namely, Hamza, `Ali, Ubaida bin Al-Harith, `Utba and Shaiba----the \ntwo sons of Rabi`a-- and Al-Walid bin `Utba.",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ أَبَا ذَرٍّ، يُقْسِمُ قَسَمًا إِنَّ هَذِهِ الآيَةَ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ‏}‏ نَزَلَتْ فِي الَّذِينَ بَرَزُوا يَوْمَ بَدْرٍ حَمْزَةَ وَعَلِيٍّ وَعُبَيْدَةَ بْنِ الْحَارِثِ وَعُتْبَةَ وَشَيْبَةَ ابْنَىْ رَبِيعَةَ وَالْوَلِيدِ بْنِ عُتْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3969In-book reference : Book 64, Hadith 22USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 308   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3970,
    "id": 3970,
    "url": "https://sunnah.com/bukhari:3970",
    "bookNumber": 64,
    "hadithNumber": 23,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "A man asked Al-Bara' and I was listening, \"Did `Ali take part in (the battle of) Badr?\" Al-Bara' said, \n\"(Yes). he even met (his enemies) in a duel and was clad in two armors (one over the other).",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، سَأَلَ رَجُلٌ الْبَرَاءَ وَأَنَا أَسْمَعُ، قَالَ أَشَهِدَ عَلِيٌّ بَدْرًا قَالَ بَارَزَ وَظَاهَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3970In-book reference : Book 64, Hadith 23USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 309   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3971,
    "id": 3971,
    "url": "https://sunnah.com/bukhari:3971",
    "bookNumber": 64,
    "hadithNumber": 24,
    "narrator": "Narrated `Abdur-Rahman bin `Auf:",
    "english": "\"I had an agreement with Umaiya bin Khalaf (that he would look after my relatives and property in \nMecca, and I would look after his relatives and property in Medina).\" `Abdur-Rahman then mentioned \nthe killing of Umaiya and his son on the day of Badr, and Bilal said, \"Woe to me if Umaiya remains \nsafe (i.e. alive) . \"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي يُوسُفُ بْنُ الْمَاجِشُونِ، عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ الرَّحْمَنِ، قَالَ كَاتَبْتُ أُمَيَّةَ بْنَ خَلَفٍ، فَلَمَّا كَانَ يَوْمُ بَدْرٍ، فَذَكَرَ قَتْلَهُ وَقَتْلَ ابْنِهِ، فَقَالَ بِلاَلٌ لاَ نَجَوْتُ إِنْ نَجَا أُمَيَّةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3971In-book reference : Book 64, Hadith 24USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 310   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3972,
    "id": 3972,
    "url": "https://sunnah.com/bukhari:3972",
    "bookNumber": 64,
    "hadithNumber": 25,
    "narrator": "Narrated 'Abdullah:",
    "english": "The Prophet (ﷺ) recited Surat-an-Najm and then prostrated himself, and all\n     who were with him prostrated too. But an old man took a handful of \n     dust and touched his forehead with it saying, \"This is sufficient for \n     me.\" Later on I saw him killed as an infidel.",
    "arabic": "حَدَّثَنَا عَبْدَانُ بْنُ عُثْمَانَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَرَأَ ‏{‏وَالنَّجْمِ‏}‏ فَسَجَدَ بِهَا، وَسَجَدَ مَنْ مَعَهُ، غَيْرَ أَنَّ شَيْخًا أَخَذَ كَفًّا مِنْ تُرَابٍ فَرَفَعَهُ إِلَى جَبْهَتِهِ فَقَالَ يَكْفِينِي هَذَا‏.‏ قَالَ عَبْدُ اللَّهِ فَلَقَدْ رَأَيْتُهُ بَعْدُ قُتِلَ كَافِرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3972In-book reference : Book 64, Hadith 25USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 311   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3973,
    "id": 3973,
    "url": "https://sunnah.com/bukhari:3973",
    "bookNumber": 64,
    "hadithNumber": 26,
    "narrator": "Narrated 'Urwa (the son of Az- Zubair):",
    "english": "Az-Zubair had three scars \n     caused by the sword, one of which was over his shoulder and I used to \n     insert my fingers in it. He received two of those wounds on the day of\n     Badr and one on the day of Al-Yarmuk. When 'Abdullah bin Zubair was \n     killed, 'Abdul-Malik bin Marwan said to me, \"O 'Urwa, do you recognize\n     the sword of Az-Zubair?\" I said, \"Yes.\" He said, \"What marks does it \n     have?\" I replied, \"It has a dent in its sharp edge which was caused in\n     it on the day of Badr.\" 'Abdul- Malik said, \"You are right! (i.e. \n     their swords) have dents because of clashing with the regiments of the\n     enemies Then 'Abdul-Malik returned that sword to me (i.e. Urwa). \n     (Hisham, 'Urwa's son said, \"We estimated the price of the sword as \n     three-thousand (Dinars) and after that it was taken by one of us (i.e.\n     the inheritors) and I wish I could have had it.\")",
    "arabic": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، قَالَ كَانَ فِي الزُّبَيْرِ ثَلاَثُ ضَرَبَاتٍ بِالسَّيْفِ، إِحْدَاهُنَّ فِي عَاتِقِهِ، قَالَ إِنْ كُنْتُ لأُدْخِلُ أَصَابِعِي فِيهَا‏.‏ قَالَ ضُرِبَ ثِنْتَيْنِ يَوْمَ بَدْرٍ، وَوَاحِدَةً يَوْمَ الْيَرْمُوكِ‏.‏ قَالَ عُرْوَةُ وَقَالَ لِي عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ حِينَ قُتِلَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يَا عُرْوَةُ، هَلْ تَعْرِفُ سَيْفَ الزُّبَيْرِ قُلْتُ نَعَمْ‏.‏ قَالَ فَمَا فِيهِ قُلْتُ فِيهِ فَلَّةٌ فُلَّهَا يَوْمَ بَدْرٍ‏.‏ قَالَ صَدَقْتَ‏.‏ بِهِنَّ فُلُولٌ مِنْ قِرَاعِ الْكَتَائِبِ ثُمَّ رَدَّهُ عَلَى عُرْوَةَ‏.‏ قَالَ هِشَامٌ فَأَقَمْنَاهُ بَيْنَنَا ثَلاَثَةَ آلاَفٍ، وَأَخَذَهُ بَعْضُنَا، وَلَوَدِدْتُ أَنِّي كُنْتُ أَخَذْتُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3973In-book reference : Book 64, Hadith 26USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 311   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3974,
    "id": 3974,
    "url": "https://sunnah.com/bukhari:3974",
    "bookNumber": 64,
    "hadithNumber": 27,
    "narrator": "Narrated Hisham:",
    "english": "That his father said, \"The sword of Az-Zubair was decorated with silver.\" Hisham added, \"The sword \nof `Urwa was (also) decorated with silver. \"",
    "arabic": "حَدَّثَنَا فَرْوَةُ، عَنْ عَلِيٍّ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ كَانَ سَيْفُ الزُّبَيْرِ مُحَلًّى بِفِضَّةٍ‏.‏ قَالَ هِشَامٌ وَكَانَ سَيْفُ عُرْوَةَ مُحَلًّى بِفِضَّةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3974In-book reference : Book 64, Hadith 27USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 312   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3975,
    "id": 3975,
    "url": "https://sunnah.com/bukhari:3975",
    "bookNumber": 64,
    "hadithNumber": 28,
    "narrator": "Narrated `Urwa:",
    "english": "On the day of (the battle) of Al-Yarmuk, the companions of Allah's Messenger (ﷺ) said to Az-Zubair, \"Will \nyou attack the enemy so that we shall attack them with you?\" Az-Zubair replied, \"If I attack them, you \npeople would not support me.\" They said, \"No, we will support you.\" So Az-Zubair attacked them \n(i.e. Byzantine) and pierced through their lines, and went beyond them and none of his companions \nwas with him. Then he returned and the enemy got hold of the bridle of his (horse) and struck him two \nblows (with the sword) on his shoulder. Between these two wounds there was a scar caused by a blow, \nhe had received on the day of Badr (battle). When I was a child I used to play with those scars by \nputting my fingers in them. On that day (my brother) \"Abdullah bin Az-Zubair was also with him and \nhe was ten years old. Az-Zubair had carried him on a horse and let him to the care of some men.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ أَصْحَابَ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالُوا لِلزُّبَيْرِ يَوْمَ الْيَرْمُوكِ أَلاَ تَشُدُّ فَنَشُدَّ مَعَكَ فَقَالَ إِنِّي إِنْ شَدَدْتُ كَذَبْتُمْ‏.‏ فَقَالُوا لاَ نَفْعَلُ، فَحَمَلَ عَلَيْهِمْ حَتَّى شَقَّ صُفُوفَهُمْ، فَجَاوَزَهُمْ وَمَا مَعَهُ أَحَدٌ، ثُمَّ رَجَعَ مُقْبِلاً، فَأَخَذُوا بِلِجَامِهِ، فَضَرَبُوهُ ضَرْبَتَيْنِ عَلَى عَاتِقِهِ بَيْنَهُمَا ضَرْبَةٌ ضُرِبَهَا يَوْمَ بَدْرٍ‏.‏ قَالَ عُرْوَةُ كُنْتُ أُدْخِلُ أَصَابِعِي فِي تِلْكَ الضَّرَبَاتِ أَلْعَبُ وَأَنَا صَغِيرٌ‏.‏ قَالَ عُرْوَةُ وَكَانَ مَعَهُ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يَوْمَئِذٍ وَهْوَ ابْنُ عَشْرِ سِنِينَ، فَحَمَلَهُ عَلَى فَرَسٍ وَكَّلَ بِهِ رَجُلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3975In-book reference : Book 64, Hadith 28USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 313   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3976,
    "id": 3976,
    "url": "https://sunnah.com/bukhari:3976",
    "bookNumber": 64,
    "hadithNumber": 29,
    "narrator": "Narrated Abu Talha:",
    "english": "On the day of Badr, the Prophet (ﷺ) ordered that the corpses of twenty four leaders of Quraish should be \nthrown into one of the dirty dry wells of Badr. (It was a habit of the Prophet (ﷺ) that whenever he \nconquered some people, he used to stay at the battle-field for three nights. So, on the third day of the \nbattle of Badr, he ordered that his she-camel be saddled, then he set out, and his companions followed \nhim saying among themselves.\" \"Definitely he (i.e. the Prophet) is proceeding for some great \npurpose.\" When he halted at the edge of the well, he addressed the corpses of the Quraish infidels by \ntheir names and their fathers' names, \"O so-and-so, son of so-and-so and O so-and-so, son of so-andso! \nWould it have pleased you if you had obeyed Allah and His Apostle? We have found true what \nour Lord promised us. Have you too found true what your Lord promised you? \"`Umar said, \"O \nAllah's Messenger (ﷺ)! You are speaking to bodies that have no souls!\" Allah's Messenger (ﷺ) said, \"By Him in \nWhose Hand Muhammad's soul is, you do not hear, what I say better than they do.\" (Qatada said, \n\"Allah brought them to life (again) to let them hear him, to reprimand them and slight them and take \nrevenge over them and caused them to feel remorseful and regretful.\")",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، سَمِعَ رَوْحَ بْنَ عُبَادَةَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، قَالَ ذَكَرَ لَنَا أَنَسُ بْنُ مَالِكٍ عَنْ أَبِي طَلْحَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم أَمَرَ يَوْمَ بَدْرٍ بِأَرْبَعَةٍ وَعِشْرِينَ رَجُلاً مِنْ صَنَادِيدِ قُرَيْشٍ فَقُذِفُوا فِي طَوِيٍّ مِنْ أَطْوَاءِ بَدْرٍ خَبِيثٍ مُخْبِثٍ، وَكَانَ إِذَا ظَهَرَ عَلَى قَوْمٍ أَقَامَ بِالْعَرْصَةِ ثَلاَثَ لَيَالٍ، فَلَمَّا كَانَ بِبَدْرٍ الْيَوْمَ الثَّالِثَ، أَمَرَ بِرَاحِلَتِهِ فَشُدَّ عَلَيْهَا رَحْلُهَا، ثُمَّ مَشَى وَاتَّبَعَهُ أَصْحَابُهُ وَقَالُوا مَا نُرَى يَنْطَلِقُ إِلاَّ لِبَعْضِ حَاجَتِهِ، حَتَّى قَامَ عَلَى شَفَةِ الرَّكِيِّ، فَجَعَلَ يُنَادِيهِمْ بِأَسْمَائِهِمْ وَأَسْمَاءِ آبَائِهِمْ ‏\"‏ يَا فُلاَنُ بْنَ فُلاَنٍ، وَيَا فُلاَنُ بْنَ فُلاَنٍ، أَيَسُرُّكُمْ أَنَّكُمْ أَطَعْتُمُ اللَّهَ وَرَسُولَهُ فَإِنَّا قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا، فَهَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ‏\"‏‏.‏ قَالَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ، مَا تُكَلِّمُ مِنْ أَجْسَادٍ لاَ أَرْوَاحَ لَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ ‏\"‏‏.‏ قَالَ قَتَادَةُ أَحْيَاهُمُ اللَّهُ حَتَّى أَسْمَعَهُمْ قَوْلَهُ تَوْبِيخًا وَتَصْغِيرًا وَنَقِيمَةً وَحَسْرَةً وَنَدَمًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3976In-book reference : Book 64, Hadith 29USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 314   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3977,
    "id": 3977,
    "url": "https://sunnah.com/bukhari:3977",
    "bookNumber": 64,
    "hadithNumber": 30,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "regarding the Statement of Allah:--\"Those who have changed Allah's Blessings for disbelief...\" \n(14.28) The people meant here by Allah, are the infidels of Quraish. (`Amr, a sub-narrator said, \n\"Those are (the infidels of) Quraish and Muhammad is Allah's Blessing. Regarding Allah's \nStatement:\"..and have led their people Into the house of destruction? (14.29) Ibn `Abbas said, \"It \nmeans the Fire they will suffer from (after their death) on the day of Badr.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ‏{‏الَّذِينَ بَدَّلُوا نِعْمَةَ اللَّهِ كُفْرًا‏}‏ قَالَ هُمْ وَاللَّهِ كُفَّارُ قُرَيْشٍ‏.‏ قَالَ عَمْرٌو هُمْ قُرَيْشٌ وَمُحَمَّدٌ صلى الله عليه وسلم نِعْمَةُ اللَّهِ ‏{‏وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ ‏}‏ قَالَ النَّارَ يَوْمَ بَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3977In-book reference : Book 64, Hadith 30USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 315   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3978,
    "id": 3978,
    "url": "https://sunnah.com/bukhari:3978",
    "bookNumber": 64,
    "hadithNumber": 31,
    "narrator": "Narrated Hisham's father:",
    "english": "It was mentioned before `Aisha that Ibn `Umar attributed the following statement to the Prophet (ﷺ) \"The \ndead person is punished in the grave because of the crying and lamentation Of his family.\" On that, \n`Aisha said, \"But Allah's Messenger (ﷺ) said, 'The dead person is punished for his crimes and sins while his \nfamily cry over him then.\" She added, \"And this is similar to the statement of Allah's Messenger (ﷺ) when he \nstood by the (edge of the) well which contained the corpses of the pagans killed at Badr, 'They hear \nwhat I say.' She added, \"But he said now they know very well what I used to tell them was the truth.\" \n`Aisha then recited: 'You cannot make the dead hear.' (30.52) and 'You cannot make those who are in \ntheir Graves, hear you.' (35.22) that is, when they had taken their places in the (Hell) Fire.",
    "arabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ ابْنَ عُمَرَ رَفَعَ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ فِي قَبْرِهِ بِبُكَاءِ أَهْلِهِ ‏\"‏‏.‏ فَقَالَتْ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيُعَذَّبُ بِخَطِيئَتِهِ وَذَنْبِهِ، وَإِنَّ أَهْلَهُ لَيَبْكُونَ عَلَيْهِ الآنَ ‏\"‏‏.‏   قَالَتْ وَذَاكَ مِثْلُ قَوْلِهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْقَلِيبِ وَفِيهِ قَتْلَى بَدْرٍ مِنَ الْمُشْرِكِينَ، فَقَالَ لَهُمْ مَا قَالَ إِنَّهُمْ لَيَسْمَعُونَ مَا أَقُولُ‏.‏ إِنَّمَا قَالَ ‏\"‏ إِنَّهُمُ الآنَ لَيَعْلَمُونَ أَنَّ مَا كُنْتُ أَقُولُ لَهُمْ حَقٌّ ‏\"‏‏.‏ ثُمَّ قَرَأَتْ ‏{‏إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ ‏{‏وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ‏}‏ تَقُولُ حِينَ تَبَوَّءُوا مَقَاعِدَهُمْ مِنَ النَّارِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3978, 3979In-book reference : Book 64, Hadith 31USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 316   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3979,
    "id": 3979,
    "url": "https://sunnah.com/bukhari:3979",
    "bookNumber": 64,
    "hadithNumber": 31,
    "narrator": "Narrated Hisham's father:",
    "english": "It was mentioned before `Aisha that Ibn `Umar attributed the following statement to the Prophet (ﷺ) \"The \ndead person is punished in the grave because of the crying and lamentation Of his family.\" On that, \n`Aisha said, \"But Allah's Messenger (ﷺ) said, 'The dead person is punished for his crimes and sins while his \nfamily cry over him then.\" She added, \"And this is similar to the statement of Allah's Messenger (ﷺ) when he \nstood by the (edge of the) well which contained the corpses of the pagans killed at Badr, 'They hear \nwhat I say.' She added, \"But he said now they know very well what I used to tell them was the truth.\" \n`Aisha then recited: 'You cannot make the dead hear.' (30.52) and 'You cannot make those who are in \ntheir Graves, hear you.' (35.22) that is, when they had taken their places in the (Hell) Fire.",
    "arabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ ابْنَ عُمَرَ رَفَعَ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ فِي قَبْرِهِ بِبُكَاءِ أَهْلِهِ ‏\"‏‏.‏ فَقَالَتْ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيُعَذَّبُ بِخَطِيئَتِهِ وَذَنْبِهِ، وَإِنَّ أَهْلَهُ لَيَبْكُونَ عَلَيْهِ الآنَ ‏\"‏‏.‏   قَالَتْ وَذَاكَ مِثْلُ قَوْلِهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْقَلِيبِ وَفِيهِ قَتْلَى بَدْرٍ مِنَ الْمُشْرِكِينَ، فَقَالَ لَهُمْ مَا قَالَ إِنَّهُمْ لَيَسْمَعُونَ مَا أَقُولُ‏.‏ إِنَّمَا قَالَ ‏\"‏ إِنَّهُمُ الآنَ لَيَعْلَمُونَ أَنَّ مَا كُنْتُ أَقُولُ لَهُمْ حَقٌّ ‏\"‏‏.‏ ثُمَّ قَرَأَتْ ‏{‏إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ ‏{‏وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ‏}‏ تَقُولُ حِينَ تَبَوَّءُوا مَقَاعِدَهُمْ مِنَ النَّارِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3978, 3979In-book reference : Book 64, Hadith 31USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 316   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3980,
    "id": 3980,
    "url": "https://sunnah.com/bukhari:3980",
    "bookNumber": 64,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) stood at the well of Badr (which contained the corpses of the pagans) and said, \"Have \nyou found true what your lord promised you?\" Then he further said, \"They now hear what I say.\" This \nwas mentioned before `Aisha and she said, \"But the Prophet (ﷺ) said, 'Now they know very well that what \nI used to tell them was the truth.' Then she recited (the Holy Verse):-- \"You cannot make the dead \nhear... ...till the end of Verse).\" (30.52)",
    "arabic": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ وَقَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى قَلِيبِ بَدْرٍ فَقَالَ ‏{‏هَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ثُمَّ قَالَ إِنَّهُمُ الآنَ يَسْمَعُونَ مَا أَقُولُ‏}‏  فَذُكِرَ لِعَائِشَةَ فَقَالَتْ إِنَّمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُمُ الآنَ لَيَعْلَمُونَ أَنَّ الَّذِي كُنْتُ أَقُولُ لَهُمْ هُوَ الْحَقُّ ‏\"‏‏.‏ ثُمَّ قَرَأَتْ ‏{‏إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ حَتَّى قَرَأَتِ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3980, 3981In-book reference : Book 64, Hadith 32USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 317   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3981,
    "id": 3981,
    "url": "https://sunnah.com/bukhari:3981",
    "bookNumber": 64,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) stood at the well of Badr (which contained the corpses of the pagans) and said, \"Have \nyou found true what your lord promised you?\" Then he further said, \"They now hear what I say.\" This \nwas mentioned before `Aisha and she said, \"But the Prophet (ﷺ) said, 'Now they know very well that what \nI used to tell them was the truth.' Then she recited (the Holy Verse):-- \"You cannot make the dead \nhear... ...till the end of Verse).\" (30.52)",
    "arabic": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ وَقَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى قَلِيبِ بَدْرٍ فَقَالَ ‏{‏هَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ثُمَّ قَالَ إِنَّهُمُ الآنَ يَسْمَعُونَ مَا أَقُولُ‏}‏  فَذُكِرَ لِعَائِشَةَ فَقَالَتْ إِنَّمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُمُ الآنَ لَيَعْلَمُونَ أَنَّ الَّذِي كُنْتُ أَقُولُ لَهُمْ هُوَ الْحَقُّ ‏\"‏‏.‏ ثُمَّ قَرَأَتْ ‏{‏إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ حَتَّى قَرَأَتِ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3980, 3981In-book reference : Book 64, Hadith 32USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 317   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3982,
    "id": 3982,
    "url": "https://sunnah.com/bukhari:3982",
    "bookNumber": 64,
    "hadithNumber": 33,
    "narrator": "Narrated Anas:",
    "english": "Haritha was martyred on the day (of the battle) of Badr, and he was a young boy then. His mother \ncame to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You know how dear Haritha is to me. If he is in \nParadise, I shall remain patient, and hope for reward from Allah, but if it is not so, then you shall see \nwhat I do?\" He said, \"May Allah be merciful to you! Have you lost your senses? Do you think there is \nonly one Paradise? There are many Paradises and your son is in the (most superior) Paradise of Al- \nFirdaus.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ أُصِيبَ حَارِثَةُ يَوْمَ بَدْرٍ وَهْوَ غُلاَمٌ، فَجَاءَتْ أُمُّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، قَدْ عَرَفْتَ مَنْزِلَةَ حَارِثَةَ مِنِّي، فَإِنْ يَكُنْ فِي الْجَنَّةِ أَصْبِرْ وَأَحْتَسِبْ، وَإِنْ تَكُ الأُخْرَى تَرَى مَا أَصْنَعُ فَقَالَ ‏\n\"‏ وَيْحَكِ أَوَهَبِلْتِ أَوَجَنَّةٌ وَاحِدَةٌ هِيَ إِنَّهَا جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ فِي جَنَّةِ الْفِرْدَوْسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3982In-book reference : Book 64, Hadith 33USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 318   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3983,
    "id": 3983,
    "url": "https://sunnah.com/bukhari:3983",
    "bookNumber": 64,
    "hadithNumber": 34,
    "narrator": "Narrated `Ali:",
    "english": "Allah's Messenger (ﷺ) sent me, Abu Marthad and Az-Zubair, and all of us were riding horses, and said, \"Go \ntill you reach Raudat-Khakh where there is a pagan woman carrying a letter from Hatib bin Abi Balta' \na to the pagans of Mecca.\" So we found her riding her camel at the place which Allah's Messenger (ﷺ) had \nmentioned. We said (to her),\"(Give us) the letter.\" She said, \"I have no letter.\" Then we made her \ncamel kneel down and we searched her, but we found no letter. Then we said, \"Allah's Messenger (ﷺ) had not \ntold us a lie, certainly. Take out the letter, otherwise we will strip you naked.\" When she saw that we \nwere determined, she put her hand below her waist belt, for she had tied her cloak round her waist, \nand she took out the letter, and we brought her to Allah's Messenger (ﷺ) Then `Umar said, \"O Allah's \nApostle! (This Hatib) has betrayed Allah, His Apostle and the believers! Let me cut off his neck!\" The \nProphet asked Hatib, \"What made you do this?\" Hatib said, \"By Allah, I did not intend to give up my \nbelief in Allah and His Apostle but I wanted to have some influence among the (Mecca) people so that \nthrough it, Allah might protect my family and property. There is none of your companions but has \nsome of his relatives there through whom Allah protects his family and property.\" The Prophet (ﷺ) said, \n\"He has spoken the truth; do no say to him but good.\" `Umar said, \"He as betrayed Allah, His Apostle \nand the faithful believers. Let me cut off his neck!\" The Prophet (ﷺ) said, \"Is he not one of the Badr \nwarriors? May be Allah looked at the Badr warriors and said, 'Do whatever you like, as I have granted \nParadise to you, or said, 'I have forgiven you.\"' On this, tears came out of `Umar's eyes, and he said, \n\"Allah and His Apostle know better.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، قَالَ سَمِعْتُ حُصَيْنَ بْنَ عَبْدِ الرَّحْمَنِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبَا مَرْثَدٍ وَالزُّبَيْرَ وَكُلُّنَا فَارِسٌ قَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ، فَإِنَّ بِهَا امْرَأَةً مِنَ الْمُشْرِكِينَ، مَعَهَا كِتَابٌ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى الْمُشْرِكِينَ ‏\"‏‏.‏ فَأَدْرَكْنَاهَا تَسِيرُ عَلَى بَعِيرٍ لَهَا حَيْثُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْنَا الْكِتَابُ‏.‏ فَقَالَتْ مَا مَعَنَا كِتَابٌ‏.‏ فَأَنَخْنَاهَا فَالْتَمَسْنَا فَلَمْ نَرَ كِتَابًا، فَقُلْنَا مَا كَذَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم، لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُجَرِّدَنَّكِ‏.‏ فَلَمَّا رَأَتِ الْجِدَّ أَهْوَتْ إِلَى حُجْزَتِهَا وَهْىَ مُحْتَجِزَةٌ بِكِسَاءٍ فَأَخْرَجَتْهُ، فَانْطَلَقْنَا بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ، قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، فَدَعْنِي فَلأَضْرِبْ عُنُقَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ ‏\"‏‏.‏ قَالَ حَاطِبٌ وَاللَّهِ مَا بِي أَنْ لاَ أَكُونَ مُؤْمِنًا بِاللَّهِ وَرَسُولِهِ صلى الله عليه وسلم أَرَدْتُ أَنْ يَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ يَدْفَعُ اللَّهُ بِهَا عَنْ أَهْلِي وَمَالِي، وَلَيْسَ أَحَدٌ مِنْ أَصْحَابِكَ إِلاَّ لَهُ هُنَاكَ مِنْ عَشِيرَتِهِ مَنْ يَدْفَعُ اللَّهُ بِهِ عَنْ أَهْلِهِ وَمَالِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَدَقَ، وَلاَ تَقُولُوا لَهُ إِلاَّ خَيْرًا ‏\"‏‏.‏ فَقَالَ عُمَرُ إِنَّهُ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، فَدَعْنِي فَلأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ مِنْ أَهْلِ بَدْرٍ ‏\"‏‏.‏ فَقَالَ ‏\"‏ لَعَلَّ اللَّهَ اطَّلَعَ إِلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ وَجَبَتْ لَكُمُ الْجَنَّةُ، أَوْ فَقَدْ غَفَرْتُ لَكُمْ ‏\"‏‏.‏ فَدَمَعَتْ عَيْنَا عُمَرَ وَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3983In-book reference : Book 64, Hadith 34USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 319   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3984,
    "id": 3984,
    "url": "https://sunnah.com/bukhari:3984",
    "bookNumber": 64,
    "hadithNumber": 35,
    "narrator": "Narrated Usaid:",
    "english": "On the day of Badr, Allah's Messenger (ﷺ) said to us, \"When the enemy comes near to you, shoot at them but \nuse your arrows sparingly (so that your arrows should not be wasted).",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ، وَالزُّبَيْرِ بْنِ الْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ، عَنْ أَبِي أُسَيْدٍ ـ رضى الله عنه ـ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ بَدْرٍ ‏\n\"‏ إِذَا أَكْثَبُوكُمْ فَارْمُوهُمْ وَاسْتَبْقُوا نَبْلَكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3984In-book reference : Book 64, Hadith 35USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 320   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3985,
    "id": 3985,
    "url": "https://sunnah.com/bukhari:3985",
    "bookNumber": 64,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Usaid:",
    "english": "On the day of (the battle of) Badr, Allah's Messenger (ﷺ) said to us, \"When your enemy comes near to you \n(i.e. overcome you by sheer number), shoot at them but use your arrows sparingly.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ، وَالْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ، عَنْ أَبِي أُسَيْدٍ ـ رضى الله عنه ـ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ بَدْرٍ ‏\n\"‏ إِذَا أَكْثَبُوكُمْ ـ يَعْنِي كَثَرُوكُمْ ـ فَارْمُوهُمْ، وَاسْتَبْقُوا نَبْلَكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3985In-book reference : Book 64, Hadith 36USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 321   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3986,
    "id": 3986,
    "url": "https://sunnah.com/bukhari:3986",
    "bookNumber": 64,
    "hadithNumber": 37,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "On the day of Uhud the Prophet (ﷺ) appointed `Abdullah bin Jubair as chief of the archers, and seventy \namong us were injured and martyred. On the day (of the battle) of Badr, the Prophet (ﷺ) and his \ncompanions had inflicted 140 casualties on the pagans, 70 were taken prisoners, and 70 were killed. \nAbu Sufyan said, \"This is a day of (revenge) for the day of Badr and the issue of war is undecided .\"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ جَعَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى الرُّمَاةِ يَوْمَ أُحُدٍ عَبْدَ اللَّهِ بْنَ جُبَيْرٍ، فَأَصَابُوا مِنَّا سَبْعِينَ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ أَصَابُوا مِنَ الْمُشْرِكِينَ يَوْمَ بَدْرٍ أَرْبَعِينَ وَمِائَةً سَبْعِينَ أَسِيرًا وَسَبْعِينَ قَتِيلاً‏.‏ قَالَ أَبُو سُفْيَانَ يَوْمٌ بِيَوْمِ بَدْرٍ، وَالْحَرْبُ سِجَالٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3986In-book reference : Book 64, Hadith 37USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 322   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3987,
    "id": 3987,
    "url": "https://sunnah.com/bukhari:3987",
    "bookNumber": 64,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Musa:",
    "english": "That the Prophet (ﷺ) said, \"The good is what Allah gave us later on (after Uhud), and the reward of \ntruthfulness is what Allah gave us after the day (of the battle) of Badr.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى،، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنَ الْخَيْرِ بَعْدُ، وَثَوَابُ الصِّدْقِ الَّذِي آتَانَا بَعْدَ يَوْمِ بَدْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3987In-book reference : Book 64, Hadith 38USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 323   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3988,
    "id": 3988,
    "url": "https://sunnah.com/bukhari:3988",
    "bookNumber": 64,
    "hadithNumber": 39,
    "narrator": "Narrated `Abdur-Rahman bin `Auf:",
    "english": "While I was fighting in the front file on the day (of the battle) of Badr, suddenly I looked behind and \nsaw on my right and left two young boys and did not feel safe by standing between them. Then one of \nthem asked me secretly so that his companion may not hear, \"O Uncle! Show me Abu Jahl.\" I said, \"O \nnephew! What will you do to him?\" He said, \"I have promised Allah that if I see him (i.e. Abu Jahl), I \nwill either kill him or be killed before I kill him.\" Then the other said the same to me secretly so that \nhis companion should not hear. I would not have been pleased to be in between two other men instead \nof them. Then I pointed him (i.e. Abu Jahl) out to them. Both of them attacked him like two hawks till \nthey knocked him down. Those two boys were the sons of 'Afra' (i.e. an Ansari woman).",
    "arabic": "حَدَّثَنِي يَعْقُوبُ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنِّي لَفِي الصَّفِّ يَوْمَ بَدْرٍ إِذِ الْتَفَتُّ، فَإِذَا عَنْ يَمِينِي وَعَنْ يَسَارِي فَتَيَانِ حَدِيثَا السِّنِّ، فَكَأَنِّي لَمْ آمَنْ بِمَكَانِهِمَا، إِذْ قَالَ لِي أَحَدُهُمَا سِرًّا مِنْ صَاحِبِهِ يَا عَمِّ أَرِنِي أَبَا جَهْلٍ‏.‏ فَقُلْتُ يَا ابْنَ أَخِي، وَمَا تَصْنَعُ بِهِ قَالَ عَاهَدْتُ اللَّهَ إِنْ رَأَيْتُهُ أَنْ أَقْتُلَهُ أَوْ أَمُوتَ دُونَهُ‏.‏ فَقَالَ لِي الآخَرُ سِرًّا مِنْ صَاحِبِهِ مِثْلَهُ قَالَ فَمَا سَرَّنِي أَنِّي بَيْنَ رَجُلَيْنِ مَكَانَهُمَا، فَأَشَرْتُ لَهُمَا إِلَيْهِ، فَشَدَّا عَلَيْهِ مِثْلَ الصَّقْرَيْنِ حَتَّى ضَرَبَاهُ، وَهُمَا ابْنَا عَفْرَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3988In-book reference : Book 64, Hadith 39USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 324   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3989,
    "id": 3989,
    "url": "https://sunnah.com/bukhari:3989",
    "bookNumber": 64,
    "hadithNumber": 40,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) sent out ten spies under the command of `Asim bin Thabit Al-Ansari, the grand-father \nof `Asim bin `Umar Al-Khattab. When they reached (a place called) Al-Hadah between 'Usfan and \nMecca, their presence was made known to a sub-tribe of Hudhail called Banu Lihyan. So they sent \nabout one hundred archers after them. The archers traced the footsteps (of the Muslims) till they found \nthe traces of dates which they had eaten at one of their camping places. The archers said, \"These dates \nare of Yathrib (i.e. Medina),\" and went on tracing the Muslims' footsteps. When `Asim and his \ncompanions became aware of them, they took refuge in a (high) place. But the enemy encircled them \nand said, \"Come down and surrender. We give you a solemn promise and covenant that we will not \nkill anyone of you.\" `Asim bin Thabit said, \"O people! As for myself, I will never get down to be \nunder the protection of an infidel. O Allah! Inform your Prophet about us.\" So the archers threw their \narrows at them and martyred `Asim. Three of them came down and surrendered to them, accepting \ntheir promise and covenant and they were Khubaib, Zaid bin Ad-Dathina and another man. When the \narchers got hold of them, they untied the strings of the arrow bows and tied their captives with them. \nThe third man said, \"This is the first proof of treachery! By Allah, I will not go with you for I follow \nthe example of these.\" He meant the martyred companions. The archers dragged him and struggled \nwith him (till they martyred him). Then Khubaib and Zaid bin Ad-Dathina were taken away by them \nand later on they sold them as slaves in Mecca after the event of the Badr battle. \nThe sons of Al-Harit bin `Amr bin Naufal bought Khubaib for he was a person who had killed (their \nfather) Al-Hari bin `Amr on the day (of the battle) of Badr. Khubaib remained imprisoned by them till \nthey decided unanimously to kill him. One day Khubaib borrowed from a daughter of Al-Harith, a \nrazor for shaving his pubic hair, and she lent it to him. By chance, while she was inattentive, a little \nson of hers went to him (i.e. Khubaib) and she saw that Khubaib had seated him on his thigh while the \nrazor was in his hand. She was so much terrified that Khubaib noticed her fear and said, \"Are you \nafraid that I will kill him? Never would I do such a thing.\" Later on (while narrating the story) she \nsaid, \"By Allah, I had never seen a better captive than Khubaib. By Allah, one day I saw him eating \nfrom a bunch of grapes in his hand while he was fettered with iron chains and (at that time) there was \nno fruit in Mecca.\" She used to say,\" It was food Allah had provided Khubaib with.\" \nWhen they took him to Al-Hil out of Mecca sanctuary to martyr him, Khubaib requested them. \n\"Allow me to offer a two-rak`at prayer.\" They allowed him and he prayed two rak`at and then said, \n\"By Allah! Had I not been afraid that you would think I was worried, I would have prayed more.\" \nThen he (invoked evil upon them) saying, \"O Allah! Count them and kill them one by one, and do not \nleave anyone of them\"' Then he recited: \"As I am martyred as a Muslim, I do not care in what way I \nreceive my death for Allah's Sake, for this is for the Cause of Allah. If He wishes, He will bless the \ncut limbs of my body.\" Then Abu Sarva, 'Ubqa bin Al-Harith went up to him and killed him. It was \nKhubaib who set the tradition of praying for any Muslim to be martyred in captivity (before he is \nexecuted). The Prophet (ﷺ) told his companions of what had happened (to those ten spies) on the same \nday they were martyred. Some Quraish people, being informed of `Asim bin Thabit's death, sent some \nmessengers to bring a part of his body so that his death might be known for certain, for he had \npreviously killed one of their leaders (in the battle of Badr). But Allah sent a swarm of wasps to \nprotect the dead body of `Asim, and they shielded him from the messengers who could not cut \nanything from his body.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي عُمَرُ بْنُ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيُّ، حَلِيفُ بَنِي زُهْرَةَ ـ وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ ـ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشَرَةً عَيْنًا، وَأَمَّرَ عَلَيْهِمْ عَاصِمَ بْنَ ثَابِتٍ الأَنْصَارِيَّ، جَدَّ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، حَتَّى إِذَا كَانُوا بِالْهَدَةِ بَيْنَ عُسْفَانَ وَمَكَّةَ ذُكِرُوا لِحَىٍّ مِنْ هُذَيْلٍ يُقَالُ لَهُمْ بَنُو لِحْيَانَ، فَنَفَرُوا لَهُمْ بِقَرِيبٍ مِنْ مِائَةِ رَجُلٍ رَامٍ، فَاقْتَصُّوا آثَارَهُمْ حَتَّى وَجَدُوا مَأْكَلَهُمُ التَّمْرَ فِي مَنْزِلٍ نَزَلُوهُ فَقَالُوا تَمْرُ يَثْرِبَ‏.‏ فَاتَّبَعُوا آثَارَهُمْ، فَلَمَّا حَسَّ بِهِمْ عَاصِمٌ وَأَصْحَابُهُ لَجَئُوا إِلَى مَوْضِعٍ، فَأَحَاطَ بِهِمُ الْقَوْمُ، فَقَالُوا لَهُمْ انْزِلُوا فَأَعْطُوا بِأَيْدِيكُمْ وَلَكُمُ الْعَهْدُ وَالْمِيثَاقُ أَنْ لاَ نَقْتُلَ مِنْكُمْ أَحَدًا‏.‏ فَقَالَ عَاصِمُ بْنُ ثَابِتٍ أَيُّهَا الْقَوْمُ، أَمَّا أَنَا فَلاَ أَنْزِلُ فِي ذِمَّةِ كَافِرٍ‏.‏ ثُمَّ قَالَ اللَّهُمَّ أَخْبِرْ عَنَّا نَبِيَّكَ صلى الله عليه وسلم‏.‏ فَرَمَوْهُمْ بِالنَّبْلِ، فَقَتَلُوا عَاصِمًا، وَنَزَلَ إِلَيْهِمْ ثَلاَثَةُ نَفَرٍ عَلَى الْعَهْدِ وَالْمِيثَاقِ، مِنْهُمْ خُبَيْبٌ وَزَيْدُ بْنُ الدَّثِنَةِ، وَرَجُلٌ آخَرُ، فَلَمَّا اسْتَمْكَنُوا مِنْهُمْ أَطْلَقُوا أَوْتَارَ قِسِيِّهِمْ فَرَبَطُوهُمْ بِهَا‏.‏ قَالَ الرَّجُلُ الثَّالِثُ هَذَا أَوَّلُ الْغَدْرِ، وَاللَّهِ لاَ أَصْحَبُكُمْ، إِنَّ لِي بِهَؤُلاَءِ أُسْوَةً‏.‏ يُرِيدُ الْقَتْلَى، فَجَرَّرُوهُ وَعَالَجُوهُ، فَأَبَى أَنْ يَصْحَبَهُمْ، فَانْطُلِقَ بِخُبَيْبٍ وَزَيْدِ بْنِ الدَّثِنَةِ حَتَّى بَاعُوهُمَا بَعْدَ وَقْعَةِ بَدْرٍ، فَابْتَاعَ بَنُو الْحَارِثِ بْنِ عَامِرِ بْنِ نَوْفَلٍ خُبَيْبًا، وَكَانَ خُبَيْبٌ هُوَ قَتَلَ الْحَارِثَ بْنَ عَامِرٍ يَوْمَ بَدْرٍ، فَلَبِثَ خُبَيْبٌ عِنْدَهُمْ أَسِيرًا حَتَّى أَجْمَعُوا قَتْلَهُ، فَاسْتَعَارَ مِنْ بَعْضِ بَنَاتِ الْحَارِثِ مُوسَى يَسْتَحِدُّ بِهَا فَأَعَارَتْهُ، فَدَرَجَ بُنَىٌّ لَهَا وَهْىَ غَافِلَةٌ حَتَّى أَتَاهُ، فَوَجَدَتْهُ مُجْلِسَهُ عَلَى فَخِذِهِ وَالْمُوسَى بِيَدِهِ قَالَتْ فَفَزِعْتُ فَزْعَةً عَرَفَهَا خُبَيْبٌ فَقَالَ أَتَخْشَيْنَ أَنْ أَقْتُلَهُ مَا كُنْتُ لأَفْعَلَ ذَلِكَ قَالَتْ وَاللَّهِ مَا رَأَيْتُ أَسِيرًا قَطُّ خَيْرًا مِنْ خُبَيْبٍ، وَاللَّهِ لَقَدْ وَجَدْتُهُ يَوْمًا يَأْكُلُ قِطْفًا مِنْ عِنَبٍ فِي يَدِهِ، وَإِنَّهُ لَمُوثَقٌ بِالْحَدِيدِ، وَمَا بِمَكَّةَ مِنْ ثَمَرَةٍ وَكَانَتْ تَقُولُ إِنَّهُ لَرِزْقٌ رَزَقَهُ اللَّهُ خُبَيْبًا، فَلَمَّا خَرَجُوا بِهِ مِنَ الْحَرَمِ لِيَقْتُلُوهُ فِي الْحِلِّ قَالَ لَهُمْ خُبَيْبٌ دَعُونِي أُصَلِّي رَكْعَتَيْنِ‏.‏ فَتَرَكُوهُ فَرَكَعَ رَكْعَتَيْنِ، فَقَالَ وَاللَّهِ لَوْلاَ أَنْ تَحْسِبُوا أَنَّ مَا بِي جَزَعٌ لَزِدْتُ، ثُمَّ قَالَ اللَّهُمَّ أَحْصِهِمْ عَدَدًا، وَاقْتُلْهُمْ بَدَدًا، وَلاَ تُبْقِ مِنْهُمْ أَحَدًا‏.‏ ثُمَّ أَنْشَأَ يَقُولُ فَلَسْتُ أُبَالِي حِينَ أُقْتَلُ مُسْلِمًا عَلَى أَىِّ جَنْبٍ كَانَ لِلَّهِ مَصْرَعِي وَذَلِكَ فِي ذَاتِ الإِلَهِ وَإِنْ يَشَأْ يُبَارِكْ عَلَى أَوْصَالِ شِلْوٍ مُمَزَّعِ ثُمَّ قَامَ إِلَيْهِ أَبُو سِرْوَعَةَ عُقْبَةُ بْنُ الْحَارِثِ، فَقَتَلَهُ وَكَانَ خُبَيْبٌ هُوَ سَنَّ لِكُلِّ مُسْلِمٍ قُتِلَ صَبْرًا الصَّلاَةَ، وَأَخْبَرَ أَصْحَابَهُ يَوْمَ أُصِيبُوا خَبَرَهُمْ، وَبَعَثَ نَاسٌ مِنْ قُرَيْشٍ إِلَى عَاصِمِ بْنِ ثَابِتٍ حِينَ حُدِّثُوا أَنَّهُ قُتِلَ أَنْ يُؤْتَوْا بِشَىْءٍ مِنْهُ يُعْرَفُ، وَكَانَ قَتَلَ رَجُلاً عَظِيمًا مِنْ عُظَمَائِهِمْ، فَبَعَثَ اللَّهُ لِعَاصِمٍ مِثْلَ الظُّلَّةِ مِنَ الدَّبْرِ، فَحَمَتْهُ مِنْ رُسُلِهِمْ، فَلَمْ يَقْدِرُوا أَنْ يَقْطَعُوا مِنْهُ شَيْئًا‏.‏ وَقَالَ كَعْبُ بْنُ مَالِكٍ ذَكَرُوا مُرَارَةَ بْنَ الرَّبِيعِ الْعَمْرِيَّ وَهِلاَلَ بْنَ أُمَيَّةَ الْوَاقِفِيَّ، رَجُلَيْنِ صَالِحَيْنِ قَدْ شَهِدَا بَدْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3989In-book reference : Book 64, Hadith 40USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 325   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3990,
    "id": 3990,
    "url": "https://sunnah.com/bukhari:3990",
    "bookNumber": 64,
    "hadithNumber": 41,
    "narrator": "Narrated Nafi:",
    "english": "Ibn 'Umar was once told that Said bin Zaid bin 'Amr bin Nufail, one of\n     the Badr warriors, had fallen ill on a Friday. Ibn 'Umar rode to him \n     late in the forenoon. The time of the Friday prayer approached and Ibn\n     'Umar did not take part in the Friday prayer.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ يَحْيَى، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ ذُكِرَ لَهُ أَنَّ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ ـ وَكَانَ بَدْرِيًّا ـ مَرِضَ فِي يَوْمِ جُمُعَةٍ فَرَكِبَ إِلَيْهِ بَعْدَ أَنْ تَعَالَى النَّهَارُ وَاقْتَرَبَتِ الْجُمُعَةُ، وَتَرَكَ الْجُمُعَةَ",
    "reference": "Reference : Sahih al-Bukhari 3990In-book reference : Book 64, Hadith 41USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 326   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3991,
    "id": 3991,
    "url": "https://sunnah.com/bukhari:3991",
    "bookNumber": 64,
    "hadithNumber": 42,
    "narrator": "Narrated Subaia bint Al-Harith:",
    "english": "That she was married to Sad bin Khaula\n     who was from the tribe of Bani 'Amr bin Luai, and was one of those who\n     fought the Badr battle. He died while she wa pregnant during \n     Hajjat-ul-Wada.' Soon after his death, she gave birth to a child. When\n     she completed the term of deliver (i.e. became clean), she prepared \n     herself for suitors. Abu As-Sanabil bin Bu'kak, a man from the tribe \n     of Bani Abd-ud-Dal called on her and said to her, \"What! I see you \n     dressed up for the people to ask you in marriage. Do you want to marry\n     By Allah, you are not allowed to marry unless four months and ten days\n     have elapsed (after your husband's death).\" Subai'a in her narration \n     said, \"When he (i.e. Abu As-Sanabil) said this to me. I put on my \n     dress in the evening and went to Allah's Messenger (ﷺ) and asked him about \n     this problem. He gave the verdict that I was free to marry as I had \n     already given birth to my child and ordered me to marry if I wished.\"",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَاهُ، كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ الزُّهْرِيِّ، يَأْمُرُهُ أَنْ يَدْخُلَ، عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الأَسْلَمِيَّةِ، فَيَسْأَلَهَا عَنْ حَدِيثِهَا وَعَنْ مَا قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ اسْتَفْتَتْهُ، فَكَتَبَ عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ يُخْبِرُهُ أَنَّ سُبَيْعَةَ بِنْتَ الْحَارِثِ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ، وَهْوَ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ، وَكَانَ مِمَّنْ شَهِدَ بَدْرًا، فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ وَهْىَ حَامِلٌ، فَلَمْ تَنْشَبْ أَنْ وَضَعَتْ حَمْلَهَا بَعْدَ وَفَاتِهِ، فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَجَمَّلَتْ لِلْخُطَّابِ، فَدَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ ـ رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ ـ فَقَالَ لَهَا مَا لِي أَرَاكِ تَجَمَّلْتِ لِلْخُطَّابِ تُرَجِّينَ النِّكَاحَ فَإِنَّكِ وَاللَّهِ مَا أَنْتِ بِنَاكِحٍ حَتَّى تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ‏.‏ قَالَتْ سُبَيْعَةُ فَلَمَّا قَالَ لِي ذَلِكَ جَمَعْتُ عَلَىَّ ثِيَابِي حِينَ أَمْسَيْتُ، وَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْتُهُ عَنْ ذَلِكَ، فَأَفْتَانِي بِأَنِّي قَدْ حَلَلْتُ حِينَ وَضَعْتُ حَمْلِي، وَأَمَرَنِي بِالتَّزَوُّجِ إِنْ بَدَا لِي‏.‏ تَابَعَهُ أَصْبَغُ عَنِ ابْنِ وَهْبٍ عَنْ يُونُسَ‏.‏   وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، وَسَأَلْنَاهُ، فَقَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، مَوْلَى بَنِي عَامِرِ بْنِ لُؤَىٍّ أَنَّ مُحَمَّدَ بْنَ إِيَاسِ بْنِ الْبُكَيْرِ، وَكَانَ، أَبُوهُ شَهِدَ بَدْرًا أَخْبَرَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3991In-book reference : Book 64, Hadith 42USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 326   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3992,
    "id": 3992,
    "url": "https://sunnah.com/bukhari:3992",
    "bookNumber": 64,
    "hadithNumber": 43,
    "narrator": "Narrated Rifaa:",
    "english": "(who was one of the Badr warriors) Gabriel came to the Prophet (ﷺ) and said, \"How do you look upon the \nwarriors of Badr among yourselves?\" The Prophet (ﷺ) said, \"As the best of the Muslims.\" or said a similar \nstatement. On that, Gabriel said, \"And so are the Angels who participated in the Badr (battle).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُعَاذِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ، عَنْ أَبِيهِ ـ وَكَانَ أَبُوهُ مِنْ أَهْلِ بَدْرٍ ـ قَالَ جَاءَ جِبْرِيلُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَا تَعُدُّونَ أَهْلَ بَدْرٍ فِيكُمْ قَالَ مِنْ أَفْضَلِ الْمُسْلِمِينَ ـ أَوْ كَلِمَةً نَحْوَهَا ـ قَالَ وَكَذَلِكَ مَنْ شَهِدَ بَدْرًا مِنَ الْمَلاَئِكَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3992In-book reference : Book 64, Hadith 43USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 327   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3993,
    "id": 3993,
    "url": "https://sunnah.com/bukhari:3993",
    "bookNumber": 64,
    "hadithNumber": 44,
    "narrator": "Narrated Mu`adh bin Rifa`a bin Rafi`:",
    "english": "Rifa`a was one of the warriors of Badr while (his father) Rafi` was one of the people of Al-`Aqaba \n(i.e. those who gave the pledge of allegiance at Al-`Aqaba). Rafi` used to say to his son, \"I would not \nhave been happier if I had taken part in the Badr battle instead of taking part in the 'Aqaba pledge.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى، عَنْ مُعَاذِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ،، وَكَانَ، رِفَاعَةُ مِنْ أَهْلِ بَدْرٍ، وَكَانَ رَافِعٌ مِنْ أَهْلِ الْعَقَبَةِ، فَكَانَ يَقُولُ لاِبْنِهِ مَا يَسُرُّنِي أَنِّي شَهِدْتُ بَدْرًا بِالْعَقَبَةِ قَالَ سَأَلَ جِبْرِيلُ النَّبِيَّ صلى الله عليه وسلم‏.‏ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3993In-book reference : Book 64, Hadith 44USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 328   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3994,
    "id": 3994,
    "url": "https://sunnah.com/bukhari:3994",
    "bookNumber": 64,
    "hadithNumber": 45,
    "narrator": "Narrated Mu`adh:",
    "english": "The one who asked (the Prophet) was Gabriel (refer to Hadith 5.327).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا يَحْيَى، سَمِعَ مُعَاذَ بْنَ رِفَاعَةَ، أَنَّ مَلَكًا، سَأَلَ النَّبِيَّ صلى الله عليه وسلم‏.‏ وَعَنْ يَحْيَى، أَنَّ يَزِيدَ بْنَ الْهَادِ أَخْبَرَهُ أَنَّهُ كَانَ مَعَهُ يَوْمَ حَدَّثَهُ مُعَاذٌ هَذَا الْحَدِيثَ، فَقَالَ يَزِيدُ فَقَالَ مُعَاذٌ إِنَّ السَّائِلَ هُوَ جِبْرِيلُ عَلَيْهِ السَّلاَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3994In-book reference : Book 64, Hadith 45USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 329   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3995,
    "id": 3995,
    "url": "https://sunnah.com/bukhari:3995",
    "bookNumber": 64,
    "hadithNumber": 46,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said on the day (of the battle) of Badr, \"This is Gabriel holding the head of his horse and \nequipped with arms for the battle.",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ يَوْمَ بَدْرٍ ‏\n\"‏ هَذَا جِبْرِيلُ آخِذٌ بِرَأْسِ فَرَسِهِ ـ عَلَيْهِ أَدَاةُ الْحَرْبِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3995In-book reference : Book 64, Hadith 46USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 330   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3996,
    "id": 3996,
    "url": "https://sunnah.com/bukhari:3996",
    "bookNumber": 64,
    "hadithNumber": 47,
    "narrator": "Narrated Anas:",
    "english": "Abu Zaid died and did not leave any offspring, and he was one of the Badr warriors.",
    "arabic": "حَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَاتَ أَبُو زَيْدٍ وَلَمْ يَتْرُكْ عَقِبًا، وَكَانَ بَدْرِيًّا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3996In-book reference : Book 64, Hadith 47USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 331   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3997,
    "id": 3997,
    "url": "https://sunnah.com/bukhari:3997",
    "bookNumber": 64,
    "hadithNumber": 48,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Abu Sa`id bin Malik Al-Khudri returned from a journey and his family offered him some meat of \nsacrifices offered at `Id ul Adha. On that he said, \"I will not eat it before asking (whether it is \nallowed).\" He went to his maternal brother, Qatada bin N i 'man, who was one of the Badr warriors, \nand asked him about it. Qatada said, \"After your departure, an order was issued by the Prophet (ﷺ) \ncancelling the prohibition of eating sacrifices after three days.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ خَبَّابٍ، أَنَّ أَبَا سَعِيدِ بْنِ مَالِكٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَدِمَ مِنْ سَفَرٍ، فَقَدَّمَ إِلَيْهِ أَهْلُهُ لَحْمًا مِنْ لُحُومِ الأَضْحَى فَقَالَ مَا أَنَا بِآكِلِهِ حَتَّى أَسْأَلَ، فَانْطَلَقَ إِلَى أَخِيهِ لأُمِّهِ وَكَانَ بَدْرِيًّا قَتَادَةَ بْنِ النُّعْمَانِ فَسَأَلَهُ، فَقَالَ إِنَّهُ حَدَثَ بَعْدَكَ أَمْرٌ نَقْضٌ لِمَا كَانُوا يُنْهَوْنَ عَنْهُ مِنْ أَكْلِ لُحُومِ الأَضْحَى بَعْدَ ثَلاَثَةِ أَيَّامٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3997In-book reference : Book 64, Hadith 48USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 332   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3998,
    "id": 3998,
    "url": "https://sunnah.com/bukhari:3998",
    "bookNumber": 64,
    "hadithNumber": 49,
    "narrator": "Narrated `Urwa:",
    "english": "Az-Zubair said, \"I met Ubaida bin Sa`id bin Al-As on the day (of the battle) of Badr and he was \ncovered with armor; so much that only his eyes were visible. He was surnamed Abu Dhat-al-Karish. \nHe said (proudly), 'I am Abu-al-Karish.' I attacked him with the spear and pierced his eye and he died. \nI put my foot over his body to pull (that spear) out, but even then I had to use a great force to take it \nout as its both ends were bent.\" `Urwa said, \"Later on Allah's Messenger (ﷺ) asked Az-Zubair for the spear \nand he gave it to him. When Allah's Messenger (ﷺ) died, Az-Zubair took it back. After that Abu Bakr \ndemanded it and he gave it to him, and when Abu Bakr died, Az-Zubair took it back. `Umar then \ndemanded it from him and he gave it to him. When `Umar died, Az-Zubair took it back, and then \n`Uthman demanded it from him and he gave it to him. When `Uthman was martyred, the spear \nremained with `Ali's offspring. Then `Abdullah bin Az-Zubair demanded it back, and it remained with \nhim till he was martyred.",
    "arabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ قَالَ الزُّبَيْرُ لَقِيتُ يَوْمَ بَدْرٍ عُبَيْدَةَ بْنَ سَعِيدِ بْنِ الْعَاصِ وَهْوَ مُدَجَّجٌ لاَ يُرَى مِنْهُ إِلاَّ عَيْنَاهُ، وَهْوَ يُكْنَى أَبُو ذَاتِ الْكَرِشِ، فَقَالَ أَنَا أَبُو ذَاتِ الْكَرِشِ‏.‏ فَحَمَلْتُ عَلَيْهِ بِالْعَنَزَةِ، فَطَعَنْتُهُ فِي عَيْنِهِ فَمَاتَ‏.‏ قَالَ هِشَامٌ فَأُخْبِرْتُ أَنَّ الزُّبَيْرَ قَالَ لَقَدْ وَضَعْتُ رِجْلِي عَلَيْهِ ثُمَّ تَمَطَّأْتُ، فَكَانَ الْجَهْدَ أَنْ نَزَعْتُهَا وَقَدِ انْثَنَى طَرَفَاهَا‏.‏ قَالَ عُرْوَةُ فَسَأَلَهُ إِيَّاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُ، فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَخَذَهَا، ثُمَّ طَلَبَهَا أَبُو بَكْرٍ فَأَعْطَاهُ، فَلَمَّا قُبِضَ أَبُو بَكْرٍ سَأَلَهَا إِيَّاهُ عُمَرُ فَأَعْطَاهُ إِيَّاهَا، فَلَمَّا قُبِضَ عُمَرُ أَخَذَهَا، ثُمَّ طَلَبَهَا عُثْمَانُ مِنْهُ فَأَعْطَاهُ إِيَّاهَا، فَلَمَّا قُتِلَ عُثْمَانُ وَقَعَتْ عِنْدَ آلِ عَلِيٍّ، فَطَلَبَهَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، فَكَانَتْ عِنْدَهُ حَتَّى قُتِلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3998In-book reference : Book 64, Hadith 49USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 333   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3999,
    "id": 3999,
    "url": "https://sunnah.com/bukhari:3999",
    "bookNumber": 64,
    "hadithNumber": 50,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "(who was one of the Badr warriors) Allah's Messenger (ﷺ) said, \"Give me the pledge of allegiance.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ عُبَادَةَ بْنَ الصَّامِتِ، وَكَانَ، شَهِدَ بَدْرًا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَايِعُونِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3999In-book reference : Book 64, Hadith 50USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 334   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4000,
    "id": 4000,
    "url": "https://sunnah.com/bukhari:4000",
    "bookNumber": 64,
    "hadithNumber": 51,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Abu Hudhaifa, one of those who fought the battle of Badr, with Allah's \nApostle adopted Salim as his son and married his niece Hind bint Al-Wahd bin `Utba to him' and \nSalim was a freed slave of an Ansari woman. Allah's Messenger (ﷺ) also adopted Zaid as his son. In the Prelslamic \nperiod of ignorance the custom was that, if one adopted a son, the people would call him by \nthe name of the adopted-father whom he would inherit as well, till Allah revealed: \"Call them \n(adopted sons) By (the names of) their fathers.\" (33.5)",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ أَبَا حُذَيْفَةَ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم تَبَنَّى سَالِمًا، وَأَنْكَحَهُ بِنْتَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ ـ وَهْوَ مَوْلًى لاِمْرَأَةٍ مِنَ الأَنْصَارِ ـ كَمَا تَبَنَّى رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْدًا، وَكَانَ مَنْ تَبَنَّى رَجُلاً فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ، وَوَرِثَ مِنْ مِيرَاثِهِ حَتَّى أَنْزَلَ اللَّهُ تَعَالَى ‏{‏ادْعُوهُمْ لآبَائِهِمْ‏}‏ فَجَاءَتْ سَهْلَةُ النَّبِيَّ صلى الله عليه وسلم، فَذَكَرَ الْحَدِيثَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4000In-book reference : Book 64, Hadith 51USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 335   (deprecated numbering scheme)"
  }
]