[
  {
    "hadithGlobalNumber": 1001,
    "id": 1001,
    "url": "https://sunnah.com/bukhari:1001",
    "bookNumber": 14,
    "hadithNumber": 12,
    "narrator": "Narrated Muhammad bin Seereen:",
    "english": "Anas was asked, \"Did the Prophet (ﷺ) recite Qunut in the Fajr prayer?\" Anas replied in the affirmative. He \nwas further asked, \"Did he recite Qunut before bowing?\" Anas replied, \"He recited Qunut after \nbowing for some time (for one month).\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ سُئِلَ أَنَسٌ أَقَنَتَ النَّبِيُّ صلى الله عليه وسلم فِي الصُّبْحِ قَالَ نَعَمْ‏.‏ فَقِيلَ لَهُ أَوَقَنَتَ قَبْلَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ يَسِيرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1001In-book reference : Book 14, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 115   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1002,
    "id": 1002,
    "url": "https://sunnah.com/bukhari:1002",
    "bookNumber": 14,
    "hadithNumber": 13,
    "narrator": "Narrated `Asim:",
    "english": "I asked Anas bin Malik about the Qunut. Anas replied, \"Definitely it was (recited)\". I asked, \"Before \nbowing or after it?\" Anas replied, \"Before bowing.\" I added, \"So and so has told me that you had \ninformed him that it had been after bowing.\" Anas said, \"He told an untruth (i.e. \"was mistaken,\" \naccording to the Hijazi dialect). Allah's Messenger (ﷺ) recited Qunut after bowing for a period of one \nmonth.\" Anas added, \"The Prophet (ﷺ) sent about seventy men (who knew the Qur'an by heart) towards \nthe pagans (of Najd) who were less than they in number and there was a peace treaty between them \nand Allah's Messenger (ﷺ) (but the Pagans broke the treaty and killed the seventy men). So Allah's Messenger (ﷺ) \nrecited Qunut for a period of one month asking Allah to punish them.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَاصِمٌ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنِ الْقُنُوتِ،‏.‏ فَقَالَ قَدْ كَانَ الْقُنُوتُ‏.‏ قُلْتُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَهُ قَالَ قَبْلَهُ‏.‏ قَالَ فَإِنَّ فُلاَنًا أَخْبَرَنِي عَنْكَ أَنَّكَ قُلْتَ بَعْدَ الرُّكُوعِ‏.‏ فَقَالَ كَذَبَ، إِنَّمَا قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ الرُّكُوعِ شَهْرًا ـ أُرَاهُ ـ كَانَ بَعَثَ قَوْمًا يُقَالُ لَهُمُ الْقُرَّاءُ زُهَاءَ سَبْعِينَ رَجُلاً إِلَى قَوْمٍ مِنَ الْمُشْرِكِينَ دُونَ أُولَئِكَ، وَكَانَ بَيْنَهُمْ وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَهْدٌ فَقَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَيْهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1002In-book reference : Book 14, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 116   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1003,
    "id": 1003,
    "url": "https://sunnah.com/bukhari:1003",
    "bookNumber": 14,
    "hadithNumber": 14,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral \nand Dhakwan.",
    "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنِ التَّيْمِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنْ أَنَسٍ، قَالَ قَنَتَ النَّبِيُّ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1003In-book reference : Book 14, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 117   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1004,
    "id": 1004,
    "url": "https://sunnah.com/bukhari:1004",
    "bookNumber": 14,
    "hadithNumber": 15,
    "narrator": "Narrated Anas:",
    "english": "The Qunut used to be recited in the Maghrib and the Fajr prayers.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ كَانَ الْقُنُوتُ فِي الْمَغْرِبِ وَالْفَجْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1004In-book reference : Book 14, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 118   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1005,
    "id": 1005,
    "url": "https://sunnah.com/bukhari:1005",
    "bookNumber": 15,
    "hadithNumber": 1,
    "narrator": "Narrated `Abbad bin Tamim's uncle:",
    "english": "The Prophet (p.b.u.h) went out to offer the Istisqa' prayer and turned (and put on) his cloak inside out.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَسْتَسْقِي وَحَوَّلَ رِدَاءَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1005In-book reference : Book 15, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 119   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1006,
    "id": 1006,
    "url": "https://sunnah.com/bukhari:1006",
    "bookNumber": 15,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira;:",
    "english": "Whenever the Prophet (p.b.u.h) lifted his head from the bowing in the last rak`a he used to say: \"O \nAllah! Save `Aiyash bin Abi Rabi`a. O Allah! Save Salama bin Hisham. O Allah! Save Walid bin \nWalid. O Allah! Save the weak faithful believers. O Allah! Be hard on the tribes of Mudar and send \n(famine) years on them like the famine years of (Prophet) Joseph .\" The Prophet (ﷺ) further said, \"Allah \nforgive the tribes of Ghifar and save the tribes of Aslam.\" Abu Az-Zinad (a sub-narrator) said, \"The \nQunut used to be recited by the Prophet (ﷺ) in the Fajr prayer.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرَّكْعَةِ الآخِرَةِ يَقُولُ ‏\"‏ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ غِفَارُ غَفَرَ اللَّهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللَّهُ ‏\"‏‏.‏ قَالَ ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ هَذَا كُلُّهُ فِي الصُّبْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1006In-book reference : Book 15, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 120   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1007,
    "id": 1007,
    "url": "https://sunnah.com/bukhari:1007",
    "bookNumber": 15,
    "hadithNumber": 3,
    "narrator": "Narrated Masruq:",
    "english": "We were with `Abdullah and he said, \"When the Prophet (ﷺ) saw the refusal of the people to accept Islam \nhe said, \"O Allah! Send (famine) years on them for (seven years) like the seven years (of famine \nduring the time) of (Prophet) Joseph.\" So famine overtook them for one year and destroyed every kind \nof life to such an extent that the people started eating hides, carcasses and rotten dead animals. \nWhenever one of them looked towards the sky, he would (imagine himself to) see smoke because of \nhunger. So Abu Sufyan went to the Prophet (ﷺ) and said, \"O Muhammad! You order people to obey Allah \nand to keep good relations with kith and kin. No doubt the people of your tribe are dying, so please \npray to Allah for them.\" So Allah revealed: \"Then watch you For the day that The sky will bring forth \na kind Of smoke Plainly visible ... Verily! You will return (to disbelief) On the day when We shall \nseize You with a mighty grasp. (44.10-16) Ibn Mas`ud added, \"Al-Batsha (i.e. grasp) happened in the \nbattle of Badr and no doubt smoke, Al-Batsha, Al-Lizam, and the verse of Surat Ar-Rum have all \npassed .",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا رَأَى مِنَ النَّاسِ إِدْبَارًا قَالَ ‏\"‏ اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ ‏\"‏‏.‏ فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَىْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ وَالْجِيَفَ، وَيَنْظُرَ أَحَدُهُمْ إِلَى السَّمَاءِ فَيَرَى الدُّخَانَ مِنَ الْجُوعِ، فَأَتَاهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا، فَادْعُ اللَّهَ لَهُمْ قَالَ اللَّهُ تَعَالَى ‏{‏فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ إِلَى قَوْلِهِ ‏{‏عَائِدُونَ * يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى‏}‏ فَالْبَطْشَةُ يَوْمَ بَدْرٍ، وَقَدْ مَضَتِ الدُّخَانُ وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1007In-book reference : Book 15, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 121   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1008,
    "id": 1008,
    "url": "https://sunnah.com/bukhari:1008",
    "bookNumber": 15,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah bin Dinar:",
    "english": "My father said, \"I heard Ibn `Umar reciting the poetic verses of Abu Talib: And a white (person) (i.e. \nthe Prophet) who is requested to pray for rain and who takes care of the orphans and is the guardian of \nwidows.\" Salim's father (Ibn `Umar) said, \"The following poetic verse occurred to my mind while I \nwas looking at the face of the Prophet (p.b.u.h) while he was praying for rain. He did not get down till \nthe rain water flowed profusely from every roof-gutter: And a white (person) who is requested to pray \nfor rain and who takes care of the orphans and is the guardian of widows . . . And these were the \nwords of Abu Talib.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَتَمَثَّلُ بِشِعْرِ أَبِي طَالِبٍ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالُ الْيَتَامَى عِصْمَةٌ لِلأَرَامِلِ وَقَالَ عُمَرُ بْنُ حَمْزَةَ حَدَّثَنَا سَالِمٌ، عَنْ أَبِيهِ، رُبَّمَا ذَكَرْتُ قَوْلَ الشَّاعِرِ وَأَنَا أَنْظُرُ، إِلَى وَجْهِ النَّبِيِّ صلى الله عليه وسلم يَسْتَسْقِي، فَمَا يَنْزِلُ حَتَّى يَجِيشَ كُلُّ مِيزَابٍ‏.‏ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالَ الْيَتَامَى عِصْمَةً لِلأَرَامِلِ وَهْوَ قَوْلُ أَبِي طَالِبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1008, 1009In-book reference : Book 15, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1009,
    "id": 1009,
    "url": "https://sunnah.com/bukhari:1009",
    "bookNumber": 15,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah bin Dinar:",
    "english": "My father said, \"I heard Ibn `Umar reciting the poetic verses of Abu Talib: And a white (person) (i.e. \nthe Prophet) who is requested to pray for rain and who takes care of the orphans and is the guardian of \nwidows.\" Salim's father (Ibn `Umar) said, \"The following poetic verse occurred to my mind while I \nwas looking at the face of the Prophet (p.b.u.h) while he was praying for rain. He did not get down till \nthe rain water flowed profusely from every roof-gutter: And a white (person) who is requested to pray \nfor rain and who takes care of the orphans and is the guardian of widows . . . And these were the \nwords of Abu Talib.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَتَمَثَّلُ بِشِعْرِ أَبِي طَالِبٍ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالُ الْيَتَامَى عِصْمَةٌ لِلأَرَامِلِ وَقَالَ عُمَرُ بْنُ حَمْزَةَ حَدَّثَنَا سَالِمٌ، عَنْ أَبِيهِ، رُبَّمَا ذَكَرْتُ قَوْلَ الشَّاعِرِ وَأَنَا أَنْظُرُ، إِلَى وَجْهِ النَّبِيِّ صلى الله عليه وسلم يَسْتَسْقِي، فَمَا يَنْزِلُ حَتَّى يَجِيشَ كُلُّ مِيزَابٍ‏.‏ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالَ الْيَتَامَى عِصْمَةً لِلأَرَامِلِ وَهْوَ قَوْلُ أَبِي طَالِبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1008, 1009In-book reference : Book 15, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1010,
    "id": 1010,
    "url": "https://sunnah.com/bukhari:1010",
    "bookNumber": 15,
    "hadithNumber": 5,
    "narrator": "Narrated Anas:",
    "english": "Whenever drought threatened them, `Umar bin Al-Khattab, used to ask Al-Abbas bin `Abdul Muttalib \nto invoke Allah for rain. He used to say, \"O Allah! We used to ask our Prophet to invoke You for rain, \nand You would bless us with rain, and now we ask his uncle to invoke You for rain. O Allah ! Bless \nus with rain.\"(1) And so it would rain.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ كَانَ إِذَا قَحَطُوا اسْتَسْقَى بِالْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَقَالَ اللَّهُمَّ إِنَّا كُنَّا نَتَوَسَّلُ إِلَيْكَ بِنَبِيِّنَا فَتَسْقِينَا وَإِنَّا نَتَوَسَّلُ إِلَيْكَ بِعَمِّ نَبِيِّنَا فَاسْقِنَا‏.‏ قَالَ فَيُسْقَوْنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1010In-book reference : Book 15, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 123   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1011,
    "id": 1011,
    "url": "https://sunnah.com/bukhari:1011",
    "bookNumber": 15,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah bin Zaid:",
    "english": "The Prophet (ﷺ) turned his cloak inside out on Istisqa.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا وَهْبٌ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَسْقَى فَقَلَبَ رِدَاءَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1011In-book reference : Book 15, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 124   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1012,
    "id": 1012,
    "url": "https://sunnah.com/bukhari:1012",
    "bookNumber": 15,
    "hadithNumber": 7,
    "narrator": "Narrated `Abdullah bin Zaid:",
    "english": "The Prophet (ﷺ) went towards the Musalla and invoked Allah for rain. He faced the Qibla and wore his \ncloak inside out, and offered two rak`at.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ، يُحَدِّثُ أَبَاهُ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى الْمُصَلَّى فَاسْتَسْقَى، فَاسْتَقْبَلَ الْقِبْلَةَ، وَقَلَبَ رِدَاءَهُ، وَصَلَّى رَكْعَتَيْنِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كَانَ ابْنُ عُيَيْنَةَ يَقُولُ هُوَ صَاحِبُ الأَذَانِ، وَلَكِنَّهُ وَهْمٌ، لأَنَّ هَذَا عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ، مَازِنُ الأَنْصَارِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1012In-book reference : Book 15, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 125   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1013,
    "id": 1013,
    "url": "https://sunnah.com/bukhari:1013",
    "bookNumber": 15,
    "hadithNumber": 8,
    "narrator": "Narrated Sharik bin `Abdullah bin Abi Namir:",
    "english": "I heard Anas bin Malik saying, \"On a Friday a person entered the main Mosque through the gate \nfacing the pulpit while Allah's Messenger (ﷺ) was delivering the Khutba. The man stood in front of Allah's \nApostle and said, 'O Allah's Messenger (ﷺ)! The livestock are dying and the roads are cut off; so please pray \nto Allah for rain.' \" Anas added, \"Allah's Messenger (ﷺ) (p.b.u.h) raised both his hands and said, 'O Allah! \nBless us with rain! O Allah! Bless us with rain! O Allah! Bless us with rain!' \" Anas added, \"By Allah, \nwe could not see any trace of cloud in the sky and there was no building or a house between us and \n(the mountains of) Sila.\" Anas added, \"A heavy cloud like a shield appeared from behind it (i.e. Sila' \nMountain). When it came in the middle of the sky, it spread and then rained.\" Anas further said, \"By \nAllah! We could not see the sun for a week. Next Friday a person entered through the same gate and \nat that time Allah's Messenger (ﷺ) was delivering the Friday's Khutba. The man stood in front of him and \nsaid, 'O Allah's Messenger (ﷺ)! The livestock are dying and the roads are cut off, please pray to Allah to \nwithhold rain.' \" Anas added, \"Allah's Messenger (ﷺ) I raised both his hands and said, 'O Allah! Round about \nus and not on us. O Allah! On the plateaus, on the mountains, on the hills, in the valleys and on the \nplaces where trees grow.' So the rain stopped and we came out walking in the sun.\" Sharik asked Anas \nwhether it was the same person who had asked for the rain (the last Friday). Anas replied that he did \nnot know.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا أَبُو ضَمْرَةَ، أَنَسُ بْنُ عِيَاضٍ قَالَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَذْكُرُ أَنَّ رَجُلاً، دَخَلَ يَوْمَ الْجُمُعَةِ مِنْ باب كَانَ وُجَاهَ الْمِنْبَرِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَتِ الْمَوَاشِي وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ يُغِيثُنَا‏.‏ قَالَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اسْقِنَا، اللَّهُمَّ اسْقِنَا، اللَّهُمَّ اسْقِنَا ‏\"‏‏.‏ قَالَ أَنَسٌ وَلاَ وَاللَّهِ مَا نَرَى فِي السَّمَاءِ مِنْ سَحَابٍ وَلاَ قَزَعَةً وَلاَ شَيْئًا، وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلاَ دَارٍ، قَالَ فَطَلَعَتْ مِنْ وَرَائِهِ سَحَابَةٌ مِثْلُ التُّرْسِ، فَلَمَّا تَوَسَّطَتِ السَّمَاءَ انْتَشَرَتْ ثُمَّ أَمْطَرَتْ‏.‏ قَالَ وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سِتًّا، ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِي الْجُمُعَةِ الْمُقْبِلَةِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يَخْطُبُ، فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَتِ الأَمْوَالُ وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ يُمْسِكْهَا، قَالَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالْجِبَالِ وَالآجَامِ وَالظِّرَابِ وَالأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ‏\"‏‏.‏ قَالَ فَانْقَطَعَتْ وَخَرَجْنَا نَمْشِي فِي الشَّمْسِ‏.‏ قَالَ شَرِيكٌ فَسَأَلْتُ أَنَسًا أَهُوَ الرَّجُلُ الأَوَّلُ قَالَ لاَ أَدْرِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1013In-book reference : Book 15, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 126   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1014,
    "id": 1014,
    "url": "https://sunnah.com/bukhari:1014",
    "bookNumber": 15,
    "hadithNumber": 9,
    "narrator": "Narrated Sharik:",
    "english": "Anas bin Malik said, \"A person entered the Mosque on a Friday through the gate facing the Daril- \nQada' and Allah's Messenger (ﷺ) was standing delivering the Khutba (sermon). The man stood in front of \nAllah's Messenger (ﷺ) and said, 'O Allah's Messenger (ﷺ), livestock are dying and the roads are cut off; please pray \nto Allah for rain.' So Allah's Messenger (ﷺ) (p.b.u.h) raised both his hands and said, 'O Allah! Bless us with \nrain. O Allah! Bless us with rain. O Allah! Bless us with rain!\" Anas added, \"By Allah, there were no \nclouds in the sky and there was no house or building between us and the mountain of Sila'. Then a big \ncloud like a shield appeared from behind it (i.e. Silas Mountain) and when it came in the middle of the \nsky, it spread and then rained. By Allah! We could not see the sun for a week. The next Friday, a \nperson entered through the same gate and Allah's Messenger (ﷺ) was delivering the Friday Khutba and the \nman stood in front of him and said, 'O Allah's Messenger (ﷺ)! The livestock are dying and the roads are cut \noff; Please pray to Allah to withhold rain.' \" Anas added, \"Allah's Messenger (ﷺ) raised both his hands and \nsaid, 'O Allah! Round about us and not on us. O Allah!' On the plateaus, on the mountains, on the \nhills, in the valleys and on the places where trees grow.' \" Anas added, \"The rain stopped and we came \nout, walking in the sun.\" Sharik asked Anas whether it was the same person who had asked for rain \nthe previous Friday. Anas replied that he did not know.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ شَرِيكٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ يَوْمَ جُمُعَةٍ مِنْ بَابٍ كَانَ نَحْوَ دَارِ الْقَضَاءِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يَخْطُبُ، فَاسْتَقْبَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَائِمًا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الأَمْوَالُ وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ يُغِيثُنَا فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا ‏\"‏‏.‏ قَالَ أَنَسٌ وَلاَ وَاللَّهِ مَا نَرَى فِي السَّمَاءِ مِنْ سَحَابٍ، وَلاَ قَزَعَةً، وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلاَ دَارٍ‏.‏ قَالَ فَطَلَعَتْ مِنْ وَرَائِهِ سَحَابَةٌ مِثْلُ التُّرْسِ، فَلَمَّا تَوَسَّطَتِ السَّمَاءَ انْتَشَرَتْ ثُمَّ أَمْطَرَتْ، فَلاَ وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سِتًّا، ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِي الْجُمُعَةِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يَخْطُبُ، فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الأَمْوَالُ وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ يُمْسِكْهَا عَنَّا‏.‏ قَالَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ‏\"‏‏.‏ قَالَ فَأَقْلَعَتْ وَخَرَجْنَا نَمْشِي فِي الشَّمْسِ‏.‏ قَالَ شَرِيكٌ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَهُوَ الرَّجُلُ الأَوَّلُ فَقَالَ مَا أَدْرِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1014In-book reference : Book 15, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 127   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1015,
    "id": 1015,
    "url": "https://sunnah.com/bukhari:1015",
    "bookNumber": 15,
    "hadithNumber": 10,
    "narrator": "Narrated Qatada:",
    "english": "Anas I said, \"While Allah's Messenger (ﷺ) (p.b.u.h) was delivering the Friday Khutba (sermon) a man came \nand said, 'O Allah's Messenger (ﷺ)! Rain is scarce; please ask Allah to bless us with rain.' So he invoked \nAllah for it, and it rained so much that we could hardly reach our homes and it continued raining till \nthe next Friday.\" Anas further said, \"Then the same or some other person stood up and said, 'O Allah's \nApostle! Invoke Allah to withhold the rain.' On that, Allah's Messenger (ﷺ) I said, 'O Allah! Round about us \nand not on us.' \" Anas added, \"I saw the clouds dispersing right and left and it continued to rain but \nnot over Medina.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ، قَحَطَ الْمَطَرُ فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا‏.‏ فَدَعَا فَمُطِرْنَا، فَمَا كِدْنَا أَنْ نَصِلَ إِلَى مَنَازِلِنَا فَمَا زِلْنَا نُمْطَرُ إِلَى الْجُمُعَةِ الْمُقْبِلَةِ‏.‏ قَالَ فَقَامَ ذَلِكَ الرَّجُلُ أَوْ غَيْرُهُ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَصْرِفَهُ عَنَّا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ قَالَ فَلَقَدْ رَأَيْتُ السَّحَابَ يَتَقَطَّعُ يَمِينًا وَشِمَالاً يُمْطَرُونَ وَلاَ يُمْطَرُ أَهْلُ الْمَدِينَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1015In-book reference : Book 15, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 128   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1016,
    "id": 1016,
    "url": "https://sunnah.com/bukhari:1016",
    "bookNumber": 15,
    "hadithNumber": 11,
    "narrator": "Narrated Anas:",
    "english": "A man came to the Prophet (p.b.u.h) and said, \"Livestock are destroyed and the roads are cut off.\" So \nAllah's Messenger (ﷺ) invoked Allah for rain and it rained from that Friday till the next Friday. The same \nperson came again and said, \"Houses have collapsed, roads are cut off, and the livestock are \ndestroyed. Please pray to Allah to withhold the rain.\" Allah's Messenger (ﷺ) (stood up and) said, \"O Allah! \n(Let it rain) on the plateaus, on the hills, in the valleys and over the places where trees grow.\" So the \nclouds cleared away from Medina as clothes are taken off .",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ هَلَكَتِ الْمَوَاشِي وَتَقَطَّعَتِ السُّبُلُ‏.‏ فَدَعَا، فَمُطِرْنَا مِنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ، ثُمَّ جَاءَ فَقَالَ تَهَدَّمَتِ الْبُيُوتُ وَتَقَطَّعَتِ السُّبُلُ، وَهَلَكَتِ الْمَوَاشِي فَادْعُ اللَّهَ يُمْسِكْهَا‏.‏ فَقَامَ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَالأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ‏\"‏‏.‏ فَانْجَابَتْ عَنِ الْمَدِينَةِ انْجِيَابَ الثَّوْبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1016In-book reference : Book 15, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 129   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1017,
    "id": 1017,
    "url": "https://sunnah.com/bukhari:1017",
    "bookNumber": 15,
    "hadithNumber": 12,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Livestock are destroyed and the roads \nare cut off. So please invoke Allah.\" So Allah's Messenger (ﷺ) prayed and it rained from that Friday to the \nnext Friday. Then he came to Allah's Messenger (ﷺ) I and said, \"O Allah's Messenger (ﷺ)! Houses have collapsed, \nroads are cut off and the livestock are destroyed.\" So Allah's Messenger (ﷺ) (p.b.u.h) prayed, \"O Allah! (Let \nit rain) on the tops of mountains, on the plateaus, in the valleys and over the places where trees grow.\" \nSo the clouds cleared away from Medina as clothes are taken off.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَتِ الْمَوَاشِي وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ، فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَمُطِرُوا مِنْ جُمُعَةٍ إِلَى جُمُعَةٍ، فَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَتِ الْبُيُوتُ وَتَقَطَّعَتِ السُّبُلُ وَهَلَكَتِ الْمَوَاشِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ عَلَى رُءُوسِ الْجِبَالِ وَالآكَامِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ‏\"‏‏.‏ فَانْجَابَتْ عَنِ الْمَدِينَةِ انْجِيَابَ الثَّوْبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1017In-book reference : Book 15, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 130   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1018,
    "id": 1018,
    "url": "https://sunnah.com/bukhari:1018",
    "bookNumber": 15,
    "hadithNumber": 13,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I p man complained to the Prophet (ﷺ) about the destruction of livestock and property and the hunger of \nthe offspring. So he invoked (Allah for rain. The narrator (Anas) did not mention that the Prophet (ﷺ) had \nworn his cloak inside out or faced the Qibla.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا مُعَافَى بْنُ عِمْرَانَ، عَنِ الأَوْزَاعِيِّ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، شَكَا إِلَى النَّبِيِّ صلى الله عليه وسلم هَلاَكَ الْمَالِ وَجَهْدَ الْعِيَالِ، فَدَعَا اللَّهَ يَسْتَسْقِي، وَلَمْ يَذْكُرْ أَنَّهُ حَوَّلَ رِدَاءَهُ وَلاَ اسْتَقْبَلَ الْقِبْلَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1018In-book reference : Book 15, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 131   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1019,
    "id": 1019,
    "url": "https://sunnah.com/bukhari:1019",
    "bookNumber": 15,
    "hadithNumber": 14,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Livestock are destroyed and the roads \nare cut off; so please invoke Allah.\" So Allah's Messenger (ﷺ) prayed for rain and it rained from that Friday \ntill the next Friday. Then a man came to the Prophet (p.b.u.h) and said, \"O Allah's Messenger (ﷺ)! The \nhouses have collapsed, roads are cut off and the livestock are destroyed.\" So Allah's Messenger (ﷺ) said, \"O \nAllah ! (Let it rain) on the tops of the mountains, on the plateaus, in the valleys and over the places \nwhere trees grow.\" So the clouds cleared away from Medina as clothes are taken off.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الْمَوَاشِي، وَتَقَطَّعَتِ السُّبُلُ، فَادْعُ اللَّهَ‏.‏ فَدَعَا اللَّهَ، فَمُطِرْنَا مِنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ، فَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَتِ الْبُيُوتُ وَتَقَطَّعَتِ السُّبُلُ وَهَلَكَتِ الْمَوَاشِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ عَلَى ظُهُورِ الْجِبَالِ وَالآكَامِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ‏\"‏‏.‏ فَانْجَابَتْ عَنِ الْمَدِينَةِ انْجِيَابَ الثَّوْبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1019In-book reference : Book 15, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 132   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1020,
    "id": 1020,
    "url": "https://sunnah.com/bukhari:1020",
    "bookNumber": 15,
    "hadithNumber": 15,
    "narrator": "Narrated Masruq:",
    "english": "One day I went to Ibn Mas`ud who said, \"When Quraish delayed in embracing Islam, the Prophet (ﷺ) I \ninvoked Allah to curse them, so they were afflicted with a (famine) year because of which many of \nthem died and they ate the carcasses and Abu Sufyan came to the Prophet (ﷺ) and said, 'O Muhammad! \nYou came to order people to keep good relation with kith and kin and your nation is being destroyed, \nso invoke Allah I ? So the Prophet (ﷺ) I recited the Holy verses of Sirat-Ad-Dukhan: 'Then watch you For \nthe day that The sky will Bring forth a kind Of smoke Plainly visible.' (44.10) When the famine was \ntaken off, the people renegade once again as nonbelievers. The statement of Allah, (in Sura \"Ad- \nDukhan\"-44) refers to that: 'On the day when We shall seize You with a mighty grasp.' (44.16) And \nthat was what happened on the day of the battle of Badr.\" Asbath added on the authority of Mansur, \n\"Allah's Messenger (ﷺ) prayed for them and it rained heavily for seven days. So the people complained of the \nexcessive rain. The Prophet (ﷺ) said, 'O Allah! (Let it rain) around us and not on us.' So the clouds \ndispersed over his head and it rained over the surroundings.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، حَدَّثَنَا مَنْصُورٌ، وَالأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ أَتَيْتُ ابْنَ مَسْعُودٍ فَقَالَ إِنَّ قُرَيْشًا أَبْطَئُوا عَنِ الإِسْلاَمِ،، فَدَعَا عَلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم فَأَخَذَتْهُمْ سَنَةٌ حَتَّى هَلَكُوا فِيهَا وَأَكَلُوا الْمَيْتَةَ وَالْعِظَامَ، فَجَاءَهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ، جِئْتَ تَأْمُرُ بِصِلَةِ الرَّحِمِ، وَإِنَّ قَوْمَكَ هَلَكُوا، فَادْعُ اللَّهَ‏.‏ فَقَرَأَ ‏{‏فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ ثُمَّ عَادُوا إِلَى كُفْرِهِمْ فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى‏}‏ يَوْمَ بَدْرٍ‏.‏ قَالَ وَزَادَ أَسْبَاطٌ عَنْ مَنْصُورٍ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم، فَسُقُوا الْغَيْثَ، فَأَطْبَقَتْ عَلَيْهِمْ سَبْعًا، وَشَكَا النَّاسُ كَثْرَةَ الْمَطَرِ فَقَالَ ‏\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَانْحَدَرَتِ السَّحَابَةُ عَنْ رَأْسِهِ، فَسُقُوا النَّاسُ حَوْلَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1020In-book reference : Book 15, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 133   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1021,
    "id": 1021,
    "url": "https://sunnah.com/bukhari:1021",
    "bookNumber": 15,
    "hadithNumber": 16,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) I was delivering the Khutba (sermon) on a Friday when the people stood up, shouted \nand said, \"O Allah's Messenger (ﷺ)! There is no rain (drought), the trees have dried and the livestock are \ndestroyed; Please pray to Allah for rain.\" So Allah's Messenger (ﷺ) said twice, \"O Allah! Bless us with rain.\" \nBy Allah, there was no trace of cloud in the sky and suddenly the sky became overcast with clouds \nand it started raining. The Prophet (ﷺ) came down the pulpit and offered the prayer. When he came back \nfrom the prayer (to his house) it was raining and it rained continuously till the next Friday. When the \nProphet started delivering the Friday Khutba (sermon), the people started shouting and said to him, \n\"The houses have collapsed and the roads are cut off; so please pray to Allah to withhold the rain.\" So \nthe Prophet (ﷺ) smiled and said, \"O Allah! Round about us and not on us.\" So the sky became clear over \nMedina but it kept on raining over the outskirts (of Medina) and not a single drop of rain fell over \nMedian. I looked towards the sky which was as bright and clear as a crown.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ جُمُعَةٍ، فَقَامَ النَّاسُ فَصَاحُوا فَقَالُوا يَا رَسُولَ اللَّهِ، قَحَطَ الْمَطَرُ وَاحْمَرَّتِ الشَّجَرُ وَهَلَكَتِ الْبَهَائِمُ، فَادْعُ اللَّهَ يَسْقِينَا‏.‏ فَقَالَ ‏\"‏ اللَّهُمَّ اسْقِنَا ‏\"‏‏.‏ مَرَّتَيْنِ، وَايْمُ اللَّهِ مَا نَرَى فِي السَّمَاءِ قَزَعَةً مِنْ سَحَابٍ، فَنَشَأَتْ سَحَابَةٌ وَأَمْطَرَتْ، وَنَزَلَ عَنِ الْمِنْبَرِ فَصَلَّى، فَلَمَّا انْصَرَفَ لَمْ تَزَلْ تُمْطِرُ إِلَى الْجُمُعَةِ الَّتِي تَلِيهَا، فَلَمَّا قَامَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ صَاحُوا إِلَيْهِ تَهَدَّمَتِ الْبُيُوتُ وَانْقَطَعَتِ السُّبُلُ، فَادْعُ اللَّهَ يَحْبِسُهَا عَنَّا‏.‏ فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَكُشِطَتِ الْمَدِينَةُ، فَجَعَلَتْ تُمْطِرُ حَوْلَهَا وَلاَ تَمْطُرُ بِالْمَدِينَةِ قَطْرَةً، فَنَظَرْتُ إِلَى الْمَدِينَةِ وَإِنَّهَا لَفِي مِثْلِ الإِكْلِيلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1021In-book reference : Book 15, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 134   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1022,
    "id": 1022,
    "url": "https://sunnah.com/bukhari:1022",
    "bookNumber": 15,
    "hadithNumber": 17,
    "narrator": "",
    "english": "Narrated 'Abdullah bin Yazid Al-Ansari that he went out with Al-Bara' bin 'Azib, and Zaid bin Arqam and invoked for rain. He ('Abdullah bin Yazid) stood up but not on a pulpit and invoked Allah for rain and then offered two Rak'a prayers with loud recitation without pronouncing Adhan or Iqama. Abu Ishaq said that 'Adbullah bin Yazid had seen the Prophet (ﷺ) (doing the same)",
    "arabic": "وَقَالَ لَنَا أَبُو نُعَيْمٍ عَنْ زُهَيْرٍ، عَنْ أَبِي إِسْحَاقَ، خَرَجَ عَبْدُ اللَّهِ بْنُ يَزِيدَ الأَنْصَارِيُّ وَخَرَجَ مَعَهُ الْبَرَاءُ بْنُ عَازِبٍ وَزَيْدُ بْنُ أَرْقَمَ رضى الله عنهم فَاسْتَسْقَى، فَقَامَ بِهِمْ عَلَى رِجْلَيْهِ عَلَى غَيْرِ مِنْبَرٍ فَاسْتَغْفَرَ، ثُمَّ صَلَّى رَكْعَتَيْنِ يَجْهَرُ بِالْقِرَاءَةِ وَلَمْ يُؤَذِّنْ، وَلَمْ يُقِمْ‏.‏ قَالَ أَبُو إِسْحَاقَ وَرَأَى عَبْدُ اللَّهِ بْنُ يَزِيدَ النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1022In-book reference : Book 15, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 134   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1023,
    "id": 1023,
    "url": "https://sunnah.com/bukhari:1023",
    "bookNumber": 15,
    "hadithNumber": 18,
    "narrator": "Narrated `Abbad bin Tamim:",
    "english": "that his uncle (who was one of the companions of the Prophet) had told him, \"The Prophet (ﷺ) went out \nwith the people to invoke Allah for rain for them. He stood up and invoked Allah for rain, then faced \nthe Qibla and turned his cloak (inside out) and it rained.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَبَّادُ بْنُ تَمِيمٍ، أَنَّ عَمَّهُ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ بِالنَّاسِ يَسْتَسْقِي لَهُمْ، فَقَامَ فَدَعَا اللَّهَ قَائِمًا، ثُمَّ تَوَجَّهَ قِبَلَ الْقِبْلَةِ، وَحَوَّلَ رِدَاءَهُ فَأُسْقُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1023In-book reference : Book 15, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 135   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1024,
    "id": 1024,
    "url": "https://sunnah.com/bukhari:1024",
    "bookNumber": 15,
    "hadithNumber": 19,
    "narrator": "Narrated `Abbad bin Tamim:",
    "english": "from his uncle who said, \"The Prophet (ﷺ) went out to invoke Allah for rain. He faced the Qibla invoking \nAllah. He turned over his cloak (inside out) and then offered two rak`at and recited the Qur'an aloud in \nthem.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَسْتَسْقِي فَتَوَجَّهَ إِلَى الْقِبْلَةِ يَدْعُو، وَحَوَّلَ رِدَاءَهُ، ثُمَّ صَلَّى رَكْعَتَيْنِ جَهَرَ فِيهِمَا بِالْقِرَاءَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1024In-book reference : Book 15, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 136   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1025,
    "id": 1025,
    "url": "https://sunnah.com/bukhari:1025",
    "bookNumber": 15,
    "hadithNumber": 20,
    "narrator": "Narrated `Abbad bin Tamim from his uncle:",
    "english": "\"I saw the Prophet (ﷺ) on the day when he went out to offer the Istisqa' prayer. He turned his back \ntowards the people and faced the Qibla and asked Allah for rain. Then he turned his cloak inside out \nand led us in a two rak`at prayer and recited the Qur'an aloud in them.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ خَرَجَ يَسْتَسْقِي قَالَ فَحَوَّلَ إِلَى النَّاسِ ظَهْرَهُ، وَاسْتَقْبَلَ الْقِبْلَةَ يَدْعُو، ثُمَّ حَوَّلَ رِدَاءَهُ، ثُمَّ صَلَّى لَنَا رَكْعَتَيْنِ جَهَرَ فِيهِمَا بِالْقِرَاءَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1025In-book reference : Book 15, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 137   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1026,
    "id": 1026,
    "url": "https://sunnah.com/bukhari:1026",
    "bookNumber": 15,
    "hadithNumber": 21,
    "narrator": "Narrated `Abbad bin Tamim from his uncle who said:",
    "english": "\"The Prophet (ﷺ) invoked Allah for rain and offered a two rak`at prayer and he put his cloak inside out.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَسْقَى فَصَلَّى رَكْعَتَيْنِ، وَقَلَبَ رِدَاءَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1026In-book reference : Book 15, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 138   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1027,
    "id": 1027,
    "url": "https://sunnah.com/bukhari:1027",
    "bookNumber": 15,
    "hadithNumber": 22,
    "narrator": "Narrated `Abbad bin Tamim from his uncle who said:",
    "english": "\"The Prophet (ﷺ) went out to the Musalla to offer the Istisqa' prayer, faced the Qibla and offered a two rak`at prayer and turned his cloak inside out.\" Narrated Abu Bakr, \"The Prophet (ﷺ) put the right side of \nhis cloak on his left side.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، سَمِعَ عَبَّادَ بْنَ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمُصَلَّى يَسْتَسْقِي، وَاسْتَقْبَلَ الْقِبْلَةَ فَصَلَّى رَكْعَتَيْنِ، وَقَلَبَ رِدَاءَهُ‏.‏ قَالَ سُفْيَانُ فَأَخْبَرَنِي الْمَسْعُودِيُّ عَنْ أَبِي بَكْرٍ قَالَ جَعَلَ الْيَمِينَ عَلَى الشِّمَالِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1027In-book reference : Book 15, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 139   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1028,
    "id": 1028,
    "url": "https://sunnah.com/bukhari:1028",
    "bookNumber": 15,
    "hadithNumber": 23,
    "narrator": "Narrated `Abdullah bin Zaid Al-Ansari:",
    "english": "The Prophet (ﷺ) went out towards the Musalla in order to offer the Istisqa' prayer and when he intended \nto invoke (Allah) or started invoking, he faced the Qibla and turned his cloak inside out.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدٍ، أَنَّ عَبَّادَ بْنَ تَمِيمٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الأَنْصَارِيَّ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى الْمُصَلَّى يُصَلِّي، وَأَنَّهُ لَمَّا دَعَا ـ أَوْ أَرَادَ أَنْ يَدْعُوَ ـ اسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ابْنُ زَيْدٍ هَذَا مَازِنِيٌّ، وَالأَوَّلُ كُوفِيٌّ هُوَ ابْنُ يَزِيدَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1028In-book reference : Book 15, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 140   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1029,
    "id": 1029,
    "url": "https://sunnah.com/bukhari:1029",
    "bookNumber": 15,
    "hadithNumber": 24,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A bedouin came to Allah's Messenger (ﷺ) on a Friday  and said, \"O Allah's Messenger ! The livestock, the offspring, and the people have perished.\" So, Allah's Messenger (ﷺ) raised both his hands invoking Allah (for rain) and the people too raised their hands with Allah's Messenger (ﷺ) invoking Allah (for rain). We had not left the mosque when it started raining. It rained till the next Friday when the same man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger! The travelers are compelled to postpone their journeys (because of excessive rain) and the roads are overflowed.\"",
    "arabic": "قَالَ أَيُّوبُ بْنُ سُلَيْمَانَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، قَالَ يَحْيَى بْنُ سَعِيدٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ أَتَى رَجُلٌ أَعْرَابِيٌّ مِنْ أَهْلِ الْبَدْوِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَتِ الْمَاشِيَةُ هَلَكَ الْعِيَالُ هَلَكَ النَّاسُ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ يَدْعُو، وَرَفَعَ النَّاسُ أَيْدِيَهُمْ مَعَهُ يَدْعُونَ، قَالَ فَمَا خَرَجْنَا مِنَ الْمَسْجِدِ حَتَّى مُطِرْنَا، فَمَا زِلْنَا نُمْطَرُ حَتَّى كَانَتِ الْجُمُعَةُ الأُخْرَى، فَأَتَى الرَّجُلُ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، بَشِقَ الْمُسَافِرُ، وَمُنِعَ الطَّرِيقُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1029In-book reference : Book 15, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 140   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1030,
    "id": 1030,
    "url": "https://sunnah.com/bukhari:1030",
    "bookNumber": 15,
    "hadithNumber": 25,
    "narrator": "",
    "english": "The narrator Anas added that the Prophet (ﷺ) raised his hands (during the invocation) to such an extent that the whiteness of his armpits was visible.",
    "arabic": "وَقَالَ الأُوَيْسِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَشَرِيكٍ، سَمِعَا أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ رَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1030In-book reference : Book 15, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 140   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1031,
    "id": 1031,
    "url": "https://sunnah.com/bukhari:1031",
    "bookNumber": 15,
    "hadithNumber": 26,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) never raised his hands for any invocation except for that of Istisqa' and he used to raise \nthem so much that the whiteness of his armpits became visible. (Note: It may be that Anas did not see \nthe Prophet (ﷺ) raising his hands, but it is narrated that the Prophet (ﷺ) used to raise his hands for invocations \nother than Istisqa. See Hadith No. 807 & 808 and also see Hadith No. 612, Vol. 5).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَرْفَعُ يَدَيْهِ فِي شَىْءٍ مِنْ دُعَائِهِ إِلاَّ فِي الاِسْتِسْقَاءِ، وَإِنَّهُ يَرْفَعُ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1031In-book reference : Book 15, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 141   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1032,
    "id": 1032,
    "url": "https://sunnah.com/bukhari:1032",
    "bookNumber": 15,
    "hadithNumber": 27,
    "narrator": "Narrated Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) saw the rain, he used to say, \"O Allah! Let it be a strong fruitful rain.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ ـ هُوَ ابْنُ مُقَاتِلٍ أَبُو الْحَسَنِ الْمَرْوَزِيُّ ـ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا رَأَى الْمَطَرَ قَالَ ‏\n\"‏ صَيِّبًا نَافِعًا ‏\"‏‏.‏ تَابَعَهُ الْقَاسِمُ بْنُ يَحْيَى عَنْ عُبَيْدِ اللَّهِ‏.‏ وَرَوَاهُ الأَوْزَاعِيُّ وَعُقَيْلٌ عَنْ نَافِعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1032In-book reference : Book 15, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 142   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1033,
    "id": 1033,
    "url": "https://sunnah.com/bukhari:1033",
    "bookNumber": 15,
    "hadithNumber": 28,
    "narrator": "Narrated Anas bin Malik:",
    "english": "In the lifetime of Allah's Messenger (ﷺ) (p.b.u.h) the people were afflicted with a (famine) year. While the \nProphet was delivering the Khutba (sermon) on the pulpit on a Friday, a Bedouin stood up and said, \n\"O Allah's Messenger (ﷺ)! The livestock are dying and the families (offspring) are hungry: please pray to \nAllah to bless us with rain.\" Allah's Messenger (ﷺ) raised both his hands towards the sky and at that time \nthere was not a trace of cloud in they sky. Then the clouds started gathering like mountains. Before he \ngot down from the pulpit I saw rainwater trickling down his beard. It rained that day, the next day, the \nthird day, the fourth day and till the next Friday, when the same Bedouin or some other person stood \nup (during the Friday Khutba) and said, \"O Allah's Messenger (ﷺ)! The houses have collapsed and the \nlivestock are drowned. Please invoke Allah for us.\" So Allah's Messenger (ﷺ) raised both his hands and said, \n\"O Allah! Around us and not on us.\" Whichever side the Prophet (ﷺ) directed his hand, the clouds \ndispersed from there till a hole (in the clouds) was formed over Medina. The valley of Qanat remained \nflowing (with water) for one month and none, came from outside who didn't talk about the abundant \nrain.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ أَصَابَتِ النَّاسَ سَنَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ، فَادْعُ اللَّهَ لَنَا أَنْ يَسْقِيَنَا‏.‏ قَالَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ، وَمَا فِي السَّمَاءِ قَزَعَةٌ، قَالَ فَثَارَ سَحَابٌ أَمْثَالُ الْجِبَالِ، ثُمَّ لَمْ يَنْزِلْ عَنْ مِنْبَرِهِ حَتَّى رَأَيْتُ الْمَطَرَ يَتَحَادَرُ عَلَى لِحْيَتِهِ، قَالَ فَمُطِرْنَا يَوْمَنَا ذَلِكَ، وَفِي الْغَدِ وَمِنْ بَعْدِ الْغَدِ وَالَّذِي يَلِيهِ إِلَى الْجُمُعَةِ الأُخْرَى، فَقَامَ ذَلِكَ الأَعْرَابِيُّ أَوْ رَجُلٌ غَيْرُهُ فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَ الْبِنَاءُ وَغَرِقَ الْمَالُ، فَادْعُ اللَّهَ لَنَا‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ وَقَالَ ‏\n\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ قَالَ فَمَا جَعَلَ يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ مِنَ السَّمَاءِ إِلاَّ تَفَرَّجَتْ حَتَّى صَارَتِ الْمَدِينَةُ فِي مِثْلِ الْجَوْبَةِ، حَتَّى سَالَ الْوَادِي ـ وَادِي قَنَاةَ ـ شَهْرًا‏.‏ قَالَ فَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلاَّ حَدَّثَ بِالْجَوْدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1033In-book reference : Book 15, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 143   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1034,
    "id": 1034,
    "url": "https://sunnah.com/bukhari:1034",
    "bookNumber": 15,
    "hadithNumber": 29,
    "narrator": "Narrated Anas:",
    "english": "Whenever a strong wind blew, anxiety appeared on the face of the Prophet (fearing that wind might be \na sign of Allah's wrath).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا، يَقُولُ كَانَتِ الرِّيحُ الشَّدِيدَةُ إِذَا هَبَّتْ عُرِفَ ذَلِكَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1034In-book reference : Book 15, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 144   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1035,
    "id": 1035,
    "url": "https://sunnah.com/bukhari:1035",
    "bookNumber": 15,
    "hadithNumber": 30,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"I was granted victory with As-Saba and the nation of 'Ad was destroyed by Ad- \nDabur (westerly wind) .",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نُصِرْتُ بِالصَّبَا، وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1035In-book reference : Book 15, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 145   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1036,
    "id": 1036,
    "url": "https://sunnah.com/bukhari:1036",
    "bookNumber": 15,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour (Last Day) will not be established until (religious) knowledge will be \ntaken away (by the death of religious learned men), earthquakes will be very frequent, time will pass \nquickly, afflictions will appear, murders will increase and money will overflow amongst you.\" (See \nHadith No. 85 Vol 1).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ أَخْبَرَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يُقْبَضَ الْعِلْمُ، وَتَكْثُرَ الزَّلاَزِلُ، وَيَتَقَارَبَ الزَّمَانُ، وَتَظْهَرَ الْفِتَنُ، وَيَكْثُرَ الْهَرْجُ ـ وَهْوَ الْقَتْلُ الْقَتْلُ ـ حَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1036In-book reference : Book 15, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 146   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1037,
    "id": 1037,
    "url": "https://sunnah.com/bukhari:1037",
    "bookNumber": 15,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn `Umar:",
    "english": "(The Prophet) said, \"O Allah! Bless our Sham and our Yemen.\" People said, \"Our Najd as well.\" The \nProphet again said, \"O Allah! Bless our Sham and Yemen.\" They said again, \"Our Najd as well.\" On \nthat the Prophet (ﷺ) said, \"There will appear earthquakes and afflictions, and from there will come out the \nside of the head of Satan.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ اللَّهُمَّ بَارِكْ لَنَا فِي شَامِنَا وَفِي يَمَنِنَا‏.‏ قَالَ قَالُوا وَفِي نَجْدِنَا قَالَ قَالَ اللَّهُمَّ بَارِكْ لَنَا فِي شَامِنَا وَفِي يَمَنِنَا‏.‏ قَالَ قَالُوا وَفِي نَجْدِنَا قَالَ قَالَ هُنَاكَ الزَّلاَزِلُ وَالْفِتَنُ، وَبِهَا يَطْلُعُ قَرْنُ الشَّيْطَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1037In-book reference : Book 15, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 147   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1038,
    "id": 1038,
    "url": "https://sunnah.com/bukhari:1038",
    "bookNumber": 15,
    "hadithNumber": 33,
    "narrator": "Narrated Zaid bin Khalid Al-Juhani:",
    "english": "Allah's Messenger (ﷺ) led the morning prayer in Al-Hudaibiya and it had rained the previous night. When \nthe Prophet (p.b.u.h) had finished the prayer he faced the people and said, \"Do you know what your \nLord has said?\" They replied, \"Allah and His Apostle know better.\" (The Prophet (ﷺ) said), \"Allah says, \n'In this morning some of My worshipers remained as true believers and some became non-believers; \nhe who said that it had rained with the blessing and mercy of Allah is the one who believes in Me and \ndoes not believe in star, but he who said it had rained because of such and such (star) is a disbeliever \nin Me and is a believer in star.' \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى إِثْرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلَةِ، فَلَمَّا انْصَرَفَ النَّبِيُّ صلى الله عليه وسلم أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ‏.‏ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ، وَأَمَّا مَنْ قَالَ بِنَوْءِ كَذَا وَكَذَا‏.‏ فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1038In-book reference : Book 15, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 148   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1039,
    "id": 1039,
    "url": "https://sunnah.com/bukhari:1039",
    "bookNumber": 15,
    "hadithNumber": 34,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Keys of the unseen knowledge are five which nobody knows but Allah \n. . . nobody knows what will happen tomorrow; nobody knows what is in the womb; nobody knows \nwhat he will gain tomorrow; nobody knows at what place he will die; and nobody knows when it will \nrain.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مِفْتَاحُ الْغَيْبِ خَمْسٌ لاَ يَعْلَمُهَا إِلاَّ اللَّهُ لاَ يَعْلَمُ أَحَدٌ مَا يَكُونُ فِي غَدٍ، وَلاَ يَعْلَمُ أَحَدٌ مَا يَكُونُ فِي الأَرْحَامِ، وَلاَ تَعْلَمُ نَفْسٌ مَاذَا تَكْسِبُ غَدًا، وَمَا تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ، وَمَا يَدْرِي أَحَدٌ مَتَى يَجِيءُ الْمَطَرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1039In-book reference : Book 15, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 17, Hadith 149   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1040,
    "id": 1040,
    "url": "https://sunnah.com/bukhari:1040",
    "bookNumber": 16,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Bakra:",
    "english": "We were with Allah's Messenger (ﷺ) when the sun eclipsed. Allah's Messenger (ﷺ) stood up dragging his cloak till \nhe entered the Mosque. He led us in a two-rak`at prayer till the sun (eclipse) had cleared. Then the \nProphet (p.b.u.h) said, \"The sun and the moon do not eclipse because of someone's death. So \nwhenever you see these eclipses pray and invoke (Allah) till the eclipse is over.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْكَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم يَجُرُّ رِدَاءَهُ حَتَّى دَخَلَ الْمَسْجِدَ، فَدَخَلْنَا فَصَلَّى بِنَا رَكْعَتَيْنِ، حَتَّى انْجَلَتِ الشَّمْسُ فَقَالَ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا، وَادْعُوا، حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1040In-book reference : Book 16, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 150   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1041,
    "id": 1041,
    "url": "https://sunnah.com/bukhari:1041",
    "bookNumber": 16,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death of someone from the \npeople but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"",
    "arabic": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ أَبَا مَسْعُودٍ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَقُومُوا فَصَلُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1041In-book reference : Book 16, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 151   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1042,
    "id": 1042,
    "url": "https://sunnah.com/bukhari:1042",
    "bookNumber": 16,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of \nsomeone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
    "arabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يُخْبِرُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهَا فَصَلُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1042In-book reference : Book 16, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 152   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1043,
    "id": 1043,
    "url": "https://sunnah.com/bukhari:1043",
    "bookNumber": 16,
    "hadithNumber": 4,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "\"The sun eclipsed in the lifetime of Allah's Messenger (ﷺ) on the day when (his son) Ibrahim died. So the \npeople said that the sun had eclipsed because of the death of Ibrahim. Allah's Messenger (ﷺ) said, \"The sun \nand the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the \neclipse pray and invoke Allah.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ مَاتَ إِبْرَاهِيمُ، فَقَالَ النَّاسُ كَسَفَتِ الشَّمْسُ لِمَوْتِ إِبْرَاهِيمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ فَصَلُّوا وَادْعُوا اللَّهَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1043In-book reference : Book 16, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 153   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1044,
    "id": 1044,
    "url": "https://sunnah.com/bukhari:1044",
    "bookNumber": 16,
    "hadithNumber": 5,
    "narrator": "Narrated `Aisha:",
    "english": "In the lifetime of Allah's Messenger (ﷺ) (p.b.u.h) the sun eclipsed, so he led the people in prayer, and stood \nup and performed a long Qiyam, then bowed for a long while. He stood up again and performed a \nlong Qiyam but this time the period of standing was shorter than the first. He bowed again for a long \ntime but shorter than the first one, then he prostrated and prolonged the prostration. He did the same in \nthe second rak`a as he did in the first and then finished the prayer; by then the sun (eclipse) had \ncleared. He delivered the Khutba (sermon) and after praising and glorifying Allah he said, \"The sun \nand the moon are two signs against the signs of Allah; they do not eclipse on the death or life of \nanyone. So when you see the eclipse, remember Allah and say Takbir, pray and give Sadaqa.\" The \nProphet then said, \"O followers of Muhammad! By Allah! There is none who has more ghaira (selfrespect) \nthan Allah as He has forbidden that His slaves, male or female commit adultery (illegal \nsexual intercourse). O followers of Muhammad! By Allah! If you knew that which I know you would \nlaugh little and weep much.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ خَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، فَقَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ مَا فَعَلَ فِي الأُولَى، ثُمَّ انْصَرَفَ وَقَدِ انْجَلَتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ وَكَبِّرُوا، وَصَلُّوا وَتَصَدَّقُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ يَا أُمَّةَ مُحَمَّدٍ، وَاللَّهِ مَا مِنْ أَحَدٍ أَغْيَرُ مِنَ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ، يَا أُمَّةَ مُحَمَّدٍ، وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1044In-book reference : Book 16, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 154   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1045,
    "id": 1045,
    "url": "https://sunnah.com/bukhari:1045",
    "bookNumber": 16,
    "hadithNumber": 6,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "\"When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) an announcement was made that a prayer \nwas to be offered in congregation.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمِ بْنِ أَبِي سَلاَّمٍ الْحَبَشِيُّ الدِّمَشْقِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ الزُّهْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لَمَّا كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نُودِيَ إِنَّ الصَّلاَةَ جَامِعَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1045In-book reference : Book 16, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 155   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1046,
    "id": 1046,
    "url": "https://sunnah.com/bukhari:1046",
    "bookNumber": 16,
    "hadithNumber": 7,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet (ﷺ) the sun eclipsed and he went to the \nMosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the \nrecitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted \nhis head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He \nthen did not prostrate but stood up and recited a prolonged recitation which was shorter than the first \nrecitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and \nthen said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his \npraises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in \nthe second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared \nbefore he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He \ndeserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse \nbecause of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" \nNarrated Az-Zuhri: I said to 'Urwa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az-Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Urwa replied, \"Yes, \nfor he missed the Prophet's tradition (concerning this matter).\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنِي أَحْمَدُ بْنُ صَالِحٍ، قَالَ حَدَّثَنَا عَنْبَسَةُ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَسَفَتِ الشَّمْسُ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ إِلَى الْمَسْجِدِ فَصَفَّ النَّاسُ وَرَاءَهُ، فَكَبَّرَ فَاقْتَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم قِرَاءَةً طَوِيلَةً، ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقَامَ وَلَمْ يَسْجُدْ، وَقَرَأَ قِرَاءَةً طَوِيلَةً، هِيَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى، ثُمَّ كَبَّرَ وَرَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ أَدْنَى مِنَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ سَجَدَ، ثُمَّ قَالَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ، فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ، وَانْجَلَتِ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ، ثُمَّ قَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\n\"‏ هُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏ وَكَانَ يُحَدِّثُ كَثِيرُ بْنُ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ كَانَ يُحَدِّثُ يَوْمَ خَسَفَتِ الشَّمْسُ بِمِثْلِ حَدِيثِ عُرْوَةَ عَنْ عَائِشَةَ‏.‏ فَقُلْتُ لِعُرْوَةَ إِنَّ أَخَاكَ يَوْمَ خَسَفَتْ بِالْمَدِينَةِ لَمْ يَزِدْ عَلَى رَكْعَتَيْنِ مِثْلَ الصُّبْحِ‏.‏ قَالَ أَجَلْ لأَنَّهُ أَخْطَأَ السُّنَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1046In-book reference : Book 16, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 156   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1047,
    "id": 1047,
    "url": "https://sunnah.com/bukhari:1047",
    "bookNumber": 16,
    "hadithNumber": 8,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet) On the day when the sun Khasafat (eclipsed) Allah's Messenger (ﷺ) prayed; he \nstood up and said Takbir and recited a prolonged recitation, then he performed a prolonged bowing, \nthen he raised his head and said, \"Sami`a l-lahu Lyman Hamidah,\" and then remained standing and \nrecited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing \nwhich was shorter than the first. Then he prostrated and prolonged the prostration and he did the same \nin the second rak`a as in the first and then finished the prayer with Taslim. By that time the sun \n(eclipse) had cleared He addressed the people and said, \"The sun and the moon are two of the signs of \nAllah; they do not eclipse (Yakhsifan) because of the death or the life (i.e. birth) of someone. So when \nyou see them make haste for the prayer.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ خَسَفَتِ الشَّمْسُ، فَقَامَ فَكَبَّرَ، فَقَرَأَ قِرَاءَةً طَوِيلَةً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ رَأْسَهُ، فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ وَقَامَ كَمَا هُوَ، ثُمَّ قَرَأَ قِرَاءَةً طَوِيلَةً، وَهْىَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْىَ أَدْنَى مِنَ الرَّكْعَةِ الأُولَى، ثُمَّ سَجَدَ سُجُودًا طَوِيلاً، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ، ثُمَّ سَلَّمَ وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، فَقَالَ فِي كُسُوفِ الشَّمْسِ وَالْقَمَرِ ‏\n\"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1047In-book reference : Book 16, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 157   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1048,
    "id": 1048,
    "url": "https://sunnah.com/bukhari:1048",
    "bookNumber": 16,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Bakra:",
    "english": "Allah's Messenger (ﷺ) said: \"The sun and the moon are two signs amongst the signs of Allah and they do not \neclipse because of the death of someone but Allah frightens His devotees with them.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ، وَلَكِنَّ اللَّهَ تَعَالَى يُخَوِّفُ بِهَا عِبَادَهُ ‏\"‏‏.‏ وَقَالَ أَبُو عَبْدِ اللَّهِ لَمْ يَذْكُرْ عَبْدُ الْوَارِثِ وَشُعْبَةُ وَخَالِدُ بْنُ عَبْدِ اللَّهِ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ يُونُسَ ‏\"‏ يُخَوِّفُ بِهَا عِبَادَهُ ‏\"‏‏.‏ وَتَابَعَهُ مُوسَى عَنْ مُبَارَكٍ عَنِ الْحَسَنِ قَالَ أَخْبَرَنِي أَبُو بَكْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏\"‏ إِنَّ اللَّهَ تَعَالَى يُخَوِّفُ بِهِمَا عِبَادَهُ ‏\"‏‏.‏ وَتَابَعَهُ أَشْعَثُ عَنِ الْحَسَنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1048In-book reference : Book 16, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 158   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1049,
    "id": 1049,
    "url": "https://sunnah.com/bukhari:1049",
    "bookNumber": 16,
    "hadithNumber": 10,
    "narrator": "Narrated `Amra bint `Abdur-Rahman:",
    "english": "A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah \ngive you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Messenger (ﷺ) \"Would the \npeople be punished in their graves?\" Allah's Messenger (ﷺ) after seeking refuge with Allah from the \npunishment of the grave (and thus replied in the affirmative). Then one day, Allah's Messenger (ﷺ) rode to go \nto some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the \ndwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood \nup for a long period and then performed a prolonged bowing which was shorter than the first bowing. \nThen he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but \nthe standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was \nshorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but \nshorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised \nhis head and prostrated and finished the prayer and (then delivered the sermon and) said as much as \nAllah wished. And then he ordered the people to seek refuge with Allah from the punishment of the \ngrave.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ يَهُودِيَّةً جَاءَتْ تَسْأَلُهَا فَقَالَتْ لَهَا أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ ـ رضى الله عنها ـ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏.‏ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَخَسَفَتِ الشَّمْسُ، فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ يُصَلِّي، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ، ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ وَانْصَرَفَ، فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1049, 1050In-book reference : Book 16, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 159   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1050,
    "id": 1050,
    "url": "https://sunnah.com/bukhari:1050",
    "bookNumber": 16,
    "hadithNumber": 10,
    "narrator": "Narrated `Amra bint `Abdur-Rahman:",
    "english": "A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah \ngive you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Messenger (ﷺ) \"Would the \npeople be punished in their graves?\" Allah's Messenger (ﷺ) after seeking refuge with Allah from the \npunishment of the grave (and thus replied in the affirmative). Then one day, Allah's Messenger (ﷺ) rode to go \nto some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the \ndwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood \nup for a long period and then performed a prolonged bowing which was shorter than the first bowing. \nThen he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but \nthe standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was \nshorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but \nshorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised \nhis head and prostrated and finished the prayer and (then delivered the sermon and) said as much as \nAllah wished. And then he ordered the people to seek refuge with Allah from the punishment of the \ngrave.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ يَهُودِيَّةً جَاءَتْ تَسْأَلُهَا فَقَالَتْ لَهَا أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ ـ رضى الله عنها ـ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏.‏ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَخَسَفَتِ الشَّمْسُ، فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ يُصَلِّي، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ، ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ وَانْصَرَفَ، فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1049, 1050In-book reference : Book 16, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 159   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1051,
    "id": 1051,
    "url": "https://sunnah.com/bukhari:1051",
    "bookNumber": 16,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) and an announcement was made that the \nprayer was to be held in congregation. The Prophet (ﷺ) performed two bowing in one rak`a. Then he stood \nup and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the \n(eclipse) had cleared `Aisha said, \"I had never performed such a long prostration.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّهُ قَالَ لَمَّا كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نُودِيَ إِنَّ الصَّلاَةَ جَامِعَةٌ فَرَكَعَ النَّبِيُّ صلى الله عليه وسلم رَكْعَتَيْنِ فِي سَجْدَةٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ فِي سَجْدَةٍ، ثُمَّ جَلَسَ، ثُمَّ جُلِّيَ عَنِ الشَّمْسِ‏.‏ قَالَ وَقَالَتْ عَائِشَةُ ـ رضى الله عنها ـ مَا سَجَدْتُ سُجُودًا قَطُّ كَانَ أَطْوَلَ مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1051In-book reference : Book 16, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 160   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1052,
    "id": 1052,
    "url": "https://sunnah.com/bukhari:1052",
    "bookNumber": 16,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Messenger (ﷺ) offered the eclipse prayer \nand stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he \nbowed for a long time and then stood up for a long period which was shorter than that of the first \nstanding, then bowed again for a long time but for a shorter period than the first; then he prostrated \ntwice and then stood up for a long period which was shorter than that of the first standing; then he \nbowed for a long time which was shorter than the previous one, and then he raised his head and stood \nup for a long period which was shorter than the first standing, then he bowed for a long time which \nwas shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun \n(eclipse) had cleared. The Prophet (ﷺ) then said, \"The sun and the moon are two of the signs of Allah. \nThey eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you \nsee them, remember Allah.\" The people say, \"O Allah's Messenger (ﷺ)! We saw you taking something from \nyour place and then we saw you retreating.\" The Prophet (ﷺ) replied, \"I saw Paradise and stretched my \nhands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the \nworld remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of \nthe inhabitants were women.\" The people asked, \"O Allah's Messenger (ﷺ)! Why is it so?\" The Prophet (ﷺ) \nreplied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The \nProphet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good \ndeeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) \nin you, she will say, 'I have never had any good from you.' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ انْخَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم، فَقَامَ قِيَامًا طَوِيلاً نَحْوًا مِنْ قِرَاءَةِ سُورَةِ الْبَقَرَةِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتِ الشَّمْسُ، فَقَالَ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ، ثُمَّ رَأَيْنَاكَ كَعْكَعْتَ‏.‏ قَالَ صلى الله عليه وسلم ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ، فَتَنَاوَلْتُ عُنْقُودًا، وَلَوْ أَصَبْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا، وَأُرِيتُ النَّارَ، فَلَمْ أَرَ مَنْظَرًا كَالْيَوْمِ قَطُّ أَفْظَعَ، وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ قَالُوا بِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُفْرِهِنَّ ‏\"‏‏.‏ قِيلَ يَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ كُلَّهُ، ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1052In-book reference : Book 16, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 161   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1053,
    "id": 1053,
    "url": "https://sunnah.com/bukhari:1053",
    "bookNumber": 16,
    "hadithNumber": 13,
    "narrator": "Narrated Fatima bint Al-Mundhir:",
    "english": "Asma' bint Al Bakr said, \"I came to `Aisha the wife of the Prophet (p.b.u.h) during the solar eclipse. \nThe people were standing and offering the prayer and she was also praying too. I asked her, 'What has \nhappened to the people?' She pointed out with her hand towards the sky and said, 'Subhan-Allah'. I \nsaid, 'Is there a sign?' She pointed out in the affirmative.\" Asma' further said, \"I too then stood up for \nthe prayer till I fainted and then poured water on my head. When Allah's Messenger (ﷺ) had finished his \nprayer, he thanked and praised Allah and said, 'I have seen at this place of mine what I have never \nseen even Paradise and Hell. No doubt, it has been inspired to me that you will be put to trial in the \ngraves like or nearly like the trial of (Masih) Ad-Dajjal. (I do not know which one of the two Asma' \nsaid.) (The angels) will come to everyone of you and will ask what do you know about this man (i.e. \nMuhammad). The believer or a firm believer (I do not know which word Asma' said) will reply, 'He is \nMuhammad, Allah's Messenger (ﷺ) (p.b.u.h) who came to us with clear evidences and guidance, so we \naccepted his teachings, believed and followed him.' The angels will then say to him, 'Sleep peacefully \nas we knew surely that you were a firm believer.' The hypocrite or doubtful person (I do not know \nwhich word Asma' said) will say, 'I do not know. I heard the people saying something so I said it (the \nsame).' \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ امْرَأَتِهِ، فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّهَا قَالَتْ أَتَيْتُ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حِينَ خَسَفَتِ الشَّمْسُ، فَإِذَا النَّاسُ قِيَامٌ يُصَلُّونَ، وَإِذَا هِيَ قَائِمَةٌ تُصَلِّي فَقُلْتُ مَا لِلنَّاسِ فَأَشَارَتْ بِيَدِهَا إِلَى السَّمَاءِ، وَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ أَىْ نَعَمْ‏.‏ قَالَتْ فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، فَجَعَلْتُ أَصُبُّ فَوْقَ رَأْسِي الْمَاءَ، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ مَا مِنْ شَىْءٍ كُنْتُ لَمْ أَرَهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ، وَلَقَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ ـ أَوْ قَرِيبًا مِنْ ـ فِتْنَةِ الدَّجَّالِ ـ لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ ـ يُؤْتَى أَحَدُكُمْ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ مُحَمَّدٌ رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَآمَنَّا وَاتَّبَعْنَا‏.‏ فَيُقَالُ لَهُ نَمْ صَالِحًا، فَقَدْ عَلِمْنَا إِنْ كُنْتَ لَمُوقِنًا‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1053In-book reference : Book 16, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 162   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1054,
    "id": 1054,
    "url": "https://sunnah.com/bukhari:1054",
    "bookNumber": 16,
    "hadithNumber": 14,
    "narrator": "Narrated Asma:",
    "english": "No doubt the Prophet (ﷺ) ordered people to manumit slaves during the solar eclipse.",
    "arabic": "حَدَّثَنَا رَبِيعُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ لَقَدْ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْعَتَاقَةِ فِي كُسُوفِ الشَّمْسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1054In-book reference : Book 16, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 163   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1055,
    "id": 1055,
    "url": "https://sunnah.com/bukhari:1055",
    "bookNumber": 16,
    "hadithNumber": 15,
    "narrator": "Narrated `Amra bint `Abdur-Rahman:",
    "english": "A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge \nfrom the punishment of the grave.\" So `Aisha asked Allah's Messenger (ﷺ), \"Would the people be punished \nin their graves?\" Allah's Messenger (ﷺ) asked Allah's refuge from the punishment of the grave (indicating an \naffirmative reply). Then one day Allah's Messenger (ﷺ) rode (to leave for some place) but the sun eclipsed. \nHe returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up \nand started offering the (eclipse) prayer and the people stood behind him. He stood for a long period \nand then performed a long bowing and then stood straight for a long period which was shorter than \nthat of the first standing, then he performed a prolonged bowing which was shorter than the first \nbowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) \nfor a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a \nprolonged bowing which was shorter than that of the first one. He then stood up for a long time but \nshorter than the first, then again performed a long bowing which was shorter than the first and then \nprostrated for a shorter while than that of the first prostration. Then he finished the prayer and \ndelivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah \nfrom the punishment of the grave.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ يَهُودِيَّةً، جَاءَتْ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏.‏ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَكَسَفَتِ الشَّمْسُ فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ فَصَلَّى، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ سُجُودًا طَوِيلاً ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ وَهْوَ دُونَ السُّجُودِ الأَوَّلِ، ثُمَّ انْصَرَفَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ",
    "reference": "Reference : Sahih al-Bukhari 1055, 1056In-book reference : Book 16, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 164   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1056,
    "id": 1056,
    "url": "https://sunnah.com/bukhari:1056",
    "bookNumber": 16,
    "hadithNumber": 15,
    "narrator": "Narrated `Amra bint `Abdur-Rahman:",
    "english": "A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge \nfrom the punishment of the grave.\" So `Aisha asked Allah's Messenger (ﷺ), \"Would the people be punished \nin their graves?\" Allah's Messenger (ﷺ) asked Allah's refuge from the punishment of the grave (indicating an \naffirmative reply). Then one day Allah's Messenger (ﷺ) rode (to leave for some place) but the sun eclipsed. \nHe returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up \nand started offering the (eclipse) prayer and the people stood behind him. He stood for a long period \nand then performed a long bowing and then stood straight for a long period which was shorter than \nthat of the first standing, then he performed a prolonged bowing which was shorter than the first \nbowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) \nfor a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a \nprolonged bowing which was shorter than that of the first one. He then stood up for a long time but \nshorter than the first, then again performed a long bowing which was shorter than the first and then \nprostrated for a shorter while than that of the first prostration. Then he finished the prayer and \ndelivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah \nfrom the punishment of the grave.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ يَهُودِيَّةً، جَاءَتْ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ‏.‏ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا، فَكَسَفَتِ الشَّمْسُ فَرَجَعَ ضُحًى، فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ ظَهْرَانَىِ الْحُجَرِ، ثُمَّ قَامَ فَصَلَّى، وَقَامَ النَّاسُ وَرَاءَهُ، فَقَامَ قِيَامًا طَوِيلاً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَسَجَدَ سُجُودًا طَوِيلاً ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ قَامَ قِيَامًا طَوِيلاً، وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ وَهْوَ دُونَ السُّجُودِ الأَوَّلِ، ثُمَّ انْصَرَفَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ",
    "reference": "Reference : Sahih al-Bukhari 1055, 1056In-book reference : Book 16, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 164   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1057,
    "id": 1057,
    "url": "https://sunnah.com/bukhari:1057",
    "bookNumber": 16,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "Allah's Messenger (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death or life but they \nare two signs amongst the signs of Allah, so pray whenever you see them.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الشَّمْسُ وَالْقَمَرُ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1057In-book reference : Book 16, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 165   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1058,
    "id": 1058,
    "url": "https://sunnah.com/bukhari:1058",
    "bookNumber": 16,
    "hadithNumber": 17,
    "narrator": "Narrated `Aisha:",
    "english": "In the lifetime of the Prophet (ﷺ) the sun eclipsed and the Prophet (p.b.u.h) stood up to offer the prayer \nwith the people and recited a long recitation, then he performed a prolonged bowing, and then lifted \nhis head and recited a prolonged recitation which was shorter than the first. Then he performed a \nprolonged bowing which was shorter than the first and then lifted his head and performed two \nprostrations. He then stood up for the second rak`a and offered it like the first. Then he stood up and \nsaid, \"The sun and the moon do not eclipse because of someone's life or death but they are two signs \namongst the signs of Allah which He shows to His worshipers. So whenever you see them, make haste \nfor the prayer.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، وَهِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِالنَّاسِ، فَأَطَالَ الْقِرَاءَةَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِرَاءَةَ، وَهْىَ دُونَ قِرَاءَتِهِ الأُولَى، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ دُونَ رُكُوعِهِ الأَوَّلِ، ثُمَّ رَفَعَ رَأْسَهُ فَسَجَدَ سَجْدَتَيْنِ، ثُمَّ قَامَ فَصَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ، ثُمَّ قَامَ فَقَالَ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ يُرِيهِمَا عِبَادَهُ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1058In-book reference : Book 16, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 166   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1059,
    "id": 1059,
    "url": "https://sunnah.com/bukhari:1059",
    "bookNumber": 16,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Musa:",
    "english": "The sun eclipsed and the Prophet (ﷺ) got up, being afraid that it might be the Hour (i.e. Day of Judgment). \nHe went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I \nhad ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the \nlife or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything \nthereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَزِعًا، يَخْشَى أَنْ تَكُونَ السَّاعَةُ، فَأَتَى الْمَسْجِدَ، فَصَلَّى بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ رَأَيْتُهُ قَطُّ يَفْعَلُهُ وَقَالَ ‏\n\"‏ هَذِهِ الآيَاتُ الَّتِي يُرْسِلُ اللَّهُ لاَ تَكُونُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنْ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ، فَإِذَا رَأَيْتُمْ شَيْئًا مِنْ ذَلِكَ فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1059In-book reference : Book 16, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 167   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1060,
    "id": 1060,
    "url": "https://sunnah.com/bukhari:1060",
    "bookNumber": 16,
    "hadithNumber": 19,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the \ndeath of Ibrahim (the son of the Prophet). Allah's Messenger (ﷺ) said, \"The sun and the moon are two signs \namongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see \nthem, invoke Allah and pray till the eclipse is clear.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا زَائِدَةُ، قَالَ حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ يَوْمَ مَاتَ إِبْرَاهِيمُ، فَقَالَ النَّاسُ انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْجَلِيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1060In-book reference : Book 16, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 168   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1061,
    "id": 1061,
    "url": "https://sunnah.com/bukhari:1061",
    "bookNumber": 16,
    "hadithNumber": 20,
    "narrator": "",
    "english": "And this was narrated by Asma' who said, \"Allah's Messenger (ﷺ) finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"",
    "arabic": "وَقَالَ أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ، قَالَتْ فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ، فَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1061In-book reference : Book 16, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 168   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1062,
    "id": 1062,
    "url": "https://sunnah.com/bukhari:1062",
    "bookNumber": 16,
    "hadithNumber": 21,
    "narrator": "Narrated Abu Bakra:",
    "english": "In the lifetime of the Prophet (ﷺ) the sun eclipsed and then he offered a two rak`at prayer.",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ شُعْبَةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1062In-book reference : Book 16, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 169   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1063,
    "id": 1063,
    "url": "https://sunnah.com/bukhari:1063",
    "bookNumber": 16,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Bakra:",
    "english": "In the lifetime of the Allah's Messenger (ﷺ) (p.b.u.h) the sun eclipsed and he went out dragging his clothes \ntill he reached the Mosque. The people gathered around him and he led them and offered two rak`at. \nWhen the sun (eclipse) cleared, he said, \"The sun and the moon are two signs amongst the signs of \nAllah; they do not eclipse because of the death of someone, and so when an eclipse occurs, pray and \ninvoke Allah till the eclipse is over.\" It happened that a son of the Prophet (ﷺ) called Ibrahim died on that \nday and the people were talking about that (saying that the eclipse was caused by his death).",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ يَجُرُّ رِدَاءَهُ حَتَّى انْتَهَى إِلَى الْمَسْجِدِ، وَثَابَ النَّاسُ إِلَيْهِ فَصَلَّى بِهِمْ رَكْعَتَيْنِ، فَانْجَلَتِ الشَّمْسُ فَقَالَ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، وَإِنَّهُمَا لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ، وَإِذَا كَانَ ذَاكَ فَصَلُّوا وَادْعُوا حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏‏.‏ وَذَاكَ أَنَّ ابْنًا لِلنَّبِيِّ صلى الله عليه وسلم مَاتَ، يُقَالُ لَهُ إِبْرَاهِيمُ، فَقَالَ النَّاسُ فِي ذَاكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1063In-book reference : Book 16, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 170   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1064,
    "id": 1064,
    "url": "https://sunnah.com/bukhari:1064",
    "bookNumber": 16,
    "hadithNumber": 23,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a \nwas longer.",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِهِمْ فِي كُسُوفِ الشَّمْسِ أَرْبَعَ رَكَعَاتٍ فِي سَجْدَتَيْنِ، الأَوَّلُ الأَوَّلُ أَطْوَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1064In-book reference : Book 16, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 171   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1065,
    "id": 1065,
    "url": "https://sunnah.com/bukhari:1065",
    "bookNumber": 16,
    "hadithNumber": 24,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (p.b.u.h) recited (the Qur'an) aloud during the eclipse prayer and when he had finished \nthe eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \n\"Sami 'allahu liman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the \neclipse prayer there are four bowing and four prostrations in two rak`at. Al-Auza'i and others said that \nthey had heard Az-Zuhri from 'Urwa from `Aisha saying, \"In the lifetime of Allah's Messenger (ﷺ) the sun \neclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed \nfour bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir \nhad informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked \n('Urwa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse \nprayer) like the morning prayer, when he offered the (eclipse) prayer in Medina.' 'Urwa replied that he \nhad missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan \nbin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud \nrecitation.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ أَخْبَرَنَا ابْنُ نَمِرٍ، سَمِعَ ابْنَ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ جَهَرَ النَّبِيُّ صلى الله عليه وسلم فِي صَلاَةِ الْخُسُوفِ بِقِرَاءَتِهِ، فَإِذَا فَرَغَ مِنْ قِرَاءَتِهِ كَبَّرَ فَرَكَعَ، وَإِذَا رَفَعَ مِنَ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ يُعَاوِدُ الْقِرَاءَةَ فِي صَلاَةِ الْكُسُوفِ، أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَقَالَ الأَوْزَاعِيُّ وَغَيْرُهُ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الشَّمْسَ، خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ مُنَادِيًا بِالصَّلاَةُ جَامِعَةٌ، فَتَقَدَّمَ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ سَمِعَ ابْنَ شِهَابٍ مِثْلَهُ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ مَا صَنَعَ أَخُوكَ ذَلِكَ، عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ مَا صَلَّى إِلاَّ رَكْعَتَيْنِ مِثْلَ الصُّبْحِ إِذْ صَلَّى بِالْمَدِينَةِ‏.‏ قَالَ أَجَلْ، إِنَّهُ أَخْطَأَ السُّنَّةَ‏.‏ تَابَعَهُ سُفْيَانُ بْنُ حُسَيْنٍ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ فِي الْجَهْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1065, 1066In-book reference : Book 16, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 172   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1066,
    "id": 1066,
    "url": "https://sunnah.com/bukhari:1066",
    "bookNumber": 16,
    "hadithNumber": 24,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (p.b.u.h) recited (the Qur'an) aloud during the eclipse prayer and when he had finished \nthe eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \n\"Sami 'allahu liman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the \neclipse prayer there are four bowing and four prostrations in two rak`at. Al-Auza'i and others said that \nthey had heard Az-Zuhri from 'Urwa from `Aisha saying, \"In the lifetime of Allah's Messenger (ﷺ) the sun \neclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed \nfour bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir \nhad informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked \n('Urwa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse \nprayer) like the morning prayer, when he offered the (eclipse) prayer in Medina.' 'Urwa replied that he \nhad missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan \nbin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud \nrecitation.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ أَخْبَرَنَا ابْنُ نَمِرٍ، سَمِعَ ابْنَ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ جَهَرَ النَّبِيُّ صلى الله عليه وسلم فِي صَلاَةِ الْخُسُوفِ بِقِرَاءَتِهِ، فَإِذَا فَرَغَ مِنْ قِرَاءَتِهِ كَبَّرَ فَرَكَعَ، وَإِذَا رَفَعَ مِنَ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ يُعَاوِدُ الْقِرَاءَةَ فِي صَلاَةِ الْكُسُوفِ، أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَقَالَ الأَوْزَاعِيُّ وَغَيْرُهُ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الشَّمْسَ، خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ مُنَادِيًا بِالصَّلاَةُ جَامِعَةٌ، فَتَقَدَّمَ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ سَمِعَ ابْنَ شِهَابٍ مِثْلَهُ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ مَا صَنَعَ أَخُوكَ ذَلِكَ، عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ مَا صَلَّى إِلاَّ رَكْعَتَيْنِ مِثْلَ الصُّبْحِ إِذْ صَلَّى بِالْمَدِينَةِ‏.‏ قَالَ أَجَلْ، إِنَّهُ أَخْطَأَ السُّنَّةَ‏.‏ تَابَعَهُ سُفْيَانُ بْنُ حُسَيْنٍ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ فِي الْجَهْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1065, 1066In-book reference : Book 16, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 18, Hadith 172   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1067,
    "id": 1067,
    "url": "https://sunnah.com/bukhari:1067",
    "bookNumber": 17,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "The Prophet (ﷺ) recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were \nwith him did the same except an old man who took a handful of small stones or earth and lifted it to \nhis forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الأَسْوَدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَرَأَ النَّبِيُّ صلى الله عليه وسلم النَّجْمَ بِمَكَّةَ فَسَجَدَ فِيهَا، وَسَجَدَ مَنْ مَعَهُ، غَيْرَ شَيْخٍ أَخَذَ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى جَبْهَتِهِ وَقَالَ يَكْفِينِي هَذَا‏.‏ فَرَأَيْتُهُ بَعْدَ ذَلِكَ قُتِلَ كَافِرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1067In-book reference : Book 17, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 173   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1068,
    "id": 1068,
    "url": "https://sunnah.com/bukhari:1068",
    "bookNumber": 17,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "On Fridays the Prophet (ﷺ) used to recite Alif Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal \nata `alal-insani i.e. Surat ad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الْجُمُعَةِ فِي صَلاَةِ الْفَجْرِ ‏{‏الم * تَنْزِيلُ‏}‏ السَّجْدَةَ وَ‏{‏هَلْ أَتَى عَلَى الإِنْسَانِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 1068In-book reference : Book 17, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 174   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1069,
    "id": 1069,
    "url": "https://sunnah.com/bukhari:1069",
    "bookNumber": 17,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The prostration of Sa`d is not a compulsory one but I saw the Prophet (ﷺ) prostrating while reciting it.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَأَبُو النُّعْمَانِ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏{‏ص‏}‏ لَيْسَ مِنْ عَزَائِمِ السُّجُودِ، وَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْجُدُ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1069In-book reference : Book 17, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 175   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1070,
    "id": 1070,
    "url": "https://sunnah.com/bukhari:1070",
    "bookNumber": 17,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "The Prophet (ﷺ) recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ سُورَةَ النَّجْمِ فَسَجَدَ بِهَا، فَمَا بَقِيَ أَحَدٌ مِنَ الْقَوْمِ إِلاَّ سَجَدَ، فَأَخَذَ رَجُلٌ مِنَ الْقَوْمِ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ، فَرَفَعَهُ إِلَى وَجْهِهِ وَقَالَ يَكْفِينِي هَذَا، فَلَقَدْ رَأَيْتُهُ بَعْدُ قُتِلَ كَافِرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1070In-book reference : Book 17, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 176   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1071,
    "id": 1071,
    "url": "https://sunnah.com/bukhari:1071",
    "bookNumber": 17,
    "hadithNumber": 5,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) I prostrated while reciting An-Najm and with him prostrated the Muslims, the pagans, the \njinns, and all human beings.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم سَجَدَ بِالنَّجْمِ وَسَجَدَ مَعَهُ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْجِنُّ وَالإِنْسُ‏.‏ وَرَوَاهُ ابْنُ طَهْمَانَ عَنْ أَيُّوبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1071In-book reference : Book 17, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 177   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1072,
    "id": 1072,
    "url": "https://sunnah.com/bukhari:1072",
    "bookNumber": 17,
    "hadithNumber": 6,
    "narrator": "Narrated `Ata' bin Yasar:",
    "english": "I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the \nProphet, yet he (the Prophet) had not performed a prostration.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنَا يَزِيدُ بْنُ خُصَيْفَةَ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ، أَنَّهُ، سَأَلَ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ فَزَعَمَ أَنَّهُ قَرَأَ عَلَى النَّبِيِّ صلى الله عليه وسلم ‏{‏وَالنَّجْمِ‏}‏ فَلَمْ يَسْجُدْ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1072In-book reference : Book 17, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 178   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1073,
    "id": 1073,
    "url": "https://sunnah.com/bukhari:1073",
    "bookNumber": 17,
    "hadithNumber": 7,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "I recited An-Najm before the Prophet, yet he did not perform a prostration.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ قَرَأْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم ‏{‏وَالنَّجْمِ‏}‏ فَلَمْ يَسْجُدْ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1073In-book reference : Book 17, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 179   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1074,
    "id": 1074,
    "url": "https://sunnah.com/bukhari:1074",
    "bookNumber": 17,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Salma:",
    "english": "I saw Abu Huraira reciting Idha-Sama' un-Shaqqat and he prostrated during its recitation. I asked Abu \nHuraira, \"Didn't I see you prostrating?\" Abu Huraira said, \"Had I not seen the Prophet (ﷺ) prostrating, I \nwould not have prostrated.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، وَمُعَاذُ بْنُ فَضَالَةَ، قَالاَ أَخْبَرَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ بِهَا فَقُلْتُ يَا أَبَا هُرَيْرَةَ، أَلَمْ أَرَكَ تَسْجُدُ قَالَ لَوْ لَمْ أَرَ النَّبِيَّ صلى الله عليه وسلم يَسْجُدُ لَمْ أَسْجُدْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1074In-book reference : Book 17, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 180   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1075,
    "id": 1075,
    "url": "https://sunnah.com/bukhari:1075",
    "bookNumber": 17,
    "hadithNumber": 9,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When the Prophet (ﷺ) recited a Sura that contained the prostration he would prostrate and we would do \nthe same and some of us (because of the heavy rush) could not find a place for prostration.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ عَلَيْنَا السُّورَةَ فِيهَا السَّجْدَةُ، فَيَسْجُدُ وَنَسْجُدُ، حَتَّى مَا يَجِدُ أَحَدُنَا مَوْضِعَ جَبْهَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1075In-book reference : Book 17, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 181   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1076,
    "id": 1076,
    "url": "https://sunnah.com/bukhari:1076",
    "bookNumber": 17,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When the Prophet (ﷺ) recited Surat As-Sajda and we were with him, he would prostrate and we also \nwould prostrate with him and some of us (because of the heavy rush) would not find a place (for our \nforeheads) to prostrate on.",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ السَّجْدَةَ وَنَحْنُ عِنْدَهُ فَيَسْجُدُ وَنَسْجُدُ مَعَهُ فَنَزْدَحِمُ حَتَّى مَا يَجِدُ أَحَدُنَا لِجَبْهَتِهِ مَوْضِعًا يَسْجُدُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1076In-book reference : Book 17, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 182   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1077,
    "id": 1077,
    "url": "https://sunnah.com/bukhari:1077",
    "bookNumber": 17,
    "hadithNumber": 11,
    "narrator": "Narrated Rabi`a:",
    "english": "`Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse \nof Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday \n`Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O \npeople! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right \nthing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). \nAdded Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can \ndo it.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ التَّيْمِيِّ ـ قَالَ أَبُو بَكْرٍ وَكَانَ رَبِيعَةُ مِنْ خِيَارِ النَّاسِ عَمَّا حَضَرَ رَبِيعَةُ مِنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَرَأَ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ بِسُورَةِ النَّحْلِ حَتَّى إِذَا جَاءَ السَّجْدَةَ نَزَلَ فَسَجَدَ وَسَجَدَ النَّاسُ، حَتَّى إِذَا كَانَتِ الْجُمُعَةُ الْقَابِلَةُ قَرَأَ بِهَا حَتَّى إِذَا جَاءَ السَّجْدَةَ قَالَ يَا أَيُّهَا النَّاسُ إِنَّا نَمُرُّ بِالسُّجُودِ فَمَنْ سَجَدَ فَقَدْ أَصَابَ، وَمَنْ لَمْ يَسْجُدْ فَلاَ إِثْمَ عَلَيْهِ‏.‏ وَلَمْ يَسْجُدْ عُمَرُ ـ رضى الله عنه‏.‏ وَزَادَ نَافِعٌ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما إِنَّ اللَّهَ لَمْ يَفْرِضِ السُّجُودَ إِلاَّ أَنْ نَشَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1077In-book reference : Book 17, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 183   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1078,
    "id": 1078,
    "url": "https://sunnah.com/bukhari:1078",
    "bookNumber": 17,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Rafi`:",
    "english": "I offered the `Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. \nI said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim and I will do the same till I \nmeet him.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنِي بَكْرٌ، عَنْ أَبِي رَافِعٍ، قَالَ صَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ فَقُلْتُ مَا هَذِهِ قَالَ سَجَدْتُ بِهَا خَلْفَ أَبِي الْقَاسِمِ صلى الله عليه وسلم فَلاَ أَزَالُ أَسْجُدُ فِيهَا حَتَّى أَلْقَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1078In-book reference : Book 17, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 184   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1079,
    "id": 1079,
    "url": "https://sunnah.com/bukhari:1079",
    "bookNumber": 17,
    "hadithNumber": 13,
    "narrator": "Narrated Ibn `Umar.:",
    "english": "Whenever the Prophet (ﷺ) recited the Sura which contained the prostration of recitation he used to \nprostrate and then, we, too, would prostrate and some of us did not find a place for prostration.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، قَالَ أَخْبَرَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ السُّورَةَ الَّتِي فِيهَا السَّجْدَةُ فَيَسْجُدُ وَنَسْجُدُ حَتَّى مَا يَجِدُ أَحَدُنَا مَكَانًا لِمَوْضِعِ جَبْهَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1079In-book reference : Book 17, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 19, Hadith 185   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1080,
    "id": 1080,
    "url": "https://sunnah.com/bukhari:1080",
    "bookNumber": 18,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and \nstayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer \nperiod we used to offer the full prayer.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ، وَحُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم تِسْعَةَ عَشَرَ يَقْصُرُ، فَنَحْنُ إِذَا سَافَرْنَا تِسْعَةَ عَشَرَ قَصَرْنَا، وَإِنْ زِدْنَا أَتْمَمْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1080In-book reference : Book 18, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 186   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1081,
    "id": 1081,
    "url": "https://sunnah.com/bukhari:1081",
    "bookNumber": 18,
    "hadithNumber": 2,
    "narrator": "Narrated Yahya bin 'Is-haq:",
    "english": "I heard Anas saying, \"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for \nevery prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \n\"We stayed in Mecca for ten days.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، فَكَانَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ‏.‏ قُلْتُ أَقَمْتُمْ بِمَكَّةَ شَيْئًا قَالَ أَقَمْنَا بِهَا عَشْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1081In-book reference : Book 18, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 187   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1082,
    "id": 1082,
    "url": "https://sunnah.com/bukhari:1082",
    "bookNumber": 18,
    "hadithNumber": 3,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman \nin the early days of his caliphate did the same, but later on he started praying the full prayer.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَأَبِي بَكْرٍ وَعُمَرَ، وَمَعَ عُثْمَانَ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ أَتَمَّهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1082In-book reference : Book 18, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 188   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1083,
    "id": 1083,
    "url": "https://sunnah.com/bukhari:1083",
    "bookNumber": 18,
    "hadithNumber": 4,
    "narrator": "Narrated Haritha bin Wahab:",
    "english": "The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم آمَنَ مَا كَانَ بِمِنًى رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1083In-book reference : Book 18, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 189   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1084,
    "id": 1084,
    "url": "https://sunnah.com/bukhari:1084",
    "bookNumber": 18,
    "hadithNumber": 5,
    "narrator": "Narrated `Abdur Rahman bin Yazid:",
    "english": "We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed \nabout it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I \nprayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr and with `Umar (during \ntheir caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by \nAllah).\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، يَقُولُ صَلَّى بِنَا عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ بِمِنًى أَرْبَعَ رَكَعَاتٍ، فَقِيلَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ فَاسْتَرْجَعَ ثُمَّ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ أَبِي بَكْرٍ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1084In-book reference : Book 18, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 190   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1085,
    "id": 1085,
    "url": "https://sunnah.com/bukhari:1085",
    "bookNumber": 18,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya \n(O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. \nThe Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those \nwho had Hadi (sacrifice) with them.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ لِصُبْحِ رَابِعَةٍ يُلَبُّونَ بِالْحَجِّ، فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً إِلاَّ مَنْ مَعَهُ الْهَدْىُ‏.‏ تَابَعَهُ عَطَاءٌ عَنْ جَابِرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1085In-book reference : Book 18, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 191   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1086,
    "id": 1086,
    "url": "https://sunnah.com/bukhari:1086",
    "bookNumber": 18,
    "hadithNumber": 7,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram \n(i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own \nhusband.)\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُسَافِرِ الْمَرْأَةُ ثَلاَثَةَ أَيَّامٍ إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1086In-book reference : Book 18, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 192   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1087,
    "id": 1087,
    "url": "https://sunnah.com/bukhari:1087",
    "bookNumber": 18,
    "hadithNumber": 8,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُسَافِرِ الْمَرْأَةُ ثَلاَثًا إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏‏.‏ تَابَعَهُ أَحْمَدُ عَنِ ابْنِ الْمُبَارَكِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1087In-book reference : Book 18, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 193   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1088,
    "id": 1088,
    "url": "https://sunnah.com/bukhari:1088",
    "bookNumber": 18,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day \nto travel for one day and night except with a Mahram.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُسَافِرَ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ لَيْسَ مَعَهَا حُرْمَةٌ ‏\"‏‏.‏ تَابَعَهُ يَحْيَى بْنُ أَبِي كَثِيرٍ وَسُهَيْلٌ وَمَالِكٌ عَنِ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1088In-book reference : Book 18, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 194   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1089,
    "id": 1089,
    "url": "https://sunnah.com/bukhari:1089",
    "bookNumber": 18,
    "hadithNumber": 10,
    "narrator": "Narrated Anas bin Malik:",
    "english": "offered four rak`at of Zuhr prayer with the Prophet (p.b.u.h) at Medina and two rak`at at Dhul-Hulaifa. \n(i.e. shortened the `Asr prayer).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ الظُّهْرَ مَعَ النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ أَرْبَعًا، وَبِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1089In-book reference : Book 18, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 195   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1090,
    "id": 1090,
    "url": "https://sunnah.com/bukhari:1090",
    "bookNumber": 18,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was \nkept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what \nmade Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ الصَّلاَةُ أَوَّلُ مَا فُرِضَتْ رَكْعَتَيْنِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ، وَأُتِمَّتْ صَلاَةُ الْحَضَرِ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ لِعُرْوَةَ مَا بَالُ عَائِشَةَ تُتِمُّ قَالَ تَأَوَّلَتْ مَا تَأَوَّلَ عُثْمَانُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1090In-book reference : Book 18, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 196   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1091,
    "id": 1091,
    "url": "https://sunnah.com/bukhari:1091",
    "bookNumber": 18,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ‏.‏ قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُهُ إِذَا أَعْجَلَهُ السَّيْرُ‏.‏ وَزَادَ اللَّيْثُ قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَالِمٌ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِالْمُزْدَلِفَةِ‏.‏ قَالَ سَالِمٌ وَأَخَّرَ ابْنُ عُمَرَ الْمَغْرِبَ، وَكَانَ اسْتُصْرِخَ عَلَى امْرَأَتِهِ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ فَقُلْتُ لَهُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ فَقُلْتُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ حَتَّى سَارَ مِيلَيْنِ أَوْ ثَلاَثَةً ثُمَّ نَزَلَ فَصَلَّى ثُمَّ قَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي إِذَا أَعْجَلَهُ السَّيْرُ‏.‏ وَقَالَ عَبْدُ اللَّهِ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ يُؤَخِّرُ الْمَغْرِبَ، فَيُصَلِّيهَا ثَلاَثًا ثُمَّ يُسَلِّمُ، ثُمَّ قَلَّمَا يَلْبَثُ حَتَّى يُقِيمَ الْعِشَاءَ فَيُصَلِّيَهَا رَكْعَتَيْنِ ثُمَّ يُسَلِّمُ، وَلاَ يُسَبِّحُ بَعْدَ الْعِشَاءِ حَتَّى يَقُومَ مِنْ جَوْفِ اللَّيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1091, 1092In-book reference : Book 18, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 197   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1092,
    "id": 1092,
    "url": "https://sunnah.com/bukhari:1092",
    "bookNumber": 18,
    "hadithNumber": 12,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ‏.‏ قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُهُ إِذَا أَعْجَلَهُ السَّيْرُ‏.‏ وَزَادَ اللَّيْثُ قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَالِمٌ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِالْمُزْدَلِفَةِ‏.‏ قَالَ سَالِمٌ وَأَخَّرَ ابْنُ عُمَرَ الْمَغْرِبَ، وَكَانَ اسْتُصْرِخَ عَلَى امْرَأَتِهِ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ فَقُلْتُ لَهُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ فَقُلْتُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ حَتَّى سَارَ مِيلَيْنِ أَوْ ثَلاَثَةً ثُمَّ نَزَلَ فَصَلَّى ثُمَّ قَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي إِذَا أَعْجَلَهُ السَّيْرُ‏.‏ وَقَالَ عَبْدُ اللَّهِ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ يُؤَخِّرُ الْمَغْرِبَ، فَيُصَلِّيهَا ثَلاَثًا ثُمَّ يُسَلِّمُ، ثُمَّ قَلَّمَا يَلْبَثُ حَتَّى يُقِيمَ الْعِشَاءَ فَيُصَلِّيَهَا رَكْعَتَيْنِ ثُمَّ يُسَلِّمُ، وَلاَ يُسَبِّحُ بَعْدَ الْعِشَاءِ حَتَّى يَقُومَ مِنْ جَوْفِ اللَّيْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1091, 1092In-book reference : Book 18, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 197   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1093,
    "id": 1093,
    "url": "https://sunnah.com/bukhari:1093",
    "bookNumber": 18,
    "hadithNumber": 13,
    "narrator": "Narrated `Abdullah bin 'Amir from his father who said:",
    "english": "I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي عَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1093In-book reference : Book 18, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 198   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1094,
    "id": 1094,
    "url": "https://sunnah.com/bukhari:1094",
    "bookNumber": 18,
    "hadithNumber": 14,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي التَّطَوُّعَ وَهْوَ رَاكِبٌ فِي غَيْرِ الْقِبْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1094In-book reference : Book 18, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 199   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1095,
    "id": 1095,
    "url": "https://sunnah.com/bukhari:1095",
    "bookNumber": 18,
    "hadithNumber": 15,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said \nthat the Prophet (ﷺ) used to do so.",
    "arabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُصَلِّي عَلَى رَاحِلَتِهِ وَيُوتِرُ عَلَيْهَا، وَيُخْبِرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1095In-book reference : Book 18, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 200   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1096,
    "id": 1096,
    "url": "https://sunnah.com/bukhari:1096",
    "bookNumber": 18,
    "hadithNumber": 16,
    "narrator": "Narrated `Abdullah bin Dinar:",
    "english": "On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction \nit took. `Abdullah said that the Prophet (ﷺ) used to do so.",
    "arabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ يُصَلِّي فِي السَّفَرِ عَلَى رَاحِلَتِهِ، أَيْنَمَا تَوَجَّهَتْ يُومِئُ‏.‏ وَذَكَرَ عَبْدُ اللَّهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1096In-book reference : Book 18, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 201   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1097,
    "id": 1097,
    "url": "https://sunnah.com/bukhari:1097",
    "bookNumber": 18,
    "hadithNumber": 17,
    "narrator": "Narrated 'Amir bin Rabi`a:",
    "english": "I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but \nAllah's Messenger (ﷺ) never did the same in offering the compulsory prayers.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عَامِرَ بْنَ رَبِيعَةَ، أَخْبَرَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ عَلَى الرَّاحِلَةِ يُسَبِّحُ، يُومِئُ بِرَأْسِهِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهَ، وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ فِي الصَّلاَةِ الْمَكْتُوبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1097In-book reference : Book 18, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1098,
    "id": 1098,
    "url": "https://sunnah.com/bukhari:1098",
    "bookNumber": 18,
    "hadithNumber": 18,
    "narrator": "Narrated Salim:",
    "english": "At night \n`Abdullah bin `Umar used to offer the prayer on the back of his animal during the journey and never \ncared about the direction he faced. Ibn `Umar said, \"Allah's Messenger (ﷺ) used to offer the optional prayer \non the back of his Mount facing any direction and also used to pray the witr on it but never offered the \ncompulsory prayer on it.\"",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمٌ كَانَ عَبْدُ اللَّهِ يُصَلِّي عَلَى دَابَّتِهِ مِنَ اللَّيْلِ وَهْوَ مُسَافِرٌ، مَا يُبَالِي حَيْثُ مَا كَانَ وَجْهُهُ‏.‏ قَالَ ابْنُ عُمَرَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَبِّحُ عَلَى الرَّاحِلَةِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهَ، وَيُوتِرُ عَلَيْهَا، غَيْرَ أَنَّهُ لاَ يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1098In-book reference : Book 18, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1099,
    "id": 1099,
    "url": "https://sunnah.com/bukhari:1099",
    "bookNumber": 18,
    "hadithNumber": 19,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the \ncompulsory prayer, he used to dismount and face the Qibla.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، قَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ فَإِذَا أَرَادَ أَنْ يُصَلِّيَ الْمَكْتُوبَةَ نَزَلَ فَاسْتَقْبَلَ الْقِبْلَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1099In-book reference : Book 18, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 203   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1100,
    "id": 1100,
    "url": "https://sunnah.com/bukhari:1100",
    "bookNumber": 18,
    "hadithNumber": 20,
    "narrator": "Narrated Anas bin Seereen:",
    "english": "We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- \nTamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the \nQibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" \nHe replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ اسْتَقْبَلْنَا أَنَسًا حِينَ قَدِمَ مِنَ الشَّأْمِ، فَلَقِينَاهُ بِعَيْنِ التَّمْرِ، فَرَأَيْتُهُ يُصَلِّي عَلَى حِمَارٍ وَوَجْهُهُ مِنْ ذَا الْجَانِبِ، يَعْنِي عَنْ يَسَارِ الْقِبْلَةِ‏.‏ فَقُلْتُ رَأَيْتُكَ تُصَلِّي لِغَيْرِ الْقِبْلَةِ‏.‏ فَقَالَ لَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَهُ لَمْ أَفْعَلْهُ‏.‏ رَوَاهُ ابْنُ طَهْمَانَ عَنْ حَجَّاجٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1100In-book reference : Book 18, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 20, Hadith 204   (deprecated numbering scheme)"
  }
]