[
  {
    "hadithGlobalNumber": 201,
    "id": 201,
    "url": "https://sunnah.com/bukhari:201",
    "bookNumber": 4,
    "hadithNumber": 67,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and \nused to perform ablution with one Mudd of water.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مِسْعَرٌ، قَالَ حَدَّثَنِي ابْنُ جَبْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَغْسِلُ ـ أَوْ كَانَ يَغْتَسِلُ ـ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ، وَيَتَوَضَّأُ بِالْمُدِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 201In-book reference : Book 4, Hadith 67USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 200   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 202,
    "id": 202,
    "url": "https://sunnah.com/bukhari:202",
    "bookNumber": 4,
    "hadithNumber": 68,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Sa`d bin Abi Waqqas said, \"The Prophet (ﷺ) passed wet hands over his Khuffs (socks made from thick \nfabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and \nadded, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about \nit.\"",
    "arabic": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ الْمِصْرِيُّ، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنِي عَمْرٌو، حَدَّثَنِي أَبُو النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَسَحَ عَلَى الْخُفَّيْنِ‏.‏ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ سَأَلَ عُمَرَ عَنْ ذَلِكَ فَقَالَ نَعَمْ إِذَا حَدَّثَكَ شَيْئًا سَعْدٌ عَنِ النَّبِيِّ صلى الله عليه وسلم فَلاَ تَسْأَلْ عَنْهُ غَيْرَهُ‏.‏ وَقَالَ مُوسَى بْنُ عُقْبَةَ أَخْبَرَنِي أَبُو النَّضْرِ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ سَعْدًا حَدَّثَهُ فَقَالَ عُمَرُ لِعَبْدِ اللَّهِ‏.‏ نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 202In-book reference : Book 4, Hadith 68USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 201   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 203,
    "id": 203,
    "url": "https://sunnah.com/bukhari:203",
    "bookNumber": 4,
    "hadithNumber": 69,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "Once Allah's Messenger (ﷺ) went out to answer the call of nature and I followed him with a tumbler \ncontaining water, and when he finished, I poured water and he performed ablution and passed wet \nhands over his Khuffs (socks made from thick fabric or leather).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ خَرَجَ لِحَاجَتِهِ فَاتَّبَعَهُ الْمُغِيرَةُ بِإِدَاوَةٍ فِيهَا مَاءٌ، فَصَبَّ عَلَيْهِ حِينَ فَرَغَ مِنْ حَاجَتِهِ، فَتَوَضَّأَ وَمَسَحَ عَلَى الْخُفَّيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 203In-book reference : Book 4, Hadith 69USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 204,
    "id": 204,
    "url": "https://sunnah.com/bukhari:204",
    "bookNumber": 4,
    "hadithNumber": 70,
    "narrator": "Narrated Ja`far bin `Amr bin Umaiya Ad-Damri:",
    "english": "My father said, \"I saw the Prophet (ﷺ) passing wet hands over his Khuffs (socks made from thick fabric or \nleather).\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَمْسَحُ عَلَى الْخُفَّيْنِ‏.‏ وَتَابَعَهُ حَرْبُ بْنُ شَدَّادٍ وَأَبَانُ عَنْ يَحْيَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 204In-book reference : Book 4, Hadith 70USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 203   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 205,
    "id": 205,
    "url": "https://sunnah.com/bukhari:205",
    "bookNumber": 4,
    "hadithNumber": 71,
    "narrator": "Narrated Ja`far bin `Amr:",
    "english": "My father said, \"I saw the Prophet (ﷺ) passing wet hands over his turban and Khuffs (socks made from \nthick fabric or leather).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَعْفَرِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَمْسَحُ عَلَى عِمَامَتِهِ وَخُفَّيْهِ‏.‏ وَتَابَعَهُ مَعْمَرٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ عَمْرٍو قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 205In-book reference : Book 4, Hadith 71USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 204   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 206,
    "id": 206,
    "url": "https://sunnah.com/bukhari:206",
    "bookNumber": 4,
    "hadithNumber": 72,
    "narrator": "Narrated `Urwa bin Al-Mughira:",
    "english": "My father said, \"Once I was in the company of the Prophet (ﷺ) on a journey and I dashed to take off his \nKhuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them \nafter performing ablution. So he passed wet hands over them.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ فَقَالَ ‏\n\"‏ دَعْهُمَا، فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ ‏\"‏‏.‏ فَمَسَحَ عَلَيْهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 206In-book reference : Book 4, Hadith 72USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 205   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 207,
    "id": 207,
    "url": "https://sunnah.com/bukhari:207",
    "bookNumber": 4,
    "hadithNumber": 73,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) ate a piece of cooked mutton from the shoulder region and prayed without repeating \nablution.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 207In-book reference : Book 4, Hadith 73USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 206   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 208,
    "id": 208,
    "url": "https://sunnah.com/bukhari:208",
    "bookNumber": 4,
    "hadithNumber": 74,
    "narrator": "Narrated Ja`far bin `Amr bin Umaiya:",
    "english": "My father said, \"I saw Allah's Messenger (ﷺ) taking a piece of (cooked) mutton from the shoulder region and \nthen he was called for prayer. He put his knife down and prayed without repeating ablution.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَى السِّكِّينَ فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 208In-book reference : Book 4, Hadith 74USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 209,
    "id": 209,
    "url": "https://sunnah.com/bukhari:209",
    "bookNumber": 4,
    "hadithNumber": 75,
    "narrator": "Narrated Suwaid bin Al-Nu`man:",
    "english": "In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached Sahba, a place near \nKhaibar, where Allah's Messenger (ﷺ) offered the `Asr prayer and asked for food. Nothing but saweeq  \nwas brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet (ﷺ) got up \nfor the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he \nthen prayed without repeating the ablution.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ أَنَّ سُوَيْدَ بْنَ النُّعْمَانِ، أَخْبَرَهُ‏.‏ أَنَّهُ، خَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ ـ وَهِيَ أَدْنَى خَيْبَرَ ـ فَصَلَّى الْعَصْرَ، ثُمَّ دَعَا بِالأَزْوَادِ، فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ، فَأَمَرَ بِهِ فَثُرِّيَ، فَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَكَلْنَا، ثُمَّ قَامَ إِلَى الْمَغْرِبِ، فَمَضْمَضَ وَمَضْمَضْنَا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 209In-book reference : Book 4, Hadith 75USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 210,
    "id": 210,
    "url": "https://sunnah.com/bukhari:210",
    "bookNumber": 4,
    "hadithNumber": 76,
    "narrator": "Narrated Maimuna:",
    "english": "The Prophet (ﷺ) ate (a piece of) mutton from the shoulder region and then prayed without repeating the \nablution.",
    "arabic": "وَحَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عِنْدَهَا كَتِفًا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 210In-book reference : Book 4, Hadith 76USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 211,
    "id": 211,
    "url": "https://sunnah.com/bukhari:211",
    "bookNumber": 4,
    "hadithNumber": 77,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) drank milk, rinsed his mouth and said, \"It has fat.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شَرِبَ لَبَنًا، فَمَضْمَضَ وَقَالَ ‏\n\"‏ إِنَّ لَهُ دَسَمًا ‏\"‏‏.‏\nتَابَعَهُ يُونُسُ وَصَالِحُ بْنُ كَيْسَانَ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 211In-book reference : Book 4, Hadith 77USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 212,
    "id": 212,
    "url": "https://sunnah.com/bukhari:212",
    "bookNumber": 4,
    "hadithNumber": 78,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his \nslumber is over because in praying while drowsy one does not know whether one is asking for \nforgiveness or for a bad thing for oneself.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ وَهُوَ يُصَلِّي فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ، فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لاَ يَدْرِي لَعَلَّهُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 212In-book reference : Book 4, Hadith 78USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 213,
    "id": 213,
    "url": "https://sunnah.com/bukhari:213",
    "bookNumber": 4,
    "hadithNumber": 79,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"If anyone of you feels drowsy while praying, he should sleep till he understands \nwhat he is saying (reciting).",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَنَمْ حَتَّى يَعْلَمَ مَا يَقْرَأُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 213In-book reference : Book 4, Hadith 79USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 212   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 214,
    "id": 214,
    "url": "https://sunnah.com/bukhari:214",
    "bookNumber": 4,
    "hadithNumber": 80,
    "narrator": "Narrated `Amr bin `Amir:",
    "english": "Anas said, \"The Prophet (ﷺ) used to perform ablution for every prayer.\" I asked Anas, \"What did you used to \ndo?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ عَامِرٍ، قَالَ سَمِعْتُ أَنَسًا، ح قَالَ وَحَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ عَامِرٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَوَضَّأُ عِنْدَ كُلِّ صَلاَةٍ‏.‏ قُلْتُ كَيْفَ كُنْتُمْ تَصْنَعُونَ قَالَ يُجْزِئُ أَحَدَنَا الْوُضُوءُ مَا لَمْ يُحْدِثْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 214In-book reference : Book 4, Hadith 80USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 215,
    "id": 215,
    "url": "https://sunnah.com/bukhari:215",
    "bookNumber": 4,
    "hadithNumber": 81,
    "narrator": "Narrated Suwaid bin Nu`man:",
    "english": "In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached As-Sahba' where \nAllah's Messenger (ﷺ) led the `Asr prayer and asked for the food. Nothing but saweeq was brought and \nwe ate it and drank (water). The Prophet (ﷺ) got up for the (Maghrib) Prayer, rinsed his mouth with water \nand then led the prayer without repeating the ablution.",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، قَالَ أَخْبَرَنِي سُوَيْدُ بْنُ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ، صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا صَلَّى دَعَا بِالأَطْعِمَةِ، فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ، فَأَكَلْنَا وَشَرِبْنَا، ثُمَّ قَامَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَغْرِبِ فَمَضْمَضَ، ثُمَّ صَلَّى لَنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 215In-book reference : Book 4, Hadith 81USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 214   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 216,
    "id": 216,
    "url": "https://sunnah.com/bukhari:216",
    "bookNumber": 4,
    "hadithNumber": 82,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices \nof two persons who were being tortured in their graves. The Prophet (ﷺ) said, \"These two persons are \nbeing tortured not for a major sin (to avoid).\" The Prophet (ﷺ) then added, \"Yes! (they are being tortured \nfor a major sin). Indeed, one of them never saved himself from being soiled with his urine while the \nother used to go about with calumnies (to make enmity between friends). The Prophet (ﷺ) then asked for a \ngreen leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why \nhe had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِحَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ أَوْ مَكَّةَ، فَسَمِعَ صَوْتَ إِنْسَانَيْنِ يُعَذَّبَانِ فِي قُبُورِهِمَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ ‏\"‏، ثُمَّ قَالَ ‏\"‏ بَلَى، كَانَ أَحَدُهُمَا لاَ يَسْتَتِرُ مِنْ بَوْلِهِ، وَكَانَ الآخَرُ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِجَرِيدَةٍ فَكَسَرَهَا كِسْرَتَيْنِ، فَوَضَعَ عَلَى كُلِّ قَبْرٍ مِنْهُمَا كِسْرَةً‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ لِمَ فَعَلْتَ هَذَا قَالَ ‏\"‏ لَعَلَّهُ أَنْ يُخَفَّفَ عَنْهُمَا مَا لَمْ تَيْبَسَا أَوْ إِلَى أَنْ يَيْبَسَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 216In-book reference : Book 4, Hadith 82USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 215   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 217,
    "id": 217,
    "url": "https://sunnah.com/bukhari:217",
    "bookNumber": 4,
    "hadithNumber": 83,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Whenever the Prophet (ﷺ) went to answer the call of nature, I used to bring water with which he used to \nclean his private parts.",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي رَوْحُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي مَيْمُونَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا تَبَرَّزَ لِحَاجَتِهِ أَتَيْتُهُ بِمَاءٍ فَيَغْسِلُ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 217In-book reference : Book 4, Hadith 83USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 216   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 218,
    "id": 218,
    "url": "https://sunnah.com/bukhari:218",
    "bookNumber": 4,
    "hadithNumber": 84,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) once passed by two graves and said, \"These two persons are being tortured not for a \nmajor sin (to avoid). One of them never saved himself from being soiled with his urine, while the \nother used to go about with calumnies (to make enmity between friends).\" The Prophet (ﷺ) then took a \ngreen leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's \nApostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till \nthese (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِقَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لاَ يَسْتَتِرُ مِنَ الْبَوْلِ، وَأَمَّا الآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ أَخَذَ جَرِيدَةً رَطْبَةً، فَشَقَّهَا نِصْفَيْنِ، فَغَرَزَ فِي كُلِّ قَبْرٍ وَاحِدَةً‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، لِمَ فَعَلْتَ هَذَا قَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏ قَالَ ابْنُ الْمُثَنَّى وَحَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الأَعْمَشُ قَالَ سَمِعْتُ مُجَاهِدًا مِثْلَهُ ‏\"‏ يَسْتَتِرُ مِنْ بَوْلِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 218In-book reference : Book 4, Hadith 84USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 217   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 219,
    "id": 219,
    "url": "https://sunnah.com/bukhari:219",
    "bookNumber": 4,
    "hadithNumber": 85,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) saw a Bedouin making water in the mosque and told the people not to disturb him. When \nhe finished, the Prophet (ﷺ) asked for some water and poured it over (the urine).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، أَخْبَرَنَا إِسْحَاقُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى أَعْرَابِيًّا يَبُولُ فِي الْمَسْجِدِ فَقَالَ ‏\n\"‏ دَعُوهُ ‏\"‏‏.‏ حَتَّى إِذَا فَرَغَ دَعَا بِمَاءٍ فَصَبَّهُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 219In-book reference : Book 4, Hadith 85USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 218   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 220,
    "id": 220,
    "url": "https://sunnah.com/bukhari:220",
    "bookNumber": 4,
    "hadithNumber": 86,
    "narrator": "Narrated Abu Huraira:",
    "english": "A Bedouin stood up and started making water in the mosque. The people caught him but the Prophet (ﷺ) \nordered them to leave him and to pour a bucket or a tumbler of water over the place where he had \npassed the urine. The Prophet (ﷺ) then said, \"You have been sent to make things easy and not to make \nthem difficult.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَامَ أَعْرَابِيٌّ فَبَالَ فِي الْمَسْجِدِ فَتَنَاوَلَهُ النَّاسُ، فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ دَعُوهُ وَهَرِيقُوا عَلَى بَوْلِهِ سَجْلاً مِنْ مَاءٍ، أَوْ ذَنُوبًا مِنْ مَاءٍ، فَإِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ، وَلَمْ تُبْعَثُوا مُعَسِّرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 220In-book reference : Book 4, Hadith 86USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 221,
    "id": 221,
    "url": "https://sunnah.com/bukhari:221",
    "bookNumber": 4,
    "hadithNumber": 87,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said as above (219).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 221In-book reference : Book 4, Hadith 87USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 222,
    "id": 222,
    "url": "https://sunnah.com/bukhari:222",
    "bookNumber": 4,
    "hadithNumber": 88,
    "narrator": "Narrated `Aisha:",
    "english": "(the mother of faithful believers) A child was brought to Allah's Messenger (ﷺ) and it urinated on the \ngarment of the Prophet. The Prophet (ﷺ) asked for water and poured it over the soiled place.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَبِيٍّ، فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَأَتْبَعَهُ إِيَّاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 222In-book reference : Book 4, Hadith 88USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 223,
    "id": 223,
    "url": "https://sunnah.com/bukhari:223",
    "bookNumber": 4,
    "hadithNumber": 89,
    "narrator": "Narrated Um Qais bint Mihsin:",
    "english": "I brought my young son, who had not started eating (ordinary food) to Allah's Messenger (ﷺ) who took him \nand made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water \nand poured it over the soiled (area) and did not wash it.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ، لَمْ يَأْكُلِ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، فَأَجْلَسَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حِجْرِهِ، فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَنَضَحَهُ وَلَمْ يَغْسِلْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 223In-book reference : Book 4, Hadith 89USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 224,
    "id": 224,
    "url": "https://sunnah.com/bukhari:224",
    "bookNumber": 4,
    "hadithNumber": 90,
    "narrator": "Narrated Hudhaifa:",
    "english": "Once the Prophet (ﷺ) went to the dumps of some people and passed urine while standing. He then asked \nfor water and so I brought it to him and he performed ablution.",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم سُبَاطَةَ قَوْمٍ فَبَالَ قَائِمًا، ثُمَّ دَعَا بِمَاءٍ، فَجِئْتُهُ بِمَاءٍ فَتَوَضَّأَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 224In-book reference : Book 4, Hadith 90USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 225,
    "id": 225,
    "url": "https://sunnah.com/bukhari:225",
    "bookNumber": 4,
    "hadithNumber": 91,
    "narrator": "Narrated Hudhaifa':",
    "english": "The Prophet (ﷺ) and I walked till we reached the dumps of some people. He stood, as any one of you \nstands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him \nand stood near his back till he finished.",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ رَأَيْتُنِي أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم نَتَمَاشَى، فَأَتَى سُبَاطَةَ قَوْمٍ خَلْفَ حَائِطٍ، فَقَامَ كَمَا يَقُومُ أَحَدُكُمْ فَبَالَ، فَانْتَبَذْتُ مِنْهُ، فَأَشَارَ إِلَىَّ فَجِئْتُهُ، فَقُمْتُ عِنْدَ عَقِبِهِ حَتَّى فَرَغَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 225In-book reference : Book 4, Hadith 91USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 226,
    "id": 226,
    "url": "https://sunnah.com/bukhari:226",
    "bookNumber": 4,
    "hadithNumber": 92,
    "narrator": "Narrated Abu Wail:",
    "english": "Abu Musa Al-Ash`ari used to lay great stress on the question of urination and he used to say, \"If \nanyone from Bani Israel happened to soil his clothes with urine, he used to cut that portion away.\" \nHearing that, Hudhaifa said to Abu Wail, \"I wish he (Abu Musa) didn't (lay great stress on that \nmatter).\" Hudhaifa added, \"Allah's Messenger (ﷺ) went to the dumps of some people and urinated while \nstanding.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ كَانَ أَبُو مُوسَى الأَشْعَرِيُّ يُشَدِّدُ فِي الْبَوْلِ وَيَقُولُ إِنَّ بَنِي إِسْرَائِيلَ كَانَ إِذَا أَصَابَ ثَوْبَ أَحَدِهِمْ قَرَضَهُ‏.‏ فَقَالَ حُذَيْفَةُ لَيْتَهُ أَمْسَكَ، أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم سُبَاطَةَ قَوْمٍ فَبَالَ قَائِمًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 226In-book reference : Book 4, Hadith 92USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 227,
    "id": 227,
    "url": "https://sunnah.com/bukhari:227",
    "bookNumber": 4,
    "hadithNumber": 93,
    "narrator": "Narrated Asma':",
    "english": "A woman came to the Prophet (ﷺ) and said, \"If anyone of us gets menses in her clothes then what should \nshe do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it \nin order to remove the traces of blood and then pour water over it. Then she can pray in it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَتْنِي فَاطِمَةُ، عَنْ أَسْمَاءَ، قَالَتْ جَاءَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ أَرَأَيْتَ إِحْدَانَا تَحِيضُ فِي الثَّوْبِ كَيْفَ تَصْنَعُ قَالَ ‏\n\"‏ تَحُتُّهُ، ثُمَّ تَقْرُصُهُ بِالْمَاءِ، وَتَنْضَحُهُ وَتُصَلِّي فِيهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 227In-book reference : Book 4, Hadith 93USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 228,
    "id": 228,
    "url": "https://sunnah.com/bukhari:228",
    "bookNumber": 4,
    "hadithNumber": 94,
    "narrator": "Narrated `Aisha:",
    "english": "Fatima bint Abi Hubaish came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ) I get persistent bleeding \nfrom the uterus and do not become clean. Shall I give up my prayers?\" Allah's Messenger (ﷺ) replied, \"No, \nbecause it is from a blood vessel and not the menses. So when your real menses begins give up your \nprayers and when it has finished wash off the blood (take a bath) and offer your prayers.\" Hisham (the \nsub narrator) narrated that his father had also said, (the Prophet (ﷺ) told her): \"Perform ablution for every \nprayer till the time of the next period comes.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ فَاطِمَةُ ابْنَةُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلاَ أَطْهُرُ، أَفَأَدَعُ الصَّلاَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ، إِنَّمَا ذَلِكِ عِرْقٌ، وَلَيْسَ بِحَيْضٍ، فَإِذَا أَقْبَلَتْ حَيْضَتُكِ فَدَعِي الصَّلاَةَ، وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ ثُمَّ صَلِّي ‏\"‏‏.‏ قَالَ وَقَالَ أَبِي ‏\"‏ ثُمَّ تَوَضَّئِي لِكُلِّ صَلاَةٍ، حَتَّى يَجِيءَ ذَلِكَ الْوَقْتُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 228In-book reference : Book 4, Hadith 94USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 229,
    "id": 229,
    "url": "https://sunnah.com/bukhari:229",
    "bookNumber": 4,
    "hadithNumber": 95,
    "narrator": "Narrated `Aisha:",
    "english": "I used to wash the traces of Janaba (semen) from the clothes of the Prophet (ﷺ) and he used to go for \nprayers while traces of water were still on it (water spots were still visible).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عَمْرُو بْنُ مَيْمُونٍ الْجَزَرِيُّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْسِلُ الْجَنَابَةَ مِنْ ثَوْبِ النَّبِيِّ صلى الله عليه وسلم، فَيَخْرُجُ إِلَى الصَّلاَةِ، وَإِنَّ بُقَعَ الْمَاءِ فِي ثَوْبِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 229In-book reference : Book 4, Hadith 95USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 230,
    "id": 230,
    "url": "https://sunnah.com/bukhari:230",
    "bookNumber": 4,
    "hadithNumber": 96,
    "narrator": "Narrated Sulaiman bin Yasar:",
    "english": "I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of \nAllah's Messenger (ﷺ) and he would go for the prayer while water spots were still visible. \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا عَمْرٌو، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ عَائِشَةَ، ح وَحَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْمَنِيِّ، يُصِيبُ الثَّوْبَ فَقَالَتْ كُنْتُ أَغْسِلُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَيَخْرُجُ إِلَى الصَّلاَةِ وَأَثَرُ الْغَسْلِ فِي ثَوْبِهِ بُقَعُ الْمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 230In-book reference : Book 4, Hadith 96USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 231,
    "id": 231,
    "url": "https://sunnah.com/bukhari:231",
    "bookNumber": 4,
    "hadithNumber": 97,
    "narrator": "Narrated `Amr bin Maimun:",
    "english": "I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \n\"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayers while water spots \nwere still visible on them.",
    "arabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونٍ، قَالَ سَأَلْتُ سُلَيْمَانَ بْنَ يَسَارٍ فِي الثَّوْبِ تُصِيبُهُ الْجَنَابَةُ قَالَ قَالَتْ عَائِشَةُ كُنْتُ أَغْسِلُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم، ثُمَّ يَخْرُجُ إِلَى الصَّلاَةِ وَأَثَرُ الْغَسْلِ فِيهِ بُقَعُ الْمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 231In-book reference : Book 4, Hadith 97USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 232,
    "id": 232,
    "url": "https://sunnah.com/bukhari:232",
    "bookNumber": 4,
    "hadithNumber": 98,
    "narrator": "Narrated `Aishah:",
    "english": "I used \nto wash the semen off the clothes of the\nProphet (ﷺ) and even then I used to notice\none or more spots on them.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَغْسِلُ الْمَنِيَّ مِنْ ثَوْبِ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ أَرَاهُ فِيهِ بُقْعَةً أَوْ بُقَعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 232In-book reference : Book 4, Hadith 98USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 233,
    "id": 233,
    "url": "https://sunnah.com/bukhari:233",
    "bookNumber": 4,
    "hadithNumber": 99,
    "narrator": "Narrated Abu Qilaba:",
    "english": "Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So \nthe Prophet (ﷺ) ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a \nmedicine). So they went as directed and after they became healthy, they killed the shepherd of the \nProphet and drove away all the camels. The news reached the Prophet (ﷺ) early in the morning and he \nsent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their \nhands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were \nput in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \n\"Those people committed theft and murder, became infidels after embracing Islam and fought against \nAllah and His Apostle .\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ قَدِمَ أُنَاسٌ مِنْ عُكْلٍ أَوْ عُرَيْنَةَ، فَاجْتَوَوُا الْمَدِينَةَ، فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم بِلِقَاحٍ، وَأَنْ يَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَانْطَلَقُوا، فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم وَاسْتَاقُوا النَّعَمَ، فَجَاءَ الْخَبَرُ فِي أَوَّلِ النَّهَارِ، فَبَعَثَ فِي آثَارِهِمْ، فَلَمَّا ارْتَفَعَ النَّهَارُ جِيءَ بِهِمْ، فَأَمَرَ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسُمِرَتْ أَعْيُنُهُمْ، وَأُلْقُوا فِي الْحَرَّةِ يَسْتَسْقُونَ فَلاَ يُسْقَوْنَ‏.‏ \nقَالَ أَبُو قِلاَبَةَ فَهَؤُلاَءِ سَرَقُوا وَقَتَلُوا وَكَفَرُوا بَعْدَ إِيمَانِهِمْ، وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 233In-book reference : Book 4, Hadith 99USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 234,
    "id": 234,
    "url": "https://sunnah.com/bukhari:234",
    "bookNumber": 4,
    "hadithNumber": 100,
    "narrator": "Narrated Anas:",
    "english": "Prior to the construction of the mosque, the Prophet (ﷺ) offered the prayers at sheep-folds.",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنَا أَبُو التَّيَّاحِ، يَزِيدُ بْنُ حُمَيْدٍ عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي قَبْلَ أَنْ يُبْنَى الْمَسْجِدُ فِي مَرَابِضِ الْغَنَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 234In-book reference : Book 4, Hadith 100USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 235,
    "id": 235,
    "url": "https://sunnah.com/bukhari:235",
    "bookNumber": 4,
    "hadithNumber": 101,
    "narrator": "Narrated Maimuna:",
    "english": "Allah's Messenger (ﷺ) was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \n\"Take out the mouse and throw away the ghee around it and use the rest.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ فَأْرَةٍ سَقَطَتْ فِي سَمْنٍ فَقَالَ ‏\n\"‏ أَلْقُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ‏.‏ وَكُلُوا سَمْنَكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 235In-book reference : Book 4, Hadith 101USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 236,
    "id": 236,
    "url": "https://sunnah.com/bukhari:236",
    "bookNumber": 4,
    "hadithNumber": 102,
    "narrator": "Narrated Maimuna:",
    "english": "The Prophet (ﷺ) was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and \nthrow away the ghee around it (and use the rest.)\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ فَأْرَةٍ سَقَطَتْ فِي سَمْنٍ فَقَالَ ‏\n\"‏ خُذُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ ‏\"‏‏.‏ قَالَ مَعْنٌ حَدَّثَنَا مَالِكٌ مَا لاَ أُحْصِيهِ يَقُولُ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 236In-book reference : Book 4, Hadith 102USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 237   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 237,
    "id": 237,
    "url": "https://sunnah.com/bukhari:237",
    "bookNumber": 4,
    "hadithNumber": 103,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of \nResurrection as it was at the time of infliction; blood will be flowing from the wound and its color will \nbe that of the blood but will smell like musk.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّ كَلْمٍ يُكْلَمُهُ الْمُسْلِمُ فِي سَبِيلِ اللَّهِ يَكُونُ يَوْمَ الْقِيَامَةِ كَهَيْئَتِهَا إِذْ طُعِنَتْ، تَفَجَّرُ دَمًا، اللَّوْنُ لَوْنُ الدَّمِ، وَالْعَرْفُ عَرْفُ الْمِسْكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 237In-book reference : Book 4, Hadith 103USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 238,
    "id": 238,
    "url": "https://sunnah.com/bukhari:238",
    "bookNumber": 4,
    "hadithNumber": 104,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (people to come in the world) but (will be) the \nforemost (on the Day of Resurrection).\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ أَخْبَرَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 238In-book reference : Book 4, Hadith 104USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 239,
    "id": 239,
    "url": "https://sunnah.com/bukhari:239",
    "bookNumber": 4,
    "hadithNumber": 105,
    "narrator": "The same narrator said that the Prophet (ﷺ) had said:",
    "english": "\"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"",
    "arabic": "وَبِإِسْنَادِهِ قَالَ ‏\n\"‏ لاَ يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ الَّذِي لاَ يَجْرِي، ثُمَّ يَغْتَسِلُ فِيهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 239In-book reference : Book 4, Hadith 105USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 240,
    "id": 240,
    "url": "https://sunnah.com/bukhari:240",
    "bookNumber": 4,
    "hadithNumber": 106,
    "narrator": "Narrated `Abdullah:",
    "english": "While Allah's Messenger (ﷺ) was prostrating (as stated below).\n\n\nNarrated `Abdullah bin Mas`ud:\n\nOnce the Prophet (ﷺ) was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his \ncompanions. One of them said to the others, \"Who amongst you will bring the Abdominal contents \n(intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he \nprostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet (ﷺ) prostrated \nand then placed it on his back between his shoulders. I was watching but could not do any thing. I \nwish I had some people with me to hold out against them. They started laughing and falling on one \nanother. Allah's Messenger (ﷺ) was in prostration and he did not lift his head up till Fatima (Prophet's \ndaughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head \nand said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the \nProphet invoked Allah against them as they had a conviction that the prayers and invocations were \naccepted in this city (Mecca). The Prophet (ﷺ) said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba \nbin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned \nthe seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies \nof those persons who were counted by Allah's Messenger (ﷺ) in the Qalib (one of the wells) of Badr.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم سَاجِدٌ ح قَالَ وَحَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ قَالَ حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ قَالَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي عِنْدَ الْبَيْتِ، وَأَبُو جَهْلٍ وَأَصْحَابٌ لَهُ جُلُوسٌ، إِذْ قَالَ بَعْضُهُمْ لِبَعْضٍ أَيُّكُمْ يَجِيءُ بِسَلَى جَزُورِ بَنِي فُلاَنٍ فَيَضَعُهُ عَلَى ظَهْرِ مُحَمَّدٍ إِذَا سَجَدَ فَانْبَعَثَ أَشْقَى الْقَوْمِ فَجَاءَ بِهِ، فَنَظَرَ حَتَّى إِذَا سَجَدَ النَّبِيُّ صلى الله عليه وسلم وَضَعَهُ عَلَى ظَهْرِهِ بَيْنَ كَتِفَيْهِ وَأَنَا أَنْظُرُ، لاَ أُغَيِّرُ شَيْئًا، لَوْ كَانَ لِي مَنْعَةٌ‏.‏ قَالَ فَجَعَلُوا يَضْحَكُونَ وَيُحِيلُ بَعْضُهُمْ عَلَى بَعْضٍ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم سَاجِدٌ لاَ يَرْفَعُ رَأْسَهُ، حَتَّى جَاءَتْهُ فَاطِمَةُ، فَطَرَحَتْ عَنْ ظَهْرِهِ، فَرَفَعَ رَأْسَهُ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ، فَشَقَّ عَلَيْهِمْ إِذْ دَعَا عَلَيْهِمْ ـ قَالَ وَكَانُوا يُرَوْنَ أَنَّ الدَّعْوَةَ فِي ذَلِكَ الْبَلَدِ مُسْتَجَابَةٌ ـ ثُمَّ سَمَّى ‏\"‏ اللَّهُمَّ عَلَيْكَ بِأَبِي جَهْلٍ، وَعَلَيْكَ بِعُتْبَةَ بْنِ رَبِيعَةَ، وَشَيْبَةَ بْنِ رَبِيعَةَ، وَالْوَلِيدِ بْنِ عُتْبَةَ، وَأُمَيَّةَ بْنِ خَلَفٍ، وَعُقْبَةَ بْنِ أَبِي مُعَيْطٍ ‏\"‏‏.‏ وَعَدَّ السَّابِعَ فَلَمْ يَحْفَظْهُ قَالَ فَوَالَّذِي نَفْسِي بِيَدِهِ، لَقَدْ رَأَيْتُ الَّذِينَ عَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم صَرْعَى فِي الْقَلِيبِ قَلِيبِ بَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 240In-book reference : Book 4, Hadith 106USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 241,
    "id": 241,
    "url": "https://sunnah.com/bukhari:241",
    "bookNumber": 4,
    "hadithNumber": 107,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) once spat in his clothes.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ بَزَقَ النَّبِيُّ صلى الله عليه وسلم فِي ثَوْبِهِ‏.‏ طَوَّلَهُ ابْنُ أَبِي مَرْيَمَ قَالَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ قَالَ سَمِعْتُ أَنَسًا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 241In-book reference : Book 4, Hadith 107USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 242,
    "id": 242,
    "url": "https://sunnah.com/bukhari:242",
    "bookNumber": 4,
    "hadithNumber": 108,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) said, \"All drinks that produce intoxication are Haram (forbidden to drink).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 242In-book reference : Book 4, Hadith 108USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 243,
    "id": 243,
    "url": "https://sunnah.com/bukhari:243",
    "bookNumber": 4,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Hazim:",
    "english": "Sahl bin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet (ﷺ) treated? \nSahl replied, \"None remains among the people living who knows that better than I. `Ali [??] used to \nbring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt \nand the wound was filled with it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي حَازِمٍ، سَمِعَ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ،، وَسَأَلَهُ النَّاسُ، وَمَا بَيْنِي وَبَيْنَهُ أَحَدٌ بِأَىِّ شَىْءٍ دُووِيَ جُرْحُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا بَقِيَ أَحَدٌ أَعْلَمُ بِهِ مِنِّي، كَانَ عَلِيٌّ يَجِيءُ بِتُرْسِهِ فِيهِ مَاءٌ، وَفَاطِمَةُ تَغْسِلُ عَنْ وَجْهِهِ الدَّمَ، فَأُخِذَ حَصِيرٌ فَأُحْرِقَ فَحُشِيَ بِهِ جُرْحُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 243In-book reference : Book 4, Hadith 109USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 244,
    "id": 244,
    "url": "https://sunnah.com/bukhari:244",
    "bookNumber": 4,
    "hadithNumber": 110,
    "narrator": "Narrated Abu Burda:",
    "english": "My father said, \"I came to the Prophet (ﷺ) and saw him carrying a Siwak in his hand and cleansing his \nteeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَوَجَدْتُهُ يَسْتَنُّ بِسِوَاكٍ بِيَدِهِ يَقُولُ ‏\n\"‏ أُعْ أُعْ ‏\"‏، وَالسِّوَاكُ فِي فِيهِ، كَأَنَّهُ يَتَهَوَّعُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 244In-book reference : Book 4, Hadith 110USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 245,
    "id": 245,
    "url": "https://sunnah.com/bukhari:245",
    "bookNumber": 4,
    "hadithNumber": 111,
    "narrator": "Narrated Hudhaifa:",
    "english": "Whenever the Prophet (ﷺ) got up at night, he used to clean his mouth with Siwak.",
    "arabic": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 245In-book reference : Book 4, Hadith 111USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 246,
    "id": 246,
    "url": "https://sunnah.com/bukhari:246",
    "bookNumber": 4,
    "hadithNumber": 112,
    "narrator": "Narrated Ibn 'Umar:",
    "english": "The Prophet (ﷺ) said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"",
    "arabic": "وَقَالَ عَفَّانُ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرَانِي أَتَسَوَّكُ بِسِوَاكٍ، فَجَاءَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي كَبِّرْ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ مِنْهُمَا ‏\"‏‏.‏ \nقَالَ أَبُو عَبْدِ اللَّهِ اخْتَصَرَهُ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 246In-book reference : Book 4, Hadith 112USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 247,
    "id": 247,
    "url": "https://sunnah.com/bukhari:247",
    "bookNumber": 4,
    "hadithNumber": 113,
    "narrator": "Narrated Al-Bara 'bin `Azib:",
    "english": "The Prophet (ﷺ) said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your \nright side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika \nraghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu \nbikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all \nmy affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is \nno fleeing from You, and there is no place of protection and safety except with You O Allah! I believe \nin Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You \nhave sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let \nthe aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet (ﷺ) and when I \nreached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You \nhave revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet (ﷺ) said, \"No, (but say): \n'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَةِ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الأَيْمَنِ، ثُمَّ قُلِ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ، وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ ‏\"‏‏.‏ قَالَ فَرَدَّدْتُهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمَّا بَلَغْتُ ‏\"‏ اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ ‏\"‏‏.‏ قُلْتُ وَرَسُولِكَ‏.‏ قَالَ ‏\"‏ لاَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 247In-book reference : Book 4, Hadith 113USC-MSA web (English) reference : Vol. 1, Book 4, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 248,
    "id": 248,
    "url": "https://sunnah.com/bukhari:248",
    "bookNumber": 5,
    "hadithNumber": 1,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever the Prophet (ﷺ) took a bath after Janaba he started by washing his hands and then performed \nablution like that for the prayer. After that he would put his fingers in water and move the roots of his \nhair with them, and then pour three handfuls of water over his head and then pour water all over his \nbody.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ، فَيُخَلِّلُ بِهَا أُصُولَ شَعَرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ غُرَفٍ بِيَدَيْهِ، ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 248In-book reference : Book 5, Hadith 1USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 249,
    "id": 249,
    "url": "https://sunnah.com/bukhari:249",
    "bookNumber": 5,
    "hadithNumber": 2,
    "narrator": "Narrated Maimuna:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) performed ablution like that for the prayer but did not wash \nhis feet. He washed off the discharge from his private parts and then poured water over his body. He \nwithdrew his feet from that place (the place where he took the bath) and then washed them. And that \nwas his way of taking the bath of Janaba.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ تَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُضُوءَهُ لِلصَّلاَةِ غَيْرَ رِجْلَيْهِ، وَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ مِنَ الأَذَى، ثُمَّ أَفَاضَ عَلَيْهِ الْمَاءَ، ثُمَّ نَحَّى رِجْلَيْهِ فَغَسَلَهُمَا، هَذِهِ غُسْلُهُ مِنَ الْجَنَابَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 249In-book reference : Book 5, Hadith 2USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 250,
    "id": 250,
    "url": "https://sunnah.com/bukhari:250",
    "bookNumber": 5,
    "hadithNumber": 3,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) and I used to take a bath from a single pot called 'Faraq'.",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنْ قَدَحٍ يُقَالُ لَهُ الْفَرَقُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 250In-book reference : Book 5, Hadith 3USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 251,
    "id": 251,
    "url": "https://sunnah.com/bukhari:251",
    "bookNumber": 5,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Salama:",
    "english": "`Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a \npot containing about a Sa` of water and took a bath and poured it over her head and at that time there \nwas a screen between her and us.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنِي شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ حَفْصٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يَقُولُ دَخَلْتُ أَنَا وَأَخُو، عَائِشَةَ عَلَى عَائِشَةَ فَسَأَلَهَا أَخُوهَا عَنْ غُسْلِ النَّبِيِّ، صلى الله عليه وسلم فَدَعَتْ بِإِنَاءٍ نَحْوًا مِنْ صَاعٍ، فَاغْتَسَلَتْ وَأَفَاضَتْ عَلَى رَأْسِهَا، وَبَيْنَنَا وَبَيْنَهَا حِجَابٌ‏.‏ \nقَالَ أَبُو عَبْدِ اللَّهِ قَالَ يَزِيدُ بْنُ هَارُونَ وَبَهْزٌ وَالْجُدِّيُّ عَنْ شُعْبَةَ قَدْرِ صَاعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 251In-book reference : Book 5, Hadith 4USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 252,
    "id": 252,
    "url": "https://sunnah.com/bukhari:252",
    "bookNumber": 5,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Ja`far:",
    "english": "While I and my father were with Jabir bin `Abdullah, some people asked him about taking a bath. He \nreplied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \n\"A Sa` was sufficient for one who had more hair than you and was better than you (meaning the \nProphet).\" And then Jabir (put on) his garment and led the prayer.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ، أَنَّهُ كَانَ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ هُوَ وَأَبُوهُ، وَعِنْدَهُ قَوْمٌ فَسَأَلُوهُ عَنِ الْغُسْلِ،‏.‏ فَقَالَ يَكْفِيكَ صَاعٌ‏.‏ فَقَالَ رَجُلٌ مَا يَكْفِينِي‏.‏ فَقَالَ جَابِرٌ كَانَ يَكْفِي مَنْ هُوَ أَوْفَى مِنْكَ شَعَرًا، وَخَيْرٌ مِنْكَ، ثُمَّ أَمَّنَا فِي ثَوْبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 252In-book reference : Book 5, Hadith 5USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 253,
    "id": 253,
    "url": "https://sunnah.com/bukhari:253",
    "bookNumber": 5,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) and Maimuna used to take a bath from a single pot.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَمَيْمُونَةَ كَانَا يَغْتَسِلاَنِ مِنْ إِنَاءٍ وَاحِدٍ‏.‏ \nقَالَ أَبُو عَبْدِ اللَّهِ كَانَ ابْنُ عُيَيْنَةَ يَقُولُ أَخِيرًا عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، وَالصَّحِيحُ مَا رَوَى أَبُو نُعَيْمٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 253In-book reference : Book 5, Hadith 6USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 254,
    "id": 254,
    "url": "https://sunnah.com/bukhari:254",
    "bookNumber": 5,
    "hadithNumber": 7,
    "narrator": "Narrated Jubair bin Mut`im:",
    "english": "Allah's Messenger (ﷺ) said, \"As for me, I pour water three times on my head.\" And he pointed with both his \nhands.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ صُرَدٍ، قَالَ حَدَّثَنِي جُبَيْرُ بْنُ مُطْعِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلاَثًا ‏\"‏‏.‏ وَأَشَارَ بِيَدَيْهِ كِلْتَيْهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 254In-book reference : Book 5, Hadith 7USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 255,
    "id": 255,
    "url": "https://sunnah.com/bukhari:255",
    "bookNumber": 5,
    "hadithNumber": 8,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) used to pour water three times on his head.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مِخْوَلِ بْنِ رَاشِدٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُفْرِغُ عَلَى رَأْسِهِ ثَلاَثًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 255In-book reference : Book 5, Hadith 8USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 256,
    "id": 256,
    "url": "https://sunnah.com/bukhari:256",
    "bookNumber": 5,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Ja`far:",
    "english": "Jabir bin `Abdullah said to me, \"Your cousin (Hasan bin Muhammad bin Al-Hanafiya) came to me \nand asked about the bath of Janaba. I replied, 'The Prophet (ﷺ) uses to take three handfuls of water, pour \nthem on his head and then pour more water over his body.' Al-Hasan said to me, 'I am a hairy man.' I \nreplied, 'The Prophet (ﷺ) had more hair than you'. \"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مَعْمَرُ بْنُ يَحْيَى بْنِ سَامٍ، حَدَّثَنِي أَبُو جَعْفَرٍ، قَالَ قَالَ لِي جَابِرٌ أَتَانِي ابْنُ عَمِّكَ يُعَرِّضُ بِالْحَسَنِ بْنِ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ قَالَ كَيْفَ الْغُسْلُ مِنَ الْجَنَابَةِ فَقُلْتُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْخُذُ ثَلاَثَةَ أَكُفٍّ وَيُفِيضُهَا عَلَى رَأْسِهِ، ثُمَّ يُفِيضُ عَلَى سَائِرِ جَسَدِهِ‏.‏ فَقَالَ لِي الْحَسَنُ إِنِّي رَجُلٌ كَثِيرُ الشَّعَرِ‏.‏ فَقُلْتُ كَانَ النَّبِيُّ صلى الله عليه وسلم أَكْثَرَ مِنْكَ شَعَرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 256In-book reference : Book 5, Hadith 9USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 257,
    "id": 257,
    "url": "https://sunnah.com/bukhari:257",
    "bookNumber": 5,
    "hadithNumber": 10,
    "narrator": "Narrated Maimuna:",
    "english": "I placed water for the bath of the Prophet. He washed his hands twice or thrice and then poured water \non his left hand and washed his private parts. He rubbed his hands over the earth (and cleaned them), \nrinsed his mouth, washed his nose by putting water in it and blowing it out, washed his face and both \nforearms and then poured water over his body. Then he withdrew from that place and washed his feet.",
    "arabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم مَاءً لِلْغُسْلِ، فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ أَفْرَغَ عَلَى شِمَالِهِ فَغَسَلَ مَذَاكِيرَهُ، ثُمَّ مَسَحَ يَدَهُ بِالأَرْضِ، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ، ثُمَّ أَفَاضَ عَلَى جَسَدِهِ، ثُمَّ تَحَوَّلَ مِنْ مَكَانِهِ فَغَسَلَ قَدَمَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 257In-book reference : Book 5, Hadith 10USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 258,
    "id": 258,
    "url": "https://sunnah.com/bukhari:258",
    "bookNumber": 5,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever the Prophet (ﷺ) took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or \nsome other scent. He used to take it in his hand, rub it first over the right side of his head and then \nover the left and then rub the middle of his head with both hands.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ حَنْظَلَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ دَعَا بِشَىْءٍ نَحْوَ الْحِلاَبِ، فَأَخَذَ بِكَفِّهِ، فَبَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ ثُمَّ الأَيْسَرِ، فَقَالَ بِهِمَا عَلَى رَأْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 258In-book reference : Book 5, Hadith 11USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 259,
    "id": 259,
    "url": "https://sunnah.com/bukhari:259",
    "bookNumber": 5,
    "hadithNumber": 12,
    "narrator": "Narrated Maimuna:",
    "english": "I placed water for the bath of the Prophet (ﷺ) and he poured water with his right hand on his left and \nwashed them. Then he washed his private parts and rubbed his hands on the ground, washed them \nwith water, rinsed his mouth and washed his nose by putting water in it and blowing it out, washed his \nface and poured water on his head. He withdrew from that place and washed his feet. A piece of cloth \n(towel) was given to him but he did not use it.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي سَالِمٌ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَتْنَا مَيْمُونَةُ، قَالَتْ صَبَبْتُ لِلنَّبِيِّ صلى الله عليه وسلم غُسْلاً، فَأَفْرَغَ بِيَمِينِهِ عَلَى يَسَارِهِ فَغَسَلَهُمَا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ قَالَ بِيَدِهِ الأَرْضَ فَمَسَحَهَا بِالتُّرَابِ، ثُمَّ غَسَلَهَا، ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ، ثُمَّ غَسَلَ وَجْهَهُ، وَأَفَاضَ عَلَى رَأْسِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، ثُمَّ أُتِيَ بِمِنْدِيلٍ، فَلَمْ يَنْفُضْ بِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 259In-book reference : Book 5, Hadith 12USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 260,
    "id": 260,
    "url": "https://sunnah.com/bukhari:260",
    "bookNumber": 5,
    "hadithNumber": 13,
    "narrator": "Narrated Maimuna:",
    "english": "The Prophet (ﷺ) took the bath of Janaba. (sexual relation or wet dream). He first cleaned his private parts \nwith his hand, and then rubbed it (that hand) on the wall (earth) and washed it. Then he performed \nablution like that for the prayer, and after the bath he washed his feet.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اغْتَسَلَ مِنَ الْجَنَابَةِ، فَغَسَلَ فَرْجَهُ بِيَدِهِ، ثُمَّ دَلَكَ بِهَا الْحَائِطَ ثُمَّ غَسَلَهَا، ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ، فَلَمَّا فَرَغَ مِنْ غُسْلِهِ غَسَلَ رِجْلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 260In-book reference : Book 5, Hadith 13USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 261,
    "id": 261,
    "url": "https://sunnah.com/bukhari:261",
    "bookNumber": 5,
    "hadithNumber": 14,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) and I used to take a bath from a single pot of water and our hands used to go in the pot \nafter each other in turn.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، أَخْبَرَنَا أَفْلَحُ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ تَخْتَلِفُ أَيْدِينَا فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 261In-book reference : Book 5, Hadith 14USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 262,
    "id": 262,
    "url": "https://sunnah.com/bukhari:262",
    "bookNumber": 5,
    "hadithNumber": 15,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) took a bath of Janaba, he washed his hands first.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 262In-book reference : Book 5, Hadith 15USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 263,
    "id": 263,
    "url": "https://sunnah.com/bukhari:263",
    "bookNumber": 5,
    "hadithNumber": 16,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) and I used to take a bath from a single pot of water after Janaba.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنْ جَنَابَةٍ‏.‏ وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 263In-book reference : Book 5, Hadith 16USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 264,
    "id": 264,
    "url": "https://sunnah.com/bukhari:264",
    "bookNumber": 5,
    "hadithNumber": 17,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) and one of his wives used to take a bath from a single pot of water. (Shu`ba added to \nAnas' Statement \"After the Janaba\").",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم وَالْمَرْأَةُ مِنْ نِسَائِهِ يَغْتَسِلاَنِ مِنْ إِنَاءٍ وَاحِدٍ‏.‏ زَادَ مُسْلِمٌ وَوَهْبٌ عَنْ شُعْبَةَ مِنَ الْجَنَابَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 264In-book reference : Book 5, Hadith 17USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 265,
    "id": 265,
    "url": "https://sunnah.com/bukhari:265",
    "bookNumber": 5,
    "hadithNumber": 18,
    "narrator": "Narrated Maimuna:",
    "english": "I placed water for the bath of Allah's Messenger (ﷺ) and he poured water over his hands and washed them \ntwice or thrice; then he poured water with his right hand over his left and washed his private parts \n(with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by \nputting water in it and blowing it out. After that he washed his face, both fore arms and head thrice \nand then poured water over his body. He withdrew from that place and washed his feet.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَاءً يَغْتَسِلُ بِهِ، فَأَفْرَغَ عَلَى يَدَيْهِ، فَغَسَلَهُمَا مَرَّتَيْنِ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ أَفْرَغَ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ مَذَاكِيرَهُ، ثُمَّ دَلَكَ يَدَهُ بِالأَرْضِ، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، ثُمَّ غَسَلَ وَجْهَهُ وَيَدَيْهِ ثُمَّ غَسَلَ رَأْسَهُ ثَلاَثًا، ثُمَّ أَفْرَغَ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى مِنْ مَقَامِهِ فَغَسَلَ قَدَمَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 265In-book reference : Book 5, Hadith 18USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 266,
    "id": 266,
    "url": "https://sunnah.com/bukhari:266",
    "bookNumber": 5,
    "hadithNumber": 19,
    "narrator": "Narrated Maimuna bint Al-Harith:",
    "english": "I placed water for the bath of Allah's Messenger (ﷺ) and put a screen. He poured water over his hands, and \nwashed them once or twice. (The sub-narrator added that he did not remember if she had said thrice or \nnot). Then he poured water with his right hand over his left one and washed his private parts. He \nrubbed his hand over the earth or the wall and washed it. He rinsed his mouth and washed his nose by \nputting water in it and blowing it out. He washed his face, forearms and head. He poured water over \nhis body and then withdrew from that place and washed his feet. I presented him a piece of cloth \n(towel) and he pointed with his hand (that he does not want it) and did not take it.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، قَالَتْ وَضَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُسْلاً وَسَتَرْتُهُ، فَصَبَّ عَلَى يَدِهِ، فَغَسَلَهَا مَرَّةً أَوْ مَرَّتَيْنِ ـ قَالَ سُلَيْمَانُ لاَ أَدْرِي أَذَكَرَ الثَّالِثَةَ أَمْ لاَ ـ ثُمَّ أَفْرَغَ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، ثُمَّ دَلَكَ يَدَهُ بِالأَرْضِ أَوْ بِالْحَائِطِ، ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَيَدَيْهِ، وَغَسَلَ رَأْسَهُ، ثُمَّ صَبَّ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ خِرْقَةً، فَقَالَ بِيَدِهِ هَكَذَا، وَلَمْ يُرِدْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 266In-book reference : Book 5, Hadith 19USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 267,
    "id": 267,
    "url": "https://sunnah.com/bukhari:267",
    "bookNumber": 5,
    "hadithNumber": 20,
    "narrator": "Narrated Muhammad bin Al-Muntathir:",
    "english": "on the authority of his father that he had asked `Aisha (about the Hadith of Ibn `Umar). She said, \n\"May Allah be Merciful to Abu `Abdur-Rahman. I used to put scent on Allah's Messenger (ﷺ) and he used to \ngo round his wives, and in the morning he assumed the Ihram, and the fragrance of scent was still \ncoming out from his body.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَيَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ ذَكَرْتُهُ لِعَائِشَةَ فَقَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صلى الله عليه وسلم، فَيَطُوفُ عَلَى نِسَائِهِ، ثُمَّ يُصْبِحُ مُحْرِمًا يَنْضَخُ طِيبًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 267In-book reference : Book 5, Hadith 20USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 267   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 268,
    "id": 268,
    "url": "https://sunnah.com/bukhari:268",
    "bookNumber": 5,
    "hadithNumber": 21,
    "narrator": "Narrated Qatada:",
    "english": "Anas bin Malik said, \"The Prophet (ﷺ) used to visit all his wives in a round, during the day and night and \nthey were eleven in number.\" I asked Anas, \"Had the Prophet (ﷺ) the strength for it?\" Anas replied, \"We \nused to say that the Prophet (ﷺ) was given the strength of thirty (men).\" And Sa`id said on the authority of \nQatada that Anas had told him about nine wives only (not eleven).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدُورُ عَلَى نِسَائِهِ فِي السَّاعَةِ الْوَاحِدَةِ مِنَ اللَّيْلِ وَالنَّهَارِ، وَهُنَّ إِحْدَى عَشْرَةَ‏.‏ قَالَ قُلْتُ لأَنَسٍ أَوَكَانَ يُطِيقُهُ قَالَ كُنَّا نَتَحَدَّثُ أَنَّهُ أُعْطِيَ قُوَّةَ ثَلاَثِينَ‏.‏ \nوَقَالَ سَعِيدٌ عَنْ قَتَادَةَ إِنَّ أَنَسًا حَدَّثَهُمْ تِسْعُ نِسْوَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 268In-book reference : Book 5, Hadith 21USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 269,
    "id": 269,
    "url": "https://sunnah.com/bukhari:269",
    "bookNumber": 5,
    "hadithNumber": 22,
    "narrator": "Narrated `Ali:",
    "english": "I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet (ﷺ) I requested \na man to ask him about it. So the man asked the Prophet (ﷺ) about it. The Prophet (ﷺ) replied, \"Perform \nablution after washing your organ (penis).\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ، قَالَ كُنْتُ رَجُلاً مَذَّاءً فَأَمَرْتُ رَجُلاً أَنْ يَسْأَلَ النَّبِيَّ صلى الله عليه وسلم لِمَكَانِ ابْنَتِهِ فَسَأَلَ فَقَالَ ‏\n\"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 269In-book reference : Book 5, Hadith 22USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 270,
    "id": 270,
    "url": "https://sunnah.com/bukhari:270",
    "bookNumber": 5,
    "hadithNumber": 23,
    "narrator": "Narrated Muhammad bin Al-Muntathir:",
    "english": "on the authority of his father that he had asked `Aisha about the saying of Ibn `Umar (i.e. he did not \nlike to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented \nAllah's Messenger (ﷺ) and he went round (had sexual intercourse with) all his wives, and in the morning he \nwas Muhrim (after taking a bath).\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ عَائِشَةَ فَذَكَرْتُ لَهَا قَوْلَ ابْنِ عُمَرَ مَا أُحِبُّ أَنْ أُصْبِحَ، مُحْرِمًا أَنْضَخُ طِيبًا‏.‏ فَقَالَتْ عَائِشَةُ أَنَا طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ثُمَّ طَافَ فِي نِسَائِهِ ثُمَّ أَصْبَحَ مُحْرِمًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 270In-book reference : Book 5, Hadith 23USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 271,
    "id": 271,
    "url": "https://sunnah.com/bukhari:271",
    "bookNumber": 5,
    "hadithNumber": 24,
    "narrator": "Narrated `Aisha:",
    "english": "It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was \na Muhrim.",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفْرِقِ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 271In-book reference : Book 5, Hadith 24USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 272,
    "id": 272,
    "url": "https://sunnah.com/bukhari:272",
    "bookNumber": 5,
    "hadithNumber": 25,
    "narrator": "Narrated Hisham bin `Urwa:",
    "english": "(on the authority of his father) `Aisha said, \"Whenever Allah's Messenger (ﷺ) took the bath of Janaba, he \ncleaned his hands and performed ablution like that for prayer and then took a bath and rubbed his hair, \ntill he felt that the whole skin of the head had become wet, then he would pour water thrice and wash \nthe rest of the body.\" `Aisha further said, \"I and Allah's Messenger (ﷺ) used to take a bath from a single \nwater container, from which we took water simultaneously.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَيْهِ، وَتَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ اغْتَسَلَ، ثُمَّ يُخَلِّلُ بِيَدِهِ شَعَرَهُ، حَتَّى إِذَا ظَنَّ أَنْ قَدْ أَرْوَى بَشَرَتَهُ، أَفَاضَ عَلَيْهِ الْمَاءَ ثَلاَثَ مَرَّاتٍ، ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ‏.‏ وَقَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ نَغْرِفُ مِنْهُ جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 272, 273In-book reference : Book 5, Hadith 25USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 273,
    "id": 273,
    "url": "https://sunnah.com/bukhari:273",
    "bookNumber": 5,
    "hadithNumber": 25,
    "narrator": "Narrated Hisham bin `Urwa:",
    "english": "(on the authority of his father) `Aisha said, \"Whenever Allah's Messenger (ﷺ) took the bath of Janaba, he \ncleaned his hands and performed ablution like that for prayer and then took a bath and rubbed his hair, \ntill he felt that the whole skin of the head had become wet, then he would pour water thrice and wash \nthe rest of the body.\" `Aisha further said, \"I and Allah's Messenger (ﷺ) used to take a bath from a single \nwater container, from which we took water simultaneously.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَيْهِ، وَتَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ اغْتَسَلَ، ثُمَّ يُخَلِّلُ بِيَدِهِ شَعَرَهُ، حَتَّى إِذَا ظَنَّ أَنْ قَدْ أَرْوَى بَشَرَتَهُ، أَفَاضَ عَلَيْهِ الْمَاءَ ثَلاَثَ مَرَّاتٍ، ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ‏.‏ وَقَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ نَغْرِفُ مِنْهُ جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 272, 273In-book reference : Book 5, Hadith 25USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 274,
    "id": 274,
    "url": "https://sunnah.com/bukhari:274",
    "bookNumber": 5,
    "hadithNumber": 26,
    "narrator": "Narrated Maimuna:",
    "english": "Water was placed for the ablution of Allah's Messenger (ﷺ) after Janaba. He poured water with his right hand \nover his left twice or thrice and then washed his private parts and rubbed his hand on the earth or on a \nwall twice or thrice and then rinsed his mouth, washed his nose by putting water in it and then \nblowing it out and then washed his face and forearms and poured water over his head and washed his \nbody. Then he shifted from that place and washed his feet. I brought a piece of cloth, but he did not \ntake it and removed the traces of water from his body with his hand.\"",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا الأَعْمَشُ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ وَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَضُوءًا لِجَنَابَةٍ فَأَكْفَأَ بِيَمِينِهِ عَلَى شِمَالِهِ مَرَّتَيْنِ، أَوْ ثَلاَثًا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ ضَرَبَ يَدَهُ بِالأَرْضِ ـ أَوِ الْحَائِطِ ـ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ، ثُمَّ أَفَاضَ عَلَى رَأْسِهِ الْمَاءَ، ثُمَّ غَسَلَ جَسَدَهُ، ثُمَّ تَنَحَّى فَغَسَلَ رِجْلَيْهِ‏.‏ قَالَتْ فَأَتَيْتُهُ بِخِرْقَةٍ، فَلَمْ يُرِدْهَا، فَجَعَلَ يَنْفُضُ بِيَدِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 274In-book reference : Book 5, Hadith 26USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 275,
    "id": 275,
    "url": "https://sunnah.com/bukhari:275",
    "bookNumber": 5,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Huraira:",
    "english": "Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Messenger (ﷺ) \ncame out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us \nto stay at our places and went to take a bath and then returned with water dropping from his head. He \nsaid, \"Allahu-Akbar\", and we all offered the prayer with him.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُقِيمَتِ الصَّلاَةُ، وَعُدِّلَتِ الصُّفُوفُ قِيَامًا، فَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا قَامَ فِي مُصَلاَّهُ ذَكَرَ أَنَّهُ جُنُبٌ فَقَالَ لَنَا ‏:‏ ‏\n\"‏ مَكَانَكُمْ ‏\"‏‏.‏ ثُمَّ رَجَعَ فَاغْتَسَلَ، ثُمَّ خَرَجَ إِلَيْنَا وَرَأْسُهُ يَقْطُرُ، فَكَبَّرَ فَصَلَّيْنَا مَعَهُ‏.‏ تَابَعَهُ عَبْدُ الأَعْلَى عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ‏.‏ وَرَوَاهُ الأَوْزَاعِيُّ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 275In-book reference : Book 5, Hadith 27USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 276,
    "id": 276,
    "url": "https://sunnah.com/bukhari:276",
    "bookNumber": 5,
    "hadithNumber": 28,
    "narrator": "Narrated Maimuna:",
    "english": "I placed water for the bath of the Prophet (ﷺ) and screened him with a garment. He poured water over his \nhands and washed them. After that he poured water with his right hand over his left and washed his \nprivate parts, rubbed his hands with earth and washed them, rinsed his mouth, washed his nose by \nputting water in it and then blowing it out and then washed his face and forearms. He poured water \nover his head and body. He then shifted from that place and washed his feet. I gave him a piece of \ncloth but he did not take it and came out removing the water (from his body) with both his hands.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا أَبُو حَمْزَةَ، قَالَ سَمِعْتُ الأَعْمَشَ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم غُسْلاً، فَسَتَرْتُهُ بِثَوْبٍ، وَصَبَّ عَلَى يَدَيْهِ فَغَسَلَهُمَا، ثُمَّ صَبَّ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، فَضَرَبَ بِيَدِهِ الأَرْضَ فَمَسَحَهَا، ثُمَّ غَسَلَهَا فَمَضْمَضَ، وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ، ثُمَّ صَبَّ عَلَى رَأْسِهِ، وَأَفَاضَ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ ثَوْبًا فَلَمْ يَأْخُذْهُ، فَانْطَلَقَ وَهْوَ يَنْفُضُ يَدَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 276In-book reference : Book 5, Hadith 28USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 277,
    "id": 277,
    "url": "https://sunnah.com/bukhari:277",
    "bookNumber": 5,
    "hadithNumber": 29,
    "narrator": "Narrated Aisha:",
    "english": "Whenever any one of us was Junub, she poured water over her head thrice with both her hands and \nthen rubbed the right side of her head with one hand and rubbed the left side of the head with the other \nhand.",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنَّا إِذَا أَصَابَتْ إِحْدَانَا جَنَابَةٌ، أَخَذَتْ بِيَدَيْهَا ثَلاَثًا فَوْقَ رَأْسِهَا، ثُمَّ تَأْخُذُ بِيَدِهَا عَلَى شِقِّهَا الأَيْمَنِ، وَبِيَدِهَا الأُخْرَى عَلَى شِقِّهَا الأَيْسَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 277In-book reference : Book 5, Hadith 29USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 278,
    "id": 278,
    "url": "https://sunnah.com/bukhari:278",
    "bookNumber": 5,
    "hadithNumber": 30,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, 'The (people of) Bani Israel used to take bath naked (all together) looking at each \nother. The Prophet (ﷺ) Moses used to take a bath alone. They said, 'By Allah! Nothing prevents Moses \nfrom taking a bath with us except that he has a scrotal hernia.' So once Moses went out to take a bath \nand put his clothes over a stone and then that stone ran away with his clothes. Moses followed that \nstone saying, \"My clothes, O stone! My clothes, O stone! till the people of Bani Israel saw him and \nsaid, 'By Allah, Moses has got no defect in his body. Moses took his clothes and began to beat the \nstone.\" Abu Huraira added, \"By Allah! There are still six or seven marks present on the stone from \nthat excessive beating.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً، يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ، وَكَانَ مُوسَى يَغْتَسِلُ وَحْدَهُ، فَقَالُوا وَاللَّهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلاَّ أَنَّهُ آدَرُ، فَذَهَبَ مَرَّةً يَغْتَسِلُ، فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ، فَفَرَّ الْحَجَرُ بِثَوْبِهِ، فَخَرَجَ مُوسَى فِي إِثْرِهِ يَقُولُ ثَوْبِي يَا حَجَرُ‏.‏ حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى مُوسَى، فَقَالُوا وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ‏.‏ وَأَخَذَ ثَوْبَهُ، فَطَفِقَ بِالْحَجَرِ ضَرْبًا ‏\"‏‏.‏ فَقَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنَّهُ لَنَدَبٌ بِالْحَجَرِ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبًا بِالْحَجَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 278In-book reference : Book 5, Hadith 30USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 279,
    "id": 279,
    "url": "https://sunnah.com/bukhari:279",
    "bookNumber": 5,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"When the Prophet (ﷺ) Job (Aiyub) was taking a bath naked, \ngolden locusts began to fall on him. Job started collecting them in his clothes. His Lord addressed \nhim, 'O Job! Haven't I given you enough so that you are not in need of them.' Job replied, 'Yes!' By \nYour Honor (power)! But I cannot dispense with Your Blessings.' \"",
    "arabic": "وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا فَخَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ، فَجَعَلَ أَيُّوبُ يَحْتَثِي فِي ثَوْبِهِ، فَنَادَاهُ رَبُّهُ يَا أَيُّوبُ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى قَالَ بَلَى وَعِزَّتِكَ وَلَكِنْ لاَ غِنَى بِي عَنْ بَرَكَتِكَ ‏\"‏‏.‏ وَرَوَاهُ إِبْرَاهِيمُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ صَفْوَانَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 279In-book reference : Book 5, Hadith 31USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 280,
    "id": 280,
    "url": "https://sunnah.com/bukhari:280",
    "bookNumber": 5,
    "hadithNumber": 32,
    "narrator": "Narrated Um Hani bint Abi Talib:",
    "english": "I went to Allah's Messenger (ﷺ) in the year of the conquest of Mecca and found him taking a bath while \nFatima was screening him. The Prophet (ﷺ) asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ، فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ تَسْتُرُهُ فَقَالَ ‏\n\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقُلْتُ أَنَا أُمُّ هَانِئٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 280In-book reference : Book 5, Hadith 32USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 281,
    "id": 281,
    "url": "https://sunnah.com/bukhari:281",
    "bookNumber": 5,
    "hadithNumber": 33,
    "narrator": "Narrated Maimuna:",
    "english": "I screened the Prophet (ﷺ) while he was taking a bath of Janaba. He washed his hands, poured water from \nhis right hand over his left and washed his private parts. Then he rubbed his hand over a wall or the \nearth, and performed ablution similar to that for the prayer but did not wash his feet. Then he poured \nwater over his body, shifted from that place, and washed his feet.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ سَتَرْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَغْتَسِلُ مِنَ الْجَنَابَةِ، فَغَسَلَ يَدَيْهِ ثُمَّ صَبَّ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ، ثُمَّ مَسَحَ بِيَدِهِ عَلَى الْحَائِطِ أَوِ الأَرْضِ، ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ، غَيْرَ رِجْلَيْهِ، ثُمَّ أَفَاضَ عَلَى جَسَدِهِ الْمَاءَ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَابْنُ فُضَيْلٍ فِي السَّتْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 281In-book reference : Book 5, Hadith 33USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 282,
    "id": 282,
    "url": "https://sunnah.com/bukhari:282",
    "bookNumber": 5,
    "hadithNumber": 34,
    "narrator": "Narrated Um-Salama:",
    "english": "(the mother of the believers) Um Sulaim, the wife of Abu Talha, came to Allah's Messenger (ﷺ) and said, \"O \nAllah's Messenger (ﷺ)! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a \nbath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Messenger (ﷺ) replied, \"Yes, if she \nnotices a discharge.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ امْرَأَةُ أَبِي طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، هَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا هِيَ احْتَلَمَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 282In-book reference : Book 5, Hadith 34USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 283,
    "id": 283,
    "url": "https://sunnah.com/bukhari:283",
    "bookNumber": 5,
    "hadithNumber": 35,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) came across me in one of the streets of Medina and at that time I was Junub. So I slipped \naway from him and went to take a bath. On my return the Prophet (ﷺ) said, \"O Abu Huraira! Where have \nyou been?\" I replied, \"I was Junub, so I disliked to sit in your company.\" The Prophet (ﷺ) said, \"Subhan \nAllah! A believer never becomes impure.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا حُمَيْدٌ، قَالَ حَدَّثَنَا بَكْرٌ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَقِيَهُ فِي بَعْضِ طَرِيقِ الْمَدِينَةِ وَهْوَ جُنُبٌ، فَانْخَنَسْتُ مِنْهُ، فَذَهَبَ فَاغْتَسَلَ، ثُمَّ جَاءَ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ قَالَ كُنْتُ جُنُبًا، فَكَرِهْتُ أَنْ أُجَالِسَكَ وَأَنَا عَلَى غَيْرِ طَهَارَةٍ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ، إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 283In-book reference : Book 5, Hadith 35USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 284,
    "id": 284,
    "url": "https://sunnah.com/bukhari:284",
    "bookNumber": 5,
    "hadithNumber": 36,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) used to visit all his wives in one night and he had nine wives at that time.",
    "arabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي اللَّيْلَةِ الْوَاحِدَةِ، وَلَهُ يَوْمَئِذٍ تِسْعُ نِسْوَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 284In-book reference : Book 5, Hadith 36USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 285,
    "id": 285,
    "url": "https://sunnah.com/bukhari:285",
    "bookNumber": 5,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) came across me and I was Junub. He took my hand and I went along with him till he \nsat down I slipped away, went home and took a bath. When I came back, he was still sitting there. He \nthen said to me, \"O Abu Huraira! Where have you been?' I told him about it. The Prophet (ﷺ) said, \n\"Subhan Allah! O Abu Huraira! A believer never becomes impure.\"",
    "arabic": "حَدَّثَنَا عَيَّاشٌ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا حُمَيْدٌ، عَنْ بَكْرٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا جُنُبٌ، فَأَخَذَ بِيَدِي، فَمَشَيْتُ مَعَهُ حَتَّى قَعَدَ فَانْسَلَلْتُ، فَأَتَيْتُ الرَّحْلَ، فَاغْتَسَلْتُ ثُمَّ جِئْتُ وَهْوَ قَاعِدٌ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هِرٍّ ‏\"‏ فَقُلْتُ لَهُ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ يَا أَبَا هِرٍّ إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 285In-book reference : Book 5, Hadith 37USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 286,
    "id": 286,
    "url": "https://sunnah.com/bukhari:286",
    "bookNumber": 5,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Salama:",
    "english": "I asked `Aisha \"Did the Prophet (ﷺ) use to sleep while he was Junub?\" She replied, \"Yes, but he used to \nperform ablution (before going to bed).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا هِشَامٌ، وَشَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ عَائِشَةَ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يَرْقُدُ وَهْوَ جُنُبٌ قَالَتْ نَعَمْ وَيَتَوَضَّأُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 286In-book reference : Book 5, Hadith 38USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 287,
    "id": 287,
    "url": "https://sunnah.com/bukhari:287",
    "bookNumber": 5,
    "hadithNumber": 39,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "I asked Allah's Messenger (ﷺ) \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs \nablution, he can sleep while he is Junub.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيَرْقُدُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏\n\"‏ نَعَمْ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَرْقُدْ وَهُوَ جُنُبٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 287In-book reference : Book 5, Hadith 39USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 288,
    "id": 288,
    "url": "https://sunnah.com/bukhari:288",
    "bookNumber": 5,
    "hadithNumber": 40,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever the Prophet (ﷺ) intended to sleep while he was Junub, he used to wash his private parts and \nperform ablution like that for the prayer.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ وَهْوَ جُنُبٌ، غَسَلَ فَرْجَهُ، وَتَوَضَّأَ لِلصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 288In-book reference : Book 5, Hadith 40USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 289,
    "id": 289,
    "url": "https://sunnah.com/bukhari:289",
    "bookNumber": 5,
    "hadithNumber": 41,
    "narrator": "Narrated `Abdullah:",
    "english": "`Umar asked the Prophet (ﷺ) \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs \nablution.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ اسْتَفْتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم أَيَنَامُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏\n\"‏ نَعَمْ، إِذَا تَوَضَّأَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 289In-book reference : Book 5, Hadith 41USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 290,
    "id": 290,
    "url": "https://sunnah.com/bukhari:290",
    "bookNumber": 5,
    "hadithNumber": 42,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "`Umar bin Al-Khattab told Allah's Messenger (ﷺ), \"I became Junub at night.\" Allah's Messenger (ﷺ) replied, \n\"Perform ablution after washing your private parts and then sleep.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنَ اللَّيْلِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 290In-book reference : Book 5, Hadith 42USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 291,
    "id": 291,
    "url": "https://sunnah.com/bukhari:291",
    "bookNumber": 5,
    "hadithNumber": 43,
    "narrator": "Narrated Hisham:",
    "english": "as the following Hadith 290.\nNarrated Abu Huraira:\n\nThe Prophet (ﷺ) said, \"When a man sits in between the four parts of a woman and did the sexual \nintercourse with her, bath becomes compulsory.\"",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ ثُمَّ جَهَدَهَا، فَقَدْ وَجَبَ الْغَسْلُ ‏\"‏‏.‏ تَابَعَهُ عَمْرُو بْنُ مَرْزُوقٍ عَنْ شُعْبَةَ مِثْلَهُ‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا قَتَادَةُ أَخْبَرَنَا الْحَسَنُ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 291In-book reference : Book 5, Hadith 43USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 292,
    "id": 292,
    "url": "https://sunnah.com/bukhari:292",
    "bookNumber": 5,
    "hadithNumber": 44,
    "narrator": "Narrated Zaid bin Khalid Al-Juhani:",
    "english": "I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did \nnot discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his \nprivate parts.\" `Uthman added, \"I heard that from Allah's Messenger (ﷺ).\" I asked `Ali bin Abi Talib, Az- \nZubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and they gave the same reply. (Abu \nAiyub said that he had heard that from Allah's Messenger (ﷺ) ) (This order was canceled later on so one has \nto take a bath. See, Hadith No. 180).",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ فَقَالَ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ فَلَمْ يُمْنِ‏.‏ قَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، وَيَغْسِلُ ذَكَرَهُ‏.‏ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَطَلْحَةَ بْنَ عُبَيْدِ اللَّهِ وَأُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنهم ـ فَأَمَرُوهُ بِذَلِكَ‏.‏ قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ سَمِعَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 292In-book reference : Book 5, Hadith 44USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 291   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 293,
    "id": 293,
    "url": "https://sunnah.com/bukhari:293",
    "bookNumber": 5,
    "hadithNumber": 45,
    "narrator": "Narrated Ubai bin Ka`b:",
    "english": "I asked Allah's Messenger (ﷺ) about a man who engages in sexual intercourse with his wife but does not \ndischarge. He replied, \"He should wash the parts which comes in contact with the private parts of the \nwoman, perform ablution and then pray.\" (Abu `Abdullah said, \"Taking a bath is safer and is the last \norder.\")",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَنِي أَبُو أَيُّوبَ، قَالَ أَخْبَرَنِي أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِذَا جَامَعَ الرَّجُلُ الْمَرْأَةَ فَلَمْ يُنْزِلْ قَالَ ‏\n\"‏ يَغْسِلُ مَا مَسَّ الْمَرْأَةَ مِنْهُ، ثُمَّ يَتَوَضَّأُ وَيُصَلِّي ‏\"‏‏.‏ \nقَالَ أَبُو عَبْدِ اللَّهِ الْغَسْلُ أَحْوَطُ، وَذَاكَ الآخِرُ، وَإِنَّمَا بَيَّنَّا لاِخْتِلاَفِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 293In-book reference : Book 5, Hadith 45USC-MSA web (English) reference : Vol. 1, Book 5, Hadith 292   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 294,
    "id": 294,
    "url": "https://sunnah.com/bukhari:294",
    "bookNumber": 6,
    "hadithNumber": 1,
    "narrator": "Narrated Al-Qasim:",
    "english": "`Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a \nplace six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He \nsaid 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing \nwhich Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the \nexception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Messenger (ﷺ) \nsacrificed cows on behalf of his wives.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ خَرَجْنَا لاَ نَرَى إِلاَّ الْحَجَّ، فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ، فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي قَالَ ‏\"‏ مَا لَكِ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ، غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ قَالَتْ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 294In-book reference : Book 6, Hadith 1USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 295,
    "id": 295,
    "url": "https://sunnah.com/bukhari:295",
    "bookNumber": 6,
    "hadithNumber": 2,
    "narrator": "Narrated `Aisha:",
    "english": "While in menses, I used to comb the hair of Allah's Messenger (ﷺ) .",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 295In-book reference : Book 6, Hadith 2USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 294   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 296,
    "id": 296,
    "url": "https://sunnah.com/bukhari:296",
    "bookNumber": 6,
    "hadithNumber": 3,
    "narrator": "Narrated `Urwa:",
    "english": "A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" \nI replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person \nto do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her \nmenses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she \nwould comb his hair, while she used to be in her menses.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ عُرْوَةَ، أَنَّهُ سُئِلَ أَتَخْدُمُنِي الْحَائِضُ أَوْ تَدْنُو مِنِّي الْمَرْأَةُ وَهْىَ جُنُبٌ فَقَالَ عُرْوَةُ كُلُّ ذَلِكَ عَلَىَّ هَيِّنٌ، وَكُلُّ ذَلِكَ تَخْدُمُنِي، وَلَيْسَ عَلَى أَحَدٍ فِي ذَلِكَ بَأْسٌ، أَخْبَرَتْنِي عَائِشَةُ أَنَّهَا كَانَتْ تُرَجِّلُ ـ تَعْنِي ـ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حَائِضٌ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ مُجَاوِرٌ فِي الْمَسْجِدِ، يُدْنِي لَهَا رَأْسَهُ وَهْىَ فِي حُجْرَتِهَا، فَتُرَجِّلُهُ وَهْىَ حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 296In-book reference : Book 6, Hadith 3USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 295   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 297,
    "id": 297,
    "url": "https://sunnah.com/bukhari:297",
    "bookNumber": 6,
    "hadithNumber": 4,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، سَمِعَ زُهَيْرًا، عَنْ مَنْصُورٍ ابْنِ صَفِيَّةَ، أَنَّ أُمَّهُ، حَدَّثَتْهُ أَنَّ عَائِشَةَ حَدَّثَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَّكِئُ فِي حَجْرِي وَأَنَا حَائِضٌ، ثُمَّ يَقْرَأُ الْقُرْآنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 297In-book reference : Book 6, Hadith 4USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 298,
    "id": 298,
    "url": "https://sunnah.com/bukhari:298",
    "bookNumber": 6,
    "hadithNumber": 5,
    "narrator": "Narrated Um Salama:",
    "english": "While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and \nput on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then \ncalled me and made me lie with him under the same sheet.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، بَيْنَا أَنَا مَعَ النَّبِيِّ، صلى الله عليه وسلم مُضْطَجِعَةً فِي خَمِيصَةٍ إِذْ حِضْتُ، فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حِيضَتِي قَالَ ‏\n\"‏ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 298In-book reference : Book 6, Hadith 5USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 299,
    "id": 299,
    "url": "https://sunnah.com/bukhari:299",
    "bookNumber": 6,
    "hadithNumber": 6,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ، كِلاَنَا جُنُبٌ‏.‏   وَكَانَ يَأْمُرُنِي فَأَتَّزِرُ، فَيُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏  وَكَانَ يُخْرِجُ رَأْسَهُ إِلَىَّ وَهُوَ مُعْتَكِفٌ، فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 299, 300, 301In-book reference : Book 6, Hadith 6USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 298   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 300,
    "id": 300,
    "url": "https://sunnah.com/bukhari:300",
    "bookNumber": 6,
    "hadithNumber": 6,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he \nused to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in \nI`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods \n(menses).",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ، كِلاَنَا جُنُبٌ‏.‏   وَكَانَ يَأْمُرُنِي فَأَتَّزِرُ، فَيُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏  وَكَانَ يُخْرِجُ رَأْسَهُ إِلَىَّ وَهُوَ مُعْتَكِفٌ، فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 299, 300, 301In-book reference : Book 6, Hadith 6USC-MSA web (English) reference : Vol. 1, Book 6, Hadith 298   (deprecated numbering scheme)"
  }
]