[
  {
    "hadithGlobalNumber": 901,
    "id": 901,
    "url": "https://sunnah.com/bukhari:901",
    "bookNumber": 11,
    "hadithNumber": 25,
    "narrator": "Narrated Muhammad bin Seereen:",
    "english": "On a rainy day Ibn `Abbas said to his Mu'adh-dhin, \"After saying, 'Ash-hadu anna Muhammadan \nRasulullah' (I testify that Muhammad is Allah's Messenger (ﷺ)), do not say 'Haiya 'Alas-Salat' (come for the \nprayer) but say 'Pray in your houses'.\" (The man did so). But the people disliked it. Ibn `Abbas said, \n\"It was done by one who was much better than I (i.e. the Prophet (p.b.u.h) ). No doubt, the Jumua \nprayer is compulsory but I dislike to put you to task by bringing you out walking in mud and slush.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ أَخْبَرَنِي عَبْدُ الْحَمِيدِ، صَاحِبُ الزِّيَادِيِّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ ابْنُ عَمِّ، مُحَمَّدِ بْنِ سِيرِينَ قَالَ ابْنُ عَبَّاسٍ لِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَلاَ تَقُلْ حَىَّ عَلَى الصَّلاَةِ‏.‏ قُلْ صَلُّوا فِي بُيُوتِكُمْ‏.‏ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا، قَالَ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي، إِنَّ الْجُمُعَةَ عَزْمَةٌ، وَإِنِّي كَرِهْتُ أَنْ أُخْرِجَكُمْ، فَتَمْشُونَ فِي الطِّينِ وَالدَّحْضِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 901In-book reference : Book 11, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 24   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 902,
    "id": 902,
    "url": "https://sunnah.com/bukhari:902",
    "bookNumber": 11,
    "hadithNumber": 26,
    "narrator": "Narrated Aisha:",
    "english": "(the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. \noutskirts of Medina up to a distance of four miles or more from Medina). They used to pass through \ndust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. \nOne of them came to Allah's Messenger (ﷺ) who was in my house. The Prophet (ﷺ) said to him, \"I wish that you \nkeep yourself clean on this day of yours (i.e. take a bath).\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ، حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ يَوْمَ الْجُمُعَةِ مِنْ مَنَازِلِهِمْ وَالْعَوَالِي، فَيَأْتُونَ فِي الْغُبَارِ، يُصِيبُهُمُ الْغُبَارُ وَالْعَرَقُ، فَيَخْرُجُ مِنْهُمُ الْعَرَقُ، فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم إِنْسَانٌ مِنْهُمْ وَهْوَ عِنْدِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 902In-book reference : Book 11, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 25   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 903,
    "id": 903,
    "url": "https://sunnah.com/bukhari:903",
    "bookNumber": 11,
    "hadithNumber": 27,
    "narrator": "Narrated Yahya bin Sa`id:",
    "english": "I asked `Amra about taking a bath on Fridays. She replied, \" Aisha said, 'The people used to work (for \ntheir livelihood) and whenever they went for the Jumua prayer, they used to go to the mosque in the \nsame shape as they had been in work. So they were asked to take a bath on Friday.' \"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَنَّهُ سَأَلَ عَمْرَةَ عَنِ الْغُسْلِ، يَوْمَ الْجُمُعَةِ فَقَالَتْ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ النَّاسُ مَهَنَةَ أَنْفُسِهِمْ، وَكَانُوا إِذَا رَاحُوا إِلَى الْجُمُعَةِ رَاحُوا فِي هَيْئَتِهِمْ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 903In-book reference : Book 11, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 26   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 904,
    "id": 904,
    "url": "https://sunnah.com/bukhari:904",
    "bookNumber": 11,
    "hadithNumber": 28,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) used to offer the Jumua prayer immediately after midday.",
    "arabic": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 904In-book reference : Book 11, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 27   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 905,
    "id": 905,
    "url": "https://sunnah.com/bukhari:905",
    "bookNumber": 11,
    "hadithNumber": 29,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We used to offer the Jumua prayer early and then have an afternoon nap.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ كُنَّا نُبَكِّرُ بِالْجُمُعَةِ، وَنَقِيلُ بَعْدَ الْجُمُعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 905In-book reference : Book 11, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 28   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 906,
    "id": 906,
    "url": "https://sunnah.com/bukhari:906",
    "bookNumber": 11,
    "hadithNumber": 30,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) used to offer the prayer earlier if it was very cold; and if it was very hot he used to delay \nthe prayer, i.e. the Jumua prayer.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا أَبُو خَلْدَةَ ـ هُوَ خَالِدُ بْنُ دِينَارٍ ـ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اشْتَدَّ الْبَرْدُ بَكَّرَ بِالصَّلاَةِ، وَإِذَا اشْتَدَّ الْحَرُّ أَبْرَدَ بِالصَّلاَةِ، يَعْنِي الْجُمُعَةَ‏.‏ قَالَ يُونُسُ بْنُ بُكَيْرٍ أَخْبَرَنَا أَبُو خَلْدَةَ فَقَالَ بِالصَّلاَةِ، وَلَمْ يَذْكُرِ الْجُمُعَةَ‏.‏ وَقَالَ بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا أَبُو خَلْدَةَ قَالَ صَلَّى بِنَا أَمِيرٌ الْجُمُعَةَ ثُمَّ قَالَ لأَنَسٍ ـ رضى الله عنه ـ كَيْفَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ",
    "reference": "Reference : Sahih al-Bukhari 906In-book reference : Book 11, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 29   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 907,
    "id": 907,
    "url": "https://sunnah.com/bukhari:907",
    "bookNumber": 11,
    "hadithNumber": 31,
    "narrator": "Narrated Abu `Abs:",
    "english": "I heard the Prophet (ﷺ) saying, \"Anyone whose feet are covered with dust in Allah's cause, shall be saved \nby Allah from the Hell-Fire.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا عَبَايَةُ بْنُ رِفَاعَةَ، قَالَ أَدْرَكَنِي أَبُو عَبْسٍ وَأَنَا أَذْهَبُ، إِلَى الْجُمُعَةِ فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ حَرَّمَهُ اللَّهُ عَلَى النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 907In-book reference : Book 11, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 908,
    "id": 908,
    "url": "https://sunnah.com/bukhari:908",
    "bookNumber": 11,
    "hadithNumber": 32,
    "narrator": "Narrated Abu Huraira:",
    "english": "heard Allah's Messenger (ﷺ)s (p.b.u.h) saying, \"If the prayer is started do not run for it but just walk for it \ncalmly and pray whatever you get, and complete whatever is missed. \"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ الزُّهْرِيُّ عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَأْتُوهَا تَسْعَوْنَ، وَأْتُوهَا تَمْشُونَ عَلَيْكُمُ السَّكِينَةُ، فَمَا أَدْرَكْتُمْ فَصَلُّوا، وَمَا فَاتَكُمْ فَأَتِمُّوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 908In-book reference : Book 11, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 909,
    "id": 909,
    "url": "https://sunnah.com/bukhari:909",
    "bookNumber": 11,
    "hadithNumber": 33,
    "narrator": "Narrated `Abdullah bin Abi Qatada on the authority of his father:",
    "english": "The Prophet (p.b.u.h) said, \"Do not stand up (for prayer) unless you see me, and observe calmness and \nsolemnity\".",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنِي أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ ـ لاَ أَعْلَمُهُ إِلاَّ عَنْ أَبِيهِ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُوا حَتَّى تَرَوْنِي، وَعَلَيْكُمُ السَّكِينَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 909In-book reference : Book 11, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 910,
    "id": 910,
    "url": "https://sunnah.com/bukhari:910",
    "bookNumber": 11,
    "hadithNumber": 34,
    "narrator": "Narrated Salman Al-Farsi:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Anyone who takes a bath on Friday and cleans himself as much as he \ncan and puts oil (on his hair) or scents himself; and then proceeds for the prayer and does not force his \nway between two persons (assembled in the mosque for the Friday prayer), and prays as much as is \nwritten for him and remains quiet when the Imam delivers the Khutba, all his sins in between the \npresent and the last Friday will be forgiven.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ وَدِيعَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ، وَتَطَهَّرَ بِمَا اسْتَطَاعَ مِنْ طُهْرٍ، ثُمَّ ادَّهَنَ أَوْ مَسَّ مِنْ طِيبٍ، ثُمَّ رَاحَ فَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ، فَصَلَّى مَا كُتِبَ لَهُ، ثُمَّ إِذَا خَرَجَ الإِمَامُ أَنْصَتَ، غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 910In-book reference : Book 11, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 911,
    "id": 911,
    "url": "https://sunnah.com/bukhari:911",
    "bookNumber": 11,
    "hadithNumber": 35,
    "narrator": "Narrated Ibn Juraij:",
    "english": "I heard Nazi' saying, \"Ibn `Umar, said, 'The Prophet (ﷺ) forbade that a man should make another man to \nget up to sit in his place' \". I said to Nafi`, 'Is it for Jumua prayer only?' He replied, \"For Jumua prayer \nand any other (prayer).\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يَقُولُ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُقِيمَ الرَّجُلُ أَخَاهُ مِنْ مَقْعَدِهِ وَيَجْلِسَ فِيهِ‏.‏ قُلْتُ لِنَافِعٍ الْجُمُعَةَ قَالَ الْجُمُعَةَ وَغَيْرَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 911In-book reference : Book 11, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 912,
    "id": 912,
    "url": "https://sunnah.com/bukhari:912",
    "bookNumber": 11,
    "hadithNumber": 36,
    "narrator": "Narrated As-Saib bin Yazid:",
    "english": "In the lifetime of the Prophet, Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be \npronounced when the Imam sat on the pulpit. But during the Caliphate of `Uthman when the Muslims \nincreased in number, a third Adhan at Az-Zaura' was added. Abu `Abdullah said, \"Az-Zaura' is a place \nin the market of Medina.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ النِّدَاءُ يَوْمَ الْجُمُعَةِ أَوَّلُهُ إِذَا جَلَسَ الإِمَامُ عَلَى الْمِنْبَرِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ عُثْمَانُ ـ رضى الله عنه ـ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 912In-book reference : Book 11, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 913,
    "id": 913,
    "url": "https://sunnah.com/bukhari:913",
    "bookNumber": 11,
    "hadithNumber": 37,
    "narrator": "Narrated As-Saib bin Yazid:",
    "english": "The person who increased the number of Adhans for the Jumua prayers to three was `Uthman bin \n`Affan and it was when the number of the (Muslim) people of Medina had increased. In the lifetime of \nthe Prophet (ﷺ) there was only one Mu'adh-dhin and the Adhan used to be pronounced only after the \nImam had taken his seat (i.e. on the pulpit).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ الَّذِي، زَادَ التَّأْذِينَ الثَّالِثَ يَوْمَ الْجُمُعَةِ عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ، وَلَمْ يَكُنْ لِلنَّبِيِّ صلى الله عليه وسلم مُؤَذِّنٌ غَيْرَ وَاحِدٍ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ، يَعْنِي عَلَى الْمِنْبَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 913In-book reference : Book 11, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 914,
    "id": 914,
    "url": "https://sunnah.com/bukhari:914",
    "bookNumber": 11,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Umama bin Sahl bin Hunaif:",
    "english": "I heard Muawiya bin Abi Sufyan (repeating the statements of the Adhan) while he was sitting on the \npulpit. When the Mu'adh-dhin pronounced the Adhan saying, \"Allahu-Akbar, Allahu Akbar\", \nMuawiya said: \"Allah Akbar, Allahu Akbar.\" And when the Mu'adh-dhin said, \"Ash-hadu an la ilaha \nillal-lah (I testify that none has the right to be worshipped but Allah)\", Muawiya said, \"And (so do) I\". \nWhen he said, \"Ash-hadu anna Muhammadan Rasulullah\" (I testify that Muhammad is Allah's \nApostle), Muawiya said, \"And (so do) I\". When the Adhan was finished, Muawiya said, \"O people, \nwhen the Mu'adh-dhin pronounced the Adhan I heard Allah's Messenger (ﷺ) on this very pulpit saying what \nyou have just heard me saying\".",
    "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ،، وَهُوَ جَالِسٌ عَلَى الْمِنْبَرِ، أَذَّنَ الْمُؤَذِّنُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ مُعَاوِيَةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَقَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَلَمَّا أَنْ قَضَى التَّأْذِينَ قَالَ يَا أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى هَذَا الْمَجْلِسِ حِينَ أَذَّنَ الْمُؤَذِّنُ يَقُولُ مَا سَمِعْتُمْ مِنِّي مِنْ مَقَالَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 914In-book reference : Book 11, Hadith 38USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 37   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 915,
    "id": 915,
    "url": "https://sunnah.com/bukhari:915",
    "bookNumber": 11,
    "hadithNumber": 39,
    "narrator": "Narrated As-Sa'ib bin Yazid I:",
    "english": "`Uthman bin `Affan introduced the second Adhan on Fridays when the number of the people in the \nmosque increased. Previously the Adhan on Fridays used to be pronounced only after the Imam had \ntaken his seat (on the pulpit).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّ التَّأْذِينَ الثَّانِيَ يَوْمَ الْجُمُعَةِ أَمَرَ بِهِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَسْجِدِ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 915In-book reference : Book 11, Hadith 39USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 38   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 916,
    "id": 916,
    "url": "https://sunnah.com/bukhari:916",
    "bookNumber": 11,
    "hadithNumber": 40,
    "narrator": "Narrated Az-Zuhri:",
    "english": "I heard As-Saib bin Yazid, saying, \"In the lifetime of Allah's Messenger (ﷺ), and Abu Bakr and `Umar, the \nAdhan for the Jumua prayer used to be pronounced after the Imam had taken his seat on the pulpit. \nBut when the people increased in number during the caliphate of `Uthman, he introduced a third \nAdhan (on Friday for the Jumua prayer) and it was pronounced at Az-Zaura' and that new state of \naffairs remained so in the succeeding years.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ إِنَّ الأَذَانَ يَوْمَ الْجُمُعَةِ كَانَ أَوَّلُهُ حِينَ يَجْلِسُ الإِمَامُ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ فِي خِلاَفَةِ عُثْمَانَ ـ رضى الله عنه ـ وَكَثُرُوا، أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالأَذَانِ الثَّالِثِ، فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ، فَثَبَتَ الأَمْرُ عَلَى ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 916In-book reference : Book 11, Hadith 40USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 39   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 917,
    "id": 917,
    "url": "https://sunnah.com/bukhari:917",
    "bookNumber": 11,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Hazim bin Dinar:",
    "english": "Some people went to Sahl bin Sa`d As-Sa`idi and told him that they had different opinions regarding \nthe wood of the pulpit. They asked him about it and he said, \"By Allah, I know of what wood the \npulpit was made, and no doubt I saw it on the very first day when Allah's Messenger (ﷺ) took his seat on it. \nAllah's Messenger (ﷺ) sent for such and such an Ansari woman (and Sahl mentioned her name) and said to \nher, 'Order your slave-carpenter to prepare for me some pieces of wood (i.e. pulpit) on which I may sit \nat the time of addressing the people.' So she ordered her slave-carpenter and he made it from the \ntamarisk of the forest and brought it (to the woman). The woman sent that (pulpit) to Allah's Messenger (ﷺ) \nwho ordered it to be placed here. Then I saw Allah's Messenger (ﷺ) praying on it and then bowed on it. Then \nhe stepped back, got down and prostrated on the ground near the foot of the pulpit and again ascended \nthe pulpit. After finishing the prayer he faced the people and said, 'I have done this so that you may \nfollow me and learn the way I pray.' \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ الإِسْكَنْدَرَانِيُّ، قَالَ حَدَّثَنَا أَبُو حَازِمِ بْنُ دِينَارٍ، أَنَّ رِجَالاً، أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، وَقَدِ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لأَعْرِفُ مِمَّا هُوَ، وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ، وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فُلاَنَةَ ـ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ ـ ‏\"‏ مُرِي غُلاَمَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ ‏\"‏‏.‏ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا، فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا، ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَيْهَا، وَكَبَّرَ وَهْوَ عَلَيْهَا، ثُمَّ رَكَعَ وَهْوَ عَلَيْهَا، ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا وَلِتَعَلَّمُوا صَلاَتِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 917In-book reference : Book 11, Hadith 41USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 918,
    "id": 918,
    "url": "https://sunnah.com/bukhari:918",
    "bookNumber": 11,
    "hadithNumber": 42,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit \nwas placed for him we heard that stem crying like a pregnant she-camel till the Prophet (ﷺ) got down from \nthe pulpit and placed his hand over it.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَنَسٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كَانَ جِذْعٌ يَقُومُ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا وُضِعَ لَهُ الْمِنْبَرُ سَمِعْنَا لِلْجِذْعِ مِثْلَ أَصْوَاتِ الْعِشَارِ حَتَّى نَزَلَ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ عَلَيْهِ‏.‏ قَالَ سُلَيْمَانُ عَنْ يَحْيَى أَخْبَرَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ أَنَّهُ سَمِعَ جَابِرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 918In-book reference : Book 11, Hadith 42USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 919,
    "id": 919,
    "url": "https://sunnah.com/bukhari:919",
    "bookNumber": 11,
    "hadithNumber": 43,
    "narrator": "Narrated Salim:",
    "english": "My father said , \"I heard the Prophet (ﷺ) delivering the Khutba on the pulpit and he said, 'Whoever comes \nfor the Jumua prayer should take a bath (before coming).' \"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ مَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 919In-book reference : Book 11, Hadith 43USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 920,
    "id": 920,
    "url": "https://sunnah.com/bukhari:920",
    "bookNumber": 11,
    "hadithNumber": 44,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (p.b.u.h) used to deliver the Khutba while standing and then he would sit, then stand \nagain as you do now-a-days.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ ثُمَّ يَقُومُ، كَمَا تَفْعَلُونَ الآنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 920In-book reference : Book 11, Hadith 44USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 43   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 921,
    "id": 921,
    "url": "https://sunnah.com/bukhari:921",
    "bookNumber": 11,
    "hadithNumber": 45,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "One day the Prophet (ﷺ) sat on the pulpit and we sat around him.",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم جَلَسَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 921In-book reference : Book 11, Hadith 45USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 922,
    "id": 922,
    "url": "https://sunnah.com/bukhari:922",
    "bookNumber": 11,
    "hadithNumber": 46,
    "narrator": "Narrated Fatima bint Al-Mundhir:",
    "english": "Asma' bint Abi Bakr As-Siddiq said, \"I went to 'Aishah and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' added, \"Allah's Messenger (ﷺ) prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger (ﷺ) finished Salat, and the solar eclipse had cleared, the Prophet (ﷺ) addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet (ﷺ) had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad (ﷺ)) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet (ﷺ) used), will say, 'He is Allah's Messenger (ﷺ) and he is Muhammad (ﷺ) who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet (ﷺ) used), will be asked what he knew about this man (Prophet Muhammed (ﷺ)). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely.\"",
    "arabic": "وَقَالَ مَحْمُودٌ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَالنَّاسُ يُصَلُّونَ قُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا أَىْ نَعَمْ‏.‏ قَالَتْ فَأَطَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم جِدًّا حَتَّى تَجَلاَّنِي الْغَشْىُ وَإِلَى جَنْبِي قِرْبَةٌ فِيهَا مَاءٌ فَفَتَحْتُهَا فَجَعَلْتُ أَصُبُّ مِنْهَا عَلَى رَأْسِي، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، وَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ قَالَتْ وَلَغِطَ نِسْوَةٌ مِنَ الأَنْصَارِ، فَانْكَفَأْتُ إِلَيْهِنَّ لأُسَكِّتَهُنَّ فَقُلْتُ لِعَائِشَةَ مَا قَالَ قَالَتْ قَالَ ‏\"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ، وَإِنَّهُ قَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ ـ أَوْ قَرِيبَ مِنْ ـ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُؤْتَى أَحَدُكُمْ، فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوْ قَالَ الْمُوقِنُ شَكَّ هِشَامٌ ـ فَيَقُولُ هُوَ رَسُولُ اللَّهِ، هُوَ مُحَمَّدٌ صلى الله عليه وسلم جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَآمَنَّا وَأَجَبْنَا وَاتَّبَعْنَا وَصَدَّقْنَا‏.‏ فَيُقَالُ لَهُ نَمْ صَالِحًا، قَدْ كُنَّا نَعْلَمُ إِنْ كُنْتَ لَتُؤْمِنُ بِهِ‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوْ قَالَ الْمُرْتَابُ شَكَّ هِشَامٌ ـ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏ قَالَ هِشَامٌ فَلَقَدْ قَالَتْ لِي فَاطِمَةُ فَأَوْعَيْتُهُ، غَيْرَ أَنَّهَا ذَكَرَتْ مَا يُغَلِّظُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 922In-book reference : Book 11, Hadith 46USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 923,
    "id": 923,
    "url": "https://sunnah.com/bukhari:923",
    "bookNumber": 11,
    "hadithNumber": 47,
    "narrator": "Narrated `Amr bin Taghlib:",
    "english": "Some property or something was brought to Allah's Messenger (ﷺ) and he distributed it. He gave to some \nmen and ignored the others. Later he got the news of his being admonished by those whom he had \nignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and \nignore another, although the one whom I ignore is more beloved to me than the one whom I give. But \nI give to some people as I feel that they have no patience and no contentment in their hearts and I \nleave those who are patient and self-content with the goodness and wealth which Allah has put into \ntheir hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's \nApostle are more beloved to me than the best red camels.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ جَرِيرِ بْنِ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِمَالٍ أَوْ سَبْىٍ فَقَسَمَهُ، فَأَعْطَى رِجَالاً وَتَرَكَ رِجَالاً فَبَلَغَهُ أَنَّ الَّذِينَ تَرَكَ عَتَبُوا، فَحَمِدَ اللَّهَ ثُمَّ أَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ، فَوَاللَّهِ إِنِّي لأُعْطِي الرَّجُلَ، وَأَدَعُ الرَّجُلَ، وَالَّذِي أَدَعُ أَحَبُّ إِلَىَّ مِنَ الَّذِي أُعْطِي وَلَكِنْ أُعْطِي أَقْوَامًا لِمَا أَرَى فِي قُلُوبِهِمْ مِنَ الْجَزَعِ وَالْهَلَعِ، وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنَ الْغِنَى وَالْخَيْرِ، فِيهِمْ عَمْرُو بْنُ تَغْلِبَ ‏\"‏‏.‏ فَوَاللَّهِ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم حُمْرَ النَّعَمِ‏.‏ تَابَعَهُ يُونُسُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 923In-book reference : Book 11, Hadith 47USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 924,
    "id": 924,
    "url": "https://sunnah.com/bukhari:924",
    "bookNumber": 11,
    "hadithNumber": 48,
    "narrator": "Narrated Aisha:",
    "english": "Once in the middle of the night Allah's Messenger (ﷺ) (p.b.u.h) went out and prayed in the mosque and some \nmen prayed with him. The next morning the people spoke about it and so more people gathered and \nprayed with him (in the second night). They circulated the news in the morning, and so, on the third \nnight the number of people increased greatly. Allah's Messenger (ﷺ) (p.b.u.h) came out and they prayed \nbehind him. On the fourth night the mosque was overwhelmed by the people till it could not \naccommodate them. Allah's Messenger (ﷺ) came out only for the Fajr prayer and when he finished the \nprayer, he faced the people and recited \"Tashah-hud\" (I testify that none has the right to be \nworshipped but Allah and that Muhammad is His Apostle), and then said, \"Amma ba'du. Verily your \npresence (in the mosque at night) was not hidden from me, but I was afraid that this prayer (Prayer of \nTahajjud) might be made compulsory and you might not be able to carry it out.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ ذَاتَ لَيْلَةٍ مِنْ جَوْفِ اللَّيْلِ، فَصَلَّى فِي الْمَسْجِدِ، فَصَلَّى رِجَالٌ بِصَلاَتِهِ فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَصَلَّوْا مَعَهُ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّوْا بِصَلاَتِهِ، فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ حَتَّى خَرَجَ لِصَلاَةِ الصُّبْحِ، فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ، فَتَشَهَّدَ ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ مَكَانُكُمْ، لَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَا ‏\"‏‏.‏ تَابَعَهُ يُونُسُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 924In-book reference : Book 11, Hadith 48USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 46   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 925,
    "id": 925,
    "url": "https://sunnah.com/bukhari:925",
    "bookNumber": 11,
    "hadithNumber": 49,
    "narrator": "Narrated Abu Hummaid As-Sa`idi:",
    "english": "One night Allah's Messenger (ﷺ) (p.b.u.h) stood up after the prayer and recited \"Tashah-hud\" and then \npraised Allah as He deserved and said, \"Amma ba'du.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَشِيَّةً بَعْدَ الصَّلاَةِ، فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ الْعَدَنِيُّ عَنْ سُفْيَانَ فِي أَمَّا بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 925In-book reference : Book 11, Hadith 49USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 926,
    "id": 926,
    "url": "https://sunnah.com/bukhari:926",
    "bookNumber": 11,
    "hadithNumber": 50,
    "narrator": "Narrated Al-Miswar bin Makhrama:",
    "english": "Once Allah's Messenger (ﷺ) got up for delivering the Khutba and I heard him after \"Tashah-hud\" saying \n\"Amma ba'du.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمِعْتُهُ حِينَ تَشَهَّدَ يَقُولُ ‏\n\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 926In-book reference : Book 11, Hadith 50USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 927,
    "id": 927,
    "url": "https://sunnah.com/bukhari:927",
    "bookNumber": 11,
    "hadithNumber": 51,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once the Prophet (ﷺ) ascended the pulpit and it was the last gathering in which he took part. He was \ncovering his shoulder with a big cloak and binding his head with an oily bandage. He glorified and \npraised Allah and said, \"O people! Come to me.\" So the people came and gathered around him and he \nthen said, \"Amma ba'du.\" \"From now onward the Ansar will decrease and other people will increase. \nSo anybody who becomes a ruler of the followers of Muhammad and has the power to harm or benefit \npeople then he should accept the good from the benevolent amongst them (Ansar) and overlook the \nfaults of their wrong-doers.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا ابْنُ الْغَسِيلِ، قَالَ حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم الْمِنْبَرَ وَكَانَ آخِرَ مَجْلِسٍ جَلَسَهُ مُتَعَطِّفًا مِلْحَفَةً عَلَى مَنْكِبَيْهِ، قَدْ عَصَبَ رَأْسَهُ بِعِصَابَةٍ دَسِمَةٍ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَيُّهَا النَّاسُ إِلَىَّ ‏\"‏‏.‏ فَثَابُوا إِلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّ هَذَا الْحَىَّ مِنَ الأَنْصَارِ يَقِلُّونَ، وَيَكْثُرُ النَّاسُ، فَمَنْ وَلِيَ شَيْئًا مِنْ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم فَاسْتَطَاعَ أَنْ يَضُرَّ فِيهِ أَحَدًا أَوْ يَنْفَعَ فِيهِ أَحَدًا، فَلْيَقْبَلْ مِنْ مُحْسِنِهِمْ، وَيَتَجَاوَزْ عَنْ مُسِيِّهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 927In-book reference : Book 11, Hadith 51USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 928,
    "id": 928,
    "url": "https://sunnah.com/bukhari:928",
    "bookNumber": 11,
    "hadithNumber": 52,
    "narrator": "Narrated `Abdullah Ibn `Umar:",
    "english": "The Prophet (ﷺ) used to deliver two Khutbas and sit in between them.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ خُطْبَتَيْنِ يَقْعُدُ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 928In-book reference : Book 11, Hadith 52USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 929,
    "id": 929,
    "url": "https://sunnah.com/bukhari:929",
    "bookNumber": 11,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"When it is a Friday, the angels stand at the gate of the mosque and keep on writing \nthe names of the persons coming to the mosque in succession according to their arrivals. The example \nof the one who enters the mosque in the earliest hour is that of one offering a camel (in sacrifice). The \none coming next is like one offering a cow and then a ram and then a chicken and then an egg \nrespectively. When the Imam comes out (for Jumua prayer) they (i.e. angels) fold their papers and \nlisten to the Khutba.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ، وَقَفَتِ الْمَلاَئِكَةُ عَلَى باب الْمَسْجِدِ يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ، وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي بَدَنَةً، ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً، ثُمَّ كَبْشًا، ثُمَّ دَجَاجَةً، ثُمَّ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ طَوَوْا صُحُفَهُمْ، وَيَسْتَمِعُونَ الذِّكْرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 929In-book reference : Book 11, Hadith 53USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 51   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 930,
    "id": 930,
    "url": "https://sunnah.com/bukhari:930",
    "bookNumber": 11,
    "hadithNumber": 54,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "A person entered the mosque while the Prophet (ﷺ) was delivering the Khutba on a Friday. The Prophet (ﷺ) \nsaid to him, \"Have you prayed?\" The man replied in the negative. The Prophet (ﷺ) said, \"Get up and pray \ntwo rak`at.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ رَجُلٌ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\"‏ أَصَلَّيْتَ يَا فُلاَنُ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 930In-book reference : Book 11, Hadith 54USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 52   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 931,
    "id": 931,
    "url": "https://sunnah.com/bukhari:931",
    "bookNumber": 11,
    "hadithNumber": 55,
    "narrator": "Narrated Jabir:",
    "english": "A man entered the Mosque while the Prophet (ﷺ) was delivering the Khutba. The Prophet (ﷺ) said to him, \n\"Have you prayed?\" The man replied in the negative. The Prophet (ﷺ) said, \"Pray two rak`at.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، قَالَ دَخَلَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ أَصَلَّيْتَ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 931In-book reference : Book 11, Hadith 55USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 53   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 932,
    "id": 932,
    "url": "https://sunnah.com/bukhari:932",
    "bookNumber": 11,
    "hadithNumber": 56,
    "narrator": "Narrated Anas:",
    "english": "While the Prophet (ﷺ) was delivering the Khutba on a Friday, a man stood up and said, \"O, Allah's \nApostle! The livestock and the sheep are dying, so pray to Allah for rain.\" So he (the Prophet) raised \nboth his hands and invoked Allah (for it).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ،‏.‏ وَعَنْ يُونُسَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَ الْكُرَاعُ، وَهَلَكَ الشَّاءُ، فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا‏.‏ فَمَدَّ يَدَيْهِ وَدَعَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 932In-book reference : Book 11, Hadith 56USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 54   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 933,
    "id": 933,
    "url": "https://sunnah.com/bukhari:933",
    "bookNumber": 11,
    "hadithNumber": 57,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once in the lifetime of the Prophet (p.b.u.h) the people were afflicted with drought (famine). While \nthe Prophet (ﷺ) was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Messenger (ﷺ)! \nOur possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So \nthe Prophet (ﷺ) raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose \nHands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got \ndown from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next \nday, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and \nsaid, \"O Allah's Messenger (ﷺ)! The houses have collapsed, our possessions and livestock have been \ndrowned; Please invoke Allah (to protect us)\". So the Prophet (ﷺ) raised both his hands and said, \"O \nAllah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds \ndispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The \nvalley of Qanat remained flooded, for one month, none came from outside but talked about the \nabundant rain.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا أَبُو عَمْرٍو، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَصَابَتِ النَّاسَ سَنَةٌ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَبَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فِي يَوْمِ جُمُعَةٍ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ، فَادْعُ اللَّهَ لَنَا‏.‏ فَرَفَعَ يَدَيْهِ، وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً، فَوَالَّذِي نَفْسِي بِيَدِهِ مَا وَضَعَهَا حَتَّى ثَارَ السَّحَابُ أَمْثَالَ الْجِبَالِ، ثُمَّ لَمْ يَنْزِلْ عَنْ مِنْبَرِهِ حَتَّى رَأَيْتُ الْمَطَرَ يَتَحَادَرُ عَلَى لِحْيَتِهِ صلى الله عليه وسلم فَمُطِرْنَا يَوْمَنَا ذَلِكَ، وَمِنَ الْغَدِ، وَبَعْدَ الْغَدِ وَالَّذِي يَلِيهِ، حَتَّى الْجُمُعَةِ الأُخْرَى، وَقَامَ ذَلِكَ الأَعْرَابِيُّ ـ أَوْ قَالَ غَيْرُهُ ـ فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَ الْبِنَاءُ وَغَرِقَ الْمَالُ، فَادْعُ اللَّهَ لَنَا‏.‏ فَرَفَعَ يَدَيْهِ، فَقَالَ ‏\n\"‏ اللَّهُمَّ حَوَالَيْنَا، وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ مِنَ السَّحَابِ إِلاَّ انْفَرَجَتْ، وَصَارَتِ الْمَدِينَةُ مِثْلَ الْجَوْبَةِ، وَسَالَ الْوَادِي قَنَاةُ شَهْرًا، وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلاَّ حَدَّثَ بِالْجَوْدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 933In-book reference : Book 11, Hadith 57USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 934,
    "id": 934,
    "url": "https://sunnah.com/bukhari:934",
    "bookNumber": 11,
    "hadithNumber": 58,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"When the Imam is delivering the Khutba, and you ask your companion \nto keep quiet and listen, then no doubt you have done an evil act.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قُلْتَ لِصَاحِبِكَ يَوْمَ الْجُمُعَةِ أَنْصِتْ‏.‏ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 934In-book reference : Book 11, Hadith 58USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 56   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 935,
    "id": 935,
    "url": "https://sunnah.com/bukhari:935",
    "bookNumber": 11,
    "hadithNumber": 59,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) talked about Friday and said, \"There is an hour (opportune time) on Friday \nand if a Muslim gets it while praying and asks something from Allah, then Allah will definitely meet \nhis demand.\" And he (the Prophet) pointed out the shortness of that time with his hands.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\n\"‏ فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وَهْوَ قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏‏.‏ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 935In-book reference : Book 11, Hadith 59USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 57   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 936,
    "id": 936,
    "url": "https://sunnah.com/bukhari:936",
    "bookNumber": 11,
    "hadithNumber": 60,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "While we were praying (Jumua Khutba & prayer) with the Prophet (p.b.u.h), some camels loaded with \nfood, arrived (from Sham). The people diverted their attention towards the camels (and left the \nmosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when \nthey see Some bargain or some amusement, They disperse headlong to it, And leave you standing.\" \n(62.11)",
    "arabic": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَتْ عِيرٌ تَحْمِلُ طَعَامًا، فَالْتَفَتُوا إِلَيْهَا حَتَّى مَا بَقِيَ مَعَ النَّبِيِّ صلى الله عليه وسلم إِلاَّ اثْنَا عَشَرَ رَجُلاً، فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 936In-book reference : Book 11, Hadith 60USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 58   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 937,
    "id": 937,
    "url": "https://sunnah.com/bukhari:937",
    "bookNumber": 11,
    "hadithNumber": 61,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) used to pray two rak`at before the Zuhr prayer and two rak`at after it. He also used to \npray two rak`at after the Maghrib prayer in his house, and two rak`at after the `Isha' prayer. He never \nprayed after Jumua prayer till he departed (from the Mosque), and then he would pray two rak`at at \nhome.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ، وَبَعْدَهَا رَكْعَتَيْنِ، وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ، وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 937In-book reference : Book 11, Hadith 61USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 938,
    "id": 938,
    "url": "https://sunnah.com/bukhari:938",
    "bookNumber": 11,
    "hadithNumber": 62,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "There was a woman amongst us who had a farm and she used to sow Silq (a kind of vegetable) on the \nedges of streams in her farm. On Fridays she used to pull out the Silq from its roots and put the roots \nin a utensil. Then she would put a handful of powdered barley over it and cook it. The roots of the Silq \nwere a substitute for meat. After finishing the Jumua prayer we used to greet her and she would give \nus that food which we would eat with our hands, and because of that meal, we used to look forward to \nFriday.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ كَانَتْ فِينَا امْرَأَةٌ تَجْعَلُ عَلَى أَرْبِعَاءَ فِي مَزْرَعَةٍ لَهَا سِلْقًا، فَكَانَتْ إِذَا كَانَ يَوْمُ جُمُعَةٍ تَنْزِعُ أُصُولَ السِّلْقِ فَتَجْعَلُهُ فِي قِدْرٍ، ثُمَّ تَجْعَلُ عَلَيْهِ قَبْضَةً مِنْ شَعِيرٍ تَطْحَنُهَا، فَتَكُونُ أُصُولُ السِّلْقِ عَرْقَهُ، وَكُنَّا نَنْصَرِفُ مِنْ صَلاَةِ الْجُمُعَةِ فَنُسَلِّمُ عَلَيْهَا، فَتُقَرِّبُ ذَلِكَ الطَّعَامَ إِلَيْنَا فَنَلْعَقُهُ، وَكُنَّا نَتَمَنَّى يَوْمَ الْجُمُعَةِ لِطَعَامِهَا ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 938In-book reference : Book 11, Hadith 62USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 60   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 939,
    "id": 939,
    "url": "https://sunnah.com/bukhari:939",
    "bookNumber": 11,
    "hadithNumber": 63,
    "narrator": "Narrated Sahl:",
    "english": "As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua \nprayer.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، بِهَذَا وَقَالَ مَا كُنَّا نَقِيلُ وَلاَ نَتَغَدَّى إِلاَّ بَعْدَ الْجُمُعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 939In-book reference : Book 11, Hadith 63USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 61   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 940,
    "id": 940,
    "url": "https://sunnah.com/bukhari:940",
    "bookNumber": 11,
    "hadithNumber": 64,
    "narrator": "Narrated Anas:",
    "english": "We used to offer the Jumua prayer early and then have the afternoon nap.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُقْبَةَ الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كُنَّا نُبَكِّرُ إِلَى الْجُمُعَةِ ثُمَّ نَقِيلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 940In-book reference : Book 11, Hadith 64USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 62   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 941,
    "id": 941,
    "url": "https://sunnah.com/bukhari:941",
    "bookNumber": 11,
    "hadithNumber": 65,
    "narrator": "Narrated Sahl:",
    "english": "We used to offer the Jumua prayer with the Prophet (ﷺ) and then take the afternoon nap.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ تَكُونُ الْقَائِلَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 941In-book reference : Book 11, Hadith 65USC-MSA web (English) reference : Vol. 2, Book 13, Hadith 63   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 942,
    "id": 942,
    "url": "https://sunnah.com/bukhari:942",
    "bookNumber": 12,
    "hadithNumber": 1,
    "narrator": "Narrated Shu'aib:",
    "english": "I asked Az-Zuhri, \"Did the Prophet (ﷺ) ever offer the Fear Prayer?\" Az-Zuhri said, \"I was told by Salim \nthat `Abdullah bin `Umar I had said, 'I took part in a holy battle with Allah's Messenger (ﷺ) I in Najd. We \nfaced the enemy and arranged ourselves in rows. Then Allah's Messenger (ﷺ) (p.b.u.h) stood up to lead the \nprayer and one party stood to pray with him while the other faced the enemy. Allah's Messenger (ﷺ) (p.b.u.h) \nand the former party bowed and performed two prostrations. Then that party left and took the place of \nthose who had not prayed. Allah's Messenger (ﷺ) prayed one rak`a (with the latter) and performed two \nprostrations and finished his prayer with Taslim. Then everyone of them bowed once and performed \ntwo prostrations individually.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَأَلْتُهُ هَلْ صَلَّى النَّبِيُّ صلى الله عليه وسلم يَعْنِي صَلاَةَ الْخَوْفِ قَالَ أَخْبَرَنِي سَالِمٌ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَوَازَيْنَا الْعَدُوَّ فَصَافَفْنَا لَهُمْ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي لَنَا فَقَامَتْ طَائِفَةٌ مَعَهُ تُصَلِّي، وَأَقْبَلَتْ طَائِفَةٌ عَلَى الْعَدُوِّ وَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْ مَعَهُ، وَسَجَدَ سَجْدَتَيْنِ، ثُمَّ انْصَرَفُوا مَكَانَ الطَّائِفَةِ الَّتِي لَمْ تُصَلِّ، فَجَاءُوا، فَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِهِمْ رَكْعَةً، وَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ، فَقَامَ كُلُّ وَاحِدٍ مِنْهُمْ فَرَكَعَ لِنَفْسِهِ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 942In-book reference : Book 12, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 64   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 943,
    "id": 943,
    "url": "https://sunnah.com/bukhari:943",
    "bookNumber": 12,
    "hadithNumber": 2,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar said something similar to Mujahid's saying: Whenever (Muslims and non-Muslims) stand \nface to face in battle, the Muslims can pray while standing. Ibn `Umar added, \"The Prophet (ﷺ) said, 'If \nthe number of the enemy is greater than the Muslims, they can pray while standing or riding \n(individually).' \"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، نَحْوًا مِنْ قَوْلِ مُجَاهِدٍ إِذَا اخْتَلَطُوا قِيَامًا‏.‏ وَزَادَ ابْنُ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ وَإِنْ كَانُوا أَكْثَرَ مِنْ ذَلِكَ فَلْيُصَلُّوا قِيَامًا وَرُكْبَانًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 943In-book reference : Book 12, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 65   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 944,
    "id": 944,
    "url": "https://sunnah.com/bukhari:944",
    "bookNumber": 12,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir \n(Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated \nand they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a \nleft and guarded their brothers. The second party joined him and performed bowing and prostration \nwith him. All the people were in prayer but they were guarding one another during the prayer.",
    "arabic": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَامَ النَّبِيُّ صلى الله عليه وسلم وَقَامَ النَّاسُ مَعَهُ، فَكَبَّرَ وَكَبَّرُوا مَعَهُ، وَرَكَعَ وَرَكَعَ نَاسٌ مِنْهُمْ، ثُمَّ سَجَدَ وَسَجَدُوا مَعَهُ، ثُمَّ قَامَ لِلثَّانِيَةِ فَقَامَ الَّذِينَ سَجَدُوا وَحَرَسُوا إِخْوَانَهُمْ، وَأَتَتِ الطَّائِفَةُ الأُخْرَى فَرَكَعُوا وَسَجَدُوا مَعَهُ، وَالنَّاسُ كُلُّهُمْ فِي صَلاَةٍ، وَلَكِنْ يَحْرُسُ بَعْضُهُمْ بَعْضًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 944In-book reference : Book 12, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 945,
    "id": 945,
    "url": "https://sunnah.com/bukhari:945",
    "bookNumber": 12,
    "hadithNumber": 4,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's \nApostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet (ﷺ) replied, \"By Allah! I too, \nhave not offered the prayer yet. \"The Prophet (ﷺ) then went to Buthan, performed ablution and performed \nthe `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
    "arabic": "حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ مُبَارَكٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ عُمَرُ يَوْمَ الْخَنْدَقِ، فَجَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ وَيَقُولُ يَا رَسُولَ اللَّهِ مَا صَلَّيْتُ الْعَصْرَ حَتَّى كَادَتِ الشَّمْسُ أَنْ تَغِيبَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَأَنَا وَاللَّهِ مَا صَلَّيْتُهَا بَعْدُ ‏\"‏‏.‏ قَالَ فَنَزَلَ إِلَى بُطْحَانَ فَتَوَضَّأَ، وَصَلَّى الْعَصْرَ بَعْدَ مَا غَابَتِ الشَّمْسُ، ثُمَّ صَلَّى الْمَغْرِبَ بَعْدَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 945In-book reference : Book 12, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 946,
    "id": 946,
    "url": "https://sunnah.com/bukhari:946",
    "bookNumber": 12,
    "hadithNumber": 5,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When the Prophet (ﷺ) returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet (ﷺ) was not what the former party had understood. And when that was told to the Prophet (ﷺ) he did not blame anyone of them.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لَنَا لَمَّا رَجَعَ مِنَ الأَحْزَابِ ‏\n\"‏ لاَ يُصَلِّيَنَّ أَحَدٌ الْعَصْرَ إِلاَّ فِي بَنِي قُرَيْظَةَ ‏\"‏‏.‏ فَأَدْرَكَ بَعْضُهُمُ الْعَصْرَ فِي الطَّرِيقِ فَقَالَ بَعْضُهُمْ لاَ نُصَلِّي حَتَّى نَأْتِيَهَا، وَقَالَ بَعْضُهُمْ بَلْ نُصَلِّي لَمْ يُرَدْ مِنَّا ذَلِكَ‏.‏ فَذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم فَلَمْ يُعَنِّفْ وَاحِدًا مِنْهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 946In-book reference : Book 12, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 947,
    "id": 947,
    "url": "https://sunnah.com/bukhari:947",
    "bookNumber": 12,
    "hadithNumber": 6,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah \nAkbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of \nthose who have been warned.\" The people came out into the streets saying, \"Muhammad and his \narmy.\" Allah's Messenger (ﷺ) vanquished them by force and their warriors were killed; the children and \nwomen were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's \nApostle go who married her and her Mahr was her manumission.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، وَثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الصُّبْحَ بِغَلَسٍ ثُمَّ رَكِبَ فَقَالَ ‏\n\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏ فَخَرَجُوا يَسْعَوْنَ فِي السِّكَكِ وَيَقُولُونَ مُحَمَّدٌ وَالْخَمِيسُ ـ قَالَ وَالْخَمِيسُ الْجَيْشُ ـ فَظَهَرَ عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَتَلَ الْمُقَاتِلَةَ وَسَبَى الذَّرَارِيَّ، فَصَارَتْ صَفِيَّةُ لِدِحْيَةَ الْكَلْبِيِّ، وَصَارَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ تَزَوَّجَهَا وَجَعَلَ صَدَاقَهَا عِتْقَهَا‏.‏ فَقَالَ عَبْدُ الْعَزِيزِ لِثَابِتٍ يَا أَبَا مُحَمَّدٍ، أَنْتَ سَأَلْتَ أَنَسًا مَا أَمْهَرَهَا قَالَ أَمْهَرَهَا نَفْسَهَا‏.‏ فَتَبَسَّمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 947In-book reference : Book 12, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 14, Hadith 68   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 948,
    "id": 948,
    "url": "https://sunnah.com/bukhari:948",
    "bookNumber": 13,
    "hadithNumber": 1,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "`Umar bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nTake it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) \n(p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period \nAllah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) \n(p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had \nno share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and \nfulfill your needs by it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ أَخَذَ عُمَرُ جُبَّةً مِنْ إِسْتَبْرَقٍ تُبَاعُ فِي السُّوقِ، فَأَخَذَهَا فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ ابْتَعْ هَذِهِ تَجَمَّلْ بِهَا لِلْعِيدِ وَالْوُفُودِ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ فَلَبِثَ عُمَرُ مَا شَاءَ اللَّهُ أَنْ يَلْبَثَ، ثُمَّ أَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِجُبَّةِ دِيبَاجٍ، فَأَقْبَلَ بِهَا عُمَرُ، فَأَتَى بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ وَأَرْسَلْتَ إِلَىَّ بِهَذِهِ الْجُبَّةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَبِيعُهَا أَوْ تُصِيبُ بِهَا حَاجَتَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 948In-book reference : Book 13, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 949,
    "id": 949,
    "url": "https://sunnah.com/bukhari:949",
    "bookNumber": 13,
    "hadithNumber": 2,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.",
    "arabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنَا عَمْرٌو، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ الأَسَدِيَّ، حَدَّثَهُ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، وَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.‏ وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ، وَهُوَ يَقُولُ ‏\"‏ دُونَكُمْ يَا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 949, 950In-book reference : Book 13, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 950,
    "id": 950,
    "url": "https://sunnah.com/bukhari:950",
    "bookNumber": 13,
    "hadithNumber": 2,
    "narrator": "Narrated Aisha:",
    "english": "Allah's Messenger (ﷺ) (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath \n(a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). \nThe Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke \nto me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Messenger (ﷺ) \n(p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I \nsignaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing \nwith shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would \nlike to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind \nhim and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got \ntired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the \naffirmative and he told me to leave.",
    "arabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنَا عَمْرٌو، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ الأَسَدِيَّ، حَدَّثَهُ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، وَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.‏ وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ، وَهُوَ يَقُولُ ‏\"‏ دُونَكُمْ يَا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 949, 950In-book reference : Book 13, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 951,
    "id": 951,
    "url": "https://sunnah.com/bukhari:951",
    "bookNumber": 13,
    "hadithNumber": 3,
    "narrator": "Narrated Al-Bara':",
    "english": "I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first \nday of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the \nname of Allah) and whoever does so, he acted according to our Sunna (traditions).\"",
    "arabic": "حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\n\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ مِنْ يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ فَقَدْ أَصَابَ سُنَّتَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 951In-book reference : Book 13, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 71   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 952,
    "id": 952,
    "url": "https://sunnah.com/bukhari:952",
    "bookNumber": 13,
    "hadithNumber": 4,
    "narrator": "Narrated Aisha:",
    "english": "Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the \nAnsar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical \ninstruments of Satan in the house of Allah's Messenger (ﷺ) !\" It happened on the `Id day and Allah's Messenger (ﷺ) \nsaid, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتِ الأَنْصَارُ يَوْمَ بُعَاثَ ـ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ ـ فَقَالَ أَبُو بَكْرٍ أَمَزَامِيرُ الشَّيْطَانِ فِي بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَلِكَ فِي يَوْمِ عِيدٍ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا، وَهَذَا عِيدُنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 952In-book reference : Book 13, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 953,
    "id": 953,
    "url": "https://sunnah.com/bukhari:953",
    "bookNumber": 13,
    "hadithNumber": 5,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some \ndates. Anas also narrated: The Prophet (ﷺ) used to eat odd number of dates.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَغْدُو يَوْمَ الْفِطْرِ حَتَّى يَأْكُلَ تَمَرَاتٍ‏.‏ وَقَالَ مُرَجَّى بْنُ رَجَاءٍ حَدَّثَنِي عُبَيْدُ اللَّهِ قَالَ حَدَّثَنِي أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم وَيَأْكُلُهُنَّ وِتْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 953In-book reference : Book 13, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 954,
    "id": 954,
    "url": "https://sunnah.com/bukhari:954",
    "bookNumber": 13,
    "hadithNumber": 6,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" \nA man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned \nsomething about his neighbors. It seemed that the Prophet (ﷺ) I believed him. Then the same man added, \n\"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet (ﷺ) permitted \nhim to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for \nothers as well.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ‏.‏ وَذَكَرَ مِنْ جِيرَانِهِ فَكَأَنَّ النَّبِيَّ صلى الله عليه وسلم صَدَّقَهُ، قَالَ وَعِنْدِي جَذَعَةٌ أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ، فَرَخَّصَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ مَنْ سِوَاهُ أَمْ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 954In-book reference : Book 13, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 74   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 955,
    "id": 955,
    "url": "https://sunnah.com/bukhari:955",
    "bookNumber": 13,
    "hadithNumber": 7,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "The Prophet (ﷺ) delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever \noffers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. \nAnd whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi \nBurda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Messenger (ﷺ)! I have slaughtered my sheep before \nthe `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked \nthat my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my \nfood before coming for the prayer.\" The Prophet (ﷺ) said, \"The sheep which you have slaughtered is just \nmutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Messenger (ﷺ)! I have a young she-goat which is \ndearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) \nsaid, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after \nyou.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ الأَضْحَى بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ، وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَإِنَّهُ قَبْلَ الصَّلاَةِ، وَلاَ نُسُكَ لَهُ ‏\"‏‏.‏ فَقَالَ أَبُو بُرْدَةَ بْنُ نِيَارٍ خَالُ الْبَرَاءِ يَا رَسُولَ اللَّهِ، فَإِنِّي نَسَكْتُ شَاتِي قَبْلَ الصَّلاَةِ، وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ، وَأَحْبَبْتُ أَنْ تَكُونَ شَاتِي أَوَّلَ مَا يُذْبَحُ فِي بَيْتِي، فَذَبَحْتُ شَاتِي وَتَغَدَّيْتُ قَبْلَ أَنْ آتِيَ الصَّلاَةَ‏.‏ قَالَ ‏\"‏ شَاتُكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، فَإِنَّ عِنْدَنَا عَنَاقًا لَنَا جَذَعَةً هِيَ أَحَبُّ إِلَىَّ مِنْ شَاتَيْنِ، أَفَتَجْزِي عَنِّي قَالَ ‏\"‏ نَعَمْ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 955In-book reference : Book 13, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 75   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 956,
    "id": 956,
    "url": "https://sunnah.com/bukhari:956",
    "bookNumber": 13,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to \nbegin with was the prayer and after that he would stand in front of the people and the people would \nkeep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. \nKhutba). And after that if he wished to send an army for an expedition, he would do so; or if he \nwanted to give and order, he would do so, and then depart. The people followed this tradition till I \nwent out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. \nWhen we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get \nup on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit \nand delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's \ntradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know \nis better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the \nprayer, so I delivered the Khutba before the prayer.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْرُجُ يَوْمَ الْفِطْرِ وَالأَضْحَى إِلَى الْمُصَلَّى، فَأَوَّلُ شَىْءٍ يَبْدَأُ بِهِ الصَّلاَةُ ثُمَّ يَنْصَرِفُ، فَيَقُومُ مُقَابِلَ النَّاسِ، وَالنَّاسُ جُلُوسٌ عَلَى صُفُوفِهِمْ، فَيَعِظُهُمْ وَيُوصِيهِمْ وَيَأْمُرُهُمْ، فَإِنْ كَانَ يُرِيدُ أَنْ يَقْطَعَ بَعْثًا قَطَعَهُ، أَوْ يَأْمُرَ بِشَىْءٍ أَمَرَ بِهِ، ثُمَّ يَنْصَرِفُ‏.‏ قَالَ أَبُو سَعِيدٍ فَلَمْ يَزَلِ النَّاسُ عَلَى ذَلِكَ حَتَّى خَرَجْتُ مَعَ مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ فِي أَضْحًى أَوْ فِطْرٍ، فَلَمَّا أَتَيْنَا الْمُصَلَّى إِذَا مِنْبَرٌ بَنَاهُ كَثِيرُ بْنُ الصَّلْتِ، فَإِذَا مَرْوَانُ يُرِيدُ أَنْ يَرْتَقِيَهُ قَبْلَ أَنْ يُصَلِّيَ، فَجَبَذْتُ بِثَوْبِهِ فَجَبَذَنِي فَارْتَفَعَ، فَخَطَبَ قَبْلَ الصَّلاَةِ، فَقُلْتُ لَهُ غَيَّرْتُمْ وَاللَّهِ‏.‏ فَقَالَ أَبَا سَعِيدٍ، قَدْ ذَهَبَ مَا تَعْلَمُ‏.‏ فَقُلْتُ مَا أَعْلَمُ وَاللَّهِ خَيْرٌ مِمَّا لاَ أَعْلَمُ‏.‏ فَقَالَ إِنَّ النَّاسَ لَمْ يَكُونُوا يَجْلِسُونَ لَنَا بَعْدَ الصَّلاَةِ فَجَعَلْتُهَا قَبْلَ الصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 956In-book reference : Book 13, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 76   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 957,
    "id": 957,
    "url": "https://sunnah.com/bukhari:957",
    "bookNumber": 13,
    "hadithNumber": 9,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) used to offer the prayer of `Id-ul-Adha and `Id-ul-Fitr and then deliver the Khutba \nafter the prayer.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي فِي الأَضْحَى وَالْفِطْرِ، ثُمَّ يَخْطُبُ بَعْدَ الصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 957In-book reference : Book 13, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 77   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 958,
    "id": 958,
    "url": "https://sunnah.com/bukhari:958",
    "bookNumber": 13,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ‏.‏ قَالَ وَأَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ فِي أَوَّلِ مَا بُويِعَ لَهُ إِنَّهُ لَمْ يَكُنْ يُؤَذَّنُ بِالصَّلاَةِ يَوْمَ الْفِطْرِ، إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ‏.‏ وَأَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى‏.‏ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فَبَدَأَ بِالصَّلاَةِ، ثُمَّ خَطَبَ النَّاسَ بَعْدُ، فَلَّمَا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ، وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ صَدَقَةً‏.‏ قُلْتُ لِعَطَاءٍ أَتَرَى حَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ فَيُذَكِّرَهُنَّ حِينَ يَفْرُغُ قَالَ إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ أَنْ لاَ يَفْعَلُوا",
    "reference": "Reference : Sahih al-Bukhari 958, 959, 960, 961In-book reference : Book 13, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 959,
    "id": 959,
    "url": "https://sunnah.com/bukhari:959",
    "bookNumber": 13,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ‏.‏ قَالَ وَأَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ فِي أَوَّلِ مَا بُويِعَ لَهُ إِنَّهُ لَمْ يَكُنْ يُؤَذَّنُ بِالصَّلاَةِ يَوْمَ الْفِطْرِ، إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ‏.‏ وَأَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى‏.‏ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فَبَدَأَ بِالصَّلاَةِ، ثُمَّ خَطَبَ النَّاسَ بَعْدُ، فَلَّمَا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ، وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ صَدَقَةً‏.‏ قُلْتُ لِعَطَاءٍ أَتَرَى حَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ فَيُذَكِّرَهُنَّ حِينَ يَفْرُغُ قَالَ إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ أَنْ لاَ يَفْعَلُوا",
    "reference": "Reference : Sahih al-Bukhari 958, 959, 960, 961In-book reference : Book 13, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 960,
    "id": 960,
    "url": "https://sunnah.com/bukhari:960",
    "bookNumber": 13,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ‏.‏ قَالَ وَأَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ فِي أَوَّلِ مَا بُويِعَ لَهُ إِنَّهُ لَمْ يَكُنْ يُؤَذَّنُ بِالصَّلاَةِ يَوْمَ الْفِطْرِ، إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ‏.‏ وَأَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى‏.‏ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فَبَدَأَ بِالصَّلاَةِ، ثُمَّ خَطَبَ النَّاسَ بَعْدُ، فَلَّمَا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ، وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ صَدَقَةً‏.‏ قُلْتُ لِعَطَاءٍ أَتَرَى حَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ فَيُذَكِّرَهُنَّ حِينَ يَفْرُغُ قَالَ إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ أَنْ لاَ يَفْعَلُوا",
    "reference": "Reference : Sahih al-Bukhari 958, 959, 960, 961In-book reference : Book 13, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 961,
    "id": 961,
    "url": "https://sunnah.com/bukhari:961",
    "bookNumber": 13,
    "hadithNumber": 10,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"Jabir bin `Abdullah said, 'The Prophet (ﷺ) went out on the Day of `Id-ul-Fitr and offered the \nprayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn \n`Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced \n(in the life time of Allah's Messenger (ﷺ)) and the Khutba used to be delivered after the prayer. Ata told me \nthat Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr \nand `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet (ﷺ) stood up and started \nwith the prayer, and after it he delivered the Khutba. When the Prophet (ﷺ) of Allah (p.b.u.h) finished (the \nKhutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was \nspreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it \nincumbent upon an Imam to go to the women and preach to them after finishing the prayer and \nKhutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ‏.‏ قَالَ وَأَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ فِي أَوَّلِ مَا بُويِعَ لَهُ إِنَّهُ لَمْ يَكُنْ يُؤَذَّنُ بِالصَّلاَةِ يَوْمَ الْفِطْرِ، إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ‏.‏ وَأَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى‏.‏ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فَبَدَأَ بِالصَّلاَةِ، ثُمَّ خَطَبَ النَّاسَ بَعْدُ، فَلَّمَا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ، وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ صَدَقَةً‏.‏ قُلْتُ لِعَطَاءٍ أَتَرَى حَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ فَيُذَكِّرَهُنَّ حِينَ يَفْرُغُ قَالَ إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ أَنْ لاَ يَفْعَلُوا",
    "reference": "Reference : Sahih al-Bukhari 958, 959, 960, 961In-book reference : Book 13, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 962,
    "id": 962,
    "url": "https://sunnah.com/bukhari:962",
    "bookNumber": 13,
    "hadithNumber": 11,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I offered the `Id prayer with Allah's Messenger (ﷺ), Abu Bakr, `Umar and `Uthman and all of them offered \nthe prayer before delivering the Khutba.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَهِدْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ ـ رضى الله عنهم ـ فَكُلُّهُمْ كَانُوا يُصَلُّونَ قَبْلَ الْخُطْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 962In-book reference : Book 13, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 79   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 963,
    "id": 963,
    "url": "https://sunnah.com/bukhari:963",
    "bookNumber": 13,
    "hadithNumber": 12,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ), Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ ـ رضى الله عنهما ـ يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 963In-book reference : Book 13, Hadith 12USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 964,
    "id": 964,
    "url": "https://sunnah.com/bukhari:964",
    "bookNumber": 13,
    "hadithNumber": 13,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. \nThen he went towards women along with Bilal and ordered them to pay alms and so they started \ngiving their earrings and necklaces (in charity).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ الْفِطْرِ رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا، ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ، فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلْنَ يُلْقِينَ، تُلْقِي الْمَرْأَةُ خُرْصَهَا وَسِخَابَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 964In-book reference : Book 13, Hadith 13USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 965,
    "id": 965,
    "url": "https://sunnah.com/bukhari:965",
    "bookNumber": 13,
    "hadithNumber": 14,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then \nreturn to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), \nand whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his \nfamily and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin \nNiyyar said, \"O Allah's Messenger (ﷺ)! I slaughtered the Nusuk (before the prayer) but I have a young shegoat \nwhich is better than an older sheep.\" The Prophet (ﷺ) I said, \"Sacrifice it in lieu of the first, but it will \nbe not sufficient (as a sacrifice) for anybody else after you.\"",
    "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا زُبَيْدٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ نَحَرَ قَبْلَ الصَّلاَةِ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسْكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو بُرْدَةَ بْنُ نِيَارٍ يَا رَسُولَ اللَّهِ، ذَبَحْتُ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ فَقَالَ ‏\"‏ اجْعَلْهُ مَكَانَهُ، وَلَنْ تُوفِيَ أَوْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 965In-book reference : Book 13, Hadith 14USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 82   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 966,
    "id": 966,
    "url": "https://sunnah.com/bukhari:966",
    "bookNumber": 13,
    "hadithNumber": 15,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle \nof the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the \nnews and came to inquire about his health and said, \"Alas! If we could only know the man who \nwounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" \nIbn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry \nthem and you allowed arms to be carried in the Haram even though it was not allowed before.\"",
    "arabic": "حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى أَبُو السُّكَيْنِ، قَالَ حَدَّثَنَا الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُوقَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ حِينَ أَصَابَهُ سِنَانُ الرُّمْحِ فِي أَخْمَصِ قَدَمِهِ، فَلَزِقَتْ قَدَمُهُ بِالرِّكَابِ، فَنَزَلْتُ فَنَزَعْتُهَا وَذَلِكَ بِمِنًى، فَبَلَغَ الْحَجَّاجَ فَجَعَلَ يَعُودُهُ فَقَالَ الْحَجَّاجُ لَوْ نَعْلَمُ مَنْ أَصَابَكَ‏.‏ فَقَالَ ابْنُ عُمَرَ أَنْتَ أَصَبْتَنِي‏.‏ قَالَ وَكَيْفَ قَالَ حَمَلْتَ السِّلاَحَ فِي يَوْمٍ لَمْ يَكُنْ يُحْمَلُ فِيهِ، وَأَدْخَلْتَ السِّلاَحَ الْحَرَمَ وَلَمْ يَكُنِ السِّلاَحُ يُدْخَلُ الْحَرَمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 966In-book reference : Book 13, Hadith 15USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 83   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 967,
    "id": 967,
    "url": "https://sunnah.com/bukhari:967",
    "bookNumber": 13,
    "hadithNumber": 16,
    "narrator": "Narrated Sa`id bin `Amr bin Sa`id bin Al-`Aas:",
    "english": "Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" \nIbn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The \nperson who allowed arms to be carried on the day on which it was forbidden to carry them (he meant \nAl-Hajjaj).\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، عَنْ أَبِيهِ، قَالَ دَخَلَ الْحَجَّاجُ عَلَى ابْنِ عُمَرَ وَأَنَا عِنْدَهُ، فَقَالَ كَيْفَ هُوَ فَقَالَ صَالِحٌ‏.‏ فَقَالَ مَنْ أَصَابَكَ قَالَ أَصَابَنِي مَنْ أَمَرَ بِحَمْلِ السِّلاَحِ فِي يَوْمٍ لاَ يَحِلُّ فِيهِ حَمْلُهُ، يَعْنِي الْحَجَّاجَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 967In-book reference : Book 13, Hadith 16USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 968,
    "id": 968,
    "url": "https://sunnah.com/bukhari:968",
    "bookNumber": 13,
    "hadithNumber": 17,
    "narrator": "Narrated Al-Bara':",
    "english": "The Prophet (ﷺ) delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we \nshould do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who \ndoes so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just \nmeat that he offered to his family and would not be considered as a sacrifice in any way. My uncle \nAbu Burda bin Niyyar got up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the \nprayer but I have a young she-goat which is better than an older sheep.\" The Prophet (ﷺ) said, \"Slaughter \nit in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ قَالَ ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَإِنَّمَا هُوَ لَحْمٌ عَجَّلَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ خَالِي أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ، أَنَا ذَبَحْتُ قَبْلَ أَنْ أُصَلِّيَ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اجْعَلْهَا مَكَانَهَا ـ أَوْ قَالَ اذْبَحْهَا ـ وَلَنْ تَجْزِيَ جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 968In-book reference : Book 13, Hadith 17USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 85   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 969,
    "id": 969,
    "url": "https://sunnah.com/bukhari:969",
    "bookNumber": 13,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"No good deeds done on other days are superior to those done on these (first ten \ndays of Dhul Hijja).\" Then some companions of the Prophet (ﷺ) said, \"Not even Jihad?\" He replied, \"Not \neven Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's \nsake) and does not return with any of those things.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ مَا الْعَمَلُ فِي أَيَّامِ الْعَشْرِ أَفْضَلَ مِنَ الْعَمَلِ فِي هَذِهِ ‏\"‏‏.‏ قَالُوا وَلاَ الْجِهَادُ قَالَ ‏\"‏ وَلاَ الْجِهَادُ، إِلاَّ رَجُلٌ خَرَجَ يُخَاطِرُ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ بِشَىْءٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 969In-book reference : Book 13, Hadith 18USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 86   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 970,
    "id": 970,
    "url": "https://sunnah.com/bukhari:970",
    "bookNumber": 13,
    "hadithNumber": 19,
    "narrator": "Narrated Muhammad bin Abi Bakr Al-Thaqafi:",
    "english": "While we were going from Mina to `Arafat, I asked Anas bin Malik, about Talbiya, \"How did you use \nto say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their \nsaying was not objected to and they used to say Takbir and that was not objected to either. \"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الثَّقَفِيُّ، قَالَ سَأَلْتُ أَنَسًا وَنَحْنُ غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَاتٍ عَنِ التَّلْبِيَةِ كَيْفَ كُنْتُمْ تَصْنَعُونَ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ كَانَ يُلَبِّي الْمُلَبِّي لاَ يُنْكَرُ عَلَيْهِ، وَيُكَبِّرُ الْمُكَبِّرُ فَلاَ يُنْكَرُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 970In-book reference : Book 13, Hadith 19USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 87   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 971,
    "id": 971,
    "url": "https://sunnah.com/bukhari:971",
    "bookNumber": 13,
    "hadithNumber": 20,
    "narrator": "Narrated Um `Atiya:",
    "english": "We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their \nhouses and menstruating women so that they might stand behind the men and say Takbir along with \nthem and invoke Allah along with them and hope for the blessings of that day and for purification \nfrom sins.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ عَاصِمٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُؤْمَرُ أَنْ نَخْرُجَ يَوْمَ الْعِيدِ، حَتَّى نُخْرِجَ الْبِكْرَ مِنْ خِدْرِهَا، حَتَّى نُخْرِجَ الْحُيَّضَ فَيَكُنَّ خَلْفَ النَّاسِ، فَيُكَبِّرْنَ بِتَكْبِيرِهِمْ، وَيَدْعُونَ بِدُعَائِهِمْ يَرْجُونَ بَرَكَةَ ذَلِكَ الْيَوْمِ وَطُهْرَتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 971In-book reference : Book 13, Hadith 20USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 88   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 972,
    "id": 972,
    "url": "https://sunnah.com/bukhari:972",
    "bookNumber": 13,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn `Umar:",
    "english": "On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of the Prophet (as a Sutra for the prayer) and then he would pray.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ تُرْكَزُ الْحَرْبَةُ قُدَّامَهُ يَوْمَ الْفِطْرِ وَالنَّحْرِ ثُمَّ يُصَلِّي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 972In-book reference : Book 13, Hadith 21USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 973,
    "id": 973,
    "url": "https://sunnah.com/bukhari:973",
    "bookNumber": 13,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) used to proceed to the Musalla and an 'Anaza used to be carried before him and planted \nin the Musalla in front of him and he would pray facing it (as a Sutra).",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا أَبُو عَمْرٍو، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَغْدُو إِلَى الْمُصَلَّى، وَالْعَنَزَةُ بَيْنَ يَدَيْهِ، تُحْمَلُ وَتُنْصَبُ بِالْمُصَلَّى بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 973In-book reference : Book 13, Hadith 22USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 90   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 974,
    "id": 974,
    "url": "https://sunnah.com/bukhari:974",
    "bookNumber": 13,
    "hadithNumber": 23,
    "narrator": "Narrated Muhammad:",
    "english": "Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the \nvirgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls \nor virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أُمِرْنَا أَنْ نُخْرِجَ، الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ‏.‏ وَعَنْ أَيُّوبَ عَنْ حَفْصَةَ بِنَحْوِهِ‏.‏ وَزَادَ فِي حَدِيثِ حَفْصَةَ قَالَ أَوْ قَالَتِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ، وَيَعْتَزِلْنَ الْحُيَّضُ الْمُصَلَّى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 974In-book reference : Book 13, Hadith 23USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 91   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 975,
    "id": 975,
    "url": "https://sunnah.com/bukhari:975",
    "bookNumber": 13,
    "hadithNumber": 24,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I (in my boyhood) went out with the Prophet (ﷺ) on the day of `Id ul Fitr or Id-ul-Adha. The Prophet (ﷺ) \nprayed and then delivered the Khutba and then went towards the women, preached and advised them \nand ordered them to give alms.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ خَرَجْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ فِطْرٍ أَوْ أَضْحَى، فَصَلَّى ثُمَّ خَطَبَ، ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 975In-book reference : Book 13, Hadith 24USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 92   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 976,
    "id": 976,
    "url": "https://sunnah.com/bukhari:976",
    "bookNumber": 13,
    "hadithNumber": 25,
    "narrator": "Narrated Al-Bara':",
    "english": "The Prophet (ﷺ) went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a \ntwo-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of \nworship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does \nthis concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) \nthen that was a thing which he prepared earlier for his family and it would not be considered as a \nNusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Messenger (ﷺ)! I slaughtered (the animal before the \nprayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to \nhim, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ أَضْحًى إِلَى الْبَقِيعِ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ وَقَالَ ‏\"‏ إِنَّ أَوَّلَ نُسُكِنَا فِي يَوْمِنَا هَذَا أَنْ نَبْدَأَ بِالصَّلاَةِ، ثُمَّ نَرْجِعَ فَنَنْحَرَ، فَمَنْ فَعَلَ ذَلِكَ فَقَدْ وَافَقَ سُنَّتَنَا، وَمَنْ ذَبَحَ قَبْلَ ذَلِكَ فَإِنَّمَا هُوَ شَىْءٌ عَجَّلَهُ لأَهْلِهِ، لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي ذَبَحْتُ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ‏.‏ قَالَ ‏\"‏ اذْبَحْهَا، وَلاَ تَفِي عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 976In-book reference : Book 13, Hadith 25USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 93   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 977,
    "id": 977,
    "url": "https://sunnah.com/bukhari:977",
    "bookNumber": 13,
    "hadithNumber": 26,
    "narrator": "Narrated `Abdur Rahman bin `Abis:",
    "english": "Ibn `Abbas was asked whether he had joined the Prophet (ﷺ) in the `Id prayer. He said, \"Yes. And I could \nnot have joined him had I not been young. (The Prophet (ﷺ) came out) till he reached the mark which was \nnear the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards \nthe women. Bilal was accompanying him. He preached to them and advised them and ordered them to \ngive alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. \nThen the Prophet (ﷺ) along with Bilal returned home.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قِيلَ لَهُ أَشَهِدْتَ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ نَعَمْ، وَلَوْلاَ مَكَانِي مِنَ الصِّغَرِ مَا شَهِدْتُهُ، حَتَّى أَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ فَصَلَّى ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ، وَمَعَهُ بِلاَلٌ، فَوَعَظَهُنَّ وَذَكَّرَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَرَأَيْتُهُنَّ يُهْوِينَ بِأَيْدِيهِنَّ يَقْذِفْنَهُ فِي ثَوْبِ بِلاَلٍ، ثُمَّ انْطَلَقَ هُوَ وَبِلاَلٌ إِلَى بَيْتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 977In-book reference : Book 13, Hadith 26USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 94   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 978,
    "id": 978,
    "url": "https://sunnah.com/bukhari:978",
    "bookNumber": 13,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' told me that he had heard Jabir bin `Abdullah saying, \"The Prophet (ﷺ) stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الْفِطْرِ، فَصَلَّى فَبَدَأَ بِالصَّلاَةِ ثُمَّ خَطَبَ، فَلَمَّا فَرَغَ نَزَلَ فَأَتَى النِّسَاءَ، فَذَكَّرَهُنَّ وَهْوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ، يُلْقِي فِيهِ النِّسَاءُ الصَّدَقَةَ‏.‏ قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لاَ وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ حِينَئِذٍ، تُلْقِي فَتَخَهَا وَيُلْقِينَ‏.‏ قُلْتُ أَتُرَى حَقًّا عَلَى الإِمَامِ ذَلِكَ وَيُذَكِّرُهُنَّ قَالَ إِنَّهُ لَحَقٌّ عَلَيْهِمْ، وَمَا لَهُمْ لاَ يَفْعَلُونَهُ",
    "reference": "Reference : Sahih al-Bukhari 978In-book reference : Book 13, Hadith 27USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 979,
    "id": 979,
    "url": "https://sunnah.com/bukhari:979",
    "bookNumber": 13,
    "hadithNumber": 28,
    "narrator": "Al-Hasan bin Muslim told me that\nIbn `Abbas had said, \"I joined the Prophet, Abu Bakr, `Umar and `Uthman in the `Id ul Fitr prayers. They used to offer the prayer before the Khutba and then they used to deliver the Khutba afterwards. Once the Prophet (ﷺ) I came out (for the `Id prayer) as if I were just observing him waving to the people to sit down. He, then accompanied by Bilal, came crossing the rows till he reached the women. He recited the following verse:",
    "english": "'O Prophet! When the believing women come to you to take the oath of fealty to you . . . (to the end of the verse) (60.12).' After finishing the recitation he said, \"O ladies! Are you fulfilling your covenant?\" None except one woman said, \"Yes.\" Hasan did not know who was that woman. The Prophet (ﷺ) said, \"Then give alms.\" Bilal spread his garment and said, \"Keep on giving alms. Let my father and mother sacrifice their lives for you (ladies).\" So the ladies kept on putting their Fatkhs (big rings) and other kinds of rings in Bilal's garment.\" `Abdur-Razaq said, \" 'Fatkhs' is a big ring which used to be worn in the (Pre-Islamic) period of ignorance.",
    "arabic": "قَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ شَهِدْتُ الْفِطْرَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ ـ رضى الله عنهم ـ يُصَلُّونَهَا قَبْلَ الْخُطْبَةِ، ثُمَّ يُخْطَبُ بَعْدُ، خَرَجَ النَّبِيُّ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجْلِسُ بِيَدِهِ، ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ مَعَهُ بِلاَلٌ فَقَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ‏}‏ الآيَةَ ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا ‏\"‏ آنْتُنَّ عَلَى ذَلِكَ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاحِدَةٌ مِنْهُنَّ لَمْ يُجِبْهُ غَيْرُهَا نَعَمْ‏.‏ لاَ يَدْرِي حَسَنٌ مَنْ هِيَ‏.‏ قَالَ ‏\"‏ فَتَصَدَّقْنَ ‏\"‏ فَبَسَطَ بِلاَلٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ لَكُنَّ فِدَاءٌ أَبِي وَأُمِّي، فَيُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ الْفَتَخُ الْخَوَاتِيمُ الْعِظَامُ كَانَتْ فِي الْجَاهِلِيَّةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 979In-book reference : Book 13, Hadith 28USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 980,
    "id": 980,
    "url": "https://sunnah.com/bukhari:980",
    "bookNumber": 13,
    "hadithNumber": 29,
    "narrator": "Narrated Aiyub:",
    "english": "Hafsa bint Seereen said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and \nstayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in \ntwelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My \nsister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! \nIf a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, \n'Her companion should let her share her veil with her, and the women should participate in the good \ndeeds and in the religious gatherings of the believers.' \" Hafsa added, \"When Um-`Atiya came, I went \nto her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be \nsacrificed for the Prophet (p.b.u.h). (And whenever she mentioned the name of the Prophet (ﷺ) she always \nused to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened \n(or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and \nmenstruating women should come out (on the `Id day). But the menstruating women should keep \naway from the Musalla. And all the women should participate in the good deeds and in the religious \ngatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya, 'Also those who are \nmenstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، قَالَتْ كُنَّا نَمْنَعُ جَوَارِيَنَا أَنْ يَخْرُجْنَ يَوْمَ الْعِيدِ، فَجَاءَتِ امْرَأَةٌ فَنَزَلَتْ قَصْرَ بَنِي خَلَفٍ فَأَتَيْتُهَا فَحَدَّثَتْ أَنَّ زَوْجَ أُخْتِهَا غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً فَكَانَتْ أُخْتُهَا مَعَهُ فِي سِتِّ غَزَوَاتٍ‏.‏ فَقَالَتْ فَكُنَّا نَقُومُ عَلَى الْمَرْضَى وَنُدَاوِي الْكَلْمَى، فَقَالَتْ يَا رَسُولَ اللَّهِ، عَلَى إِحْدَانَا بَأْسٌ إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ أَنْ لاَ تَخْرُجَ فَقَالَ ‏\"‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا فَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ فَلَمَّا قَدِمَتْ أُمُّ عَطِيَّةَ أَتَيْتُهَا، فَسَأَلْتُهَا أَسَمِعْتِ فِي كَذَا وَكَذَا قَالَتْ نَعَمْ، بِأَبِي ـ وَقَلَّمَا ذَكَرَتِ النَّبِيَّ صلى الله عليه وسلم إِلاَّ قَالَتْ بِأَبِي ـ قَالَ ‏\"‏ لِيَخْرُجِ الْعَوَاتِقُ ذَوَاتُ الْخُدُورِ ـ أَوْ قَالَ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ شَكَّ أَيُّوبُ ـ وَالْحُيَّضُ، وَيَعْتَزِلُ الْحُيَّضُ الْمُصَلَّى، وَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ لَهَا آلْحُيَّضُ قَالَتْ نَعَمْ، أَلَيْسَ الْحَائِضُ تَشْهَدُ عَرَفَاتٍ وَتَشْهَدُ كَذَا وَتَشْهَدُ كَذَا",
    "reference": "Reference : Sahih al-Bukhari 980In-book reference : Book 13, Hadith 29USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 96   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 981,
    "id": 981,
    "url": "https://sunnah.com/bukhari:981",
    "bookNumber": 13,
    "hadithNumber": 30,
    "narrator": "Narrated Um-`Atiya:",
    "english": "We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature \ngirls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The \nmenstruating women could present themselves at the religious gathering and invocation of Muslims \nbut should keep away from their Musalla.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ أُمِرْنَا أَنْ نَخْرُجَ فَنُخْرِجَ الْحُيَّضَ وَالْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ‏.‏ قَالَ ابْنُ عَوْنٍ أَوِ الْعَوَاتِقَ ذَوَاتِ الْخُدُورِ، فَأَمَّا الْحُيَّضُ فَيَشْهَدْنَ جَمَاعَةَ الْمُسْلِمِينَ وَدَعْوَتَهُمْ، وَيَعْتَزِلْنَ مُصَلاَّهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 981In-book reference : Book 13, Hadith 30USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 982,
    "id": 982,
    "url": "https://sunnah.com/bukhari:982",
    "bookNumber": 13,
    "hadithNumber": 31,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (p.b.u.h) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي كَثِيرُ بْنُ فَرْقَدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْحَرُ أَوْ يَذْبَحُ بِالْمُصَلَّى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 982In-book reference : Book 13, Hadith 31USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 983,
    "id": 983,
    "url": "https://sunnah.com/bukhari:983",
    "bookNumber": 13,
    "hadithNumber": 32,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who \nprayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) \ntradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just \nmutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I \nslaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating \nand drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my \nfamily and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda \nsaid, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a \nsacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a \nsacrifice), after you.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسْكَنَا فَقَدْ أَصَابَ النُّسُكَ، وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَتِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلاَةِ، وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ وَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ قَالَ فَإِنَّ عِنْدِي عَنَاقَ جَذَعَةٍ، هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ، فَهَلْ تَجْزِي عَنِّي قَالَ ‏\"‏ نَعَمْ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 983In-book reference : Book 13, Hadith 32USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 99   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 984,
    "id": 984,
    "url": "https://sunnah.com/bukhari:984",
    "bookNumber": 13,
    "hadithNumber": 33,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that \nwhoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter \nanother sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my \nneighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a \nyoung she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission \nfor slaughtering it as a sacrifice.",
    "arabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ النَّحْرِ، ثُمَّ خَطَبَ فَأَمَرَ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ أَنْ يُعِيدَ ذَبْحَهُ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ، جِيرَانٌ لِي ـ إِمَّا قَالَ بِهِمْ خَصَاصَةٌ، وَإِمَّا قَالَ بِهِمْ فَقْرٌ ـ وَإِنِّي ذَبَحْتُ قَبْلَ الصَّلاَةِ وَعِنْدِي عَنَاقٌ لِي أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَرَخَّصَ لَهُ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 984In-book reference : Book 13, Hadith 33USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 100   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 985,
    "id": 985,
    "url": "https://sunnah.com/bukhari:985",
    "bookNumber": 13,
    "hadithNumber": 34,
    "narrator": "Narrated Jundab:",
    "english": "On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the \nsacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter \nanother animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice \nmentioning Allah's name on it.\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ، عَنْ جُنْدَبٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ ثُمَّ خَطَبَ، ثُمَّ ذَبَحَ فَقَالَ ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيَذْبَحْ أُخْرَى مَكَانَهَا، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 985In-book reference : Book 13, Hadith 34USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 101   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 986,
    "id": 986,
    "url": "https://sunnah.com/bukhari:986",
    "bookNumber": 13,
    "hadithNumber": 35,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different \nfrom that by which he went.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا أَبُو تُمَيْلَةَ، يَحْيَى بْنُ وَاضِحٍ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ يَوْمُ عِيدٍ خَالَفَ الطَّرِيقَ‏.‏ تَابَعَهُ يُونُسُ بْنُ مُحَمَّدٍ عَنْ فُلَيْحٍ‏.‏ وَحَدِيثُ جَابِرٍ أَصَحُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 986In-book reference : Book 13, Hadith 35USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 102   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 987,
    "id": 987,
    "url": "https://sunnah.com/bukhari:987",
    "bookNumber": 13,
    "hadithNumber": 36,
    "narrator": "Narrated `Urwa on the authority of `Aisha:",
    "english": "On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ‏\"‏‏.‏ وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى‏.‏ وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ، فَزَجَرَهُمْ عُمَرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ، أَمْنًا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 987, 988In-book reference : Book 13, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 988,
    "id": 988,
    "url": "https://sunnah.com/bukhari:988",
    "bookNumber": 13,
    "hadithNumber": 36,
    "narrator": "Narrated `Urwa on the authority of `Aisha:",
    "english": "On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr came to her while two young \ngirls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr \nscolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr, \"Leave them, for these days \nare the days of `Id and the days of Mina.\" `Aisha further said, \"Once the Prophet (ﷺ) was screening me \nand I was watching the display of black slaves in the Mosque and (`Umar) scolded them. The Prophet (ﷺ) \nsaid, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ‏\"‏‏.‏ وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى‏.‏ وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ، فَزَجَرَهُمْ عُمَرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ، أَمْنًا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 987, 988In-book reference : Book 13, Hadith 36USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 989,
    "id": 989,
    "url": "https://sunnah.com/bukhari:989",
    "bookNumber": 13,
    "hadithNumber": 37,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any \nother prayer before or after it and at that time Bilal was accompanying him.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا وَمَعَهُ بِلاَلٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 989In-book reference : Book 13, Hadith 37USC-MSA web (English) reference : Vol. 2, Book 15, Hadith 104   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 990,
    "id": 990,
    "url": "https://sunnah.com/bukhari:990",
    "bookNumber": 14,
    "hadithNumber": 1,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Once a person asked Allah's Messenger (ﷺ) (ﷺ) about the night prayer. Allah's \n     Apostle (ﷺ) replied, \"The night prayer is offered as two Rak`at followed by\n     two Rak`at and so on and if anyone is afraid of the approaching dawn \n     (Fajr prayer) he should pray one Rak`ah and this will be a Witr for all \n     the Rak`at which he has prayed before.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً، تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 990In-book reference : Book 14, Hadith 1USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 991,
    "id": 991,
    "url": "https://sunnah.com/bukhari:991",
    "bookNumber": 14,
    "hadithNumber": 2,
    "narrator": "",
    "english": "Nafi` told that `Abdullah bin \n     `Umar used to say Taslim between (the first) two Rak`at and (the third)\n     odd one in the Witr prayer, when he wanted to attend to a certain \n     matter (during that interval between the Rak`at).",
    "arabic": "وَعَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَةِ وَالرَّكْعَتَيْنِ فِي الْوِتْرِ، حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 991In-book reference : Book 14, Hadith 2USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 992,
    "id": 992,
    "url": "https://sunnah.com/bukhari:992",
    "bookNumber": 14,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's \nApostle and his wife slept length-wise. The Prophet (ﷺ) slept till midnight or nearly so and woke up \nrubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Messenger (ﷺ) went towards a leather \nskin and performed ablution in the most perfect way and then stood for the prayer. I did the same and \nstood beside him. The Prophet (ﷺ) put his right hand on my head, twisted my ear and then prayed two \nrak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he \nstood up and offered two rak`at (Sunnah of Fajr prayer) and then went out and offered the Fajr prayer. \n(See Hadith 183)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ، وَهْىَ خَالَتُهُ، فَاضْطَجَعْتُ فِي عَرْضِ وِسَادَةٍ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَرِيبًا مِنْهُ، فَاسْتَيْقَظَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ، ثُمَّ قَرَأَ عَشْرَ آيَاتٍ مِنْ آلِ عِمْرَانَ، ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ قَامَ يُصَلِّي فَصَنَعْتُ مِثْلَهُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي يَفْتِلُهَا، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ، خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 992In-book reference : Book 14, Hadith 3USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 106   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 993,
    "id": 993,
    "url": "https://sunnah.com/bukhari:993",
    "bookNumber": 14,
    "hadithNumber": 4,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you \nwant to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \n\"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr \nand all that is permissible. I hope there will be no harm in it.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ رَكْعَةً تُوتِرُ لَكَ مَا صَلَّيْتَ ‏\"‏‏.‏ قَالَ الْقَاسِمُ وَرَأَيْنَا أُنَاسًا مُنْذُ أَدْرَكْنَا يُوتِرُونَ بِثَلاَثٍ، وَإِنَّ كُلاًّ لَوَاسِعٌ أَرْجُو أَنْ لاَ يَكُونَ بِشَىْءٍ مِنْهُ بَأْسٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 993In-book reference : Book 14, Hadith 4USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 994,
    "id": 994,
    "url": "https://sunnah.com/bukhari:994",
    "bookNumber": 14,
    "hadithNumber": 5,
    "narrator": "Narrated `A'isha:",
    "english": "Allah's Messenger (ﷺ) used to pray eleven rak`at at night and that was his night prayer and each of his \nprostrations lasted for a period enough for one of you to recite fifty verses before Allah's Messenger (ﷺ) \nraised his head. He also used to pray two rak`at (Sunnah) before the (compulsory) Fajr prayer and then \nlie down on his right side till the Mu'adh-dhin came to him for the prayer.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً، كَانَتْ تِلْكَ صَلاَتَهُ ـ تَعْنِي بِاللَّيْلِ ـ فَيَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 994In-book reference : Book 14, Hadith 5USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 108   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 995,
    "id": 995,
    "url": "https://sunnah.com/bukhari:995",
    "bookNumber": 14,
    "hadithNumber": 6,
    "narrator": "Narrated Anas bin Seereen:",
    "english": "I asked Ibn `Umar, \"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as \nto prolonging the recitation in them?\" He said, \"The Prophet (ﷺ) used to pray at night two rak`at \nfollowed by two and so on, and end the prayer by one rak`ah witr. He used to offer two rak`at before \nthe Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he \nprayed) quickly.)\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ قُلْتُ لاِبْنِ عُمَرَ أَرَأَيْتَ الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ أُطِيلُ فِيهِمَا الْقِرَاءَةَ فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ مَثْنَى مَثْنَى، وَيُوتِرُ بِرَكْعَةٍ وَيُصَلِّي الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ وَكَأَنَّ الأَذَانَ بِأُذُنَيْهِ‏.‏ قَالَ حَمَّادٌ أَىْ سُرْعَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 995In-book reference : Book 14, Hadith 6USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 109   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 996,
    "id": 996,
    "url": "https://sunnah.com/bukhari:996",
    "bookNumber": 14,
    "hadithNumber": 7,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) offered witr prayer at different nights at various hours extending (from the `Isha' \nprayer) up to the last hour of the night.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كُلَّ اللَّيْلِ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 996In-book reference : Book 14, Hadith 7USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 110   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 997,
    "id": 997,
    "url": "https://sunnah.com/bukhari:997",
    "bookNumber": 14,
    "hadithNumber": 8,
    "narrator": "Narrated `A'isha:",
    "english": "The Prophet (ﷺ) used to offer his night prayer while I was sleeping across in his bed. Whenever \nhe intended to offer the witr prayer, he used to wake me up and I would offer the witr prayer too.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي، وَأَنَا رَاقِدَةٌ مُعْتَرِضَةً عَلَى فِرَاشِهِ، فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 997In-book reference : Book 14, Hadith 8USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 111   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 998,
    "id": 998,
    "url": "https://sunnah.com/bukhari:998",
    "bookNumber": 14,
    "hadithNumber": 9,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"Make witr as your last prayer at night.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اجْعَلُوا آخِرَ صَلاَتِكُمْ بِاللَّيْلِ وِتْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 998In-book reference : Book 14, Hadith 9USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 999,
    "id": 999,
    "url": "https://sunnah.com/bukhari:999",
    "bookNumber": 14,
    "hadithNumber": 10,
    "narrator": "Narrated Sa`id bin Yasar:",
    "english": "I was going to Mecca in the company of `Abdullah bin `Umar and when I apprehended the \napproaching dawn, I dismounted and offered the witr prayer and then joined him. `Abdullah bin \n`Umar said, \"Where have you been?\" I replied, \"I apprehended the approaching dawn so I dismounted \nand prayed the witr prayer.\" `Abdullah said, \"Isn't it sufficient for you to follow the good example of \nAllah's Messenger (ﷺ)?\" I replied, \"Yes, by Allah.\" He said, \"Allah's Messenger (ﷺ) used to pray witr on the back of \nthe camel (while on a journey).\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ سَعِيدِ بْنِ يَسَارٍ، أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ فَقَالَ سَعِيدٌ فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ، ثُمَّ لَحِقْتُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ خَشِيتُ الصُّبْحَ، فَنَزَلْتُ فَأَوْتَرْتُ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم أُسْوَةٌ حَسَنَةٌ فَقُلْتُ بَلَى وَاللَّهِ‏.‏ قَالَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 999In-book reference : Book 14, Hadith 10USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 113   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 1000,
    "id": 1000,
    "url": "https://sunnah.com/bukhari:1000",
    "bookNumber": 14,
    "hadithNumber": 11,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) used to offer (Nawafil) prayers on his Rahila (mount) facing its direction by signals, but \nnot the compulsory prayer. He also used to pray witr on his (mount) Rahila.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي السَّفَرِ عَلَى رَاحِلَتِهِ، حَيْثُ تَوَجَّهَتْ بِهِ، يُومِئُ إِيمَاءً، صَلاَةَ اللَّيْلِ إِلاَّ الْفَرَائِضَ، وَيُوتِرُ عَلَى رَاحِلَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 1000In-book reference : Book 14, Hadith 11USC-MSA web (English) reference : Vol. 2, Book 16, Hadith 114   (deprecated numbering scheme)"
  }
]