[
  {
    "hadithGlobalNumber": 6001,
    "id": 6001,
    "url": "https://sunnah.com/bukhari:6001",
    "bookNumber": 78,
    "hadithNumber": 32,
    "narrator": "Narrated `Abdullah:",
    "english": "I said 'O Allah's Messenger (ﷺ)! Which sin is the greatest?\" He said, \"To set up a rival unto Allah, though He \nAlone created you.\" I said, \"What next?\" He said, \"To kill your son lest he should share your food \nwith you.\" I further asked, \"What next?\" He said, \"To commit illegal sexual intercourse with the wife \nof your neighbor.\" And then Allah revealed as proof of the statement of the Prophet: 'Those who \ninvoke not with Allah any other god)................. (to end of verse)...' (25.68)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهْوَ خَلَقَكَ ‏\"‏‏.‏ ثُمَّ قَالَ أَىُّ قَالَ ‏\"‏ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَأْكُلَ مَعَكَ ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ ‏\"‏‏.‏ وَأَنْزَلَ اللَّهُ تَصْدِيقَ قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏{‏وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6001In-book reference : Book 78, Hadith 32USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6002,
    "id": 6002,
    "url": "https://sunnah.com/bukhari:6002",
    "bookNumber": 78,
    "hadithNumber": 33,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) took a child in his lap for Tahnik (i.e. he chewed a date in his mouth and put its juice in \nthe mouth of the child). The child urinated on him, so he asked for water and poured it over the place \nof the urine.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَضَعَ صَبِيًّا فِي حِجْرِهِ يُحَنِّكُهُ، فَبَالَ عَلَيْهِ، فَدَعَا بِمَاءٍ فَأَتْبَعَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6002In-book reference : Book 78, Hadith 33USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6003,
    "id": 6003,
    "url": "https://sunnah.com/bukhari:6003",
    "bookNumber": 78,
    "hadithNumber": 34,
    "narrator": "Narrated Usama bin Zaid:",
    "english": "Allah's Messenger (ﷺ) used to put me on (one of) his thighs and put Al-Hasan bin `Ali on his other thigh, and \nthen embrace us and say, \"O Allah! Please be Merciful to them, as I am merciful to them. \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَارِمٌ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا تَمِيمَةَ، يُحَدِّثُ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، يُحَدِّثُهُ أَبُو عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْخُذُنِي فَيُقْعِدُنِي عَلَى فَخِذِهِ، وَيُقْعِدُ الْحَسَنَ عَلَى فَخِذِهِ الأُخْرَى، ثُمَّ يَضُمُّهُمَا ثُمَّ يَقُولُ ‏\n\"‏ اللَّهُمَّ ارْحَمْهُمَا فَإِنِّي أَرْحَمُهُمَا ‏\"‏‏.‏   وَعَنْ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُلَيْمَانُ، عَنْ أَبِي عُثْمَانَ، قَالَ التَّيْمِيُّ فَوَقَعَ فِي قَلْبِي مِنْهُ شَىْءٌ، قُلْتُ حَدَّثْتُ بِهِ كَذَا وَكَذَا، فَلَمْ أَسْمَعْهُ مِنْ أَبِي عُثْمَانَ، فَنَظَرْتُ فَوَجَدْتُهُ عِنْدِي مَكْتُوبًا فِيمَا سَمِعْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6003In-book reference : Book 78, Hadith 34USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6004,
    "id": 6004,
    "url": "https://sunnah.com/bukhari:6004",
    "bookNumber": 78,
    "hadithNumber": 35,
    "narrator": "Narrated `Aisha:",
    "english": "I never felt so jealous of any woman as I did of Khadija, though she had died three years before the \nProphet married me, and that was because I heard him mentioning her too often, and because his Lord \nhad ordered him to give her the glad tidings that she would have a palace in Paradise, made of Qasab \nand because he used to slaughter a sheep and distribute its meat among her friends.",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا غِرْتُ عَلَى امْرَأَةٍ مَا غِرْتُ عَلَى خَدِيجَةَ، وَلَقَدْ هَلَكَتْ قَبْلَ أَنْ يَتَزَوَّجَنِي بِثَلاَثِ سِنِينَ، لِمَا كُنْتُ أَسْمَعُهُ يَذْكُرُهَا، وَلَقَدْ أَمَرَهُ رَبُّهُ أَنْ يُبَشِّرَهَا بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ، وَإِنْ كَانَ لَيَذْبَحُ الشَّاةَ ثُمَّ يُهْدِي فِي خُلَّتِهَا مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6004In-book reference : Book 78, Hadith 35USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6005,
    "id": 6005,
    "url": "https://sunnah.com/bukhari:6005",
    "bookNumber": 78,
    "hadithNumber": 36,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "The Prophet (ﷺ) said, \"I and the person who looks after an orphan and provides for him, will be in \nParadise like this,\" putting his index and middle fingers together.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَنَا وَكَافِلُ الْيَتِيمِ، فِي الْجَنَّةِ هَكَذَا ‏\"‏‏.‏ وَقَالَ بِإِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6005In-book reference : Book 78, Hadith 36USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6006,
    "id": 6006,
    "url": "https://sunnah.com/bukhari:6006",
    "bookNumber": 78,
    "hadithNumber": 37,
    "narrator": "Narrated Safwan bin Salim:",
    "english": "The Prophet (ﷺ) said \"The one who looks after and works for a widow and for a poor person, is like a \nwarrior fighting for Allah's Cause or like a person who fasts during the day and prays all the night.\" \nNarrated Abu Huraira that the Prophet (ﷺ) said as above.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، يَرْفَعُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ، أَوْ كَالَّذِي يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ ‏\"‏‏.‏   حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ",
    "reference": "Reference : Sahih al-Bukhari 6006In-book reference : Book 78, Hadith 37USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6007,
    "id": 6007,
    "url": "https://sunnah.com/bukhari:6007",
    "bookNumber": 78,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The one who looks after and works for a widow and for a poor person is like a \nwarrior fighting for Allah's Cause.\" (The narrator Al-Qa'nabi is not sure whether he also said \"Like the \none who prays all the night without slackness and fasts continuously and never breaks his fast.\")",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ ـ وَأَحْسِبُهُ قَالَ، يَشُكُّ الْقَعْنَبِيُّ ـ كَالْقَائِمِ لاَ يَفْتُرُ، وَكَالصَّائِمِ لاَ يُفْطِرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6007In-book reference : Book 78, Hadith 38USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6008,
    "id": 6008,
    "url": "https://sunnah.com/bukhari:6008",
    "bookNumber": 78,
    "hadithNumber": 39,
    "narrator": "Narrated Abu Sulaiman and Malik bin Huwairith:",
    "english": "We came to the Prophet (ﷺ) and we were (a few) young men of approximately equal age and stayed with \nhim for twenty nights. Then he thought that we were anxious for our families, and he asked us whom \nwe had left behind to look after our families, and we told him. He was kindhearted and merciful, so he \nsaid, \"Return to your families and teach them (religious knowledge) and order them (to do good \ndeeds) and offer your prayers in the way you saw me offering my prayers, and when the stated time \nfor the prayer becomes due, then one of you should pronounce its call (i.e. the Adhan), and the eldest \nof you should lead you in prayer.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي سُلَيْمَانَ، مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً، فَظَنَّ أَنَّا اشْتَقْنَا أَهْلَنَا، وَسَأَلَنَا عَمَّنْ تَرَكْنَا فِي أَهْلِنَا، فَأَخْبَرْنَاهُ، وَكَانَ رَفِيقًا رَحِيمًا فَقَالَ ‏\n\"‏ ارْجِعُوا إِلَى أَهْلِيكُمْ فَعَلِّمُوهُمْ وَمُرُوهُمْ، وَصَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي، وَإِذَا حَضَرَتِ الصَّلاَةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، ثُمَّ لِيَؤُمَّكُمْ أَكْبَرُكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6008In-book reference : Book 78, Hadith 39USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 37   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6009,
    "id": 6009,
    "url": "https://sunnah.com/bukhari:6009",
    "bookNumber": 78,
    "hadithNumber": 40,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"While a man was walking on a road. he became very thirsty. Then he came \nacross a well, got down into it, drank (of its water) and then came out. Meanwhile he saw a dog \npanting and licking mud because of excessive thirst. The man said to himself \"This dog is suffering \nfrom the same state of thirst as I did.\" So he went down the well (again) and filled his shoe (with \nwater) and held it in his mouth and watered the dog. Allah thanked him for that deed and forgave \nhim.\" The people asked, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving the animals?\" He said, \n\"(Yes) There is a reward for serving any animate (living being) .\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ، فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ، فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ بِي، فَنَزَلَ الْبِئْرَ فَمَلأَ خُفَّهُ، ثُمَّ أَمْسَكَهُ بِفِيهِ، فَسَقَى الْكَلْبَ، فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي الْبَهَائِمِ أَجْرًا‏.‏ فَقَالَ ‏\"‏ فِي كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6009In-book reference : Book 78, Hadith 40USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 38   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6010,
    "id": 6010,
    "url": "https://sunnah.com/bukhari:6010",
    "bookNumber": 78,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) stood up for the prayer and we too stood up along with him. Then a bedouin shouted \nwhile offering prayer. \"O Allah! Bestow Your Mercy on me and Muhammad only and do not bestow \nit on anybody else along with us.\" When the Prophet (ﷺ) had finished his prayer with Taslim, he said to \nthe Bedouin, \"You have limited (narrowed) a very vast (thing),\" meaning Allah's Mercy.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي صَلاَةٍ وَقُمْنَا مَعَهُ، فَقَالَ أَعْرَابِيٌّ وَهْوَ فِي الصَّلاَةِ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا، وَلاَ تَرْحَمْ مَعَنَا أَحَدًا‏.‏ فَلَمَّا سَلَّمَ النَّبِيُّ صلى الله عليه وسلم قَالَ لِلأَعْرَابِيِّ ‏\n\"‏ لَقَدْ حَجَّرْتَ وَاسِعًا ‏\"‏‏.‏ يُرِيدُ رَحْمَةَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6010In-book reference : Book 78, Hadith 41USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 39   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6011,
    "id": 6011,
    "url": "https://sunnah.com/bukhari:6011",
    "bookNumber": 78,
    "hadithNumber": 42,
    "narrator": "Narrated An-Nu`man bin Bashir:",
    "english": "Allah's Messenger (ﷺ) said, \"You see the believers as regards their being merciful among themselves and \nshowing love among themselves and being kind, resembling one body, so that, if any part of the body \nis not well then the whole body shares the sleeplessness (insomnia) and fever with it.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، قَالَ سَمِعْتُهُ يَقُولُ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَرَى الْمُؤْمِنِينَ فِي تَرَاحُمِهِمْ وَتَوَادِّهِمْ وَتَعَاطُفِهِمْ كَمَثَلِ الْجَسَدِ إِذَا اشْتَكَى عُضْوًا تَدَاعَى لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالْحُمَّى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6011In-book reference : Book 78, Hadith 42USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6012,
    "id": 6012,
    "url": "https://sunnah.com/bukhari:6012",
    "bookNumber": 78,
    "hadithNumber": 43,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"If any Muslim plants any plant and a human being or an animal eats of it, he will \nbe rewarded as if he had given that much in charity.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ مُسْلِمٍ غَرَسَ غَرْسًا فَأَكَلَ مِنْهُ إِنْسَانٌ أَوْ دَابَّةٌ إِلاَّ كَانَ لَهُ صَدَقَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6012In-book reference : Book 78, Hadith 43USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6013,
    "id": 6013,
    "url": "https://sunnah.com/bukhari:6013",
    "bookNumber": 78,
    "hadithNumber": 44,
    "narrator": "Narrated Jarir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"He who is not merciful to others, will not be treated mercifully.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي زَيْدُ بْنُ وَهْبٍ، قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لاَ يَرْحَمُ لاَ يُرْحَمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6013In-book reference : Book 78, Hadith 44USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6014,
    "id": 6014,
    "url": "https://sunnah.com/bukhari:6014",
    "bookNumber": 78,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said \"Gabriel continued to recommend me about treating the neighbors Kindly and \npolitely so much so that I thought he would order me to make them as my heirs.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا زَالَ يُوصِينِي جِبْرِيلُ بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6014In-book reference : Book 78, Hadith 45USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 43   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6015,
    "id": 6015,
    "url": "https://sunnah.com/bukhari:6015",
    "bookNumber": 78,
    "hadithNumber": 46,
    "narrator": "Narrates Ibn `Umar:",
    "english": "Allah' Apostle said, Gabriel kept on recommending me about treating the neighbors in a kind and \npolite manner, so much so that I thought that he would order (me) to make them (my) heirs.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6015In-book reference : Book 78, Hadith 46USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6016,
    "id": 6016,
    "url": "https://sunnah.com/bukhari:6016",
    "bookNumber": 78,
    "hadithNumber": 47,
    "narrator": "Narrated Abu Shuraih:",
    "english": "The Prophet (ﷺ) said, \"By Allah, he does not believe! By Allah, he does not believe! By Allah, he does \nnot believe!\" It was said, \"Who is that, O Allah's Messenger (ﷺ)?\" He said, \"That person whose neighbor \ndoes not feel safe from his evil.\"",
    "arabic": "حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ، عَنْ أَبِي شُرَيْحٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ وَاللَّهِ لاَ يُؤْمِنُ، وَاللَّهِ لاَ يُؤْمِنُ، وَاللَّهِ لاَ يُؤْمِنُ ‏\"‏‏.‏ قِيلَ وَمَنْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي لاَ يَأْمَنُ جَارُهُ بَوَايِقَهُ ‏\"‏‏.‏ تَابَعَهُ شَبَابَةُ وَأَسَدُ بْنُ مُوسَى‏.‏   وَقَالَ حُمَيْدُ بْنُ الأَسْوَدِ وَعُثْمَانُ بْنُ عُمَرَ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ وَشُعَيْبُ بْنُ إِسْحَاقَ عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ،‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6016In-book reference : Book 78, Hadith 47USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6017,
    "id": 6017,
    "url": "https://sunnah.com/bukhari:6017",
    "bookNumber": 78,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) used to say, \"O Muslim ladies! A neighbouress should not look down upon the present of \nher neighbouress even it were the hooves of a sheep.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا سَعِيدٌ ـ هُوَ الْمَقْبُرِيُّ ـ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَا نِسَاءَ الْمُسْلِمَاتِ لاَ تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6017In-book reference : Book 78, Hadith 48USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 46   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6018,
    "id": 6018,
    "url": "https://sunnah.com/bukhari:6018",
    "bookNumber": 78,
    "hadithNumber": 49,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Anybody who believes in Allah and the Last Day should not harm his neighbor, \nand anybody who believes in Allah and the Last Day should entertain his guest generously and \nanybody who believes in Allah and the Last Day should talk what is good or keep quiet. (i.e. abstain \nfrom all kinds of evil and dirty talk).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6018In-book reference : Book 78, Hadith 49USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6019,
    "id": 6019,
    "url": "https://sunnah.com/bukhari:6019",
    "bookNumber": 78,
    "hadithNumber": 50,
    "narrator": "Narrated Abu Shuraih Al-Adawi:",
    "english": "My ears heard and my eyes saw the Prophet (ﷺ) when he spoke, \"Anybody who believes in Allah and the \nLast Day, should serve his neighbor generously, and anybody who believes in Allah and the Last Day \nshould serve his guest generously by giving him his reward.\" It was asked. \"What is his reward, O \nAllah's Messenger (ﷺ)?\" He said, \"(To be entertained generously) for a day and a night with high quality of \nfood and the guest has the right to be entertained for three days (with ordinary food) and if he stays \nlonger, what he will be provided with will be regarded as Sadaqa (a charitable gift). And anybody who \nbelieves in Allah and the Last Day should talk what is good or keep quiet (i.e. abstain from all kinds \nof dirty and evil talks).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، قَالَ سَمِعَتْ أُذُنَاىَ، وَأَبْصَرَتْ، عَيْنَاىَ حِينَ تَكَلَّمَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ ‏\"‏‏.‏ قَالَ وَمَا جَائِزَتُهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ يَوْمٌ وَلَيْلَةٌ وَالضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ، فَمَا كَانَ وَرَاءَ ذَلِكَ فَهْوَ صَدَقَةٌ عَلَيْهِ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6019In-book reference : Book 78, Hadith 50USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6020,
    "id": 6020,
    "url": "https://sunnah.com/bukhari:6020",
    "bookNumber": 78,
    "hadithNumber": 51,
    "narrator": "Narrated `Aisha:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! I have two neighbors! To whom shall I send my gifts?\" He said, \"To the \none whose gate in nearer to you.\"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَبُو عِمْرَانَ، قَالَ سَمِعْتُ طَلْحَةَ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي جَارَيْنِ فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏\n\"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6020In-book reference : Book 78, Hadith 51USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6021,
    "id": 6021,
    "url": "https://sunnah.com/bukhari:6021",
    "bookNumber": 78,
    "hadithNumber": 52,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, Enjoining, all that is good is a Sadaqa.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّ مَعْرُوفٍ صَدَقَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6021In-book reference : Book 78, Hadith 52USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6022,
    "id": 6022,
    "url": "https://sunnah.com/bukhari:6022",
    "bookNumber": 78,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"On every Muslim there is enjoined (a compulsory) Sadaqa (alms).\" They (the \npeople) said, \"If one has nothing?' He said, \"He should work with his hands so that he may benefit \nhimself and give in charity.\" They said, \"If he cannot work or does not work?\" He said, \"Then he \nshould help the oppressed unhappy person (by word or action or both).\" They said, \"If he does not do \nit?\" He said, \"Then he should enjoin what is good (or said what is reasonable).' They said, \"If he does \nnot do that''' He said, \"Then he should refrain from doing evil, for that will be considered for Him as a \nSadaqa (charity) . \"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ ‏\"‏‏.‏ قَالُوا فَإِنْ لَمْ يَجِدْ قَالَ ‏\"‏ فَيَعْمَلُ بِيَدَيْهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ ‏\"‏‏.‏ قَالُوا فَإِنْ لَمْ يَسْتَطِعْ أَوْ لَمْ يَفْعَلْ قَالَ ‏\"‏ فَيُعِينُ ذَا الْحَاجَةِ الْمَلْهُوفَ ‏\"‏‏.‏ قَالُوا فَإِنْ لَمْ يَفْعَلْ قَالَ ‏\"‏ فَيَأْمُرُ بِالْخَيْرِ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ بِالْمَعْرُوفِ ‏\"‏‏.‏ قَالَ فَإِنْ لَمْ يَفْعَلْ قَالَ ‏\"‏ فَيُمْسِكُ عَنِ الشَّرِّ، فَإِنَّهُ لَهُ صَدَقَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6022In-book reference : Book 78, Hadith 53USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 51   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6023,
    "id": 6023,
    "url": "https://sunnah.com/bukhari:6023",
    "bookNumber": 78,
    "hadithNumber": 54,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "The Prophet (ﷺ) mentioned the (Hell) Fire and sought refuge (with Allah) from it, and turned his face to \nthe other side. He mentioned the (Hell) Fire again and took refuge (with Allah) from it and turned his \nface to the other side. (Shu`ba, the sub-narrator, said, \"I have no doubt that the Prophet (ﷺ) repeated it \ntwice.\") The Prophet (ﷺ) then said, \"(O people!) Save yourselves from the (Hell) Fire even if with one \nhalf of a date fruit (given in charity), and if this is not available, then (save yourselves) by saying a \ngood pleasant friendly word.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ ذَكَرَ النَّبِيُّ صلى الله عليه وسلم النَّارَ، فَتَعَوَّذَ مِنْهَا وَأَشَاحَ بِوَجْهِهِ، ثُمَّ ذَكَرَ النَّارَ، فَتَعَوَّذَ مِنْهَا، وَأَشَاحَ بِوَجْهِهِ ـ قَالَ شُعْبَةُ أَمَّا مَرَّتَيْنِ فَلاَ أَشُكُّ ـ ثُمَّ قَالَ ‏\n\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَإِنْ لَمْ تَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6023In-book reference : Book 78, Hadith 54USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 52   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6024,
    "id": 6024,
    "url": "https://sunnah.com/bukhari:6024",
    "bookNumber": 78,
    "hadithNumber": 55,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) A group of Jews entered upon the Prophet (ﷺ) and said, \"As-Samu-Alaikum.\" \n(i.e. death be upon you). I understood it and said, \"Wa-Alaikum As-Samu wal-la'n. (death and the \ncurse of Allah be Upon you).\" Allah's Messenger (ﷺ) said \"Be calm, O `Aisha! Allah loves that on, should be \nkind and lenient in all matters.\" I said, \"O Allah's Messenger (ﷺ)! Haven't you heard what they (the Jews) \nhave said?\" Allah's Messenger (ﷺ) said \"I have (already) said (to them) \"And upon you ! \"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ دَخَلَ رَهْطٌ مِنَ الْيَهُودِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكُمْ‏.‏ قَالَتْ عَائِشَةُ فَفَهِمْتُهَا فَقُلْتُ وَعَلَيْكُمُ السَّامُ وَاللَّعْنَةُ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَهْلاً يَا عَائِشَةُ، إِنَّ اللَّهَ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ وَلَمْ تَسْمَعْ مَا قَالُوا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6024In-book reference : Book 78, Hadith 55USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 53   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6025,
    "id": 6025,
    "url": "https://sunnah.com/bukhari:6025",
    "bookNumber": 78,
    "hadithNumber": 56,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A bedouin urinated in the mosque and the people ran to (beat) him. Allah's Messenger (ﷺ) said, \"Do not \ninterrupt his urination (i.e. let him finish).\" Then the Prophet (ﷺ) asked for a tumbler of water and poured \nthe water over the place of urine.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا، بَالَ فِي الْمَسْجِدِ، فَقَامُوا إِلَيْهِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لا تُزْرِمُوهُ ‏\"‏‏.‏ ثُمَّ دَعَا بِدَلْوٍ مِنْ مَاءٍ فَصُبَّ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6025In-book reference : Book 78, Hadith 56USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 54   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6026,
    "id": 6026,
    "url": "https://sunnah.com/bukhari:6026",
    "bookNumber": 78,
    "hadithNumber": 57,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each \nother.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced. (At that time) the Prophet (ﷺ) was \nsitting and a man came and begged or asked for something. The Prophet (ﷺ) faced us and said, \"Help and \nrecommend him and you will receive the reward for it, and Allah will bring about what He will \nthrough His Prophet's tongue.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، بُرَيْدِ بْنِ أَبِي بُرْدَةَ قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ، يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏‏.‏ ثُمَّ شَبَّكَ بَيْنَ أَصَابِعِهِ‏.‏   وَكَانَ النَّبِيُّ صلى الله عليه وسلم جَالِسًا إِذْ جَاءَ رَجُلٌ يَسْأَلُ أَوْ طَالِبُ حَاجَةٍ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ اشْفَعُوا فَلْتُؤْجَرُوا، وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6026, 6027In-book reference : Book 78, Hadith 57USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6027,
    "id": 6027,
    "url": "https://sunnah.com/bukhari:6027",
    "bookNumber": 78,
    "hadithNumber": 57,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each \nother.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced. (At that time) the Prophet (ﷺ) was \nsitting and a man came and begged or asked for something. The Prophet (ﷺ) faced us and said, \"Help and \nrecommend him and you will receive the reward for it, and Allah will bring about what He will \nthrough His Prophet's tongue.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، بُرَيْدِ بْنِ أَبِي بُرْدَةَ قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ، يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏‏.‏ ثُمَّ شَبَّكَ بَيْنَ أَصَابِعِهِ‏.‏   وَكَانَ النَّبِيُّ صلى الله عليه وسلم جَالِسًا إِذْ جَاءَ رَجُلٌ يَسْأَلُ أَوْ طَالِبُ حَاجَةٍ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ اشْفَعُوا فَلْتُؤْجَرُوا، وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6026, 6027In-book reference : Book 78, Hadith 57USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6028,
    "id": 6028,
    "url": "https://sunnah.com/bukhari:6028",
    "bookNumber": 78,
    "hadithNumber": 58,
    "narrator": "Narrated Abu Musa:",
    "english": "Whenever a beggar or a person in need came to the Prophet, the Prophet\n     would say \"Help and recommend him and you will receive the reward for \n     it, and Allah will bring about what he will through His Prophet's \n     tongue",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا أَتَاهُ السَّائِلُ أَوْ صَاحِبُ الْحَاجَةِ قَالَ ‏\n\"‏ اشْفَعُوا فَلْتُؤْجَرُوا، وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ رَسُولِهِ مَا شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6028In-book reference : Book 78, Hadith 58USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 56   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6029,
    "id": 6029,
    "url": "https://sunnah.com/bukhari:6029",
    "bookNumber": 78,
    "hadithNumber": 59,
    "narrator": "Narrated Masruq:",
    "english": "Abdullah bin 'Amr mentioned Allah's Messenger (ﷺ) saying that he was neither\n     a Fahish nor a Mutafahish. Abdullah bin 'Amr added, Allah's Messenger (ﷺ) \n     said, 'The best among you are those who have the best manners and \n     character.'",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، سَمِعْتُ أَبَا وَائِلٍ، سَمِعْتُ مَسْرُوقًا، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنْ مَسْرُوقٍ، قَالَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو حِينَ قَدِمَ مَعَ مُعَاوِيَةَ إِلَى الْكُوفَةِ فَذَكَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَمْ يَكُنْ فَاحِشًا وَلاَ مُتَفَحِّشًا، وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَخْيَرِكُمْ أَحْسَنَكُمْ خُلُقًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6029In-book reference : Book 78, Hadith 59USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 56   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6030,
    "id": 6030,
    "url": "https://sunnah.com/bukhari:6030",
    "bookNumber": 78,
    "hadithNumber": 60,
    "narrator": "Narrated `Abdullah bin Mulaika:",
    "english": "`Aisha said that the Jews came to the Prophet (ﷺ) and said, \"As-Samu 'Alaikum\" (death be on you). \n`Aisha said (to them), \"(Death) be on you, and may Allah curse you and shower His wrath upon you!\" \nThe Prophet (ﷺ) said, \"Be calm, O `Aisha ! You should be kind and lenient, and beware of harshness and \nFuhsh (i.e. bad words).\" She said (to the Prophet), \"Haven't you heard what they (Jews) have said?\" \nHe said, \"Haven't you heard what I have said (to them)? I said the same to them, and my invocation \nagainst them will be accepted while theirs against me will be rejected (by Allah). \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ يَهُودَ، أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكُمْ‏.‏ فَقَالَتْ عَائِشَةُ عَلَيْكُمْ، وَلَعَنَكُمُ اللَّهُ، وَغَضِبَ اللَّهُ عَلَيْكُمْ‏.‏ قَالَ ‏\"‏ مَهْلاً يَا عَائِشَةُ، عَلَيْكِ بِالرِّفْقِ، وَإِيَّاكِ وَالْعُنْفَ وَالْفُحْشَ ‏\"‏‏.‏ قَالَتْ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ أَوَلَمْ تَسْمَعِي مَا قُلْتُ رَدَدْتُ عَلَيْهِمْ، فَيُسْتَجَابُ لِي فِيهِمْ، وَلاَ يُسْتَجَابُ لَهُمْ فِيَّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6030In-book reference : Book 78, Hadith 60USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 57   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6031,
    "id": 6031,
    "url": "https://sunnah.com/bukhari:6031",
    "bookNumber": 78,
    "hadithNumber": 61,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) was not one who would abuse (others) or say obscene words, or curse (others), and if he \nwanted to admonish anyone of us, he used to say: \"What is wrong with him, his forehead be dusted!\"",
    "arabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنَا أَبُو يَحْيَى، هُوَ فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ هِلاَلِ بْنِ أُسَامَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم سَبَّابًا وَلاَ فَحَّاشًا وَلاَ لَعَّانًا، كَانَ يَقُولُ لأَحَدِنَا عِنْدَ الْمَعْتَبَةِ ‏\n\"‏ مَا لَهُ، تَرِبَ جَبِينُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6031In-book reference : Book 78, Hadith 61USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 58   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6032,
    "id": 6032,
    "url": "https://sunnah.com/bukhari:6032",
    "bookNumber": 78,
    "hadithNumber": 62,
    "narrator": "Narrated 'Aisha:",
    "english": "A man asked permission to enter upon the Prophet. When the Prophet (ﷺ) saw\n     him, he said, \"What an evil brother of his tribe! And what an evil son\n     of his tribe!\" When that man sat down, the Prophet (ﷺ) behaved with him in\n     a nice and polite manner and was completely at ease with him. When \n     that person had left, 'Aisha said (to the Prophet). \"O Allah's \n     Apostle! When you saw that man, you said so-and-so about him, then you\n     showed him a kind and polite behavior, and you enjoyed his company?\" \n     Allah's Messenger (ﷺ) said, \"O 'Aisha! Have you ever seen me speaking a bad \n     and dirty language? (Remember that) the worst people in Allah's sight \n     on the Day of Resurrection will be those whom the people leave \n     (undisturbed) to be away from their evil (deeds).\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، اسْتَأْذَنَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمَّا رَآهُ قَالَ ‏\"‏ بِئْسَ أَخُو الْعَشِيرَةِ، وَبِئْسَ ابْنُ الْعَشِيرَةِ ‏\"‏‏.‏ فَلَمَّا جَلَسَ تَطَلَّقَ النَّبِيُّ صلى الله عليه وسلم فِي وَجْهِهِ وَانْبَسَطَ إِلَيْهِ، فَلَمَّا انْطَلَقَ الرَّجُلُ قَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ حِينَ رَأَيْتَ الرَّجُلَ قُلْتَ لَهُ كَذَا وَكَذَا، ثُمَّ تَطَلَّقْتَ فِي وَجْهِهِ وَانْبَسَطْتَ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَائِشَةُ مَتَى عَهِدْتِنِي فَحَّاشًا، إِنَّ شَرَّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ مَنْ تَرَكَهُ النَّاسُ اتِّقَاءَ شَرِّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6032In-book reference : Book 78, Hadith 62USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6033,
    "id": 6033,
    "url": "https://sunnah.com/bukhari:6033",
    "bookNumber": 78,
    "hadithNumber": 63,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) was the best among the people (both in shape and \n     character) and was the most generous of them, and was the bravest of \n     them. Once, during the night, the people of Medina got afraid (of a \n     sound). So the people went towards that sound, but the Prophet (ﷺ) having \n     gone to that sound before them, met them while he was saying, \"Don't \n     be afraid, don't be afraid.\" (At that time) he was riding a horse \n     belonging to Abu Talha and it was naked without a saddle, and he was \n     carrying a sword slung at his neck. The Prophet (ﷺ) said, \"I found it (the\n     horse) like a sea, or, it is the sea indeed.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَأَجْوَدَ النَّاسِ وَأَشْجَعَ النَّاسِ، وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ ذَاتَ لَيْلَةٍ فَانْطَلَقَ النَّاسُ قِبَلَ الصَّوْتِ، فَاسْتَقْبَلَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ سَبَقَ النَّاسَ إِلَى الصَّوْتِ وَهْوَ يَقُولُ ‏\"‏ لَنْ تُرَاعُوا، لَنْ تُرَاعُوا ‏\"‏‏.‏ وَهْوَ عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْىٍ مَا عَلَيْهِ سَرْجٌ، فِي عُنُقِهِ سَيْفٌ فَقَالَ ‏\"‏ لَقَدْ وَجَدْتُهُ بَحْرًا ‏\"‏‏.‏ أَوْ ‏\"‏ إِنَّهُ لَبَحْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6033In-book reference : Book 78, Hadith 63USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6034,
    "id": 6034,
    "url": "https://sunnah.com/bukhari:6034",
    "bookNumber": 78,
    "hadithNumber": 64,
    "narrator": "Narrated Jabir:",
    "english": "Never was the Prophet (ﷺ) asked for a thing to be given for which his answer was 'no'.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ يَقُولُ مَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ قَطُّ فَقَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6034In-book reference : Book 78, Hadith 64USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 60   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6035,
    "id": 6035,
    "url": "https://sunnah.com/bukhari:6035",
    "bookNumber": 78,
    "hadithNumber": 65,
    "narrator": "Narrated Masruq:",
    "english": "We were sitting with `Abdullah bin `Amr who was narrating to us (Hadith): He said, \"Allah's Messenger (ﷺ) \nwas neither a Fahish nor a Mutafahhish, and he used to say, 'The best among you are the best in \ncharacter (having good manners).\"'",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ مَسْرُوقٍ، قَالَ كُنَّا جُلُوسًا مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو يُحَدِّثُنَا إِذْ قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاحِشًا وَلاَ مُتَفَحِّشًا، وَإِنَّهُ كَانَ يَقُولُ ‏\n\"‏ إِنَّ خِيَارَكُمْ أَحَاسِنُكُمْ أَخْلاَقًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6035In-book reference : Book 78, Hadith 65USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 61   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6036,
    "id": 6036,
    "url": "https://sunnah.com/bukhari:6036",
    "bookNumber": 78,
    "hadithNumber": 66,
    "narrator": "Narrated Abu Hazim:",
    "english": "Sahl bin Sa`d said that a woman brought a Burda (sheet) to the Prophet. Sahl asked the people, \"Do \nyou know what is a Burda?\" The people replied, \"It is a 'Shamla', a sheet with a fringe.\" That woman \nsaid, \"O Allah's Messenger (ﷺ)! I have brought it so that you may wear it.\" So the Prophet (ﷺ) took it because he \nwas in need of it and wore it. A man among his companions, seeing him wearing it, said, \"O Allah's \nApostle! Please give it to me to wear.\" The Prophet (ﷺ) said, \"Yes.\" (and gave him that sheet). When the \nProphet left, the man was blamed by his companions who said, \"It was not nice on your part to ask the \nProphet for it while you know that he took it because he was in need of it, and you also know that he \n(the Prophet) never turns down anybody's request that he might be asked for.\" That man said, \"I just \nwanted to have its blessings as the Prophet (ﷺ) had put it on, so l hoped that I might be shrouded in it.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم بِبُرْدَةٍ‏.‏ فَقَالَ سَهْلٌ لِلْقَوْمِ أَتَدْرُونَ مَا الْبُرْدَةُ فَقَالَ الْقَوْمُ هِيَ شَمْلَةٌ‏.‏ فَقَالَ سَهْلٌ هِيَ شَمْلَةٌ مَنْسُوجَةٌ فِيهَا حَاشِيَتُهَا ـ فَقَالَتْ يَا رَسُولَ اللَّهِ أَكْسُوكَ هَذِهِ‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَلَبِسَهَا، فَرَآهَا عَلَيْهِ رَجُلٌ مِنَ الصَّحَابَةِ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحْسَنَ هَذِهِ فَاكْسُنِيهَا‏.‏ فَقَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ فَلَمَّا قَامَ النَّبِيُّ صلى الله عليه وسلم لاَمَهُ أَصْحَابُهُ قَالُوا مَا أَحْسَنْتَ حِينَ رَأَيْتَ النَّبِيَّ صلى الله عليه وسلم أَخَذَهَا مُحْتَاجًا إِلَيْهَا، ثُمَّ سَأَلْتَهُ إِيَّاهَا، وَقَدْ عَرَفْتَ أَنَّهُ لاَ يُسْأَلُ شَيْئًا فَيَمْنَعَهُ‏.‏ فَقَالَ رَجَوْتُ بَرَكَتَهَا حِينَ لَبِسَهَا النَّبِيُّ صلى الله عليه وسلم لَعَلِّي أُكَفَّنُ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6036In-book reference : Book 78, Hadith 66USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 62   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6037,
    "id": 6037,
    "url": "https://sunnah.com/bukhari:6037",
    "bookNumber": 78,
    "hadithNumber": 67,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Time will pass rapidly, good deeds will decrease, and miserliness will be \nthrown (in the hearts of the people), and the Harj (will increase).\" They asked, \"What is the Harj?\" He \nreplied, \"(It is) killing (murdering), (it is) murdering (killing).",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَتَقَارَبُ الزَّمَانُ وَيَنْقُصُ الْعَمَلُ، وَيُلْقَى الشُّحُّ وَيَكْثُرُ الْهَرْجُ ‏\"‏‏.‏ قَالُوا وَمَا الْهَرْجُ قَالَ ‏\"‏ الْقَتْلُ، الْقَتْلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6037In-book reference : Book 78, Hadith 67USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 63   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6038,
    "id": 6038,
    "url": "https://sunnah.com/bukhari:6038",
    "bookNumber": 78,
    "hadithNumber": 68,
    "narrator": "Narrated Anas:",
    "english": "I served the Prophet (ﷺ) for ten years, and he never said to me, \"Uf\" (a minor harsh word denoting \nimpatience) and never blamed me by saying, \"Why did you do so or why didn't you do so?\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، سَمِعَ سَلاَّمَ بْنَ مِسْكِينٍ، قَالَ سَمِعْتُ ثَابِتًا، يَقُولُ حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ قَالَ خَدَمْتُ النَّبِيَّ صلى الله عليه وسلم عَشْرَ سِنِينَ، فَمَا قَالَ لِي أُفٍّ‏.‏ وَلاَ لِمَ صَنَعْتَ وَلاَ أَلاَّ صَنَعْتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6038In-book reference : Book 78, Hadith 68USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 64   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6039,
    "id": 6039,
    "url": "https://sunnah.com/bukhari:6039",
    "bookNumber": 78,
    "hadithNumber": 69,
    "narrator": "Narrated Al-Aswad:",
    "english": "I asked `Aisha what did the Prophet (ﷺ) use to do at home. She replied. \"He used to keep himself busy \nserving his family and when it was time for the prayer, he would get up for prayer.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ سَأَلْتُ عَائِشَةَ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي أَهْلِهِ قَالَتْ كَانَ فِي مِهْنَةِ أَهْلِهِ، فَإِذَا حَضَرَتِ الصَّلاَةُ قَامَ إِلَى الصَّلاَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6039In-book reference : Book 78, Hadith 69USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 65   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6040,
    "id": 6040,
    "url": "https://sunnah.com/bukhari:6040",
    "bookNumber": 78,
    "hadithNumber": 70,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"If Allah loves a person, He calls Gabriel saying: 'Allah loves so and so; O Gabriel, \nlove him.' Gabriel would love him, and then Gabriel would make an announcement among the \nresidents of the Heaven, 'Allah loves so-and-so, therefore, you should love him also.' So, all the \nresidents of the Heavens would love him and then he is granted the pleasure of the people of the \nearth.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَحَبَّ اللَّهُ عَبْدًا نَادَى جِبْرِيلَ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا، فَأَحِبَّهُ‏.‏ فَيُحِبُّهُ جِبْرِيلُ، فَيُنَادِي جِبْرِيلُ فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا، فَأَحِبُّوهُ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ، ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي أَهْلِ الأَرْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6040In-book reference : Book 78, Hadith 70USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6041,
    "id": 6041,
    "url": "https://sunnah.com/bukhari:6041",
    "bookNumber": 78,
    "hadithNumber": 71,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"None will have the sweetness (delight) of Faith (a) till he loves a person and loves \nhim only for Allah's sake, (b) and till it becomes dearer to him to be thrown in the fire than to revert to \ndisbelief (Heathenism) after Allah has brought him out of it, (c) and till Allah and His Apostle become \ndearer to him than anything else.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَجِدُ أَحَدٌ حَلاَوَةَ الإِيمَانِ حَتَّى يُحِبَّ الْمَرْءَ، لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَحَتَّى أَنْ يُقْذَفَ فِي النَّارِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَرْجِعَ إِلَى الْكُفْرِ، بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ، وَحَتَّى يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6041In-book reference : Book 78, Hadith 71USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6042,
    "id": 6042,
    "url": "https://sunnah.com/bukhari:6042",
    "bookNumber": 78,
    "hadithNumber": 72,
    "narrator": "Narrated `Abdullah bin Zam`a:",
    "english": "The Prophet (ﷺ) forbade laughing at a person who passes wind, and said, \"How does anyone of you beat \nhis wife as he beats the stallion camel and then he may embrace (sleep with) her?\" And Hisham said, \n\"As he beats his slave\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَضْحَكَ الرَّجُلُ مِمَّا يَخْرُجُ مِنَ الأَنْفُسِ وَقَالَ ‏\"‏ بِمَ يَضْرِبُ أَحَدُكُمُ امْرَأَتَهُ ضَرْبَ الْفَحْلِ، ثُمَّ لَعَلَّهُ يُعَانِقُهَا ‏\"‏‏.‏ وَقَالَ الثَّوْرِيُّ وَوُهَيْبٌ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ ‏\"‏ جَلْدَ الْعَبْدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6042In-book reference : Book 78, Hadith 72USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 68   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6043,
    "id": 6043,
    "url": "https://sunnah.com/bukhari:6043",
    "bookNumber": 78,
    "hadithNumber": 73,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said at Mina, \"Do you know what day is today?\" They (the people) replied, \"Allah and \nHis Apostle know better,\" He said \"Today is 10th of Dhul-Hijja, the sacred (forbidden) day. Do you \nknow what town is this town?\" They (the people) replied, \"Allah and His Apostle know better.\" He \nsaid, \"This is the (forbidden) Sacred town (Mecca a sanctuary).\" And do you know which month is \nthis month?\" They (the People) replied, \"Allah and His Apostle know better.\" He said, ''This is the \nSacred (forbidden) month .\" He added, \"Allah has made your blood, your properties and your honor \nSacred to one another (i.e. Muslims) like the sanctity of this day of yours in this month of yours, in \nthis town of yours.\" (See Hadith No. 797, Vol. 2.)",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم بِمِنًى ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ فَإِنَّ هَذَا يَوْمٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ بَلَدٌ حَرَامٌ، أَتَدْرُونَ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهْرٌ حَرَامٌ ‏\"‏‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6043In-book reference : Book 78, Hadith 73USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6044,
    "id": 6044,
    "url": "https://sunnah.com/bukhari:6044",
    "bookNumber": 78,
    "hadithNumber": 74,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"Abusing a Muslim is Fusuq (i.e., an evil-doing), and killing him is Kufr \n(disbelief).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ ‏\"‏‏.‏ تَابَعَهُ غُنْدَرٌ عَنْ شُعْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6044In-book reference : Book 78, Hadith 74USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6045,
    "id": 6045,
    "url": "https://sunnah.com/bukhari:6045",
    "bookNumber": 78,
    "hadithNumber": 75,
    "narrator": "Narrated Abu Dhar:",
    "english": "That he heard the Prophet (ﷺ) saying, \"If somebody accuses another of Fusuq (by calling him 'Fasiq' i.e. a \nwicked person) or accuses him of Kufr, such an accusation will revert to him (i.e. the accuser) if his \ncompanion (the accused) is innocent.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ، أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَرْمِي رَجُلٌ رَجُلاً بِالْفُسُوقِ، وَلاَ يَرْمِيهِ بِالْكُفْرِ، إِلاَّ ارْتَدَّتْ عَلَيْهِ، إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6045In-book reference : Book 78, Hadith 75USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 71   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6046,
    "id": 6046,
    "url": "https://sunnah.com/bukhari:6046",
    "bookNumber": 78,
    "hadithNumber": 76,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) was neither a Fahish (one who had a bad tongue) nor a Sabbaba (one who abuses \nothers) and he used to say while admonishing somebody, \"What is wrong with him? May dust be on \nhis forehead!\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسٍ، قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاحِشًا وَلاَ لَعَّانًا وَلاَ سَبَّابًا، كَانَ يَقُولُ عِنْدَ الْمَعْتَبَةِ ‏\n\"‏ مَا لَهُ، تَرِبَ جَبِينُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6046In-book reference : Book 78, Hadith 76USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6047,
    "id": 6047,
    "url": "https://sunnah.com/bukhari:6047",
    "bookNumber": 78,
    "hadithNumber": 77,
    "narrator": "Narrated Thabit bin Ad-Dahhak:",
    "english": "(who was one of the companions who gave the pledge of allegiance to the Prophet (ﷺ) underneath the tree \n(Al-Hudaibiya)) Allah's Messenger (ﷺ) said, \"Whoever swears by a religion other than Islam (i.e. if \nsomebody swears by saying that he is a non-Muslim e.g., a Jew or a Christian, etc.) in case he is \ntelling a lie, he is really so if his oath is false, and a person is not bound to fulfill a vow about a thing \nwhich he does not possess. And if somebody commits suicide with anything in this world, he will be \ntortured with that very thing on the Day of Resurrection; And if somebody curses a believer, then his \nsin will be as if he murdered him; And whoever accuses a believer of Kufr (disbelief), then it is as if \nhe killed him.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّ ثَابِتَ بْنَ الضَّحَّاكِ، وَكَانَ، مِنْ أَصْحَابِ الشَّجَرَةِ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ حَلَفَ عَلَى مِلَّةٍ غَيْرِ الإِسْلاَمِ فَهْوَ كَمَا قَالَ، وَلَيْسَ عَلَى ابْنِ آدَمَ نَذْرٌ فِيمَا لاَ يَمْلِكُ، وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ، وَمَنْ لَعَنَ مُؤْمِنًا فَهْوَ كَقَتْلِهِ، وَمَنْ قَذَفَ مُؤْمِنًا بِكُفْرٍ فَهْوَ كَقَتْلِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6047In-book reference : Book 78, Hadith 77USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6048,
    "id": 6048,
    "url": "https://sunnah.com/bukhari:6048",
    "bookNumber": 78,
    "hadithNumber": 78,
    "narrator": "Narrated Sulaiman bin Surad:",
    "english": "A man from the companions of the Prophet (ﷺ) said, \"Two men abused each other in front of the Prophet (ﷺ) \nand one of them became angry and his anger became so intense that his face became swollen and \nchanged. The Prophet (ﷺ) said, \"I know a word the saying of which will cause him to relax if he does say \nit.\" Then a man went to him and informed him of the statement of the Prophet (ﷺ) and said, \"Seek refuge \nwith Allah from Satan.\" On that, angry man said, 'Do you find anything wrong with me? Am I insane? \nGo away!\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَغَضِبَ أَحَدُهُمَا، فَاشْتَدَّ غَضَبُهُ حَتَّى انْتَفَخَ وَجْهُهُ وَتَغَيَّرَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ ‏\"‏‏.‏ فَانْطَلَقَ إِلَيْهِ الرَّجُلُ فَأَخْبَرَهُ بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ تَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ‏.‏ فَقَالَ أَتُرَى بِي بَأْسٌ أَمَجْنُونٌ أَنَا اذْهَبْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6048In-book reference : Book 78, Hadith 78USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 74   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6049,
    "id": 6049,
    "url": "https://sunnah.com/bukhari:6049",
    "bookNumber": 78,
    "hadithNumber": 79,
    "narrator": "Narrated 'Ubada bin As-Samit:",
    "english": "Allah's Messenger (ﷺ) went out to inform the people about the (date of the Night of decree (Al-Qadr). There \nhappened a quarrel between two Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about the \nNight of Al-Qadr, but as so-and-so and so-and-so quarrelled, so the news about it had been taken \naway; and may be it was better for you. So look for it in the ninth, the seventh, or the fifth (of the last \nten days of Ramadan).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ حُمَيْدٍ، قَالَ قَالَ أَنَسٌ حَدَّثَنِي عُبَادَةُ بْنُ الصَّامِتِ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُخْبِرَ النَّاسَ بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى رَجُلاَنِ مِنَ الْمُسْلِمِينَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خَرَجْتُ لأُخْبِرَكُمْ، فَتَلاَحَى فُلاَنٌ وَفُلاَنٌ وَإِنَّهَا رُفِعَتْ، وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ، فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6049In-book reference : Book 78, Hadith 79USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 75   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6050,
    "id": 6050,
    "url": "https://sunnah.com/bukhari:6050",
    "bookNumber": 78,
    "hadithNumber": 80,
    "narrator": "Narrated Ma'rur:",
    "english": "I saw Abu Dhar wearing a Burd (garment) and his slave too was wearing a Burd, so I said (to Abu \nDhar), \"If you take this (Burda of your slave) and wear it (along with yours), you will have a nice suit \n(costume) and you may give him another garment.\" Abu Dhar said, \"There was a quarrel between me \nand another man whose mother was a non-Arab and I called her bad names. The man mentioned \n(complained about) me to the Prophet. The Prophet (ﷺ) said, \"Did you abuse so-and-so?\" I said, \"Yes\" He \nsaid, \"Did you call his mother bad names?\" I said, \"Yes\". He said, \"You still have the traits of (the \nPre-lslamic period of) ignorance.\" I said. \"(Do I still have ignorance) even now in my old age?\" He \nsaid, \"Yes, they (slaves or servants) are your brothers, and Allah has put them under your command. \nSo the one under whose hand Allah has put his brother, should feed him of what he eats, and give him \ndresses of what he wears, and should not ask him to do a thing beyond his capacity. And if at all he \nasks him to do a hard task, he should help him therein.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ رَأَيْتُ عَلَيْهِ بُرْدًا وَعَلَى غُلاَمِهِ بُرْدًا فَقُلْتُ لَوْ أَخَذْتَ هَذَا فَلَبِسْتَهُ كَانَتْ حُلَّةً، وَأَعْطَيْتَهُ ثَوْبًا آخَرَ‏.‏ فَقَالَ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ كَلاَمٌ، وَكَانَتْ أُمُّهُ أَعْجَمِيَّةً، فَنِلْتُ مِنْهَا فَذَكَرَنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي ‏\"‏ أَسَابَبْتَ فُلاَنًا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَفَنِلْتَ مِنْ أُمِّهِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ ‏\"‏‏.‏ قُلْتُ عَلَى حِينِ سَاعَتِي هَذِهِ مِنْ كِبَرِ السِّنِّ قَالَ ‏\"‏ نَعَمْ، هُمْ إِخْوَانُكُمْ، جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ جَعَلَ اللَّهُ أَخَاهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ يُكَلِّفُهُ مِنَ الْعَمَلِ مَا يَغْلِبُهُ، فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيُعِنْهُ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6050In-book reference : Book 78, Hadith 80USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 76   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6051,
    "id": 6051,
    "url": "https://sunnah.com/bukhari:6051",
    "bookNumber": 78,
    "hadithNumber": 81,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) led us in the Zuhr prayer, offering only two rak`at and then (finished it) with Taslim, and \nwent to a piece of wood in front of the mosque and put his hand over it. Abu Bakr and `Umar were \nalso present among the people on that day but dared not talk to him (about his unfinished prayer). And \nthe hasty people went away, wondering. \"Has the prayer been shortened\" Among the people there was \na man whom the Prophet (ﷺ) used to call Dhul-Yadain (the longarmed). He said, \"O Allah's Prophet! \nHave you forgotten or has the prayer been shortened?\" The Prophet (ﷺ) said, \"Neither have I forgotten, \nnor has it been shortened.\" They (the people) said, \"Surely, you have forgotten, O Allah's Messenger (ﷺ)!\" \nThe Prophet (ﷺ) said, Dhul-Yadain has told the truth.\" So the Prophet (ﷺ) got up and offered other two rak`at \nand finished his prayer with Taslim. Then he said Takbir, performed a prostration of ordinary duration \nor longer, then he raised his head and said Takbir and performed another prostration of ordinary \nduration or longer and then raised his head and said Takbir (i.e. he performed the two prostrations of \nSahu, i.e., forgetfulness).",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ رَكْعَتَيْنِ، ثُمَّ سَلَّمَ، ثُمَّ قَامَ إِلَى خَشَبَةٍ فِي مُقَدَّمِ الْمَسْجِدِ، وَوَضَعَ يَدَهُ عَلَيْهَا، وَفِي الْقَوْمِ يَوْمَئِذٍ أَبُو بَكْرٍ وَعُمَرُ، فَهَابَا أَنْ يُكَلِّمَاهُ، وَخَرَجَ سَرَعَانُ النَّاسِ فَقَالُوا قَصُرَتِ الصَّلاَةُ‏.‏ وَفِي الْقَوْمِ رَجُلٌ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُوهُ ذَا الْيَدَيْنِ فَقَالَ يَا نَبِيَّ اللَّهِ أَنَسِيتَ أَمْ قَصُرَتْ‏.‏ فَقَالَ ‏\"‏ لَمْ أَنْسَ وَلَمْ تَقْصُرْ ‏\"‏‏.‏ قَالُوا بَلْ نَسِيتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ صَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ، فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ، ثُمَّ وَضَعَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6051In-book reference : Book 78, Hadith 81USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 77   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6052,
    "id": 6052,
    "url": "https://sunnah.com/bukhari:6052",
    "bookNumber": 78,
    "hadithNumber": 82,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) passed by two graves and said, \"Both of them (persons in the grave) are being \ntortured, and they are not being tortured for a major sin. This one used not to save himself from being \nsoiled with his urine, and the other used to go about with calumnies (among the people to rouse \nhostilities, e.g., one goes to a person and tells him that so-and-so says about him such-and-such evil \nthings). The Prophet (ﷺ) then asked for a green leaf of a date-palm tree, split it into two pieces and planted \none on each grave and said, \"It is hoped that their punishment may be abated till those two pieces of \nthe leaf get dried.\" (See Hadith No 215, Vol 1).",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى قَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ، أَمَّا هَذَا فَكَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ، وَأَمَّا هَذَا فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِعَسِيبٍ رَطْبٍ، فَشَقَّهُ بِاثْنَيْنِ، فَغَرَسَ عَلَى هَذَا وَاحِدًا وَعَلَى هَذَا وَاحِدًا ثُمَّ قَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا، مَا لَمْ يَيْبَسَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6052In-book reference : Book 78, Hadith 82USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6053,
    "id": 6053,
    "url": "https://sunnah.com/bukhari:6053",
    "bookNumber": 78,
    "hadithNumber": 83,
    "narrator": "Narrated Abu Usaid As-Sa`idi:",
    "english": "The Prophet (ﷺ) said, \"The best family among the Ansar is the Banu An-Najjar. \"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي أُسَيْدٍ السَّاعِدِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خَيْرُ دُورِ الأَنْصَارِ بَنُو النَّجَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6053In-book reference : Book 78, Hadith 83USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 79   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6054,
    "id": 6054,
    "url": "https://sunnah.com/bukhari:6054",
    "bookNumber": 78,
    "hadithNumber": 84,
    "narrator": "Narrated `Aisha:",
    "english": "A man asked permission to enter upon Allah's Messenger (ﷺ). The Prophet (ﷺ) said, \"Admit him. What an evil \nbrother of his people or a son of his people.\" But when the man entered, the Prophet (ﷺ) spoke to him in a \nvery polite manner. (And when that person left) I said, \"O Allah's Messenger (ﷺ)! You had said what you had \nsaid, yet you spoke to him in a very polite manner?\" The Prophet (ﷺ) said, \"O `Aisha! The worst people \nare those whom the people desert or leave in order to save themselves from their dirty language or \nfrom their transgression.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، سَمِعْتُ ابْنَ الْمُنْكَدِرِ، سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ قَالَتِ، اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ائْذَنُوا لَهُ بِئْسَ، أَخُو الْعَشِيرَةِ أَوِ ابْنُ الْعَشِيرَةِ ‏\"‏‏.‏ فَلَمَّا دَخَلَ أَلاَنَ لَهُ الْكَلاَمَ قُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ الَّذِي قُلْتَ، ثُمَّ أَلَنْتَ لَهُ الْكَلاَمَ قَالَ ‏\"‏ أَىْ عَائِشَةُ، إِنَّ شَرَّ النَّاسِ مَنْ تَرَكَهُ النَّاسُ ـ أَوْ وَدَعَهُ النَّاسُ ـ اتِّقَاءَ فُحْشِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6054In-book reference : Book 78, Hadith 84USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6055,
    "id": 6055,
    "url": "https://sunnah.com/bukhari:6055",
    "bookNumber": 78,
    "hadithNumber": 85,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once the Prophet (ﷺ) went through the grave-yards of Medina and heard the voices of two humans who \nwere being tortured in their graves. The Prophet (ﷺ) said, \"They are being punished, but they are not being \npunished because of a major sin, yet their sins are great. One of them used not to save himself from \n(being soiled with) the urine, and the other used to go about with calumnies (Namima).\" Then the \nProphet asked for a green palm tree leaf and split it into two pieces and placed one piece on each \ngrave, saying, \"I hope that their punishment may be abated as long as these pieces of the leaf are not \ndried.\"",
    "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا عَبِيدَةُ بْنُ حُمَيْدٍ أَبُو عَبْدِ الرَّحْمَنِ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنْ بَعْضِ حِيطَانِ الْمَدِينَةِ، فَسَمِعَ صَوْتَ إِنْسَانَيْنِ يُعَذَّبَانِ فِي قُبُورِهِمَا فَقَالَ ‏\"‏ يُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرَةٍ، وَإِنَّهُ لَكَبِيرٌ، كَانَ أَحَدُهُمَا لاَ يَسْتَتِرُ مِنَ الْبَوْلِ، وَكَانَ الآخَرُ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِجَرِيدَةٍ فَكَسَرَهَا بِكِسْرَتَيْنِ أَوْ ثِنْتَيْنِ، فَجَعَلَ كِسْرَةً فِي قَبْرِ هَذَا، وَكِسْرَةً فِي قَبْرِ هَذَا، فَقَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6055In-book reference : Book 78, Hadith 85USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6056,
    "id": 6056,
    "url": "https://sunnah.com/bukhari:6056",
    "bookNumber": 78,
    "hadithNumber": 86,
    "narrator": "Narrated Hudhaifa:",
    "english": "I heard the Prophet (ﷺ) saying, \"A Qattat will not enter Paradise.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، قَالَ كُنَّا مَعَ حُذَيْفَةَ فَقِيلَ لَهُ إِنَّ رَجُلاً يَرْفَعُ الْحَدِيثَ إِلَى عُثْمَانَ‏.‏ فَقَالَ حُذَيْفَةُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَدْخُلُ الْجَنَّةَ قَتَّاتٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6056In-book reference : Book 78, Hadith 86USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 82   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6057,
    "id": 6057,
    "url": "https://sunnah.com/bukhari:6057",
    "bookNumber": 78,
    "hadithNumber": 87,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Whoever does not give up false statements (i.e. telling lies), and evil deeds, and \nspeaking bad words to others, Allah is not in need of his (fasting) leaving his food and drink.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ وَالْجَهْلَ فَلَيْسَ لِلَّهِ حَاجَةٌ أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ ‏\"‏‏.‏ قَالَ أَحْمَدُ أَفْهَمَنِي رَجُلٌ إِسْنَادَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6057In-book reference : Book 78, Hadith 87USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 83   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6058,
    "id": 6058,
    "url": "https://sunnah.com/bukhari:6058",
    "bookNumber": 78,
    "hadithNumber": 88,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The worst people in the Sight of Allah on the Day of Resurrection will be the \ndouble faced people who appear to some people with one face and to other people with another face.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ تَجِدُ مِنْ شَرِّ النَّاسِ يَوْمَ الْقِيَامَةِ عِنْدَ اللَّهِ ذَا الْوَجْهَيْنِ، الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6058In-book reference : Book 78, Hadith 88USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6059,
    "id": 6059,
    "url": "https://sunnah.com/bukhari:6059",
    "bookNumber": 78,
    "hadithNumber": 89,
    "narrator": "Narrated Ibn Mas`ud:",
    "english": "Once Allah's Messenger (ﷺ) divided and distributed (the war booty). An Ansar man said, \"By Allah ! \nMuhammad, by this distribution, did not intend to please Allah.\" So I came to Allah's Messenger (ﷺ) and \ninformed him about it whereupon his face became changed with anger and he said, \"May Allah \nbestow His Mercy on Moses for he was hurt with more than this, yet he remained patient.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قِسْمَةً، فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ وَاللَّهِ مَا أَرَادَ مُحَمَّدٌ بِهَذَا وَجْهَ اللَّهِ‏.‏ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَتَمَعَّرَ وَجْهُهُ وَقَالَ ‏\n\"‏ رَحِمَ اللَّهُ مُوسَى، لَقَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6059In-book reference : Book 78, Hadith 89USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 85   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6060,
    "id": 6060,
    "url": "https://sunnah.com/bukhari:6060",
    "bookNumber": 78,
    "hadithNumber": 90,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) heard a man praising another man and he was exaggerating in his praise. The Prophet (ﷺ) \nsaid (to him). \"You have destroyed (or cut) the back of the man.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يُثْنِي عَلَى رَجُلٍ وَيُطْرِيهِ فِي الْمِدْحَةِ فَقَالَ ‏\n\"‏ أَهْلَكْتُمْ ـ أَوْ قَطَعْتُمْ ـ ظَهْرَ الرَّجُلِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6060In-book reference : Book 78, Hadith 90USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 86   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6061,
    "id": 6061,
    "url": "https://sunnah.com/bukhari:6061",
    "bookNumber": 78,
    "hadithNumber": 91,
    "narrator": "Narrated Abu Bakra:",
    "english": "A man was mentioned before the Prophet (ﷺ) and another man praised him greatly The Prophet (ﷺ) said, \n\"May Allah's Mercy be on you ! You have cut the neck of your friend.\" The Prophet (ﷺ) repeated this \nsentence many times and said, \"If it is indispensable for anyone of you to praise someone, then he \nshould say, 'I think that he is so-and-so,\" if he really thinks that he is such. Allah is the One Who will \ntake his accounts (as He knows his reality) and no-one can sanctify anybody before Allah.\" (Khalid \nsaid, \"Woe to you,\" instead of \"Allah's Mercy be on you.\")",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، ذُكِرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَثْنَى عَلَيْهِ رَجُلٌ خَيْرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ ـ يَقُولُهُ مِرَارًا ـ إِنْ كَانَ أَحَدُكُمْ مَادِحًا لاَ مَحَالَةَ فَلْيَقُلْ أَحْسِبُ كَذَا وَكَذَا‏.‏ إِنْ كَانَ يُرَى أَنَّهُ كَذَلِكَ، وَحَسِيبُهُ اللَّهُ، وَلاَ يُزَكِّي عَلَى اللَّهِ أَحَدًا ‏\"‏‏.‏ قَالَ وُهَيْبٌ عَنْ خَالِدٍ ‏\"‏ وَيْلَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6061In-book reference : Book 78, Hadith 91USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 87   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6062,
    "id": 6062,
    "url": "https://sunnah.com/bukhari:6062",
    "bookNumber": 78,
    "hadithNumber": 92,
    "narrator": "Narrated Salim:",
    "english": "that his father said; \"When Allah's Messenger (ﷺ) mentioned what he mentioned about (the hanging of) the \nIzar (waist sheet), Abu Bakr said, \"O Allah's Messenger (ﷺ)! My Izar slackens on one side (without my \nintention).\" The Prophet (ﷺ) said, \"You are not among those (who, out of pride) drag their Izars behind \nthem.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ ذَكَرَ فِي الإِزَارِ مَا ذَكَرَ، قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّ إِزَارِي يَسْقُطُ مِنْ أَحَدِ شِقَّيْهِ‏.‏ قَالَ ‏\n\"‏ إِنَّكَ لَسْتَ مِنْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6062In-book reference : Book 78, Hadith 92USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 88   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6063,
    "id": 6063,
    "url": "https://sunnah.com/bukhari:6063",
    "bookNumber": 78,
    "hadithNumber": 93,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) continued for such-and-such period imagining that he has slept (had sexual relations) \nwith his wives, and in fact he did not. One day he said, to me, \"O `Aisha! Allah has instructed me \nregarding a matter about which I had asked Him. There came to me two men, one of them sat near my \nfeet and the other near my head. The one near my feet, asked the one near my head (pointing at me), \n'What is wrong with this man? The latter replied, 'He is under the effect of magic.' The first one asked, \n'Who had worked magic on him?' The other replied, 'Lubaid bin Asam.' The first one asked, 'What \nmaterial (did he use)?' The other replied, 'The skin of the pollen of a male date tree with a comb and \nthe hair stuck to it, kept under a stone in the well of Dharwan.\"' Then the Prophet (ﷺ) went to that well \nand said, \"This is the same well which was shown to me in the dream. The tops of its date-palm trees \nlook like the heads of the devils, and its water looks like the Henna infusion.\" Then the Prophet (ﷺ) \nordered that those things be taken out. I said, \"O Allah's Messenger (ﷺ)! Won't you disclose (the magic \nobject)?\" The Prophet (ﷺ) said, \"Allah has cured me and I hate to circulate the evil among the people.\" \n`Aisha added, \"(The magician) Lubaid bin Asam was a man from Bani Zuraiq, an ally of the Jews.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَكَثَ النَّبِيُّ صلى الله عليه وسلم كَذَا وَكَذَا يُخَيَّلُ إِلَيْهِ أَنَّهُ يَأْتِي أَهْلَهُ وَلاَ يَأْتِي، قَالَتْ عَائِشَةُ فَقَالَ لِي ذَاتَ يَوْمٍ ‏\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ أَفْتَانِي فِي أَمْرٍ اسْتَفْتَيْتُهُ فِيهِ، أَتَانِي رَجُلاَنِ، فَجَلَسَ أَحَدُهُمَا عِنْدَ رِجْلَىَّ وَالآخَرُ عِنْدَ رَأْسِي، فَقَالَ الَّذِي عِنْدَ رِجْلَىَّ لِلَّذِي عِنْدَ رَأْسِي مَا بَالُ الرَّجُلِ قَالَ مَطْبُوبٌ‏.‏ يَعْنِي مَسْحُورًا‏.‏ قَالَ وَمَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ أَعْصَمَ‏.‏ قَالَ وَفِيمَ قَالَ فِي جُفِّ طَلْعَةٍ ذَكَرٍ فِي مُشْطٍ وَمُشَاقَةٍ، تَحْتَ رَعُوفَةٍ فِي بِئْرِ ذَرْوَانَ ‏\"‏‏.‏ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَذِهِ الْبِئْرُ الَّتِي أُرِيتُهَا كَأَنَّ رُءُوسَ نَخْلِهَا رُءُوسُ الشَّيَاطِينِ، وَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ ‏\"‏‏.‏ فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَأُخْرِجَ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ فَهَلاَّ ـ تَعْنِي ـ تَنَشَّرْتَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَّا اللَّهُ فَقَدْ شَفَانِي، وَأَمَّا أَنَا فَأَكْرَهُ أَنْ أُثِيرَ عَلَى النَّاسِ شَرًّا ‏\"‏‏.‏ قَالَتْ وَلَبِيدُ بْنُ أَعْصَمَ رَجُلٌ مِنْ بَنِي زُرَيْقٍ حَلِيفٌ لِيَهُودَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6063In-book reference : Book 78, Hadith 93USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6064,
    "id": 6064,
    "url": "https://sunnah.com/bukhari:6064",
    "bookNumber": 78,
    "hadithNumber": 94,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales; and do not look for \nthe others' faults and do not spy, and do not be jealous of one another, and do not desert (cut your \nrelation with) one another, and do not hate one another; and O Allah's worshipers! Be brothers (as \nAllah has ordered you!\")",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَدَابَرُوا، وَلاَ تَبَاغَضُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6064In-book reference : Book 78, Hadith 94USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 90   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6065,
    "id": 6065,
    "url": "https://sunnah.com/bukhari:6065",
    "bookNumber": 78,
    "hadithNumber": 95,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"Do not hate one another, and do not be jealous of one another, and do not desert \neach other, and O, Allah's worshipers! Be brothers. Lo! It is not permissible for any Muslim to desert \n(not talk to) his brother (Muslim) for more than three days.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبَاغَضُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا، وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثَةِ أَيَّامٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6065In-book reference : Book 78, Hadith 95USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 91   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6066,
    "id": 6066,
    "url": "https://sunnah.com/bukhari:6066",
    "bookNumber": 78,
    "hadithNumber": 96,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales. and do not look \nfor the others' faults, and do not do spying on one another, and do not practice Najsh, and do not be \njealous of one another and do not hate one another, and do not desert (stop talking to) one another. \nAnd O, Allah's worshipers! Be brothers!\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَنَاجَشُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6066In-book reference : Book 78, Hadith 96USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 92   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6067,
    "id": 6067,
    "url": "https://sunnah.com/bukhari:6067",
    "bookNumber": 78,
    "hadithNumber": 97,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"I do not think that so-and-so and so-and-so know anything of our religion.\" (And \nAl-Laith said, \"These two persons were among the hypocrites.\")",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا أَظُنُّ فُلاَنًا وَفُلاَنًا يَعْرِفَانِ مِنْ دِينِنَا شَيْئًا ‏\"‏‏.‏ قَالَ اللَّيْثُ كَانَا رَجُلَيْنِ مِنَ الْمُنَافِقِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6067In-book reference : Book 78, Hadith 97USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 93   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6068,
    "id": 6068,
    "url": "https://sunnah.com/bukhari:6068",
    "bookNumber": 78,
    "hadithNumber": 98,
    "narrator": "Narrated Al-Laith:",
    "english": "`Aisha said \"The Prophet (ﷺ) entered upon me one day and said, 'O `Aisha! I do not think that so-and-so \nand so-and-so know anything of our religion which we follow.\"'",
    "arabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، بِهَذَا وَقَالَتْ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم يَوْمًا وَقَالَ ‏\n\"‏ يَا عَائِشَةُ مَا أَظُنُّ فُلاَنًا وَفُلاَنًا يَعْرِفَانِ دِينَنَا الَّذِي نَحْنُ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6068In-book reference : Book 78, Hadith 98USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 94   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6069,
    "id": 6069,
    "url": "https://sunnah.com/bukhari:6069",
    "bookNumber": 78,
    "hadithNumber": 99,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying. \"All the sins of my followers will be forgiven except those of the \nMujahirin (those who commit a sin openly or disclose their sins to the people). An example of such \ndisclosure is that a person commits a sin at night and though Allah screens it from the public, then he \ncomes in the morning, and says, 'O so-and-so, I did such-and-such (evil) deed yesterday,' though he \nspent his night screened by his Lord (none knowing about his sin) and in the morning he removes \nAllah's screen from himself.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ أَخِي ابْنِ شِهَابٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ كُلُّ أُمَّتِي مُعَافًى إِلاَّ الْمُجَاهِرِينَ، وَإِنَّ مِنَ الْمَجَانَةِ أَنْ يَعْمَلَ الرَّجُلُ بِاللَّيْلِ عَمَلاً، ثُمَّ يُصْبِحَ وَقَدْ سَتَرَهُ اللَّهُ، فَيَقُولَ يَا فُلاَنُ عَمِلْتُ الْبَارِحَةَ كَذَا وَكَذَا، وَقَدْ بَاتَ يَسْتُرُهُ رَبُّهُ وَيُصْبِحُ يَكْشِفُ سِتْرَ اللَّهِ عَنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6069In-book reference : Book 78, Hadith 99USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6070,
    "id": 6070,
    "url": "https://sunnah.com/bukhari:6070",
    "bookNumber": 78,
    "hadithNumber": 100,
    "narrator": "Narrated Safwan bin Muhriz:",
    "english": "A man asked Ibn `Umar, \"What did you hear Allah's Messenger (ﷺ) saying regarding An-Najwa (secret talk \nbetween Allah and His believing worshipper on the Day of Judgment)?\" He said, \"(The Prophet (ﷺ) said), \n\"One of you will come close to his Lord till He will shelter him in His screen and say: Did you \ncommit such-and-such sin? He will say, 'Yes.' Then Allah will say: Did you commit such and such \nsin? He will say, 'Yes.' So Allah will make him confess (all his sins) and He will say, 'I screened them \n(your sins) for you in the world, and today I forgive them for you.\"'",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، أَنَّ رَجُلاً، سَأَلَ ابْنَ عُمَرَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي النَّجْوَى قَالَ ‏\n\"‏ يَدْنُو أَحَدُكُمْ مِنْ رَبِّهِ حَتَّى يَضَعَ كَنَفَهُ عَلَيْهِ فَيَقُولُ عَمِلْتَ كَذَا وَكَذَا‏.‏ فَيَقُولُ نَعَمْ‏.‏ وَيَقُولُ عَمِلْتَ كَذَا وَكَذَا‏.‏ فَيَقُولُ نَعَمْ‏.‏ فَيُقَرِّرُهُ ثُمَّ يَقُولُ إِنِّي سَتَرْتُ عَلَيْكَ فِي الدُّنْيَا، فَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6070In-book reference : Book 78, Hadith 100USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 96   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6071,
    "id": 6071,
    "url": "https://sunnah.com/bukhari:6071",
    "bookNumber": 78,
    "hadithNumber": 101,
    "narrator": "Narrated Haritha bin Wahb:",
    "english": "Al-Khuzai: The Prophet (ﷺ) said, \"Shall I inform you about the people of \n     Paradise? They comprise every obscure unimportant humble person, and \n     if he takes Allah's Oath that he will do that thing, Allah will \n     fulfill his oath (by doing that). Shall I inform you about the people \n     of the Fire? They comprise every cruel, violent, proud and conceited \n     person.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا مَعْبَدُ بْنُ خَالِدٍ الْقَيْسِيُّ، عَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ، كُلُّ ضَعِيفٍ مُتَضَاعِفٍ، لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ، أَلاَ أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُسْتَكْبِرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6071In-book reference : Book 78, Hadith 101USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6072,
    "id": 6072,
    "url": "https://sunnah.com/bukhari:6072",
    "bookNumber": 78,
    "hadithNumber": 102,
    "narrator": "",
    "english": "Anas bin Malik said, \"Any of the female slaves of Medina \n     could take hold of the hand of Allah's Messenger (ﷺ) and take him wherever \n     she wished.\"",
    "arabic": "وَقَالَ مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَتِ الأَمَةُ مِنْ إِمَاءِ أَهْلِ الْمَدِينَةِ لَتَأْخُذُ بِيَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَنْطَلِقُ بِهِ حَيْثُ شَاءَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6072In-book reference : Book 78, Hadith 102USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6073,
    "id": 6073,
    "url": "https://sunnah.com/bukhari:6073",
    "bookNumber": 78,
    "hadithNumber": 103,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) that she was told that `Abdullah bin Az-Zubair (on hearing that she was \nselling or giving something as a gift) said, \"By Allah, if `Aisha does not give up this, I will declare her \nincompetent to dispose of her wealth.\" I said, \"Did he (`Abdullah bin Az-Zubair) say so?\" They \n(people) said, \"Yes.\" `Aisha said, \"I vow to Allah that I will never speak to Ibn Az-Zubair.\" When this \ndesertion lasted long, `Abdullah bin Az-Zubair sought intercession with her, but she said, \"By Allah, I \nwill not accept the intercession of anyone for him, and will not commit a sin by breaking my vow.\" \nWhen this state of affairs was prolonged on Ibn Az-Zubair (he felt it hard on him), he said to Al- \nMiswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth, who were from the tribe \nof Bani Zahra, \"I beseech you, by Allah, to let me enter upon `Aisha, for it is unlawful for her to vow \nto cut the relation with me.\" \nSo Al-Miswar and `Abdur-Rahman, wrapping their sheets around themselves, asked `Aisha's \npermission saying, \"Peace and Allah's Mercy and Blessings be upon you! Shall we come in?\" `Aisha \nsaid, \"Come in.\" They said, \"All of us?\" She said, \"Yes, come in all of you,\" not knowing that Ibn Az- \nZubair was also with them. So when they entered, Ibn Az-Zubair entered the screened place and got \nhold of `Aisha and started requesting her to excuse him, and wept. Al-Miswar and `Abdur Rahman \nalso started requesting her to speak to him and to accept his repentance. \nThey said (to her), \"The Prophet (ﷺ) forbade what you know of deserting (not speaking to your Muslim \nBrethren), for it is unlawful for any Muslim not to talk to his brother for more than three nights \n(days).\" So when they increased their reminding her (of the superiority of having good relation with \nKith and kin, and of excusing others' sins), and brought her down to a critical situation, she started \nreminding them, and wept, saying, \"I have made a vow, and (the question of) vow is a difficult one.\" \nThey (Al-Miswar and `Abdur-Rahman) persisted in their appeal till she spoke with `Abdullah bin Az- \nZubair and she manumitted forty slaves as an expiation for her vow. Later on, whenever she \nremembered her vow, she used to weep so much that her veil used to become wet with her tears.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَوْفُ بْنُ مَالِكِ بْنِ الطُّفَيْلِ ـ هُوَ ابْنُ الْحَارِثِ وَهْوَ ابْنُ أَخِي عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم لأُمِّهَا ـ أَنَّ عَائِشَةَ حُدِّثَتْ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ قَالَ فِي بَيْعٍ أَوْ عَطَاءٍ أَعْطَتْهُ عَائِشَةُ وَاللَّهِ لَتَنْتَهِيَنَّ عَائِشَةُ، أَوْ لأَحْجُرَنَّ عَلَيْهَا‏.‏ فَقَالَتْ أَهُوَ قَالَ هَذَا قَالُوا نَعَمْ‏.‏ قَالَتْ هُوَ لِلَّهِ عَلَىَّ نَذْرٌ، أَنْ لاَ أُكَلِّمَ ابْنَ الزُّبَيْرِ أَبَدًا‏.‏ فَاسْتَشْفَعَ ابْنُ الزُّبَيْرِ إِلَيْهَا، حِينَ طَالَتِ الْهِجْرَةُ فَقَالَتْ لاَ وَاللَّهِ لاَ أُشَفِّعُ فِيهِ أَبَدًا، وَلاَ أَتَحَنَّثُ إِلَى نَذْرِي‏.‏ فَلَمَّا طَالَ ذَلِكَ عَلَى ابْنِ الزُّبَيْرِ كَلَّمَ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ، وَهُمَا مِنْ بَنِي زُهْرَةَ، وَقَالَ لَهُمَا أَنْشُدُكُمَا بِاللَّهِ لَمَّا أَدْخَلْتُمَانِي عَلَى عَائِشَةَ، فَإِنَّهَا لاَ يَحِلُّ لَهَا أَنْ تَنْذُرَ قَطِيعَتِي‏.‏ فَأَقْبَلَ بِهِ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ مُشْتَمِلَيْنِ بِأَرْدِيَتِهِمَا حَتَّى اسْتَأْذَنَا عَلَى عَائِشَةَ فَقَالاَ السَّلاَمُ عَلَيْكِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، أَنَدْخُلُ قَالَتْ عَائِشَةُ ادْخُلُوا‏.‏ قَالُوا كُلُّنَا قَالَتْ نَعَمِ ادْخُلُوا كُلُّكُمْ‏.‏ وَلاَ تَعْلَمُ أَنَّ مَعَهُمَا ابْنَ الزُّبَيْرِ، فَلَمَّا دَخَلُوا دَخَلَ ابْنُ الزُّبَيْرِ الْحِجَابَ، فَاعْتَنَقَ عَائِشَةَ وَطَفِقَ يُنَاشِدُهَا وَيَبْكِي، وَطَفِقَ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ يُنَاشِدَانِهَا إِلاَّ مَا كَلَّمَتْهُ وَقَبِلَتْ مِنْهُ، وَيَقُولاَنِ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَمَّا قَدْ عَلِمْتِ مِنَ الْهِجْرَةِ، فَإِنَّهُ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ‏.‏ فَلَمَّا أَكْثَرُوا عَلَى عَائِشَةَ مِنَ التَّذْكِرَةِ وَالتَّحْرِيجِ طَفِقَتْ تُذَكِّرُهُمَا نَذْرَهَا وَتَبْكِي وَتَقُولُ إِنِّي نَذَرْتُ، وَالنَّذْرُ شَدِيدٌ‏.‏ فَلَمْ يَزَالاَ بِهَا حَتَّى كَلَّمَتِ ابْنَ الزُّبَيْرِ، وَأَعْتَقَتْ فِي نَذْرِهَا ذَلِكَ أَرْبَعِينَ رَقَبَةً‏.‏ وَكَانَتْ تَذْكُرُ نَذْرَهَا بَعْدَ ذَلِكَ فَتَبْكِي، حَتَّى تَبُلَّ دُمُوعُهَا خِمَارَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6073-6075In-book reference : Book 78, Hadith 103USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6075,
    "id": 6075,
    "url": "https://sunnah.com/bukhari:6075",
    "bookNumber": 78,
    "hadithNumber": 103,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) that she was told that `Abdullah bin Az-Zubair (on hearing that she was \nselling or giving something as a gift) said, \"By Allah, if `Aisha does not give up this, I will declare her \nincompetent to dispose of her wealth.\" I said, \"Did he (`Abdullah bin Az-Zubair) say so?\" They \n(people) said, \"Yes.\" `Aisha said, \"I vow to Allah that I will never speak to Ibn Az-Zubair.\" When this \ndesertion lasted long, `Abdullah bin Az-Zubair sought intercession with her, but she said, \"By Allah, I \nwill not accept the intercession of anyone for him, and will not commit a sin by breaking my vow.\" \nWhen this state of affairs was prolonged on Ibn Az-Zubair (he felt it hard on him), he said to Al- \nMiswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth, who were from the tribe \nof Bani Zahra, \"I beseech you, by Allah, to let me enter upon `Aisha, for it is unlawful for her to vow \nto cut the relation with me.\" \nSo Al-Miswar and `Abdur-Rahman, wrapping their sheets around themselves, asked `Aisha's \npermission saying, \"Peace and Allah's Mercy and Blessings be upon you! Shall we come in?\" `Aisha \nsaid, \"Come in.\" They said, \"All of us?\" She said, \"Yes, come in all of you,\" not knowing that Ibn Az- \nZubair was also with them. So when they entered, Ibn Az-Zubair entered the screened place and got \nhold of `Aisha and started requesting her to excuse him, and wept. Al-Miswar and `Abdur Rahman \nalso started requesting her to speak to him and to accept his repentance. \nThey said (to her), \"The Prophet (ﷺ) forbade what you know of deserting (not speaking to your Muslim \nBrethren), for it is unlawful for any Muslim not to talk to his brother for more than three nights \n(days).\" So when they increased their reminding her (of the superiority of having good relation with \nKith and kin, and of excusing others' sins), and brought her down to a critical situation, she started \nreminding them, and wept, saying, \"I have made a vow, and (the question of) vow is a difficult one.\" \nThey (Al-Miswar and `Abdur-Rahman) persisted in their appeal till she spoke with `Abdullah bin Az- \nZubair and she manumitted forty slaves as an expiation for her vow. Later on, whenever she \nremembered her vow, she used to weep so much that her veil used to become wet with her tears.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَوْفُ بْنُ مَالِكِ بْنِ الطُّفَيْلِ ـ هُوَ ابْنُ الْحَارِثِ وَهْوَ ابْنُ أَخِي عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم لأُمِّهَا ـ أَنَّ عَائِشَةَ حُدِّثَتْ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ قَالَ فِي بَيْعٍ أَوْ عَطَاءٍ أَعْطَتْهُ عَائِشَةُ وَاللَّهِ لَتَنْتَهِيَنَّ عَائِشَةُ، أَوْ لأَحْجُرَنَّ عَلَيْهَا‏.‏ فَقَالَتْ أَهُوَ قَالَ هَذَا قَالُوا نَعَمْ‏.‏ قَالَتْ هُوَ لِلَّهِ عَلَىَّ نَذْرٌ، أَنْ لاَ أُكَلِّمَ ابْنَ الزُّبَيْرِ أَبَدًا‏.‏ فَاسْتَشْفَعَ ابْنُ الزُّبَيْرِ إِلَيْهَا، حِينَ طَالَتِ الْهِجْرَةُ فَقَالَتْ لاَ وَاللَّهِ لاَ أُشَفِّعُ فِيهِ أَبَدًا، وَلاَ أَتَحَنَّثُ إِلَى نَذْرِي‏.‏ فَلَمَّا طَالَ ذَلِكَ عَلَى ابْنِ الزُّبَيْرِ كَلَّمَ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ، وَهُمَا مِنْ بَنِي زُهْرَةَ، وَقَالَ لَهُمَا أَنْشُدُكُمَا بِاللَّهِ لَمَّا أَدْخَلْتُمَانِي عَلَى عَائِشَةَ، فَإِنَّهَا لاَ يَحِلُّ لَهَا أَنْ تَنْذُرَ قَطِيعَتِي‏.‏ فَأَقْبَلَ بِهِ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ مُشْتَمِلَيْنِ بِأَرْدِيَتِهِمَا حَتَّى اسْتَأْذَنَا عَلَى عَائِشَةَ فَقَالاَ السَّلاَمُ عَلَيْكِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، أَنَدْخُلُ قَالَتْ عَائِشَةُ ادْخُلُوا‏.‏ قَالُوا كُلُّنَا قَالَتْ نَعَمِ ادْخُلُوا كُلُّكُمْ‏.‏ وَلاَ تَعْلَمُ أَنَّ مَعَهُمَا ابْنَ الزُّبَيْرِ، فَلَمَّا دَخَلُوا دَخَلَ ابْنُ الزُّبَيْرِ الْحِجَابَ، فَاعْتَنَقَ عَائِشَةَ وَطَفِقَ يُنَاشِدُهَا وَيَبْكِي، وَطَفِقَ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ يُنَاشِدَانِهَا إِلاَّ مَا كَلَّمَتْهُ وَقَبِلَتْ مِنْهُ، وَيَقُولاَنِ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَمَّا قَدْ عَلِمْتِ مِنَ الْهِجْرَةِ، فَإِنَّهُ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ‏.‏ فَلَمَّا أَكْثَرُوا عَلَى عَائِشَةَ مِنَ التَّذْكِرَةِ وَالتَّحْرِيجِ طَفِقَتْ تُذَكِّرُهُمَا نَذْرَهَا وَتَبْكِي وَتَقُولُ إِنِّي نَذَرْتُ، وَالنَّذْرُ شَدِيدٌ‏.‏ فَلَمْ يَزَالاَ بِهَا حَتَّى كَلَّمَتِ ابْنَ الزُّبَيْرِ، وَأَعْتَقَتْ فِي نَذْرِهَا ذَلِكَ أَرْبَعِينَ رَقَبَةً‏.‏ وَكَانَتْ تَذْكُرُ نَذْرَهَا بَعْدَ ذَلِكَ فَتَبْكِي، حَتَّى تَبُلَّ دُمُوعُهَا خِمَارَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6073-6075In-book reference : Book 78, Hadith 103USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6076,
    "id": 6076,
    "url": "https://sunnah.com/bukhari:6076",
    "bookNumber": 78,
    "hadithNumber": 104,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"Do not hate one another, nor be jealous of one another; and do not desert one \nanother, but O Allah's worshipers! Be Brothers! And it is unlawful for a Muslim to desert his brother \nMuslim (and not to talk to him) for more than three nights.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبَاغَضُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا، وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6076In-book reference : Book 78, Hadith 104USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 99   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6077,
    "id": 6077,
    "url": "https://sunnah.com/bukhari:6077",
    "bookNumber": 78,
    "hadithNumber": 105,
    "narrator": "Narrated Abu Aiyub Al-Ansari:",
    "english": "Allah's Messenger (ﷺ) said, \"It is not lawful for a man to desert his brother Muslim for more than three \nnights. (It is unlawful for them that) when they meet, one of them turns his face away from the other, \nand the other turns his face from the former, and the better of the two will be the one who greets the \nother first.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لِرَجُلٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ، يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا، وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلاَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6077In-book reference : Book 78, Hadith 105USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 100   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6078,
    "id": 6078,
    "url": "https://sunnah.com/bukhari:6078",
    "bookNumber": 78,
    "hadithNumber": 106,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) said, \" I know whether you are angry or pleased.\" I said, \"How do you know that, \nAllah's Messenger (ﷺ)?\" He said, \"When you are pleased, you say, \"Yes, by the Lord of Muhammad,' but \nwhen you are angry, you say, 'No, by the Lord of Abraham!' \" I said, \"Yes, I do not leave, except your \nname.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لأَعْرِفُ غَضَبَكِ وَرِضَاكِ ‏\"‏‏.‏ قَالَتْ قُلْتُ وَكَيْفَ تَعْرِفُ ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِنَّكِ إِذَا كُنْتِ رَاضِيَةً قُلْتِ بَلَى وَرَبِّ مُحَمَّدٍ‏.‏ وَإِذَا كُنْتِ سَاخِطَةً قُلْتِ لاَ وَرَبِّ إِبْرَاهِيمَ ‏\"‏‏.‏ قَالَتْ قُلْتُ أَجَلْ لَسْتُ أُهَاجِرُ إِلاَّ اسْمَكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6078In-book reference : Book 78, Hadith 106USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 101   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6079,
    "id": 6079,
    "url": "https://sunnah.com/bukhari:6079",
    "bookNumber": 78,
    "hadithNumber": 107,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) \"I do not remember my parents believing in any religion other than the \nReligion (of Islam), and our being visited by Allah's Messenger (ﷺ) in the morning and in the evening. One \nday, while we were sitting in the house of Abu Bakr (my father) at noon, someone said, 'This is \nAllah's Messenger (ﷺ) coming at an hour at which he never used to visit us.' Abu Bakr said, 'There must be \nsomething very urgent that has brought him at this hour.' The Prophet (ﷺ) said, 'I have been allowed to go \nout (of Mecca) to migrate.' \"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ، وَلَمْ يَمُرَّ عَلَيْهِمَا يَوْمٌ إِلاَّ يَأْتِينَا فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم طَرَفَىِ النَّهَارِ بُكْرَةً وَعَشِيَّةً، فَبَيْنَمَا نَحْنُ جُلُوسٌ فِي بَيْتِ أَبِي بَكْرٍ فِي نَحْرِ الظَّهِيرَةِ قَالَ قَائِلٌ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَاعَةٍ لَمْ يَكُنْ يَأْتِينَا فِيهَا‏.‏ قَالَ أَبُو بَكْرٍ مَا جَاءَ بِهِ فِي هَذِهِ السَّاعَةِ إِلاَّ أَمْرٌ‏.‏ قَالَ ‏\n\"‏ إِنِّي قَدْ أُذِنَ لِي بِالْخُرُوجِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6079In-book reference : Book 78, Hadith 107USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 102   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6080,
    "id": 6080,
    "url": "https://sunnah.com/bukhari:6080",
    "bookNumber": 78,
    "hadithNumber": 108,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) visited a household among the Ansars, and he took a meal with them. When he \nintended to leave, he asked for a place in that house for him, to pray so a mat sprinkled with water was \nput and he offered prayer over it, and invoked for Allah's Blessing upon them (his hosts).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَنَسِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم زَارَ أَهْلَ بَيْتٍ فِي الأَنْصَارِ فَطَعِمَ عِنْدَهُمْ طَعَامًا، فَلَمَّا أَرَادَ أَنْ يَخْرُجَ أَمَرَ بِمَكَانٍ مِنَ الْبَيْتِ، فَنُضِحَ لَهُ عَلَى بِسَاطٍ، فَصَلَّى عَلَيْهِ، وَدَعَا لَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6080In-book reference : Book 78, Hadith 108USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6081,
    "id": 6081,
    "url": "https://sunnah.com/bukhari:6081",
    "bookNumber": 78,
    "hadithNumber": 109,
    "narrator": "Narrated `Abdullah:",
    "english": "`Umar saw a silken cloak over a man (for sale) so he took it to the Prophet (ﷺ) and said, 'O Allah's \nApostle! Buy this and wear it when the delegate come to you.' He said, 'The silk is worn by one who \nwill have no share (in the Here-after).' Some time passed after this event, and then the Prophet (ﷺ) sent a \n(similar) cloak to him. `Umar brought that cloak back to the Prophet (ﷺ) and said, 'You have sent this to \nme, and you said about a similar one what you said?' The Prophet (ﷺ) said, 'I have sent it to you so that \nyou may get money by selling it.' Because of this, Ibn `Umar used to hate the silken markings on the \ngarments.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ قَالَ لِي سَالِمُ بْنُ عَبْدِ اللَّهِ مَا الإِسْتَبْرَقُ قُلْتُ مَا غَلُظَ مِنَ الدِّيبَاجِ وَخَشُنَ مِنْهُ‏.‏ قَالَ سَمِعْتُ عَبْدَ اللَّهِ يَقُولُ رَأَى عُمَرُ عَلَى رَجُلٍ حُلَّةً مِنْ إِسْتَبْرَقٍ فَأَتَى بِهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ اشْتَرِ هَذِهِ فَالْبَسْهَا لِوَفْدِ النَّاسِ إِذَا قَدِمُوا عَلَيْكَ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا يَلْبَسُ الْحَرِيرَ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ فَمَضَى فِي ذَلِكَ مَا مَضَى، ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ إِلَيْهِ بِحُلَّةٍ فَأَتَى بِهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ بَعَثْتَ إِلَىَّ بِهَذِهِ، وَقَدْ قُلْتَ فِي مِثْلِهَا مَا قُلْتَ قَالَ ‏\"‏ إِنَّمَا بَعَثْتُ إِلَيْكَ لِتُصِيبَ بِهَا مَالاً ‏\"‏‏.‏ فَكَانَ ابْنُ عُمَرَ يَكْرَهُ الْعَلَمَ فِي الثَّوْبِ لِهَذَا الْحَدِيثِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6081In-book reference : Book 78, Hadith 109USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 104   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6082,
    "id": 6082,
    "url": "https://sunnah.com/bukhari:6082",
    "bookNumber": 78,
    "hadithNumber": 110,
    "narrator": "Narrated Anas:",
    "english": "When `Abdur-Rahman came to us, the Prophet (ﷺ) established a bond of brotherhood between him and \nSa`d bin Ar-Rabi`. Once the Prophet (ﷺ) said, \"As you (O `Abdur-Rahman) have married, give a wedding \nbanquet even if with one sheep.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ لَمَّا قَدِمَ عَلَيْنَا عَبْدُ الرَّحْمَنِ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6082In-book reference : Book 78, Hadith 110USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6083,
    "id": 6083,
    "url": "https://sunnah.com/bukhari:6083",
    "bookNumber": 78,
    "hadithNumber": 111,
    "narrator": "Narrated `Asim:",
    "english": "I said to Anas bin Malik, \"Did it reach you that the Prophet (ﷺ) said, \"There is no treaty of brotherhood in \nIslam'?\" Anas said, \"The Prophet (ﷺ) made a treaty (of brotherhood) between the Ansar and the Quraish in \nmy home.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ أَبَلَغَكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ حِلْفَ فِي الإِسْلاَمِ ‏\"‏‏.‏ فَقَالَ قَدْ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6083In-book reference : Book 78, Hadith 111USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 106   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6084,
    "id": 6084,
    "url": "https://sunnah.com/bukhari:6084",
    "bookNumber": 78,
    "hadithNumber": 112,
    "narrator": "Narrated `Aisha:",
    "english": "Rifa`a Al-Qurazi divorced his wife irrevocably (i.e. that divorce was the final). Later on `Abdur- \nRahman bin Az-Zubair married her after him. She came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I \nwas Rifa`a's wife and he divorced me thrice, and then I was married to `Abdur-Rahman bin AzZubair, \nwho, by Allah has nothing with him except something like this fringe, O Allah's Messenger (ﷺ),\" showing a \nfringe she had taken from her covering sheet. Abu Bakr was sitting with the Prophet (ﷺ) while Khalid Ibn \nSa`id bin Al-As was sitting at the gate of the room waiting for admission. Khalid started calling Abu \nBakr, \"O Abu Bakr! Why don't you reprove this lady from what she is openly saying before Allah's \nApostle?\" Allah's Messenger (ﷺ) did nothing except smiling, and then said (to the lady), \"Perhaps you want \nto go back to Rifa`a? No, (it is not possible), unless and until you enjoy the sexual relation with him \n(`Abdur Rahman), and he enjoys the sexual relation with you.\"",
    "arabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رِفَاعَةَ، الْقُرَظِيَّ طَلَّقَ امْرَأَتَهُ فَبَتَّ طَلاَقَهَا، فَتَزَوَّجَهَا بَعْدَهُ عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ، فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا كَانَتْ عِنْدَ رِفَاعَةَ فَطَلَّقَهَا آخِرَ ثَلاَثِ تَطْلِيقَاتٍ، فَتَزَوَّجَهَا بَعْدَهُ عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ، وَإِنَّهُ وَاللَّهِ مَا مَعَهُ يَا رَسُولَ اللَّهِ إِلاَّ مِثْلُ هَذِهِ الْهُدْبَةِ، لِهُدْبَةٍ أَخَذَتْهَا مِنْ جِلْبَابِهَا‏.‏ قَالَ وَأَبُو بَكْرٍ جَالِسٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَابْنُ سَعِيدِ بْنِ الْعَاصِ جَالِسٌ بِبَابِ الْحُجْرَةِ لِيُؤْذَنَ لَهُ، فَطَفِقَ خَالِدٌ يُنَادِي أَبَا بَكْرٍ، يَا أَبَا بَكْرٍ أَلاَ تَزْجُرُ هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَا يَزِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى التَّبَسُّمِ ثُمَّ قَالَ ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6084In-book reference : Book 78, Hadith 112USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6085,
    "id": 6085,
    "url": "https://sunnah.com/bukhari:6085",
    "bookNumber": 78,
    "hadithNumber": 113,
    "narrator": "Narrated Sa`d:",
    "english": "`Umar bin Al-Khattab asked permission of Allah's Messenger (ﷺ) to see him while some Quraishi women \nwere sitting with him and they were asking him to give them more financial support while raising \ntheir voices over the voice of the Prophet. When `Umar asked permission to enter, all of them hurried \nto screen themselves the Prophet (ﷺ) admitted `Umar and he entered, while the Prophet (ﷺ) was smiling. \n`Umar said, \"May Allah always keep you smiling, O Allah's Messenger (ﷺ)! Let my father and mother be \nsacrificed for you !\" The Prophet (ﷺ) said, \"I am astonished at these women who were with me. As soon \nas they heard your voice, they hastened to screen themselves.\" `Umar said, \"You have more right, that \nthey should be afraid of you, O Allah's Messenger (ﷺ)!\" And then he (`Umar) turned towards them and said, \n\"O enemies of your souls! You are afraid of me and not of Allah's Messenger (ﷺ)?\" The women replied, \n\"Yes, for you are sterner and harsher than Allah's Messenger (ﷺ).\" Allah's Messenger (ﷺ) said, \"O Ibn Al-Khattab! \nBy Him in Whose Hands my life is, whenever Satan sees you taking a way, he follows a way other \nthan yours!\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ نِسْوَةٌ مِنْ قُرَيْشٍ يَسْأَلْنَهُ وَيَسْتَكْثِرْنَهُ، عَالِيَةً أَصْوَاتُهُنَّ عَلَى صَوْتِهِ، فَلَمَّا اسْتَأْذَنَ عُمَرُ تَبَادَرْنَ الْحِجَابَ، فَأَذِنَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَدَخَلَ وَالنَّبِيُّ صلى الله عليه وسلم يَضْحَكُ فَقَالَ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَقَالَ ‏\"‏ عَجِبْتُ مِنْ هَؤُلاَءِ اللاَّتِي كُنَّ عِنْدِي، لَمَّا سَمِعْنَ صَوْتَكَ تَبَادَرْنَ الْحِجَابَ ‏\"‏‏.‏ فَقَالَ أَنْتَ أَحَقُّ أَنْ يَهَبْنَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ أَقْبَلَ عَلَيْهِنَّ فَقَالَ يَا عَدُوَّاتِ أَنْفُسِهِنَّ أَتَهَبْنَنِي وَلَمْ تَهَبْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْنَ إِنَّكَ أَفَظُّ وَأَغْلَظُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِيهٍ يَا ابْنَ الْخَطَّابِ، وَالَّذِي نَفْسِي بِيَدِهِ مَا لَقِيَكَ الشَّيْطَانُ سَالِكًا فَجًّا إِلاَّ سَلَكَ فَجًّا غَيْرَ فَجِّكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6085In-book reference : Book 78, Hadith 113USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 108   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6086,
    "id": 6086,
    "url": "https://sunnah.com/bukhari:6086",
    "bookNumber": 78,
    "hadithNumber": 114,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "When Allah Apostle was in Ta'if (trying to conquer it), he said to his companions, \"Tomorrow we will \nreturn (to Medina), if Allah wills.\" Some of the companions of Allah's Messenger (ﷺ) said, \"We will not \nleave till we conquer it.\" The Prophet (ﷺ) said, \"Therefore, be ready to fight tomorrow.\" On the following \nday, they (Muslims) fought fiercely (with the people of Ta'if) and suffered many wounds. Then \nAllah's Messenger (ﷺ) said, \"Tomorrow we will return (to Medina), if Allah wills.\" His companions kept \nquiet this time. Allah's Messenger (ﷺ) then smiled.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالطَّائِفِ قَالَ ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَقَالَ نَاسٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَبْرَحُ أَوْ نَفْتَحَهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَاغْدُوا عَلَى الْقِتَالِ ‏\"‏‏.‏ قَالَ فَغَدَوْا فَقَاتَلُوهُمْ قِتَالاً شَدِيدًا وَكَثُرَ فِيهِمُ الْجِرَاحَاتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ فَسَكَتُوا فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ بِالْخَبَرِ‏ كُلَّهُ.‏",
    "reference": "Reference : Sahih al-Bukhari 6086In-book reference : Book 78, Hadith 114USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 109   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6087,
    "id": 6087,
    "url": "https://sunnah.com/bukhari:6087",
    "bookNumber": 78,
    "hadithNumber": 115,
    "narrator": "Narrated Abu Huraira:",
    "english": "A man came to the Prophet (ﷺ) and said, \"I have been ruined for I have had sexual relation with my wife \nin Ramadan (while I was fasting)\" The Prophet (ﷺ) said (to him), \"Manumit a slave.\" The man said, \" I \ncannot afford that.\" The Prophet (ﷺ) said, \"(Then) fast for two successive months continuously\". The man \nsaid, \"I cannot do that.\" The Prophet (ﷺ) said, \"(Then) feed sixty poor persons.\" The man said, \"I have \nnothing (to feed them with).\" Then a big basket full of dates was brought to the Prophet. The Prophet (ﷺ) \nsaid, \"Where is the questioner? Go and give this in charity.\" The man said, \"(Shall I give this in \ncharity) to a poorer person than l? By Allah, there is no family in between these two mountains (of \nMedina) who are poorer than we.\" The Prophet (ﷺ) then smiled till his premolar teeth became visible, and \nsaid, \"Then (feed) your (family with it).",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ وَقَعْتُ عَلَى أَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ أَعْتِقْ رَقَبَةً ‏\"‏‏.‏ قَالَ لَيْسَ لِي‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ أَسْتَطِيعُ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ ـ قَالَ إِبْرَاهِيمُ الْعَرَقُ الْمِكْتَلُ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ تَصَدَّقْ بِهَا ‏\"‏‏.‏ قَالَ عَلَى أَفْقَرَ مِنِّي وَاللَّهِ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرُ مِنَّا‏.‏ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ نَوَاجِذُهُ‏.‏ قَالَ ‏\"‏ فَأَنْتُمْ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6087In-book reference : Book 78, Hadith 115USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 110   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6088,
    "id": 6088,
    "url": "https://sunnah.com/bukhari:6088",
    "bookNumber": 78,
    "hadithNumber": 116,
    "narrator": "Narrated Anas bin Malik:",
    "english": "While I was going along with Allah's Messenger (ﷺ) who was wearing a Najrani Burd (sheet) with a thick \nborder, a bedouin overtook the Prophet (ﷺ) and pulled his Rida' (sheet) forcibly. I looked at the side of the \nshoulder of the Prophet (ﷺ) and noticed that the edge of the Rida' had left a mark on it because of the \nviolence of his pull. The bedouin said, \"O Muhammad! Order for me some of Allah's property which \nyou have.\" The Prophet (ﷺ) turned towards him, (smiled) and ordered that he be given something.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ، فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَ بِرِدَائِهِ جَبْذَةً شَدِيدَةً ـ قَالَ أَنَسٌ فَنَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الرِّدَاءِ مِنْ شِدَّةِ جَبْذَتِهِ ـ ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ‏.‏ فَالْتَفَتَ إِلَيْهِ فَضَحِكَ، ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6088In-book reference : Book 78, Hadith 116USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 111   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6089,
    "id": 6089,
    "url": "https://sunnah.com/bukhari:6089",
    "bookNumber": 78,
    "hadithNumber": 117,
    "narrator": "Narrated Jarir:",
    "english": "The Prophet (ﷺ) did not screen himself from me (had never prevented me from entering upon him) since I \nembraced Islam, and whenever he saw me, he would receive me with a smile. Once I told him that I \ncould not sit firm on horses. He stroked me on the chest with his hand, and said, \"O Allah! Make him \nfirm and make him a guiding and a rightly guided man.",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ مَا حَجَبَنِي النَّبِيُّ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ، وَلاَ رَآنِي إِلاَّ تَبَسَّمَ فِي وَجْهِي‏.‏\nوَلَقَدْ شَكَوْتُ إِلَيْهِ أَنِّي لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ ‏\n\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6089, 6090In-book reference : Book 78, Hadith 117USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6090,
    "id": 6090,
    "url": "https://sunnah.com/bukhari:6090",
    "bookNumber": 78,
    "hadithNumber": 117,
    "narrator": "Narrated Jarir:",
    "english": "The Prophet (ﷺ) did not screen himself from me (had never prevented me from entering upon him) since I \nembraced Islam, and whenever he saw me, he would receive me with a smile. Once I told him that I \ncould not sit firm on horses. He stroked me on the chest with his hand, and said, \"O Allah! Make him \nfirm and make him a guiding and a rightly guided man.",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ مَا حَجَبَنِي النَّبِيُّ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ، وَلاَ رَآنِي إِلاَّ تَبَسَّمَ فِي وَجْهِي‏.‏\nوَلَقَدْ شَكَوْتُ إِلَيْهِ أَنِّي لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ ‏\n\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6089, 6090In-book reference : Book 78, Hadith 117USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6091,
    "id": 6091,
    "url": "https://sunnah.com/bukhari:6091",
    "bookNumber": 78,
    "hadithNumber": 118,
    "narrator": "Narrated Zainab bint Um Salama:",
    "english": "Um Sulaim said, \"O Allah's Messenger (ﷺ)! Verily Allah is not shy of (telling you) the truth. Is it essential \nfor a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if \nshe notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) \ndischarge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحِي مِنَ الْحَقِّ، هَلْ عَلَى الْمَرْأَةِ غُسْلٌ إِذَا احْتَلَمَتْ قَالَ ‏\"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَضَحِكَتْ أُمُّ سَلَمَةَ فَقَالَتْ أَتَحْتَلِمُ الْمَرْأَةُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَبِمَ شَبَهُ الْوَلَدِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6091In-book reference : Book 78, Hadith 118USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 113   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6092,
    "id": 6092,
    "url": "https://sunnah.com/bukhari:6092",
    "bookNumber": 78,
    "hadithNumber": 119,
    "narrator": "Narrated `Aisha:",
    "english": "I never saw the Prophet (ﷺ) laughing to an extent that one could see his palate, but he always used to \nsmile only.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُسْتَجْمِعًا قَطُّ ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ، إِنَّمَا كَانَ يَتَبَسَّمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6092In-book reference : Book 78, Hadith 119USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 114   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6093,
    "id": 6093,
    "url": "https://sunnah.com/bukhari:6093",
    "bookNumber": 78,
    "hadithNumber": 120,
    "narrator": "Narrated Anas:",
    "english": "A man came to the Prophet (ﷺ) on a Friday while he (the Prophet) was delivering a sermon at Medina, and \nsaid, \"There is lack of rain, so please invoke your Lord to bless us with the rain.\" The Prophet (ﷺ) looked \nat the sky when no cloud could be detected. Then he invoked Allah for rain. Clouds started gathering \ntogether and it rained till the Medina valleys started flowing with water. It continued raining till the \nnext Friday. Then that man (or some other man) stood up while the Prophet (ﷺ) was delivering the Friday \nsermon, and said, \"We are drowned; Please invoke your Lord to withhold it (rain) from us\" The \nProphet smiled and said twice or thrice, \"O Allah! Please let it rain round about us and not upon us.\" \nThe clouds started dispersing over Medina to the right and to the left, and it rained round about \nMedina and not upon Medina. Allah showed them (the people) the miracle of His Prophet and His \nresponse to his invocation.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ وَهْوَ يَخْطُبُ بِالْمَدِينَةِ فَقَالَ قَحَطَ الْمَطَرُ فَاسْتَسْقِ رَبَّكَ، فَنَظَرَ إِلَى السَّمَاءِ وَمَا نَرَى مِنْ سَحَابٍ، فَاسْتَسْقَى فَنَشَأَ السَّحَابُ بَعْضُهُ إِلَى بَعْضٍ، ثُمَّ مُطِرُوا حَتَّى سَالَتْ مَثَاعِبُ الْمَدِينَةِ، فَمَا زَالَتْ إِلَى الْجُمُعَةِ الْمُقْبِلَةِ مَا تُقْلِعُ، ثُمَّ قَامَ ذَلِكَ الرَّجُلُ أَوْ غَيْرُهُ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ غَرِقْنَا فَادْعُ رَبَّكَ يَحْبِسْهَا عَنَّا‏.‏ فَضَحِكَ ثُمَّ قَالَ ‏\n\"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏ فَجَعَلَ السَّحَابُ يَتَصَدَّعُ عَنِ الْمَدِينَةِ يَمِينًا وَشِمَالاً، يُمْطَرُ مَا حَوَالَيْنَا، وَلاَ يُمْطِرُ مِنْهَا شَىْءٌ، يُرِيهِمُ اللَّهُ كَرَامَةَ نَبِيِّهِ صلى الله عليه وسلم وَإِجَابَةَ دَعْوَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6093In-book reference : Book 78, Hadith 120USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 115   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6094,
    "id": 6094,
    "url": "https://sunnah.com/bukhari:6094",
    "bookNumber": 78,
    "hadithNumber": 121,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Truthfulness leads to righteousness, and righteousness leads to Paradise. And a \nman keeps on telling the truth until he becomes a truthful person. Falsehood leads to Al-Fajur (i.e. \nwickedness, evil-doing), and Al-Fajur (wickedness) leads to the (Hell) Fire, and a man may keep on \ntelling lies till he is written before Allah, a liar.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ، وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ، وَإِنَّ الرَّجُلَ لَيَصْدُقُ حَتَّى يَكُونَ صِدِّيقًا، وَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ، وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ، وَإِنَّ الرَّجُلَ لَيَكْذِبُ، حَتَّى يُكْتَبَ عِنْدَ اللَّهِ كَذَّابًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6094In-book reference : Book 78, Hadith 121USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 116   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6095,
    "id": 6095,
    "url": "https://sunnah.com/bukhari:6095",
    "bookNumber": 78,
    "hadithNumber": 122,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks, he tells a lie; and \nwhenever he promises, he breaks his promise; and whenever he is entrusted, he betrays (proves to be \ndishonest)\".",
    "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، نَافِعِ بْنِ مَالِكِ بْنِ أَبِي عَامِرٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6095In-book reference : Book 78, Hadith 122USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 117   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6096,
    "id": 6096,
    "url": "https://sunnah.com/bukhari:6096",
    "bookNumber": 78,
    "hadithNumber": 123,
    "narrator": "Narrated Samura bin Jundub:",
    "english": "The Prophet (ﷺ) said, \"I saw (in a dream), two men came to me.\" Then the Prophet (ﷺ) narrated the story \n(saying), \"They said, 'The person, the one whose cheek you saw being torn away (from the mouth to \nthe ear) was a liar and used to tell lies and the people would report those lies on his authority till they \nspread all over the world. So he will be punished like that till the Day of Resurrection.\"'",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرٌ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ رَجُلَيْنِ أَتَيَانِي قَالاَ الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يَكْذِبُ بِالْكَذْبَةِ تُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الآفَاقَ فَيُصْنَعُ بِهِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6096In-book reference : Book 78, Hadith 123USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 118   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6097,
    "id": 6097,
    "url": "https://sunnah.com/bukhari:6097",
    "bookNumber": 78,
    "hadithNumber": 124,
    "narrator": "Narrated Hudhaifa:",
    "english": "From among the people, Ibn Um `Abd greatly resembled Allah's Messenger (ﷺ)s in solemn gate and good \nappearance of piety and in calmness and sobriety from the time he goes out of his house till he returns \nto it. But we do not know how he behaves with his family when he is alone with them.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمُ الأَعْمَشُ، سَمِعْتُ شَقِيقًا، قَالَ سَمِعْتُ حُذَيْفَةَ، يَقُولُ إِنَّ أَشْبَهَ النَّاسِ دَلاًّ وَسَمْتًا وَهَدْيًا بِرَسُولِ اللَّهِ صلى الله عليه وسلم لاَبْنُ أُمِّ عَبْدٍ، مِنْ حِينَ يَخْرُجُ مِنْ بَيْتِهِ إِلَى أَنْ يَرْجِعَ إِلَيْهِ، لاَ نَدْرِي مَا يَصْنَعُ فِي أَهْلِهِ إِذَا خَلاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6097In-book reference : Book 78, Hadith 124USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 119   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6098,
    "id": 6098,
    "url": "https://sunnah.com/bukhari:6098",
    "bookNumber": 78,
    "hadithNumber": 125,
    "narrator": "Narrated Tariq:",
    "english": "`Abdullah said, \"The best talk is Allah's Book (Qur'an), and the best guidance is the guidance of \nMuhammad.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُخَارِقٍ، سَمِعْتُ طَارِقًا، قَالَ قَالَ عَبْدُ اللَّهِ إِنَّ أَحْسَنَ الْحَدِيثِ كِتَابُ اللَّهِ، وَأَحْسَنَ الْهَدْىِ هَدْىُ مُحَمَّدٍ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6098In-book reference : Book 78, Hadith 125USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 120   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6099,
    "id": 6099,
    "url": "https://sunnah.com/bukhari:6099",
    "bookNumber": 78,
    "hadithNumber": 126,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said: None is more patient than Allah against the harmful saying. He hears from the \npeople they ascribe children to Him, yet He gives them health and (supplies them with) provision.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الأَعْمَشُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ أَحَدٌ ـ أَوْ لَيْسَ شَىْءٌ ـ أَصْبَرَ عَلَى أَذًى سَمِعَهُ مِنَ اللَّهِ، إِنَّهُمْ لَيَدْعُونَ لَهُ وَلَدًا، وَإِنَّهُ لَيُعَافِيهِمْ وَيَرْزُقُهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6099In-book reference : Book 78, Hadith 126USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 121   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6100,
    "id": 6100,
    "url": "https://sunnah.com/bukhari:6100",
    "bookNumber": 78,
    "hadithNumber": 127,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) divided and distributed something as he used to do for some of his distributions. A man \nfrom the Ansar said, \"By Allah, in this division the pleasure of Allah has not been intended.\" I said, \"I \nwill definitely tell this to the Prophet (ﷺ) .\" So I went to him while he was sitting with his companions and \ntold him of it secretly. That was hard upon the Prophet (ﷺ) and the color of his face changed, and he \nbecame so angry that I wished I had not told him. The Prophet (ﷺ) then said, \"Moses was harmed with \nmore than this, yet he remained patient.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ شَقِيقًا، يَقُولُ قَالَ عَبْدُ اللَّهِ قَسَمَ النَّبِيُّ صلى الله عليه وسلم قِسْمَةً كَبَعْضِ مَا كَانَ يَقْسِمُ، فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ وَاللَّهِ إِنَّهَا لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهُ اللَّهِ‏.‏ قُلْتُ أَمَّا أَنَا لأَقُولَنَّ لِلنَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَسَارَرْتُهُ فَشَقَّ ذَلِكَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَتَغَيَّرَ وَجْهُهُ وَغَضِبَ، حَتَّى وَدِدْتُ أَنِّي لَمْ أَكُنْ أَخْبَرْتُهُ ثُمَّ قَالَ ‏\n\"‏ قَدْ أُوذِيَ مُوسَى بِأَكْثَرَ مِنْ ذَلِكَ فَصَبَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6100In-book reference : Book 78, Hadith 127USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 6101,
    "id": 6101,
    "url": "https://sunnah.com/bukhari:6101",
    "bookNumber": 78,
    "hadithNumber": 128,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) did something and allowed his people to do it, but some people refrained from doing it. \nWhen the Prophet (ﷺ) learned of that, he delivered a sermon, and after having sent Praises to Allah, he \nsaid, \"What is wrong with such people as refrain from doing a thing that I do? By Allah, I know Allah \nbetter than they, and I am more afraid of Him than they.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، قَالَتْ عَائِشَةُ صَنَعَ النَّبِيُّ صلى الله عليه وسلم شَيْئًا فَرَخَّصَ فِيهِ فَتَنَزَّهَ عَنْهُ قَوْمٌ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَخَطَبَ فَحَمِدَ اللَّهَ ثُمَّ قَالَ ‏\n\"‏ مَا بَالُ أَقْوَامٍ يَتَنَزَّهُونَ عَنِ الشَّىْءِ أَصْنَعُهُ، فَوَاللَّهِ إِنِّي لأَعْلَمُهُمْ بِاللَّهِ وَأَشَدُّهُمْ لَهُ خَشْيَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 6101In-book reference : Book 78, Hadith 128USC-MSA web (English) reference : Vol. 8, Book 73, Hadith 123   (deprecated numbering scheme)"
  }
]