[
  {
    "hadithGlobalNumber": 3601,
    "id": 3601,
    "url": "https://sunnah.com/bukhari:3601",
    "bookNumber": 61,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There will be afflictions (and at the time) the sitting person will be better than \nthe standing one, and the standing one will be better than the walking, and the walking will be better \nthan the running. And whoever will look towards those afflictions, they will overtake him, and \nwhoever will find a refuge or a shelter, should take refuge in it.\" The same narration is reported by \nAbu Bakr, with the addition, \"(The Prophet (ﷺ) said), 'Among the prayers there is a prayer the missing of \nwhich will be to one like losing one's family and property.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَتَكُونُ فِتَنٌ، الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ، وَالْقَائِمُ فِيهَا خَيْرٌ مِنَ الْمَاشِي، وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي، وَمَنْ يُشْرِفْ لَهَا تَسْتَشْرِفْهُ، وَمَنْ وَجَدَ مَلْجَأً أَوْ مَعَاذًا فَلْيَعُذْ بِهِ ‏\"‏‏.‏   وَعَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُطِيعِ بْنِ الأَسْوَدِ، عَنْ نَوْفَلِ بْنِ مُعَاوِيَةَ،، مِثْلَ حَدِيثِ أَبِي هُرَيْرَةَ هَذَا، إِلاَّ أَنَّ أَبَا بَكْرٍ، يَزِيدُ ‏\"‏ مِنَ الصَّلاَةِ صَلاَةٌ مَنْ فَاتَتْهُ فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3601, 3602In-book reference : Book 61, Hadith 109USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 799   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3602,
    "id": 3602,
    "url": "https://sunnah.com/bukhari:3602",
    "bookNumber": 61,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There will be afflictions (and at the time) the sitting person will be better than \nthe standing one, and the standing one will be better than the walking, and the walking will be better \nthan the running. And whoever will look towards those afflictions, they will overtake him, and \nwhoever will find a refuge or a shelter, should take refuge in it.\" The same narration is reported by \nAbu Bakr, with the addition, \"(The Prophet (ﷺ) said), 'Among the prayers there is a prayer the missing of \nwhich will be to one like losing one's family and property.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَتَكُونُ فِتَنٌ، الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ، وَالْقَائِمُ فِيهَا خَيْرٌ مِنَ الْمَاشِي، وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي، وَمَنْ يُشْرِفْ لَهَا تَسْتَشْرِفْهُ، وَمَنْ وَجَدَ مَلْجَأً أَوْ مَعَاذًا فَلْيَعُذْ بِهِ ‏\"‏‏.‏   وَعَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُطِيعِ بْنِ الأَسْوَدِ، عَنْ نَوْفَلِ بْنِ مُعَاوِيَةَ،، مِثْلَ حَدِيثِ أَبِي هُرَيْرَةَ هَذَا، إِلاَّ أَنَّ أَبَا بَكْرٍ، يَزِيدُ ‏\"‏ مِنَ الصَّلاَةِ صَلاَةٌ مَنْ فَاتَتْهُ فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3601, 3602In-book reference : Book 61, Hadith 109USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 799   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3603,
    "id": 3603,
    "url": "https://sunnah.com/bukhari:3603",
    "bookNumber": 61,
    "hadithNumber": 110,
    "narrator": "Narrated Ibn Mas`ud:",
    "english": "The Prophet (ﷺ) said, \"Soon others will be preferred to you, and there will be things which you will not \nlike.\" The companions of the Prophet (ﷺ) asked, \"O Allah's Messenger (ﷺ)! What do you order us to do (in this \ncase)? \" He said, \"(I order you) to give the rights that are on you and to ask your rights from Allah.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ سَتَكُونُ أَثَرَةٌ وَأُمُورٌ تُنْكِرُونَهَا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ تُؤَدُّونَ الْحَقَّ الَّذِي عَلَيْكُمْ، وَتَسْأَلُونَ اللَّهَ الَّذِي لَكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3603In-book reference : Book 61, Hadith 110USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 800   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3604,
    "id": 3604,
    "url": "https://sunnah.com/bukhari:3604",
    "bookNumber": 61,
    "hadithNumber": 111,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"This branch from Quraish will ruin the people.\" The companions of the Prophet (ﷺ) \nasked, \"What do you order us to do (then)?\" He said, \"I would suggest that the people keep away from \nthem.''",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا أَبُو مَعْمَرٍ، إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُهْلِكُ النَّاسَ هَذَا الْحَىُّ مِنْ قُرَيْشٍ ‏\"‏‏.‏ قَالُوا فَمَا تَأْمُرُنَا قَالَ ‏\"‏ لَوْ أَنَّ النَّاسَ اعْتَزَلُوهُمْ ‏\"‏‏.‏ قَالَ مَحْمُودٌ حَدَّثَنَا أَبُو دَاوُدَ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ سَمِعْتُ أَبَا زُرْعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3604In-book reference : Book 61, Hadith 111USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 801   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3605,
    "id": 3605,
    "url": "https://sunnah.com/bukhari:3605",
    "bookNumber": 61,
    "hadithNumber": 112,
    "narrator": "Narrated Sa`id Al-Umawi:",
    "english": "I was with Marwan and Abu Huraira and heard Abu Huraira saying, \"I heard the trustworthy, truly \ninspired one (i.e. the Prophet (ﷺ) ) saying, 'The destruction of my followers will be brought about by the \nhands of some youngsters from Quraish.\" Marwan asked, \"Youngsters?\" Abu Huraira said, \"If you \nwish, I would name them: They are the children of so-and-so and the children of so-and-so.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدٍ الأُمَوِيُّ، عَنْ جَدِّهِ، قَالَ كُنْتُ مَعَ مَرْوَانَ وَأَبِي هُرَيْرَةَ فَسَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ الصَّادِقَ الْمَصْدُوقَ، يَقُولُ ‏\n\"‏ هَلاَكُ أُمَّتِي عَلَى يَدَىْ غِلْمَةٍ مِنْ قُرَيْشٍ ‏\"‏‏.‏ فَقَالَ مَرْوَانُ غِلْمَةٌ‏.‏ قَالَ أَبُو هُرَيْرَةَ إِنْ شِئْتَ أَنْ أُسَمِّيَهُمْ بَنِي فُلاَنٍ وَبَنِي فُلاَنٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3605In-book reference : Book 61, Hadith 112USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 802   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3606,
    "id": 3606,
    "url": "https://sunnah.com/bukhari:3606",
    "bookNumber": 61,
    "hadithNumber": 113,
    "narrator": "Narrated Hudhaifa bin Al-Yaman:",
    "english": "The people used to ask Allah's Messenger (ﷺ) about good, but I used to ask him about evil for fear that it \nmight overtake me. Once I said, \"O Allah's Messenger (ﷺ)! We were in ignorance and in evil and Allah has \nbestowed upon us the present good; will there by any evil after this good?\" He said, \"Yes.\" I asked, \n\"Will there be good after that evil?\" He said, \"Yes, but it would be tained with Dakhan (i.e. Little \nevil).\" I asked, \"What will its Dakhan be?\" He said, \"There will be some people who will lead \n(people) according to principles other than my tradition. You will see their actions and disapprove of \nthem.\" I said, \"Will there by any evil after that good?\" He said, \"Yes, there will be some people who \nwill invite others to the doors of Hell, and whoever accepts their invitation to it will be thrown in it \n(by them).\" I said, \"O Allah's Messenger (ﷺ)! Describe those people to us.\" He said, \"They will belong to us \nand speak our language\" I asked, \"What do you order me to do if such a thing should take place in my \nlife?\" He said, \"Adhere to the group of Muslims and their Chief.\" I asked, \"If there is neither a group \n(of Muslims) nor a chief (what shall I do)?\" He said, \"Keep away from all those different sects, even if \nyou had to bite (i.e. eat) the root of a tree, till you meet Allah while you are still in that state.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنِي ابْنُ جَابِرٍ، قَالَ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ الْحَضْرَمِيُّ، قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، أَنَّهُ سَمِعَ حُذَيْفَةَ بْنَ الْيَمَانِ، يَقُولُ كَانَ النَّاسُ يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْخَيْرِ، وَكُنْتُ أَسْأَلُهُ عَنِ الشَّرِّ مَخَافَةَ أَنْ يُدْرِكَنِي‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ، فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ، فَهَلْ بَعْدَ هَذَا الْخَيْرِ مِنْ شَرٍّ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ وَهَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ قَالَ ‏\"‏ نَعَمْ، وَفِيهِ دَخَنٌ ‏\"‏‏.‏ قُلْتُ وَمَا دَخَنُهُ قَالَ ‏\"‏ قَوْمٌ يَهْدُونَ بِغَيْرِ هَدْيِي تَعْرِفُ مِنْهُمْ وَتُنْكِرُ ‏\"‏‏.‏ قُلْتُ فَهَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ قَالَ ‏\"‏ نَعَمْ دُعَاةٌ إِلَى أَبْوَابِ جَهَنَّمَ، مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا فَقَالَ ‏\"‏ هُمْ مِنْ جِلْدَتِنَا، وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا ‏\"‏ قُلْتُ فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ قَالَ ‏\"‏ تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ ‏\"‏‏.‏ قُلْتُ فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلاَ إِمَامٌ قَالَ ‏\"‏ فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا، وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ عَلَى ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3606In-book reference : Book 61, Hadith 113USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 803   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3607,
    "id": 3607,
    "url": "https://sunnah.com/bukhari:3607",
    "bookNumber": 61,
    "hadithNumber": 114,
    "narrator": "Narrated Hudhaifa:",
    "english": "My companions learned (something about) good (through asking the Prophet) while I learned \n(something about) evil.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ، حَدَّثَنِي قَيْسٌ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ تَعَلَّمَ أَصْحَابِي الْخَيْرَ وَتَعَلَّمْتُ الشَّرَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3607In-book reference : Book 61, Hadith 114USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 804   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3608,
    "id": 3608,
    "url": "https://sunnah.com/bukhari:3608",
    "bookNumber": 61,
    "hadithNumber": 115,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Day of (Judgment) will not be established till there is a war between two \ngroups whose claims (or religion) will be the same.\"",
    "arabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَقْتَتِلَ فِئَتَانِ دَعْوَاهُمَا وَاحِدَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3608In-book reference : Book 61, Hadith 115USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 805   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3609,
    "id": 3609,
    "url": "https://sunnah.com/bukhari:3609",
    "bookNumber": 61,
    "hadithNumber": 116,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till there is a war between two groups among \nwhom there will be a great number of casualties, though the claims (or religion) of both of them will \nbe one and the same. And the Hour will not be established till there appear about thirty liars, all of \nwhom will be claiming to be the messengers of Allah. \"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَقْتَتِلَ فِئَتَانِ، فَيَكُونَ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ، دَعْوَاهُمَا وَاحِدَةٌ، وَلاَ تَقُومُ السَّاعَةُ حَتَّى يُبْعَثَ دَجَّالُونَ كَذَّابُونَ قَرِيبًا مِنْ ثَلاَثِينَ، كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3609In-book reference : Book 61, Hadith 116USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 806   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3610,
    "id": 3610,
    "url": "https://sunnah.com/bukhari:3610",
    "bookNumber": 61,
    "hadithNumber": 117,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "While we were with Allah's Messenger (ﷺ) who was distributing (i.e. some property), there came Dhu-l- \nKhuwaisira, a man from the tribe of Bani Tamim and said, \"O Allah's Messenger (ﷺ)! Do Justice.\" The \nProphet said, \"Woe to you! Who could do justice if I did not? I would be a desperate loser if I did not \ndo justice.\" `Umar said, \"O Allah's Messenger (ﷺ)! Allow me to chop his head off.\" The Prophet (ﷺ) said, \"Leave \nhim, for he has companions who pray and fast in such a way that you will consider your fasting \nnegligible in comparison to theirs. They recite Qur'an but it does not go beyond their throats (i.e. they \ndo not act on it) and they will desert Islam as an arrow goes through a victim's body, so that the \nhunter, on looking at the arrow's blade, would see nothing on it; he would look at its Risaf and see \nnothing: he would look at its Na,di and see nothing, and he would look at its Qudhadh ( 1 ) and see \nnothing (neither meat nor blood), for the arrow has been too fast even for the blood and excretions to \nsmear. The sign by which they will be recognized is that among them there will be a black man, one \nof whose arms will resemble a woman's breast or a lump of meat moving loosely. Those people will \nappear when there will be differences amongst the people.\" I testify that I heard this narration from \nAllah's Messenger (ﷺ) and I testify that `Ali bin Abi Talib fought with such people, and I was in his \ncompany. He ordered that the man (described by the Prophet (ﷺ) ) should be looked for. The man was \nbrought and I looked at him and noticed that he looked exactly as the Prophet (ﷺ) had described him.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يَقْسِمُ قَسْمًا أَتَاهُ ذُو الْخُوَيْصِرَةِ ـ وَهْوَ رَجُلٌ مِنْ بَنِي تَمِيمٍ ـ فَقَالَ يَا رَسُولَ اللَّهِ اعْدِلْ‏.‏ فَقَالَ ‏\"‏ وَيْلَكَ، وَمَنْ يَعْدِلُ إِذَا لَمْ أَعْدِلْ قَدْ خِبْتَ وَخَسِرْتَ إِنْ لَمْ أَكُنْ أَعْدِلُ ‏\"‏‏.‏ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فِيهِ، فَأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ ‏\"‏ دَعْهُ فَإِنَّ لَهُ أَصْحَابًا، يَحْقِرُ أَحَدُكُمْ صَلاَتَهُ مَعَ صَلاَتِهِمْ وَصِيَامَهُ مَعَ صِيَامِهِمْ، يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يُنْظَرُ إِلَى نَصْلِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ إِلَى رِصَافِهِ فَمَا يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ إِلَى نَضِيِّهِ ـ وَهْوَ قِدْحُهُ ـ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ إِلَى قُذَذِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، قَدْ سَبَقَ الْفَرْثَ وَالدَّمَ، آيَتُهُمْ رَجُلٌ أَسْوَدُ إِحْدَى عَضُدَيْهِ مِثْلُ ثَدْىِ الْمَرْأَةِ، أَوْ مِثْلُ الْبَضْعَةِ تَدَرْدَرُ وَيَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنَ النَّاسِ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ فَأَشْهَدُ أَنِّي سَمِعْتُ هَذَا الْحَدِيثَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَأَشْهَدُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ قَاتَلَهُمْ وَأَنَا مَعَهُ، فَأَمَرَ بِذَلِكَ الرَّجُلِ، فَالْتُمِسَ فَأُتِيَ بِهِ حَتَّى نَظَرْتُ إِلَيْهِ عَلَى نَعْتِ النَّبِيِّ صلى الله عليه وسلم الَّذِي نَعَتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3610In-book reference : Book 61, Hadith 117USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 807   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3611,
    "id": 3611,
    "url": "https://sunnah.com/bukhari:3611",
    "bookNumber": 61,
    "hadithNumber": 118,
    "narrator": "Narrated `Ali:",
    "english": "I relate the traditions of Allah's Messenger (ﷺ) to you for I would rather fall from the sky than attribute \nsomething to him falsely. But when I tell you a thing which is between you and me, then no doubt, \nwar is guile. I heard Allah's Messenger (ﷺ) saying, \"In the last days of this world there will appear some \nyoung foolish people who will use (in their claim) the best speech of all people (i.e. the Qur'an) and \nthey will abandon Islam as an arrow going through the game. Their belief will not go beyond their \nthroats (i.e. they will have practically no belief), so wherever you meet them, kill them, for he who \nkills them shall get a reward on the Day of Resurrection.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ خَيْثَمَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه ـ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلأَنْ أَخِرَّ مِنَ السَّمَاءِ أَحَبُّ إِلَىَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ، وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ، فَإِنَّ الْحَرْبَ خَدْعَةٌ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الأَسْنَانِ، سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ، يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3611In-book reference : Book 61, Hadith 118USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 808   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3612,
    "id": 3612,
    "url": "https://sunnah.com/bukhari:3612",
    "bookNumber": 61,
    "hadithNumber": 119,
    "narrator": "Narrated Khabbab bin Al-Arat:",
    "english": "We complained to Allah's Messenger (ﷺ) (of the persecution inflicted on us by the infidels) while he was \nsitting in the shade of the Ka`ba, leaning over his Burd (i.e. covering sheet). We said to him, \"Would \nyou seek help for us? Would you pray to Allah for us?\" He said, \"Among the nations before you a \n(believing) man would be put in a ditch that was dug for him, and a saw would be put over his head \nand he would be cut into two pieces; yet that (torture) would not make him give up his religion. His \nbody would be combed with iron combs that would remove his flesh from the bones and nerves, yet \nthat would not make him abandon his religion. By Allah, this religion (i.e. Islam) will prevail till a \ntraveler from Sana (in Yemen) to Hadrarmaut will fear none but Allah, or a wolf as regards his sheep, \nbut you (people) are hasty.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، عَنْ خَبَّابِ بْنِ الأَرَتِّ، قَالَ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ مُتَوَسِّدٌ بُرْدَةً لَهُ فِي ظِلِّ الْكَعْبَةِ، قُلْنَا لَهُ أَلاَ تَسْتَنْصِرُ لَنَا أَلاَ تَدْعُو اللَّهَ لَنَا قَالَ ‏\n\"‏ كَانَ الرَّجُلُ فِيمَنْ قَبْلَكُمْ يُحْفَرُ لَهُ فِي الأَرْضِ فَيُجْعَلُ فِيهِ، فَيُجَاءُ بِالْمِنْشَارِ، فَيُوضَعُ عَلَى رَأْسِهِ فَيُشَقُّ بِاثْنَتَيْنِ، وَمَا يَصُدُّهُ ذَلِكَ عَنْ دِينِهِ، وَيُمْشَطُ بِأَمْشَاطِ الْحَدِيدِ، مَا دُونَ لَحْمِهِ مِنْ عَظْمٍ أَوْ عَصَبٍ، وَمَا يَصُدُّهُ ذَلِكَ عَنْ دِينِهِ، وَاللَّهِ لَيُتِمَّنَّ هَذَا الأَمْرَ حَتَّى يَسِيرَ الرَّاكِبُ مِنْ صَنْعَاءَ إِلَى حَضْرَمَوْتَ، لاَ يَخَافُ إِلاَّ اللَّهَ أَوِ الذِّئْبَ عَلَى غَنَمِهِ، وَلَكِنَّكُمْ تَسْتَعْجِلُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3612In-book reference : Book 61, Hadith 119USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 809   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3613,
    "id": 3613,
    "url": "https://sunnah.com/bukhari:3613",
    "bookNumber": 61,
    "hadithNumber": 120,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) noticed the absence of Thabit bin Qais. A man said, \"O Allah's Messenger (ﷺ)! I shall bring you \nhis news.\" So he went to him and saw him sitting in his house drooping his head (sadly). He asked \nThabit, \"What's the matter?\" Thabit replied, \"An evil situation: A man used to raise his voice over the \nvoice of the Prophet (ﷺ) and so all his good deeds have been annulled and he is from the people of Hell.\" \nThe man went back and told the Prophet (ﷺ) that Thabit had said so-and-so. (The sub-narrator, Musa bin \nAnas said, \"The man went to Thabit again with glad tidings).\" The Prophet (ﷺ) said to him, \"Go and say \nto Thabit: 'You are not from the people of Fire, but from the people of Paradise.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ أَنْبَأَنِي مُوسَى بْنُ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم افْتَقَدَ ثَابِتَ بْنَ قَيْسٍ، فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، أَنَا أَعْلَمُ لَكَ عِلْمَهُ‏.‏ فَأَتَاهُ فَوَجَدَهُ جَالِسًا فِي بَيْتِهِ مُنَكِّسًا رَأْسَهُ، فَقَالَ مَا شَأْنُكَ فَقَالَ شَرٌّ، كَانَ يَرْفَعُ صَوْتَهُ فَوْقَ صَوْتِ النَّبِيِّ صلى الله عليه وسلم فَقَدْ حَبِطَ عَمَلُهُ، وَهْوَ مِنْ أَهْلِ النَّارِ‏.‏ فَأَتَى الرَّجُلُ فَأَخْبَرَهُ أَنَّهُ قَالَ كَذَا وَكَذَا‏.‏ فَقَالَ مُوسَى بْنُ أَنَسٍ فَرَجَعَ الْمَرَّةَ الآخِرَةَ بِبِشَارَةٍ عَظِيمَةٍ، فَقَالَ ‏\n\"‏ اذْهَبْ إِلَيْهِ فَقُلْ لَهُ إِنَّكَ لَسْتَ مِنْ أَهْلِ النَّارِ، وَلَكِنْ مِنْ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3613In-book reference : Book 61, Hadith 120USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 810   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3614,
    "id": 3614,
    "url": "https://sunnah.com/bukhari:3614",
    "bookNumber": 61,
    "hadithNumber": 121,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "A man recited Surat-al-Kahf (in his prayer) and in the house there was a (riding) animal which got \nfrightened and started jumping. The man finished his prayer with Taslim, but behold! A mist or a \ncloud hovered over him. He informed the Prophet (ﷺ) of that and the Prophet (ﷺ) said, \"O so-and-so! Recite, \nfor this (mist or cloud) was a sign of peace descending for the recitation of Qur'an.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَرَأَ رَجُلٌ الْكَهْفَ وَفِي الدَّارِ الدَّابَّةُ فَجَعَلَتْ تَنْفِرُ فَسَلَّمَ، فَإِذَا ضَبَابَةٌ ـ أَوْ سَحَابَةٌ ـ غَشِيَتْهُ، فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اقْرَأْ فُلاَنُ، فَإِنَّهَا السَّكِينَةُ نَزَلَتْ لِلْقُرْآنِ، أَوْ تَنَزَّلَتْ لِلْقُرْآنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3614In-book reference : Book 61, Hadith 121USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 811   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3615,
    "id": 3615,
    "url": "https://sunnah.com/bukhari:3615",
    "bookNumber": 61,
    "hadithNumber": 122,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "Abu Bakr came to my father who was at home and purchased a saddle from him. He said to `Azib. \n\"Tell your son to carry it with me.\" So I carried it with him and my father followed us so as to take the \nprice (of the saddle). My father said, \"O Abu Bakr! Tell me what happened to you on your night \njourney with Allah's Messenger (ﷺ) (during Migration).\" He said, \"Yes, we travelled the whole night and also \nthe next day till midday. when nobody could be seen on the way ( because of the severe heat) . Then \nthere appeared a long rock having shade beneath it, and the sunshine had not come to it yet. So we \ndismounted there and I levelled a place and covered it with an animal hide or dry grass for the Prophet (ﷺ) \nto sleep on (for a while). \nI then said, 'Sleep, O Allah's Messenger (ﷺ), and I will guard you.' So he slept and I went out to guard him. \nSuddenly I saw a shepherd coming with his sheep to that rock with the same intention we had when \nwe came to it. I asked (him). 'To whom do you belong, O boy?' He replied, 'I belong to a man from \nMedina or Mecca.' I said, 'Do your sheep have milk?' He said, 'Yes.' I said, 'Will you milk for us?' He \nsaid, 'Yes.' He caught hold of a sheep and I asked him to clean its teat from dust, hairs and dirt. (The \nsub-narrator said that he saw Al-Bara' striking one of his hands with the other, demonstrating how the \nshepherd removed the dust.) The shepherd milked a little milk in a wooden container and I had a \nleather container which I carried for the Prophet (ﷺ) to drink and perform the ablution from. I went to the \nProphet, hating to wake him up, but when I reached there, the Prophet (ﷺ) had already awakened; so I \npoured water over the middle part of the milk container, till the milk was cold. Then I said, 'Drink, O \nAllah's Messenger (ﷺ)!' He drank till I was pleased. \nThen he asked, 'Has the time for our departure come?' I said, 'Yes.' So we departed after midday. \nSuraqa bin Malik followed us and I said, 'We have been discovered, O Allah's Messenger (ﷺ)!' He said, Don't \ngrieve for Allah is with us.' The Prophet (ﷺ) invoked evil on him (i.e. Suraqa) and so the legs of his horse \nsank into the earth up to its belly. (The subnarrator, Zuhair is not sure whether Abu Bakr said, \"(It \nsank) into solid earth.\") Suraqa said, 'I see that you have invoked evil on me. Please invoke good on \nme, and by Allah, I will cause those who are seeking after you to return.' The Prophet (ﷺ) invoked good \non him and he was saved. Then, whenever he met somebody on the way, he would say, 'I have looked \nfor him here in vain.' So he caused whomever he met to return. Thus Suraqa fulfilled his promise.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا أَحْمَدُ بْنُ يَزِيدَ بْنِ إِبْرَاهِيمَ أَبُو الْحَسَنِ الْحَرَّانِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ جَاءَ أَبُو بَكْرٍ ـ رضى الله عنه ـ إِلَى أَبِي فِي مَنْزِلِهِ، فَاشْتَرَى مِنْهُ رَحْلاً فَقَالَ لِعَازِبٍ ابْعَثِ ابْنَكَ يَحْمِلْهُ مَعِي‏.‏ قَالَ فَحَمَلْتُهُ مَعَهُ، وَخَرَجَ أَبِي يَنْتَقِدُ ثَمَنَهُ، فَقَالَ لَهُ أَبِي يَا أَبَا بَكْرٍ حَدِّثْنِي كَيْفَ صَنَعْتُمَا حِينَ سَرَيْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ أَسْرَيْنَا لَيْلَتَنَا، وَمِنَ الْغَدِ حَتَّى قَامَ قَائِمُ الظَّهِيرَةِ، وَخَلاَ الطَّرِيقُ لاَ يَمُرُّ فِيهِ أَحَدٌ، فَرُفِعَتْ لَنَا صَخْرَةٌ طَوِيلَةٌ، لَهَا ظِلٌّ لَمْ تَأْتِ عَلَيْهِ الشَّمْسُ فَنَزَلْنَا عِنْدَهُ، وَسَوَّيْتُ لِلنَّبِيِّ صلى الله عليه وسلم مَكَانًا بِيَدِي يَنَامُ عَلَيْهِ، وَبَسَطْتُ فِيهِ فَرْوَةً، وَقُلْتُ نَمْ يَا رَسُولَ اللَّهِ، وَأَنَا أَنْفُضُ لَكَ مَا حَوْلَكَ‏.‏ فَنَامَ وَخَرَجْتُ أَنْفُضُ مَا حَوْلَهُ، فَإِذَا أَنَا بِرَاعٍ مُقْبِلٍ بِغَنَمِهِ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا مِثْلَ الَّذِي أَرَدْنَا فَقُلْتُ لِمَنْ أَنْتَ يَا غُلاَمُ فَقَالَ لِرَجُلٍ مِنْ أَهْلِ الْمَدِينَةِ أَوْ مَكَّةَ‏.‏ قُلْتُ أَفِي غَنَمِكَ لَبَنٌ قَالَ نَعَمُ‏.‏ قُلْتُ أَفَتَحْلُبُ قَالَ نَعَمْ‏.‏ فَأَخَذَ شَاةً‏.‏ فَقُلْتُ انْفُضِ الضَّرْعَ مِنَ التُّرَابِ وَالشَّعَرِ وَالْقَذَى‏.‏ قَالَ فَرَأَيْتُ الْبَرَاءَ يَضْرِبُ إِحْدَى يَدَيْهِ عَلَى الأُخْرَى يَنْفُضُ، فَحَلَبَ فِي قَعْبٍ كُثْبَةً مِنْ لَبَنٍ، وَمَعِي إِدَاوَةٌ حَمَلْتُهَا لِلنَّبِيِّ صلى الله عليه وسلم يَرْتَوِي مِنْهَا، يَشْرَبُ وَيَتَوَضَّأُ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَكَرِهْتُ أَنْ أُوقِظَهُ، فَوَافَقْتُهُ حِينَ اسْتَيْقَظَ، فَصَبَبْتُ مِنَ الْمَاءِ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ ـ قَالَ ـ فَشَرِبَ، حَتَّى رَضِيتُ ثُمَّ قَالَ ‏\"‏ أَلَمْ يَأْنِ لِلرَّحِيلِ ‏\"‏‏.‏ قُلْتُ بَلَى ـ قَالَ ـ فَارْتَحَلْنَا بَعْدَ مَا مَالَتِ الشَّمْشُ، وَاتَّبَعَنَا سُرَاقَةُ بْنُ مَالِكٍ، فَقُلْتُ أُتِينَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ لاَ تَحْزَنْ، إِنَّ اللَّهَ مَعَنَا ‏\"‏‏.‏ فَدَعَا عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَارْتَطَمَتْ بِهِ فَرَسُهُ إِلَى بَطْنِهَا ـ أُرَى فِي جَلَدٍ مِنَ الأَرْضِ، شَكَّ زُهَيْرٌ ـ فَقَالَ إِنِّي أُرَاكُمَا قَدْ دَعَوْتُمَا عَلَىَّ فَادْعُوَا لِي، فَاللَّهُ لَكُمَا أَنْ أَرُدَّ عَنْكُمَا الطَّلَبَ‏.‏ فَدَعَا لَهُ النَّبِيُّ صلى الله عليه وسلم فَنَجَا فَجَعَلَ لاَ يَلْقَى أَحَدًا إِلاَّ قَالَ كَفَيْتُكُمْ مَا هُنَا‏.‏ فَلاَ يَلْقَى أَحَدًا إِلاَّ رَدَّهُ‏.‏ قَالَ وَوَفَى لَنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3615In-book reference : Book 61, Hadith 122USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 812   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3616,
    "id": 3616,
    "url": "https://sunnah.com/bukhari:3616",
    "bookNumber": 61,
    "hadithNumber": 123,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) paid a visit to a sick bedouin. The Prophet (ﷺ) when visiting a patient used to say, \"No harm \nwill befall you! May Allah cure you! May Allah cure you!\" So the Prophet (ﷺ) said to the bedouin. \"No \nharm will befall you. May Allah cure you!\" The bedouin said, \"You say, may Allah cure me? No, for \nit is a fever which boils in (the body of) an old man, and will lead him to the grave.\" The Prophet (ﷺ) said, \n\"Yes, then may it be as you say.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ ـ يَعُودُهُ ـ قَالَ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ عَلَى مَرِيضٍ يَعُودُهُ قَالَ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ‏.‏ فَقَالَ لَهُ ‏\"‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ قُلْتَ طَهُورٌ كَلاَّ بَلْ هِيَ حُمَّى تَفُورُ ـ أَوْ تَثُورُ ـ عَلَى شَيْخٍ كَبِيرٍ، تُزِيرُهُ الْقُبُورَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3616In-book reference : Book 61, Hadith 123USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 813   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3617,
    "id": 3617,
    "url": "https://sunnah.com/bukhari:3617",
    "bookNumber": 61,
    "hadithNumber": 124,
    "narrator": "Narrated Anas:",
    "english": "There was a Christian who embraced Islam and read Surat-al-Baqara and Al-`Imran, and he used to \nwrite for the Prophet. Later on he returned to Christianity again and he used to say: \n\"Muhammad knows nothing but what I have written for him.\" Then Allah caused him to die, and the \npeople buried him, but in the morning they saw that the earth had thrown his body out. They said, \n\"This is the act of Muhammad and his companions. They dug the grave of our companion and took his \nbody out of it because he had run away from them.\" They again dug the grave deeply for him, but in \nthe morning they again saw that the earth had thrown his body out. They said, \"This is an act of \nMuhammad and his companions. They dug the grave of our companion and threw his body outside it, \nfor he had run away from them.\" They dug the grave for him as deep as they could, but in the morning \nthey again saw that the earth had thrown his body out. So they believed that what had befallen him \nwas not done by human beings and had to leave him thrown (on the ground).",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ رَجُلٌ نَصْرَانِيًّا فَأَسْلَمَ وَقَرَأَ الْبَقَرَةَ وَآلَ عِمْرَانَ، فَكَانَ يَكْتُبُ لِلنَّبِيِّ صلى الله عليه وسلم، فَعَادَ نَصْرَانِيًّا فَكَانَ يَقُولُ مَا يَدْرِي مُحَمَّدٌ إِلاَّ مَا كَتَبْتُ لَهُ، فَأَمَاتَهُ اللَّهُ فَدَفَنُوهُ، فَأَصْبَحَ وَقَدْ لَفَظَتْهُ الأَرْضُ فَقَالُوا هَذَا فِعْلُ مُحَمَّدٍ وَأَصْحَابِهِ، لَمَّا هَرَبَ مِنْهُمْ نَبَشُوا عَنْ صَاحِبِنَا‏.‏ فَأَلْقُوهُ فَحَفَرُوا لَهُ فَأَعْمَقُوا، فَأَصْبَحَ وَقَدْ لَفَظَتْهُ الأَرْضُ، فَقَالُوا هَذَا فِعْلُ مُحَمَّدٍ وَأَصْحَابِهِ نَبَشُوا عَنْ صَاحِبِنَا لَمَّا هَرَبَ مِنْهُمْ‏.‏ فَأَلْقَوْهُ فَحَفَرُوا لَهُ، وَأَعْمَقُوا لَهُ فِي الأَرْضِ مَا اسْتَطَاعُوا، فَأَصْبَحَ قَدْ لَفَظَتْهُ الأَرْضُ، فَعَلِمُوا أَنَّهُ لَيْسَ مِنَ النَّاسِ فَأَلْقَوْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3617In-book reference : Book 61, Hadith 124USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 814   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3618,
    "id": 3618,
    "url": "https://sunnah.com/bukhari:3618",
    "bookNumber": 61,
    "hadithNumber": 125,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"When Khosrau perishes, there will be no (more) Khosrau after him, and when \nCaesar perishes, there will be no more Caesar after him. By Him in Whose Hands Muhammad's life \nis, you will spend the treasures of both of them in Allah's Cause.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ وَأَخْبَرَنِي ابْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَإِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتُنْفِقُنَّ كُنُوزَهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3618In-book reference : Book 61, Hadith 125USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 815   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3619,
    "id": 3619,
    "url": "https://sunnah.com/bukhari:3619",
    "bookNumber": 61,
    "hadithNumber": 126,
    "narrator": "Narrated Jabir bin Samura:",
    "english": "The Prophet (ﷺ) said, \"When Khosrau perishes, there will be no more Khosrau a after him, and when \nCaesar perishes, there will be no more Caesar after him,\" The Prophet (ﷺ) also said, \"You will spend the \ntreasures of both of them in Allah's Cause.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، رَفَعَهُ قَالَ ‏\n\"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ ـ وَذَكَرَ وَقَالَ ـ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3619In-book reference : Book 61, Hadith 126USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 816   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3620,
    "id": 3620,
    "url": "https://sunnah.com/bukhari:3620",
    "bookNumber": 61,
    "hadithNumber": 127,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Musailama-al-Kadhdhab (i.e. the liar) came in the life-time of Allah's Messenger (ﷺ) with many of his people \n(to Medina) and said, \"If Muhammad makes me his successor, I will follow him.\" Allah's Messenger (ﷺ) \nwent up to him with Thabit bin Qais bin Shams; and Allah's Messenger (ﷺ) was carrying a piece of a datepalm \nleaf in his hand. He stood before Musailama (and his companions) and said, \"If you asked me \neven this piece (of a leaf), I would not give it to you. You cannot avoid the fate you are destined to, by \nAllah. If you reject Islam, Allah will destroy you. I think that you are most probably the same person \nwhom I have seen in the dream.\" Abu Huraira told me that Allah's Messenger (ﷺ); said, \"While I was \nsleeping, I saw (in a dream) two gold bracelets round my arm, and that worried me too much. Then I \nwas instructed divinely in my dream, to blow them off and so I blew them off, and they flew away. I \ninterpreted the two bracelets as symbols of two liars who would appear after me. And so one of them \nwas Al-Ansi and the other was Musailama Al-Kadhdhab from Al-Yamama.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ الأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ‏.‏ وَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ، فَأَقْبَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قِطْعَةُ جَرِيدٍ، حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ فَقَالَ ‏\"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا، وَلَنْ تَعْدُوَ أَمْرَ اللَّهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ، وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيكَ مَا رَأَيْتُ ‏\"‏‏.‏   فَأَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ، فَأَهَمَّنِي شَأْنُهُمَا، فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ بَعْدِي ‏\"‏‏.‏ فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ وَالآخَرُ مُسَيْلِمَةَ الْكَذَّابَ صَاحِبَ الْيَمَامَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3620, 3621In-book reference : Book 61, Hadith 127USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 817   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3621,
    "id": 3621,
    "url": "https://sunnah.com/bukhari:3621",
    "bookNumber": 61,
    "hadithNumber": 127,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Musailama-al-Kadhdhab (i.e. the liar) came in the life-time of Allah's Messenger (ﷺ) with many of his people \n(to Medina) and said, \"If Muhammad makes me his successor, I will follow him.\" Allah's Messenger (ﷺ) \nwent up to him with Thabit bin Qais bin Shams; and Allah's Messenger (ﷺ) was carrying a piece of a datepalm \nleaf in his hand. He stood before Musailama (and his companions) and said, \"If you asked me \neven this piece (of a leaf), I would not give it to you. You cannot avoid the fate you are destined to, by \nAllah. If you reject Islam, Allah will destroy you. I think that you are most probably the same person \nwhom I have seen in the dream.\" Abu Huraira told me that Allah's Messenger (ﷺ); said, \"While I was \nsleeping, I saw (in a dream) two gold bracelets round my arm, and that worried me too much. Then I \nwas instructed divinely in my dream, to blow them off and so I blew them off, and they flew away. I \ninterpreted the two bracelets as symbols of two liars who would appear after me. And so one of them \nwas Al-Ansi and the other was Musailama Al-Kadhdhab from Al-Yamama.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ الأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ‏.‏ وَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ، فَأَقْبَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قِطْعَةُ جَرِيدٍ، حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ فَقَالَ ‏\"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا، وَلَنْ تَعْدُوَ أَمْرَ اللَّهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ، وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيكَ مَا رَأَيْتُ ‏\"‏‏.‏   فَأَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ، فَأَهَمَّنِي شَأْنُهُمَا، فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ بَعْدِي ‏\"‏‏.‏ فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ وَالآخَرُ مُسَيْلِمَةَ الْكَذَّابَ صَاحِبَ الْيَمَامَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3620, 3621In-book reference : Book 61, Hadith 127USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 817   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3622,
    "id": 3622,
    "url": "https://sunnah.com/bukhari:3622",
    "bookNumber": 61,
    "hadithNumber": 128,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"In a dream I saw myself migrating from Mecca to a place having plenty of date \ntrees. I thought that it was Al-Yamama or Hajar, but it came to be Medina i.e. Yathrib. In the same \ndream I saw myself moving a sword and its blade got broken. It came to symbolize the defeat which \nthe Muslims suffered from, on the Day of Uhud. I moved the sword again, and it became normal as \nbefore, and that was the symbol of the victory Allah bestowed upon Muslims and their gathering \ntogether. I saw cows in my dream, and by Allah, that was a blessing, and they symbolized the \nbelievers on the Day of Uhud. And the blessing was the good Allah bestowed upon us and the reward \nof true belief which Allah gave us after the day of Badr.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ أُرَاهُ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ، فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ، فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ، وَرَأَيْتُ فِي رُؤْيَاىَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ بِأُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ، وَرَأَيْتُ فِيهَا بَقَرًا وَاللَّهُ خَيْرٌ فَإِذَا هُمُ الْمُؤْمِنُونَ يَوْمَ أُحُدٍ، وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ مِنَ الْخَيْرِ، وَثَوَابِ الصِّدْقِ الَّذِي آتَانَا اللَّهُ بَعْدَ يَوْمِ بَدْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3622In-book reference : Book 61, Hadith 128USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 818   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3623,
    "id": 3623,
    "url": "https://sunnah.com/bukhari:3623",
    "bookNumber": 61,
    "hadithNumber": 129,
    "narrator": "Narrated `Aisha:",
    "english": "Once Fatima came walking and her gait resembled the gait of the Prophet (ﷺ) . The Prophet (ﷺ) said, \n\"Welcome, O my daughter!\" Then he made her sit on his right or on his left side, and then he told her \na secret and she started weeping. I asked her, \"Why are you weeping?\" He again told her a secret and \nshe started laughing. I said, \"I never saw happiness so near to sadness as I saw today.\" I asked her \nwhat the Prophet (ﷺ) had told her. She said, \"I would never disclose the secret of Allah's Messenger (ﷺ).\" When \nthe Prophet (ﷺ) died, I asked her about it. She replied. \"The Prophet (ﷺ) said: 'Every year Gabriel used to \nrevise the Qur'an with me once only, but this year he has done so twice. I think this portends my \ndeath, and you will be the first of my family to follow me.' So I started weeping. Then he said. 'Don't \nyou like to be the chief of all the ladies of Paradise or the chief of the believing women? So I \nlaughed for that.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَقْبَلَتْ فَاطِمَةُ تَمْشِي، كَأَنَّ مِشْيَتَهَا مَشْىُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَرْحَبًا بِابْنَتِي ‏\"‏‏.‏ ثُمَّ أَجْلَسَهَا عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ، ثُمَّ أَسَرَّ إِلَيْهَا حَدِيثًا، فَبَكَتْ فَقُلْتُ لَهَا لِمَ تَبْكِينَ ثُمَّ أَسَرَّ إِلَيْهَا حَدِيثًا فَضَحِكَتْ فَقُلْتُ مَا رَأَيْتُ كَالْيَوْمِ فَرَحًا أَقْرَبَ مِنْ حُزْنٍ، فَسَأَلْتُهَا عَمَّا قَالَ‏.‏   فَقَالَتْ مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى قُبِضَ النَّبِيُّ صلى الله عليه وسلم فَسَأَلْتُهَا فَقَالَتْ أَسَرَّ إِلَىَّ ‏\"‏ إِنَّ جِبْرِيلَ كَانَ يُعَارِضُنِي الْقُرْآنَ كُلَّ سَنَةٍ مَرَّةً، وَإِنَّهُ عَارَضَنِي الْعَامَ مَرَّتَيْنِ، وَلاَ أُرَاهُ إِلاَّ حَضَرَ أَجَلِي، وَإِنَّكِ أَوَّلُ أَهْلِ بَيْتِي لَحَاقًا بِي ‏\"‏‏.‏ فَبَكَيْتُ فَقَالَ ‏\"‏ أَمَا تَرْضَيْنَ أَنْ تَكُونِي سَيِّدَةَ نِسَاءِ أَهْلِ الْجَنَّةِ ـ أَوْ نِسَاءِ الْمُؤْمِنِينَ ‏\"‏‏.‏ فَضَحِكْتُ لِذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3623, 3624In-book reference : Book 61, Hadith 129USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 819   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3624,
    "id": 3624,
    "url": "https://sunnah.com/bukhari:3624",
    "bookNumber": 61,
    "hadithNumber": 129,
    "narrator": "Narrated `Aisha:",
    "english": "Once Fatima came walking and her gait resembled the gait of the Prophet (ﷺ) . The Prophet (ﷺ) said, \n\"Welcome, O my daughter!\" Then he made her sit on his right or on his left side, and then he told her \na secret and she started weeping. I asked her, \"Why are you weeping?\" He again told her a secret and \nshe started laughing. I said, \"I never saw happiness so near to sadness as I saw today.\" I asked her \nwhat the Prophet (ﷺ) had told her. She said, \"I would never disclose the secret of Allah's Messenger (ﷺ).\" When \nthe Prophet (ﷺ) died, I asked her about it. She replied. \"The Prophet (ﷺ) said: 'Every year Gabriel used to \nrevise the Qur'an with me once only, but this year he has done so twice. I think this portends my \ndeath, and you will be the first of my family to follow me.' So I started weeping. Then he said. 'Don't \nyou like to be the chief of all the ladies of Paradise or the chief of the believing women? So I \nlaughed for that.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَقْبَلَتْ فَاطِمَةُ تَمْشِي، كَأَنَّ مِشْيَتَهَا مَشْىُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَرْحَبًا بِابْنَتِي ‏\"‏‏.‏ ثُمَّ أَجْلَسَهَا عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ، ثُمَّ أَسَرَّ إِلَيْهَا حَدِيثًا، فَبَكَتْ فَقُلْتُ لَهَا لِمَ تَبْكِينَ ثُمَّ أَسَرَّ إِلَيْهَا حَدِيثًا فَضَحِكَتْ فَقُلْتُ مَا رَأَيْتُ كَالْيَوْمِ فَرَحًا أَقْرَبَ مِنْ حُزْنٍ، فَسَأَلْتُهَا عَمَّا قَالَ‏.‏   فَقَالَتْ مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى قُبِضَ النَّبِيُّ صلى الله عليه وسلم فَسَأَلْتُهَا فَقَالَتْ أَسَرَّ إِلَىَّ ‏\"‏ إِنَّ جِبْرِيلَ كَانَ يُعَارِضُنِي الْقُرْآنَ كُلَّ سَنَةٍ مَرَّةً، وَإِنَّهُ عَارَضَنِي الْعَامَ مَرَّتَيْنِ، وَلاَ أُرَاهُ إِلاَّ حَضَرَ أَجَلِي، وَإِنَّكِ أَوَّلُ أَهْلِ بَيْتِي لَحَاقًا بِي ‏\"‏‏.‏ فَبَكَيْتُ فَقَالَ ‏\"‏ أَمَا تَرْضَيْنَ أَنْ تَكُونِي سَيِّدَةَ نِسَاءِ أَهْلِ الْجَنَّةِ ـ أَوْ نِسَاءِ الْمُؤْمِنِينَ ‏\"‏‏.‏ فَضَحِكْتُ لِذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3623, 3624In-book reference : Book 61, Hadith 129USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 819   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3625,
    "id": 3625,
    "url": "https://sunnah.com/bukhari:3625",
    "bookNumber": 61,
    "hadithNumber": 130,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) in his fatal illness, called his daughter Fatima and told her a secret because of which she \nstarted weeping. Then he called her and told her another secret, and she started laughing. When I \nasked her about that, she replied, The Prophet (ﷺ) told me that he would die in his fatal illness, and so I \nwept, but then he secretly told me that from amongst his family, I would be the first to join him, and \nso I laughed.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَعَا النَّبِيُّ صلى الله عليه وسلم فَاطِمَةَ ابْنَتَهُ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ، فَسَارَّهَا بِشَىْءٍ فَبَكَتْ، ثُمَّ دَعَاهَا، فَسَارَّهَا فَضَحِكَتْ، قَالَتْ فَسَأَلْتُهَا عَنْ ذَلِكَ‏.‏   فَقَالَتْ سَارَّنِي النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَنِي أَنَّهُ يُقْبَضُ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَبَكَيْتُ، ثُمَّ سَارَّنِي فَأَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِ بَيْتِهِ أَتْبَعُهُ فَضَحِكْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3625, 3626In-book reference : Book 61, Hadith 130USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 820   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3626,
    "id": 3626,
    "url": "https://sunnah.com/bukhari:3626",
    "bookNumber": 61,
    "hadithNumber": 130,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) in his fatal illness, called his daughter Fatima and told her a secret because of which she \nstarted weeping. Then he called her and told her another secret, and she started laughing. When I \nasked her about that, she replied, The Prophet (ﷺ) told me that he would die in his fatal illness, and so I \nwept, but then he secretly told me that from amongst his family, I would be the first to join him, and \nso I laughed.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَعَا النَّبِيُّ صلى الله عليه وسلم فَاطِمَةَ ابْنَتَهُ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ، فَسَارَّهَا بِشَىْءٍ فَبَكَتْ، ثُمَّ دَعَاهَا، فَسَارَّهَا فَضَحِكَتْ، قَالَتْ فَسَأَلْتُهَا عَنْ ذَلِكَ‏.‏   فَقَالَتْ سَارَّنِي النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَنِي أَنَّهُ يُقْبَضُ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَبَكَيْتُ، ثُمَّ سَارَّنِي فَأَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِ بَيْتِهِ أَتْبَعُهُ فَضَحِكْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3625, 3626In-book reference : Book 61, Hadith 130USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 820   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3627,
    "id": 3627,
    "url": "https://sunnah.com/bukhari:3627",
    "bookNumber": 61,
    "hadithNumber": 131,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "About Ibn `Abbas: `Umar bin Al-Khattab used to treat Ibn `Abbas very favorably `Abdur Rahman bin \n`Auf said to him. \"We also have sons that are equal to him (but you are partial to him.)\" `Umar said, \n\"It is because of his knowledge.\" Then `Umar asked Ibn `Abbas about the interpretation of the Verse:- \n'When come the Help of Allah and the conquest (of Mecca) (110.1) Ibn `Abbas said. \"It portended the \ndeath of Allah's Messenger (ﷺ), which Allah had informed him of.\" `Umar said, \"I do not know from this \nVerse but what you know.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ يُدْنِي ابْنَ عَبَّاسٍ، فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنَّ لَنَا أَبْنَاءً مِثْلَهُ‏.‏ فَقَالَ إِنَّهُ مِنْ حَيْثُ تَعْلَمُ‏.‏ فَسَأَلَ عُمَرُ ابْنَ عَبَّاسٍ عَنْ هَذِهِ الآيَةِ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏‏.‏ فَقَالَ أَجَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْلَمَهُ إِيَّاهُ‏.‏ قَالَ مَا أَعْلَمُ مِنْهَا إِلاَّ مَا تَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3627In-book reference : Book 61, Hadith 131USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 821   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3628,
    "id": 3628,
    "url": "https://sunnah.com/bukhari:3628",
    "bookNumber": 61,
    "hadithNumber": 132,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) in his fatal illness came out, wrapped with a sheet, and his head was wrapped with an \noiled bandage. He sat on the pulpit, and praising and glorifying Allah, he said, \"Now then, people will \nincrease but the Ansar will decrease in number, so much so that they, compared with the people, will \nbe just like the salt in the meals. So, if any of you should take over the authority by which he can \neither benefit some people or harm some others, he should accept the goodness of their good people \n(i.e. Ansar) and excuse the faults of their wrong-doers.\" That was the last gathering which the Prophet (ﷺ) \nattended.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ حَنْظَلَةَ بْنِ الْغَسِيلِ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ بِمِلْحَفَةٍ قَدْ عَصَّبَ بِعِصَابَةٍ دَسْمَاءَ، حَتَّى جَلَسَ عَلَى الْمِنْبَرِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ فَإِنَّ النَّاسَ يَكْثُرُونَ وَيَقِلُّ الأَنْصَارُ، حَتَّى يَكُونُوا فِي النَّاسِ بِمَنْزِلَةِ الْمِلْحِ فِي الطَّعَامِ، فَمَنْ وَلِيَ مِنْكُمْ شَيْئًا يَضُرُّ فِيهِ قَوْمًا، وَيَنْفَعُ فِيهِ آخَرِينَ، فَلْيَقْبَلْ مِنْ مُحْسِنِهِمْ، وَيَتَجَاوَزْ عَنْ مُسِيئِهِمْ ‏\"‏‏.‏ فَكَانَ آخِرَ مَجْلِسٍ جَلَسَ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3628In-book reference : Book 61, Hadith 132USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 822   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3629,
    "id": 3629,
    "url": "https://sunnah.com/bukhari:3629",
    "bookNumber": 61,
    "hadithNumber": 133,
    "narrator": "Narrated Abu Bakra:",
    "english": "Once the Prophet (ﷺ) brought out Al-Hasan and took him up the pulpit along with him and said, \"This son \nof mine is a Saiyid (i.e. chief) and I hope that Allah will help him bring about reconciliation between \ntwo Muslim groups.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ أَبِي مُوسَى، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ أَخْرَجَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ يَوْمٍ الْحَسَنَ فَصَعِدَ بِهِ عَلَى الْمِنْبَرِ، فَقَالَ ‏\n\"‏ ابْنِي هَذَا سَيِّدٌ، وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3629In-book reference : Book 61, Hadith 133USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 823   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3630,
    "id": 3630,
    "url": "https://sunnah.com/bukhari:3630",
    "bookNumber": 61,
    "hadithNumber": 134,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) had informed us of the death of Ja`far and Zaid before the news of their death reached us, \nand his eyes were shedding tears.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَعَى جَعْفَرًا وَزَيْدًا قَبْلَ أَنْ يَجِيءَ خَبَرُهُمْ، وَعَيْنَاهُ تَذْرِفَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3630In-book reference : Book 61, Hadith 134USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 824   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3631,
    "id": 3631,
    "url": "https://sunnah.com/bukhari:3631",
    "bookNumber": 61,
    "hadithNumber": 135,
    "narrator": "Narrated Jabir:",
    "english": "(Once) the Prophet (ﷺ) said, \"Have you got carpets?\" I replied, \"Whence can we get carpets?\" He said, \n\"But you shall soon have carpets.\" I used to say to my wife, \"Remove your carpets from my sight,\" \nbut she would say, \"Didn't the Prophet (ﷺ) tell you that you would soon have carpets?\" So I would give up \nmy request.",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ لَكُمْ مِنْ أَنْمَاطٍ ‏\"‏‏.‏ قُلْتُ وَأَنَّى يَكُونُ لَنَا الأَنْمَاطُ قَالَ ‏\"‏ أَمَا إِنَّهُ سَيَكُونُ لَكُمُ الأَنْمَاطُ ‏\"‏‏.‏ فَأَنَا أَقُولُ لَهَا ـ يَعْنِي امْرَأَتَهُ ـ أَخِّرِي عَنِّي أَنْمَاطَكِ‏.‏ فَتَقُولُ أَلَمْ يَقُلِ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا سَتَكُونُ لَكُمُ الأَنْمَاطُ ‏\"‏‏.‏ فَأَدَعُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3631In-book reference : Book 61, Hadith 135USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 825   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3632,
    "id": 3632,
    "url": "https://sunnah.com/bukhari:3632",
    "bookNumber": 61,
    "hadithNumber": 136,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "Sa`d bin Mu`adh came to Mecca with the intention of performing `Umra, and stayed at the house of \nUmaiya bin Khalaf Abi Safwan, for Umaiya himself used to stay at Sa`d's house when he passed by \nMedina on his way to Sham. Umaiya said to Sa`d, \"Will you wait till midday when the people are (at \ntheir homes), then you may go and perform the Tawaf round the Ka`ba?\" So, while Sa`d was going \naround the Ka`ba, Abu Jahl came and asked, \"Who is that who is performing Tawaf?\" Sa`d replied, \"I \nam Sa`d.\" Abu Jahl said, \"Are you circumambulating the Ka`ba safely although you have given refuge \nto Muhammad and his companions?\" Sa`d said, \"Yes,\" and they started quarreling. Umaiya said to \nSa`d, \"Don't shout at Abi-l-Hakam (i.e. Abu Jahl), for he is chief of the valley (of Mecca).\" Sa`d then \nsaid (to Abu Jahl). 'By Allah, if you prevent me from performing the Tawaf of the Ka`ba, I will spoil \nyour trade with Sham.\" Umaiya kept on saying to Sa`d, \"Don't raise your voice.\" and kept on taking \nhold of him. Sa`d became furious and said, (to Umaiya), \"Be away from me, for I have heard \nMuhammad saying that he will kill you.\" Umaiiya said, \"Will he kill me?\" Sa`d said, \"Yes,.\" Umaiya \nsaid, \"By Allah! When Muhammad says a thing, he never tells a lie.\" Umaiya went to his wife and \nsaid to her, \"Do you know what my brother from Yathrib (i.e. Medina) has said to me?\" She said, \n\"What has he said?\" He said, \"He claims that he has heard Muhammad claiming that he will kill me.\" \nShe said, By Allah! Muhammad never tells a lie.\" So when the infidels started to proceed for Badr \n(Battle) and declared war (against the Muslims), his wife said to him, \"Don't you remember what your \nbrother from Yathrib told you?\" Umaiya decided not to go but Abu Jahl said to him, \"You are from \nthe nobles of the valley (of Mecca), so you should accompany us for a day or two.\" He went with them \nand thus Allah got him killed.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ انْطَلَقَ سَعْدُ بْنُ مُعَاذٍ مُعْتَمِرًا ـ قَالَ ـ فَنَزَلَ عَلَى أُمَيَّةَ بْنِ خَلَفٍ أَبِي صَفْوَانَ، وَكَانَ أُمَيَّةُ إِذَا انْطَلَقَ إِلَى الشَّأْمِ فَمَرَّ بِالْمَدِينَةِ نَزَلَ عَلَى سَعْدٍ، فَقَالَ أُمَيَّةُ لِسَعْدٍ انْتَظِرْ حَتَّى إِذَا انْتَصَفَ النَّهَارُ، وَغَفَلَ النَّاسُ انْطَلَقْتُ فَطُفْتُ، فَبَيْنَا سَعْدٌ يَطُوفُ إِذَا أَبُو جَهْلٍ فَقَالَ مَنْ هَذَا الَّذِي يَطُوفُ بِالْكَعْبَةِ فَقَالَ سَعْدٌ أَنَا سَعْدٌ‏.‏ فَقَالَ أَبُو جَهْلٍ تَطُوفُ بِالْكَعْبَةِ آمِنًا، وَقَدْ آوَيْتُمْ مُحَمَّدًا وَأَصْحَابَهُ فَقَالَ نَعَمْ‏.‏ فَتَلاَحَيَا بَيْنَهُمَا‏.‏ فَقَالَ أُمَيَّةُ لِسَعْدٍ لاَ تَرْفَعْ صَوْتَكَ عَلَى أَبِي الْحَكَمِ، فَإِنَّهُ سَيِّدُ أَهْلِ الْوَادِي‏.‏ ثُمَّ قَالَ سَعْدٌ وَاللَّهِ لَئِنْ مَنَعْتَنِي أَنْ أَطُوفَ بِالْبَيْتِ لأَقْطَعَنَّ مَتْجَرَكَ بِالشَّأْمِ‏.‏ قَالَ فَجَعَلَ أُمَيَّةُ يَقُولُ لِسَعْدٍ لاَ تَرْفَعْ صَوْتَكَ‏.‏ وَجَعَلَ يُمْسِكُهُ، فَغَضِبَ سَعْدٌ فَقَالَ دَعْنَا عَنْكَ، فَإِنِّي سَمِعْتُ مُحَمَّدًا صلى الله عليه وسلم يَزْعُمُ أَنَّهُ قَاتِلُكَ‏.‏ قَالَ إِيَّاىَ قَالَ نَعَمْ‏.‏ قَالَ وَاللَّهِ مَا يَكْذِبُ مُحَمَّدٌ إِذَا حَدَّثَ‏.‏ فَرَجَعَ إِلَى امْرَأَتِهِ، فَقَالَ أَمَا تَعْلَمِينَ مَا قَالَ لِي أَخِي الْيَثْرِبِيُّ قَالَتْ وَمَا قَالَ قَالَ زَعَمَ أَنَّهُ سَمِعَ مُحَمَّدًا يَزْعُمُ أَنَّهُ قَاتِلِي‏.‏ قَالَتْ فَوَاللَّهِ مَا يَكْذِبُ مُحَمَّدٌ‏.‏ قَالَ فَلَمَّا خَرَجُوا إِلَى بَدْرٍ، وَجَاءَ الصَّرِيخُ قَالَتْ لَهُ امْرَأَتُهُ أَمَا ذَكَرْتَ مَا قَالَ لَكَ أَخُوكَ الْيَثْرِبِيُّ قَالَ فَأَرَادَ أَنْ لاَ يَخْرُجَ، فَقَالَ لَهُ أَبُو جَهْلٍ إِنَّكَ مِنْ أَشْرَافِ الْوَادِي، فَسِرْ يَوْمًا أَوْ يَوْمَيْنِ، فَسَارَ مَعَهُمْ فَقَتَلَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3632In-book reference : Book 61, Hadith 136USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 826   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3633,
    "id": 3633,
    "url": "https://sunnah.com/bukhari:3633",
    "bookNumber": 61,
    "hadithNumber": 138,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"I saw (in a dream) the people assembled in a gathering, and then Abu Bakr got \nup and drew one or two buckets of water (from a well) but there was weakness in his drawing. May \nAllah forgive him. Then `Umar took the bucket and in his hands it turned into a very large bucket. I \nhad never seen anyone amongst: the people who could draw the water as strongly as `Umar till all the \npeople drank their fill and watered their camels that knelt down there.",
    "arabic": "حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُغِيرَةِ، عَنْ أَبِيهِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ رَأَيْتُ النَّاسَ مُجْتَمِعِينَ فِي صَعِيدٍ، فَقَامَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي بَعْضِ نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ أَخَذَهَا عُمَرُ، فَاسْتَحَالَتْ بِيَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا فِي النَّاسِ يَفْرِي فَرِيَّهُ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏ وَقَالَ هَمَّامٌ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ فَنَزَعَ أَبُو بَكْرٍ ذَنُوبَيْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3633In-book reference : Book 61, Hadith 138USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 828   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3634,
    "id": 3634,
    "url": "https://sunnah.com/bukhari:3634",
    "bookNumber": 61,
    "hadithNumber": 137,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I got the news that Gabriel came to the Prophet (ﷺ) while Um Salama was present. Gabriel started talking \n(to the Prophet (ﷺ) and then left. The Prophet (ﷺ) said to Um Salama, \"(Do you know) who it was?\" (or a \nsimilar question). She said, \"It was Dihya (a handsome person amongst the companions of the Prophet (ﷺ) \n).\" Later on Um Salama said, \"By Allah! I thought he was none but Dihya, till I heard the Prophet (ﷺ) \ntalking about Gabriel in his sermon.\" (The Sub-narrator asked Abu `Uthman, \"From where have you \nheard this narration?\" He replied, \"From Usama bin Zaid.\")",
    "arabic": "حَدَّثَنِي عَبَّاسُ بْنُ الْوَلِيدِ النَّرْسِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ، قَالَ أُنْبِئْتُ أَنَّ جِبْرِيلَ ـ عَلَيْهِ السَّلاَمُ ـ أَتَى النَّبِيَّ صلى الله عليه وسلم وَعِنْدَهُ أُمُّ سَلَمَةَ، فَجَعَلَ يُحَدِّثُ ثُمَّ قَامَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأُمِّ سَلَمَةَ ‏\n\"‏ مَنْ هَذَا ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏ قَالَ قَالَتْ هَذَا دِحْيَةُ‏.‏ قَالَتْ أُمُّ سَلَمَةَ ايْمُ اللَّهِ مَا حَسِبْتُهُ إِلاَّ إِيَّاهُ حَتَّى سَمِعْتُ خُطْبَةَ نَبِيِّ اللَّهِ صلى الله عليه وسلم يُخْبِرُ جِبْرِيلَ أَوْ كَمَا قَالَ‏.‏ قَالَ فَقُلْتُ لأَبِي عُثْمَانَ مِمَّنْ سَمِعْتَ هَذَا قَالَ مِنْ أُسَامَةَ بْنِ زَيْدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3634In-book reference : Book 61, Hadith 137USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 827   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3635,
    "id": 3635,
    "url": "https://sunnah.com/bukhari:3635",
    "bookNumber": 61,
    "hadithNumber": 139,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Jews came to Allah's Messenger (ﷺ) and told him that a man and a woman from amongst them had \ncommitted illegal sexual intercourse. Allah's Messenger (ﷺ) said to them, \"What do you find in the Torah \n(old Testament) about the legal punishment of Ar-Rajm (stoning)?\" They replied, (But) we announce \ntheir crime and lash them.\" `Abdullah bin Salam said, \"You are telling a lie; Torah contains the order \nof Rajm.\" They brought and opened the Torah and one of them solaced his hand on the Verse of Rajm \nand read the verses preceding and following it. `Abdullah bin Salam said to him, \"Lift your hand.\" \nWhen he lifted his hand, the Verse of Rajm was written there. They said, \"Muhammad has told the \ntruth; the Torah has the Verse of Rajm. The Prophet (ﷺ) then gave the order that both of them should be \nstoned to death. (`Abdullah bin `Umar said, \"I saw the man leaning over the woman to shelter her \nfrom the stones.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْيَهُودَ، جَاءُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ أَنَّ رَجُلاً مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ ‏\"‏‏.‏ فَقَالُوا نَفْضَحُهُمْ وَيُجْلَدُونَ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبْتُمْ، إِنَّ فِيهَا الرَّجْمَ‏.‏ فَأَتَوْا بِالتَّوْرَاةِ فَنَشَرُوهَا، فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ، فَقَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ارْفَعْ يَدَكَ‏.‏ فَرَفَعَ يَدَهُ فَإِذَا فِيهَا آيَةُ الرَّجْمِ‏.‏ فَقَالُوا صَدَقَ يَا مُحَمَّدُ، فِيهَا آيَةُ الرَّجْمِ‏.‏ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا‏.‏ قَالَ عَبْدُ اللَّهِ فَرَأَيْتُ الرَّجُلَ يَجْنَأُ عَلَى الْمَرْأَةِ يَقِيهَا الْحِجَارَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3635In-book reference : Book 61, Hadith 139USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 829   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3636,
    "id": 3636,
    "url": "https://sunnah.com/bukhari:3636",
    "bookNumber": 61,
    "hadithNumber": 140,
    "narrator": "Narrated `Abdullah bin Masud:",
    "english": "During the lifetime of the Prophet (ﷺ) the moon was split into two parts and on that the Prophet (ﷺ) said, \n\"Bear witness (to thus).",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم شِقَّتَيْنِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اشْهَدُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3636In-book reference : Book 61, Hadith 140USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 830   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3637,
    "id": 3637,
    "url": "https://sunnah.com/bukhari:3637",
    "bookNumber": 61,
    "hadithNumber": 141,
    "narrator": "Narrated Anas:",
    "english": "That the Meccan people requested Allah's Messenger (ﷺ) to show them a miracle, and so he showed them the \nsplitting of the moon.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يُونُسُ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ،‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ حَدَّثَهُمْ أَنَّ أَهْلَ مَكَّةَ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يُرِيَهُمْ آيَةً، فَأَرَاهُمُ انْشِقَاقَ الْقَمَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3637In-book reference : Book 61, Hadith 141USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 831   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3638,
    "id": 3638,
    "url": "https://sunnah.com/bukhari:3638",
    "bookNumber": 61,
    "hadithNumber": 142,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The moon was split into two parts during the lifetime of the Prophet.",
    "arabic": "حَدَّثَنِي خَلَفُ بْنُ خَالِدٍ الْقُرَشِيُّ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ الْقَمَرَ، انْشَقَّ فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم‏.",
    "reference": "Reference : Sahih al-Bukhari 3638In-book reference : Book 61, Hadith 142USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 832   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3639,
    "id": 3639,
    "url": "https://sunnah.com/bukhari:3639",
    "bookNumber": 61,
    "hadithNumber": 143,
    "narrator": "Narrated Anas:",
    "english": "Once two men from the companions of Allah's Messenger (ﷺ) went out of the house of the Prophet (ﷺ) on a very \ndark night. They were accompanied by two things that resembled two lamps lighting the way in front \nof them, and when they parted, each of them was accompanied by one of those two things (lamps) till \nthey reached their homes.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ رَجُلَيْنِ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم خَرَجَا مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم فِي لَيْلَةٍ مُظْلِمَةٍ وَمَعَهُمَا مِثْلُ الْمِصْبَاحَيْنِ، يُضِيآنِ بَيْنَ أَيْدِيهِمَا، فَلَمَّا افْتَرَقَا صَارَ مَعَ كُلِّ وَاحِدٍ مِنْهُمَا وَاحِدٌ حَتَّى أَتَى أَهْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3639In-book reference : Book 61, Hadith 143USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 833   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3640,
    "id": 3640,
    "url": "https://sunnah.com/bukhari:3640",
    "bookNumber": 61,
    "hadithNumber": 144,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "The Prophet (ﷺ) said, \"Some of my followers will remain victorious (and on the right path) till the Last \nDay comes, and they will still be victorious.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ نَاسٌ مِنْ أُمَّتِي ظَاهِرِينَ حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3640In-book reference : Book 61, Hadith 144USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 834   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3641,
    "id": 3641,
    "url": "https://sunnah.com/bukhari:3641",
    "bookNumber": 61,
    "hadithNumber": 145,
    "narrator": "Narrated Muawiya:",
    "english": "I heard the Prophet (ﷺ) saying, \"A group of people amongst my followers will remain obedient to Allah's \norders and they will not be harmed by anyone who will not help them or who will oppose them, till \nAllah's Order (the Last Day) comes upon them while they are still on the right path.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنِي ابْنُ جَابِرٍ، قَالَ حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَزَالُ مِنْ أُمَّتِي أُمَّةٌ قَائِمَةٌ بِأَمْرِ اللَّهِ، لاَ يَضُرُّهُمْ مَنْ خَذَلَهُمْ وَلاَ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ وَهُمْ عَلَى ذَلِكَ ‏\"‏‏.‏ قَالَ عُمَيْرٌ فَقَالَ مَالِكُ بْنُ يُخَامِرَ قَالَ مُعَاذٌ وَهُمْ بِالشَّأْمِ‏.‏ فَقَالَ مُعَاوِيَةُ هَذَا مَالِكٌ يَزْعُمُ أَنَّهُ سَمِعَ مُعَاذًا يَقُولُ وَهُمْ بِالشَّامِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3641In-book reference : Book 61, Hadith 145USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 835   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3642,
    "id": 3642,
    "url": "https://sunnah.com/bukhari:3642",
    "bookNumber": 61,
    "hadithNumber": 146,
    "narrator": "Narrated `Urwa:",
    "english": "That the Prophet (ﷺ) gave him one Dinar so as to buy a sheep for him. `Urwa bought two sheep for him \nwith the money. Then he sold one of the sheep for one Dinar, and brought one Dinar and a sheep to \nthe Prophet. On that, the Prophet (ﷺ) invoked Allah to bless him in his deals. So `Urwa used to gain (from \nany deal) even if he bought dust. (In another narration) `Urwa said, \"I heard Allah's Messenger (ﷺ) saying, \n\"There is always goodness in horses till the Day of Resurrection.\" (The subnarrator added, \"I saw 70 \nhorses in `Urwa's house.') (Sufyan said, \"The Prophet (ﷺ) asked `Urwa to buy a sheep for him as a \nsacrifice.\")",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا شَبِيبُ بْنُ غَرْقَدَةَ، قَالَ سَمِعْتُ الْحَىَّ، يُحَدِّثُونَ عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ دِينَارًا يَشْتَرِي بِهِ شَاةً، فَاشْتَرَى لَهُ بِهِ شَاتَيْنِ، فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ وَجَاءَهُ بِدِينَارٍ وَشَاةٍ، فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ، وَكَانَ لَوِ اشْتَرَى التُّرَابَ لَرَبِحَ فِيهِ‏.‏ قَالَ سُفْيَانُ كَانَ الْحَسَنُ بْنُ عُمَارَةَ جَاءَنَا بِهَذَا الْحَدِيثِ عَنْهُ، قَالَ سَمِعَهُ شَبِيبٌ مِنْ عُرْوَةَ، فَأَتَيْتُهُ فَقَالَ شَبِيبٌ إِنِّي لَمْ أَسْمَعْهُ مِنْ عُرْوَةَ، قَالَ سَمِعْتُ الْحَىَّ يُخْبِرُونَهُ عَنْهُ‏.‏   وَلَكِنْ سَمِعْتُهُ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْخَيْرُ مَعْقُودٌ بِنَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ وَقَدْ رَأَيْتُ فِي دَارِهِ سَبْعِينَ فَرَسًا‏.‏ قَالَ سُفْيَانُ يَشْتَرِي لَهُ شَاةً كَأَنَّهَا أُضْحِيَّةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3642, 3643In-book reference : Book 61, Hadith 146USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 836   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3643,
    "id": 3643,
    "url": "https://sunnah.com/bukhari:3643",
    "bookNumber": 61,
    "hadithNumber": 146,
    "narrator": "Narrated `Urwa:",
    "english": "That the Prophet (ﷺ) gave him one Dinar so as to buy a sheep for him. `Urwa bought two sheep for him \nwith the money. Then he sold one of the sheep for one Dinar, and brought one Dinar and a sheep to \nthe Prophet. On that, the Prophet (ﷺ) invoked Allah to bless him in his deals. So `Urwa used to gain (from \nany deal) even if he bought dust. (In another narration) `Urwa said, \"I heard Allah's Messenger (ﷺ) saying, \n\"There is always goodness in horses till the Day of Resurrection.\" (The subnarrator added, \"I saw 70 \nhorses in `Urwa's house.') (Sufyan said, \"The Prophet (ﷺ) asked `Urwa to buy a sheep for him as a \nsacrifice.\")",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا شَبِيبُ بْنُ غَرْقَدَةَ، قَالَ سَمِعْتُ الْحَىَّ، يُحَدِّثُونَ عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْطَاهُ دِينَارًا يَشْتَرِي بِهِ شَاةً، فَاشْتَرَى لَهُ بِهِ شَاتَيْنِ، فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ وَجَاءَهُ بِدِينَارٍ وَشَاةٍ، فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ، وَكَانَ لَوِ اشْتَرَى التُّرَابَ لَرَبِحَ فِيهِ‏.‏ قَالَ سُفْيَانُ كَانَ الْحَسَنُ بْنُ عُمَارَةَ جَاءَنَا بِهَذَا الْحَدِيثِ عَنْهُ، قَالَ سَمِعَهُ شَبِيبٌ مِنْ عُرْوَةَ، فَأَتَيْتُهُ فَقَالَ شَبِيبٌ إِنِّي لَمْ أَسْمَعْهُ مِنْ عُرْوَةَ، قَالَ سَمِعْتُ الْحَىَّ يُخْبِرُونَهُ عَنْهُ‏.‏   وَلَكِنْ سَمِعْتُهُ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْخَيْرُ مَعْقُودٌ بِنَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ وَقَدْ رَأَيْتُ فِي دَارِهِ سَبْعِينَ فَرَسًا‏.‏ قَالَ سُفْيَانُ يَشْتَرِي لَهُ شَاةً كَأَنَّهَا أُضْحِيَّةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3642, 3643In-book reference : Book 61, Hadith 146USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 836   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3644,
    "id": 3644,
    "url": "https://sunnah.com/bukhari:3644",
    "bookNumber": 61,
    "hadithNumber": 147,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"There is always goodness in horses till the Day of Resurrection. \"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3644In-book reference : Book 61, Hadith 147USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 837   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3645,
    "id": 3645,
    "url": "https://sunnah.com/bukhari:3645",
    "bookNumber": 61,
    "hadithNumber": 148,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"There is always goodness in horses.\"",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3645In-book reference : Book 61, Hadith 148USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 838   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3646,
    "id": 3646,
    "url": "https://sunnah.com/bukhari:3646",
    "bookNumber": 61,
    "hadithNumber": 149,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A horse may be kept for one of three purposes: for a man it may be a source of \nreward; for another it may be a means of living; and for a third it may be a burden (a source of \ncommitting sins). As for the one for whom it is a source of reward, he is the one who keeps his horse \nfor the sake of Jihad in Allah's Cause; he ties it with a long rope on a pasture or in a garden. So \nwhatever its rope allows it to eat, will be regarded as good rewardable deeds (for its owner). And if it \nbreaks off its rope and jumps over one or two hillocks, even its dung will be considered amongst his \ngood deeds. And if it passes by a river and drinks water from it, that will be considered as good deeds \nfor his benefit) even if he has had no intention of watering it. A horse is a shelter for the one who \nkeeps it so that he may earn his living honestly and takes it as a refuge to keep him from following \nillegal ways (of gaining money), and does not forget the rights of Allah (i.e. paying the Zakat and \nallowing others to use it for Allah's Sake). But a horse is a burden (and a source of committing sins for \nhim who keeps it out of pride and pretense and with the intention of harming the Muslims.\" \nThe Prophet (ﷺ) was asked about donkeys. He replied, \"Nothing has been revealed to be concerning them \nexcept this comprehensive Verse (which covers everything) :--'Then whosoever has done good equal \nto the weight of an atom (or a small ant), Shall see it (its reward) And whosoever has done evil equal \nto the weight of an atom (or a small ) ant), Shall see it (Its punishment).\" (99.7-8)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِثَلاَثَةٍ لِرَجُلٍ أَجْرٌ، وَلِرَجُلٍ سِتْرٌ وَعَلَى رَجُلٍ وِزْرٌ‏.‏ فَأَمَّا الَّذِي لَهُ أَجْرٌ، فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ، فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ، وَمَا أَصَابَتْ فِي طِيَلِهَا مِنَ الْمَرْجِ أَوِ الرَّوْضَةِ كَانَتْ لَهُ حَسَنَاتٍ، وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا، فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ، كَانَتْ أَرْوَاثُهَا حَسَنَاتٍ لَهُ، وَلَوْ أَنَّهَا مَرَّتْ بِنَهْرٍ فَشَرِبَتْ، وَلَمْ يُرِدْ أَنْ يَسْقِيَهَا، كَانَ ذَلِكَ لَهُ حَسَنَاتٍ، وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَسِتْرًا وَتَعَفُّفًا، لَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَظُهُورِهَا، فَهِيَ لَهُ كَذَلِكَ سِتْرٌ‏.‏ وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً، وَنِوَاءً لأَهْلِ الإِسْلاَمِ فَهْىَ وِزْرٌ‏.‏ وَسُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْحُمُرِ فَقَالَ ‏\"‏ مَا أُنْزِلَ عَلَىَّ فِيهَا إِلاَّ هَذِهِ الآيَةُ الْجَامِعَةُ الْفَاذَّةُ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3646In-book reference : Book 61, Hadith 149USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 839   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3647,
    "id": 3647,
    "url": "https://sunnah.com/bukhari:3647",
    "bookNumber": 61,
    "hadithNumber": 150,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) reached Khaibar in the early morning and the people of Khaibar came out with their \nspades, and when they saw the Prophet (ﷺ) they said, \"Muhammad and his army!\" and returned hurriedly \nto take refuge in the fort. The Prophet (ﷺ) raised his hands and said, \"Allah is Greater! Khaibar is ruined ! \nIf we approach a nation, then miserable is the morning of those who are warned.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ صَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ بُكْرَةً وَقَدْ خَرَجُوا بِالْمَسَاحِي، فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَالْخَمِيسُ‏.‏ وَأَحَالُوا إِلَى الْحِصْنِ يَسْعَوْنَ، فَرَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَيْهِ وَقَالَ ‏\n\"‏ اللَّهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3647In-book reference : Book 61, Hadith 150USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 840   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3648,
    "id": 3648,
    "url": "https://sunnah.com/bukhari:3648",
    "bookNumber": 61,
    "hadithNumber": 151,
    "narrator": "Narrated Abu Huraira:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! I hear many narrations from you but I forget them.\" He said, \"Spread your covering sheet.\" I spread my sheet and he moved both his hands as if scooping something and emptied them in the sheet and said, \"Wrap it.\" I wrapped it round my body, and since then I have never forgotten.",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ مِنْكَ كَثِيرًا فَأَنْسَاهُ‏.‏ قَالَ ‏\"‏ ابْسُطْ رِدَاءَكَ ‏\"‏‏.‏ فَبَسَطْتُ فَغَرَفَ بِيَدِهِ فِيهِ، ثُمَّ قَالَ ‏\"‏ ضُمَّهُ ‏\"‏ فَضَمَمْتُهُ، فَمَا نَسِيتُ حَدِيثًا بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3648In-book reference : Book 61, Hadith 151USC-MSA web (English) reference : Vol. 4, Book 56, Hadith 841   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3649,
    "id": 3649,
    "url": "https://sunnah.com/bukhari:3649",
    "bookNumber": 62,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "\"Allah's Messenger (ﷺ) said, \"A time will come upon the people, when a group of people will wage a holy \nwar and it will be said, 'Is there amongst you anyone who has accompanied Allah's Messenger (ﷺ)?' They \nwill say, 'Yes.' And so victory will be bestowed on them. Then a time will come upon the people when \na group of people will wage a holy war, and it will be said, \"Is there amongst you anynone who has \naccompanied the companions of Allah's Messenger (ﷺ)?' They will say, 'Yes.' And so victory will be \nbestowed on them. Then a time will come upon the people when a group of people will wage a holy \nwar, and it will be said, \"Is there amongst you anyone who has been in the company of the \ncompanions of the companions of Allah's Messenger (ﷺ) ?' They will say, 'Yes.' And victory will be \nbestowed on them.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيَقُولُونَ فِيكُمْ مَنْ صَاحَبَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ‏.‏ ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ، ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3649In-book reference : Book 62, Hadith 1USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 1   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3650,
    "id": 3650,
    "url": "https://sunnah.com/bukhari:3650",
    "bookNumber": 62,
    "hadithNumber": 2,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "\"Allah's Messenger (ﷺ) said, 'The best of my followers are those living in my generation (i.e. my \ncontemporaries). and then those who will follow the latter\" `Imran added, \"I do not remember whether \nhe mentioned two or three generations after his generation, then the Prophet (ﷺ) added, 'There will come \nafter you, people who will bear witness without being asked to do so, and will be treacherous and \nuntrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، سَمِعْتُ زَهْدَمَ بْنَ مُضَرِّبٍ، سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ أُمَّتِي قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ فَلاَ أَدْرِي أَذَكَرَ بَعْدَ قَرْنِهِ قَرْنَيْنِ أَوْ ثَلاَثًا ‏\"‏ ثُمَّ إِنَّ بَعْدَكُمْ قَوْمًا يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَنْذُرُونَ وَلاَ يَفُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3650In-book reference : Book 62, Hadith 2USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 2   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3651,
    "id": 3651,
    "url": "https://sunnah.com/bukhari:3651",
    "bookNumber": 62,
    "hadithNumber": 3,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"The best people are those living in my generation, and then those who will follow \nthem, and then those who will follow the latter. Then there will come some people who will bear \nwitness before taking oaths, and take oaths before bearing witness.\" (Ibrahim, a sub-narrator said, \n\"They used to beat us for witnesses and covenants when we were still children.\")",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ قَوْمٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانُوا يَضْرِبُونَا عَلَى الشَّهَادَةِ وَالْعَهْدِ وَنَحْنُ صِغَارٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3651In-book reference : Book 62, Hadith 3USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 3   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3652,
    "id": 3652,
    "url": "https://sunnah.com/bukhari:3652",
    "bookNumber": 62,
    "hadithNumber": 4,
    "narrator": "Narrated Al-Bara':",
    "english": "Abu Bakr bought a (camel) saddle from `Azib for thirteen Dirhams. Abu Bakr said to `Azib, \"Tell Al- \nBara' to carry the saddle for me.\" `Azib said, \"No, unless you relate to me what happened to you and \nAllah's Messenger (ﷺ) when you left Mecca while the pagans were in search of you.\" Abu Bakr said, \"We \nleft Mecca and we traveled continuously for that night and the following day till it was midday. I \nlooked (around) searching for shade to take as shelter, and suddenly I came across a rock, and found a \nlittle shade there. So I cleaned the place and spread a bed for the Prophet (ﷺ) in the shade and said to him, \n'Lie down, O Allah's Messenger (ﷺ).' So the Prophet (ﷺ) lay down and I went out, looking around to see if there \nwas any person pursuing us. Suddenly I saw a shepherd driving his sheep towards the rock, seeking \nwhat we had already sought from it. I asked him, 'To whom do you belong, O boy?' He said, 'I belong \nto a man from Quraish.' He named the man and I recognized him. I asked him, 'Is there any milk with \nyour sheep?' He said, 'Yes.' I said, 'Will you then milk (some) for us?' He said, 'Yes.' Then I asked him \nto tie the legs of one of the sheep and clean its udder, and then ordered him to clean his hands from \ndust. Then the shepherd cleaned his hands by striking his hands against one another. After doing so, \nhe milked a small amount of milk. I used to keep for Allah's Messenger (ﷺ) a leather water-container, the \nmouth of which was covered with a piece of cloth. I poured water on the milk container till its lower \npart was cold. Then I took the milk to the Prophet (ﷺ) whom I found awake. I said to him, 'Drink, O \nAllah's Messenger (ﷺ).' So he drank till I became pleased. Then I said, 'It is time for us to move, O Allah's \nApostle!' He said, 'Yes.' So we set out while the people (i.e. Quraish pagans) were searching for us, \nbut none found us except Suraqah bin Malik bin Ju`shum who was riding his horse. I said, 'These are \nour pursuers who have found us. O Allah's Messenger (ﷺ)!' He said, 'Do not grieve, for Allah is with us.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اشْتَرَى أَبُو بَكْرٍ ـ رضى الله عنه ـ مِنْ عَازِبٍ رَحْلاً بِثَلاَثَةَ عَشَرَ دِرْهَمًا فَقَالَ أَبُو بَكْرٍ لِعَازِبٍ مُرِ الْبَرَاءَ فَلْيَحْمِلْ إِلَىَّ رَحْلِي‏.‏ فَقَالَ عَازِبٌ لاَ حَتَّى تُحَدِّثَنَا كَيْفَ صَنَعْتَ أَنْتَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ خَرَجْتُمَا مِنْ مَكَّةَ وَالْمُشْرِكُونَ يَطْلُبُونَكُمْ قَالَ ارْتَحَلْنَا مِنْ مَكَّةَ، فَأَحْيَيْنَا أَوْ سَرَيْنَا لَيْلَتَنَا وَيَوْمَنَا حَتَّى أَظْهَرْنَا وَقَامَ قَائِمُ الظَّهِيرَةِ، فَرَمَيْتُ بِبَصَرِي هَلْ أَرَى مِنْ ظِلٍّ فَآوِيَ إِلَيْهِ، فَإِذَا صَخْرَةٌ أَتَيْتُهَا فَنَظَرْتُ بَقِيَّةَ ظِلٍّ لَهَا فَسَوَّيْتُهُ، ثُمَّ فَرَشْتُ لِلنَّبِيِّ صلى الله عليه وسلم فِيهِ، ثُمَّ قُلْتُ لَهُ اضْطَجِعْ يَا نَبِيَّ اللَّهِ‏.‏ فَاضْطَجَعَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ انْطَلَقْتُ أَنْظُرُ مَا حَوْلِي، هَلْ أَرَى مِنَ الطَّلَبِ أَحَدًا فَإِذَا أَنَا بِرَاعِي غَنَمٍ يَسُوقُ غَنَمَهُ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا الَّذِي أَرَدْنَا، فَسَأَلْتُهُ فَقُلْتُ لَهُ لِمَنْ أَنْتَ يَا غُلاَمُ قَالَ لِرَجُلٍ مِنْ قُرَيْشٍ سَمَّاهُ فَعَرَفْتُهُ‏.‏ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ‏.‏ قُلْتُ فَهَلْ أَنْتَ حَالِبٌ لَبَنًا قَالَ نَعَمْ‏.‏ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْ غَنَمِهِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ ضَرْعَهَا مِنَ الْغُبَارِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ كَفَّيْهِ، فَقَالَ هَكَذَا ضَرَبَ إِحْدَى كَفَّيْهِ بِالأُخْرَى فَحَلَبَ لِي كُثْبَةً مِنْ لَبَنٍ، وَقَدْ جَعَلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِدَاوَةً عَلَى فَمِهَا خِرْقَةٌ، فَصَبَبْتُ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، فَانْطَلَقْتُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَوَافَقْتُهُ قَدِ اسْتَيْقَظَ، فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قُلْتُ قَدْ آنَ الرَّحِيلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ فَارْتَحَلْنَا وَالْقَوْمُ يَطْلُبُونَا، فَلَمْ يُدْرِكْنَا أَحَدٌ مِنْهُمْ غَيْرُ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ عَلَى فَرَسٍ لَهُ‏.‏ فَقُلْتُ هَذَا الطَّلَبُ قَدْ لَحِقَنَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3652In-book reference : Book 62, Hadith 4USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 4   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3653,
    "id": 3653,
    "url": "https://sunnah.com/bukhari:3653",
    "bookNumber": 62,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Bakr:",
    "english": "I said to the Prophet (ﷺ) while I was in the Cave. \"If any of them should look under his feet, he would see \nus.\" He said, \"O Abu Bakr! What do you think of two (persons) the third of whom is Allah?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنه ـ قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم وَأَنَا فِي الْغَارِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ تَحْتَ قَدَمَيْهِ لأَبْصَرَنَا‏.‏ فَقَالَ ‏\n\"‏ مَا ظَنُّكَ يَا أَبَا بَكْرٍ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3653In-book reference : Book 62, Hadith 5USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 5   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3654,
    "id": 3654,
    "url": "https://sunnah.com/bukhari:3654",
    "bookNumber": 62,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) addressed the people saying, \"Allah has given option to a slave to choose this world or \nwhat is with Him. The slave has chosen what is with Allah.\" Abu Bakr wept, and we were astonished \nat his weeping caused by what the Prophet (ﷺ) mentioned as to a Slave ( of Allah) who had been offered a \nchoice, (we learned later on) that Allah's Messenger (ﷺ) himself was the person who was given the choice, \nand that Abu Bakr knew best of all of us. Allah's Messenger (ﷺ) added, \"The person who has favored me \nmost of all both with his company and wealth, is Abu Bakr. If I were to take a Khalil other than my \nLord, I would have taken Abu Bakr as such, but (what relates us) is the Islamic brotherhood and \nfriendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحٌ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ وَقَالَ ‏\"‏ إِنَّ اللَّهَ خَيَّرَ عَبْدًا بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ فَاخْتَارَ ذَلِكَ الْعَبْدُ مَا عِنْدَ اللَّهِ ‏\"‏‏.‏ قَالَ فَبَكَى أَبُو بَكْرٍ، فَعَجِبْنَا لِبُكَائِهِ أَنْ يُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَبْدٍ خُيِّرَ‏.‏ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ الْمُخَيَّرُ وَكَانَ أَبُو بَكْرٍ أَعْلَمَنَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَمَنِّ النَّاسِ عَلَىَّ فِي صُحْبَتِهِ وَمَالِهِ أَبَا بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلاً غَيْرَ رَبِّي لاَتَّخَذْتُ أَبَا بَكْرٍ، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ وَمَوَدَّتُهُ، لاَ يَبْقَيَنَّ فِي الْمَسْجِد ِباب إِلاَّ سُدَّ، إِلاَّ باب أَبِي بَكْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3654In-book reference : Book 62, Hadith 6USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 6   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3655,
    "id": 3655,
    "url": "https://sunnah.com/bukhari:3655",
    "bookNumber": 62,
    "hadithNumber": 7,
    "narrator": "Narrated Ibn `Umar:",
    "english": "We used to compare the people as to who was better during the lifetime of Allah's Messenger (ﷺ) . We used \nto regard Abu Bakr as the best, then `Umar, and then `Uthman .",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نُخَيِّرُ بَيْنَ النَّاسِ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم فَنُخَيِّرُ أَبَا بَكْرٍ، ثُمَّ عُمَرَ بْنَ الْخَطَّابِ، ثُمَّ عُثْمَانَ بْنَ عَفَّانَ رضى الله عنهم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3655In-book reference : Book 62, Hadith 7USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 7   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3656,
    "id": 3656,
    "url": "https://sunnah.com/bukhari:3656",
    "bookNumber": 62,
    "hadithNumber": 8,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"If I were to take a Khalil, I would have taken Abu Bakr, but he is my brother and \nmy companion (in Islam).",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَلَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي خَلِيلاً لاَتَّخَذْتُ، أَبَا بَكْرٍ وَلَكِنْ أَخِي وَصَاحِبِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3656In-book reference : Book 62, Hadith 8USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 8   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3657,
    "id": 3657,
    "url": "https://sunnah.com/bukhari:3657",
    "bookNumber": 62,
    "hadithNumber": 9,
    "narrator": "Narrated Aiyub:",
    "english": "The Prophet (ﷺ) said, \"If I were to take a Khalil, I would have taken him (i.e. Abu Bakr) as a Khalil, but \nthe Islamic brotherhood is better.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى، وَمُوسَى، قَالاَ حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، وَقَالَ، ‏\n\"‏ لَوْ كُنْتُ مُتَّخِذًا خَلِيلاً لاَتَّخَذْتُهُ خَلِيلاً، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3657In-book reference : Book 62, Hadith 9USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 9   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3658,
    "id": 3658,
    "url": "https://sunnah.com/bukhari:3658",
    "bookNumber": 62,
    "hadithNumber": 10,
    "narrator": "Narrated `Abdullah bin Abi Mulaika:",
    "english": "The people of Kufa sent a letter to Ibn Az-Zubair, asking about (the inheritance of) (paternal) \ngrandfather. He replied that the right of the inheritance of (paternal) grandfather is the same as that of \nfather if the father is dead) and added, \"Allah's Messenger (ﷺ) said, ' If I were to take a Khalil from this \nnation, I would have taken him (i.e. Abu Bakr).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبَ أَهْلُ الْكُوفَةِ إِلَى ابْنِ الزُّبَيْرِ فِي الْجَدِّ‏.‏ فَقَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ ‏\"‏‏.‏ أَنْزَلَهُ أَبًا يَعْنِي أَبَا بَكْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3658In-book reference : Book 62, Hadith 10USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 10   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3659,
    "id": 3659,
    "url": "https://sunnah.com/bukhari:3659",
    "bookNumber": 62,
    "hadithNumber": 11,
    "narrator": "Narrated Jubair bin Mut`im:",
    "english": "A woman came to the Prophet (ﷺ) who ordered her to return to him again. She said, \"What if I came and \ndid not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet (ﷺ) said, \"If you should not \nfind me, go to Abu Bakr.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ‏.‏ قَالَتْ أَرَأَيْتَ إِنْ جِئْتُ وَلَمْ أَجِدْكَ كَأَنَّهَا تَقُولُ الْمَوْتَ‏.‏ قَالَ عَلَيْهِ السَّلاَمُ ‏\n\"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3659In-book reference : Book 62, Hadith 11USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 11   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3660,
    "id": 3660,
    "url": "https://sunnah.com/bukhari:3660",
    "bookNumber": 62,
    "hadithNumber": 12,
    "narrator": "Narrated `Ammar:",
    "english": "I saw Allah's Messenger (ﷺ) and there was none with him but five slaves, two women and Abu Bakr (i.e. \nthose were the only converts to Islam then).",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي الطَّيِّبِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُجَالِدٍ، حَدَّثَنَا بَيَانُ بْنُ بِشْرٍ، عَنْ وَبَرَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ عَمَّارًا، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا مَعَهُ إِلاَّ خَمْسَةُ أَعْبُدٍ وَامْرَأَتَانِ وَأَبُو بَكْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3660In-book reference : Book 62, Hadith 12USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 12   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3661,
    "id": 3661,
    "url": "https://sunnah.com/bukhari:3661",
    "bookNumber": 62,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Ad-Darda:",
    "english": "While I was sitting with the Prophet, Abu Bakr came, lifting up one corner of his garment uncovering \nhis knee. The Prophet (ﷺ) said, \"Your companion has had a quarrel.\" Abu Bakr greeted (the Prophet (ﷺ) ) and \nsaid, \"O Allah's Messenger (ﷺ)! There was something (i.e. quarrel) between me and the Son of Al-Khattab. I \ntalked to him harshly and then regretted that, and requested him to forgive me, but he refused. This is \nwhy I have come to you.\" The Prophet (ﷺ) said thrice, \"O Abu Bakr! May Allah forgive you.\" In the \nmeanwhile, `Umar regretted (his refusal of Abu Bakr's excuse) and went to Abu Bakr's house and \nasked if Abu Bakr was there. They replied in the negative. So he came to the Prophet (ﷺ) and greeted him, \nbut signs of displeasure appeared on the face of the Prophet (ﷺ) till Abu Bakr pitied (`Umar), so he knelt \nand said twice, \"O Allah's Messenger (ﷺ)! By Allah! I was more unjust to him (than he to me).\" The Prophet (ﷺ) \nsaid, \"Allah sent me (as a Prophet) to you (people) but you said (to me), 'You are telling a lie,' while \nAbu Bakr said, 'He has said the truth,' and consoled me with himself and his money.\" He then said \ntwice, \"Won't you then give up harming my companion?\" After that nobody harmed Abu Bakr.",
    "arabic": "حَدَّثَنِي هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَائِذِ اللَّهِ أَبِي إِدْرِيسَ، عَنْ أَبِي الدَّرْدَاءِ ـ رضى الله عنه ـ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَ أَبُو بَكْرٍ آخِذًا بِطَرَفِ ثَوْبِهِ حَتَّى أَبْدَى عَنْ رُكْبَتِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَّا صَاحِبُكُمْ فَقَدْ غَامَرَ ‏\"‏‏.‏ فَسَلَّمَ، وَقَالَ إِنِّي كَانَ بَيْنِي وَبَيْنَ ابْنِ الْخَطَّابِ شَىْءٌ فَأَسْرَعْتُ إِلَيْهِ ثُمَّ نَدِمْتُ، فَسَأَلْتُهُ أَنْ يَغْفِرَ لِي فَأَبَى عَلَىَّ، فَأَقْبَلْتُ إِلَيْكَ فَقَالَ ‏\"‏ يَغْفِرُ اللَّهُ لَكَ يَا أَبَا بَكْرٍ ‏\"‏‏.‏ ثَلاَثًا، ثُمَّ إِنَّ عُمَرَ نَدِمَ فَأَتَى مَنْزِلَ أَبِي بَكْرٍ فَسَأَلَ أَثَمَّ أَبُو بَكْرٍ فَقَالُوا لاَ‏.‏ فَأَتَى إِلَى النَّبِيِّ صلى الله عليه وسلم، فَسَلَّمَ فَجَعَلَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم يَتَمَعَّرُ حَتَّى أَشْفَقَ أَبُو بَكْرٍ، فَجَثَا عَلَى رُكْبَتَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ، وَاللَّهِ أَنَا كُنْتُ أَظْلَمَ مَرَّتَيْنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ بَعَثَنِي إِلَيْكُمْ فَقُلْتُمْ كَذَبْتَ‏.‏ وَقَالَ أَبُو بَكْرٍ صَدَقَ‏.‏ وَوَاسَانِي بِنَفْسِهِ وَمَالِهِ، فَهَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي ‏\"‏‏.‏ مَرَّتَيْنِ فَمَا أُوذِيَ بَعْدَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3661In-book reference : Book 62, Hadith 13USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 13   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3662,
    "id": 3662,
    "url": "https://sunnah.com/bukhari:3662",
    "bookNumber": 62,
    "hadithNumber": 14,
    "narrator": "Narrated `Amr bin Al-As:",
    "english": "The Prophet (ﷺ) deputed me to read the Army of Dhat-as-Salasil. I came to him and said, \"Who is the \nmost beloved person to you?\" He said, \" `Aisha.\" I asked, \"Among the men?\" He said, \"Her father.\" I \nsaid, \"Who then?\" He said, \"Then `Umar bin Al-Khattab.\" He then named other men.",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، قَالَ خَالِدٌ الْحَذَّاءُ حَدَّثَنَا عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ الْعَاصِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ عَلَى جَيْشِ ذَاتِ السَّلاَسِلِ، فَأَتَيْتُهُ فَقُلْتُ أَىُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ ‏\"‏ عَائِشَةُ ‏\"‏‏.‏ فَقُلْتُ مِنَ الرِّجَالِ فَقَالَ ‏\"‏ أَبُوهَا ‏\"‏‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ عُمَرُ بْنُ الْخَطَّابِ ‏\"‏‏.‏ فَعَدَّ رِجَالاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3662In-book reference : Book 62, Hadith 14USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 14   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3663,
    "id": 3663,
    "url": "https://sunnah.com/bukhari:3663",
    "bookNumber": 62,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"While a shepherd was amongst his sheep, a wolf attacked them and \ntook away one sheep. When the shepherd chased the wolf, the wolf turned towards him and said, \n'Who will be its guard on the day of wild animals when nobody except I will be its shepherd. And \nwhile a man was driving a cow with a load on it, it turned towards him and spoke to him saying, 'I \nhave not been created for this purpose, but for ploughing.\" The people said, \"Glorified be Allah.\" The \nProphet said, \"But I believe in it and so does Abu Bakr end `Umar.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ عَدَا عَلَيْهِ الذِّئْبُ، فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهُ الرَّاعِي، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ مَنْ لَهَا يَوْمَ السَّبُعِ، يَوْمَ لَيْسَ لَهَا رَاعٍ غَيْرِي، وَبَيْنَا رَجُلٌ يَسُوقُ بَقَرَةً قَدْ حَمَلَ عَلَيْهَا، فَالْتَفَتَتْ إِلَيْهِ فَكَلَّمَتْهُ فَقَالَتْ إِنِّي لَمْ أُخْلَقْ لِهَذَا، وَلَكِنِّي خُلِقْتُ لِلْحَرْثِ ‏\"‏‏.‏ قَالَ النَّاسُ سُبْحَانَ اللَّهِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُومِنُ بِذَلِكَ وَأَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ رضى الله عنهما ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3663In-book reference : Book 62, Hadith 15USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 15   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3664,
    "id": 3664,
    "url": "https://sunnah.com/bukhari:3664",
    "bookNumber": 62,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw myself standing at a well, on it there was \na bucket. I drew water from the well as much as Allah wished. Then Ibn Abi Quhafa (i.e. Abu Bakr) \ntook the bucket from me and brought out one or two buckets (of water) and there was weakness in his \ndrawing the water. May Allah forgive his weakness for him. Then the bucket turned into a very big \none and Ibn Al-Khattab took it over and I had never seen such a mighty person amongst the people as \nhim in performing such hard work, till the people drank to their satisfaction and watered their camels \nthat knelt down there.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ عَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ، فَنَزَعَ بِهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ ضَعْفَهُ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا ابْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3664In-book reference : Book 62, Hadith 16USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 16   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3665,
    "id": 3665,
    "url": "https://sunnah.com/bukhari:3665",
    "bookNumber": 62,
    "hadithNumber": 17,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "That Allah's Messenger (ﷺ) said, \"Allah will not look on the Day of Judgment at him who drags his robe \n(behind him) out of pride.\" Abu Bakr said \"One side of my robe slacks down unless I get very \ncautious about it.\" Allah's Messenger (ﷺ) said, \"But you do not do that with a pride.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّ أَحَدَ شِقَّىْ ثَوْبِي يَسْتَرْخِي إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَسْتَ تَصْنَعُ ذَلِكَ خُيَلاَءَ ‏\"‏ قَالَ مُوسَى فَقُلْتُ لِسَالِمٍ أَذَكَرَ عَبْدُ اللَّهِ مَنْ جَرَّ إِزَارَهُ قَالَ لَمْ أَسْمَعْهُ ذَكَرَ إِلاَّ ثَوْبَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3665In-book reference : Book 62, Hadith 17USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 17   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3666,
    "id": 3666,
    "url": "https://sunnah.com/bukhari:3666",
    "bookNumber": 62,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Anybody who spends a pair of something in Allah's Cause will be \ncalled from all the gates of Paradise, \"O Allah's slave! This is good.' He who is amongst those who \npray will be called from the gate of the prayer (in Paradise) and he who is from the people of Jihad \nwill be called from the gate of Jihad, and he who is from those' who give in charity (i.e. Zakat) will be \ncalled from the gate of charity, and he who is amongst those who observe fast will be called from the \ngate of fasting, the gate of Raiyan.\" Abu Bakr said, \"He who is called from all those gates will need \nnothing,\" He added, \"Will anyone be called from all those gates, O Allah's Messenger (ﷺ)?\" He said, \"Yes, \nand I hope you will be among those, O Abu Bakr.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَىْءٍ مِنَ الأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَابِ ـ يَعْنِي الْجَنَّةَ ـ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ، فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ باب الصَّلاَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ باب الْجِهَادِ، وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ باب الصَّدَقَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ باب الصِّيَامِ، وَبَابِ الرَّيَّانِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ مَا عَلَى هَذَا الَّذِي يُدْعَى مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ، وَقَالَ هَلْ يُدْعَى مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ، وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ يَا أَبَا بَكْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3666In-book reference : Book 62, Hadith 18USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 18   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3667,
    "id": 3667,
    "url": "https://sunnah.com/bukhari:3667",
    "bookNumber": 62,
    "hadithNumber": 19,
    "narrator": "Narrated 'Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) died while Abu Bakr was at a place called As-Sunah (Al-'Aliya) 'Umar stood up and said, \"By Allah! Allah's Messenger (ﷺ) is not dead!\" 'Umar (later on) said, \"By Allah! Nothing occurred to my mind except that.\" He said, \"Verily! Allah will resurrect him and he will cut the hands and legs of some men.\" Then Abu Bakr came and uncovered the face of Allah's Messenger (ﷺ), kissed him and said, \"Let my mother and father be sacrificed for you, (O Allah's Messenger (ﷺ)), you are good in life and in death. By Allah in Whose Hands my life is, Allah will never make you taste death twice.\" Then he went out and said, \"O oath-taker! Don't be hasty.\" When Abu Bakr spoke, 'Umar sat down. Abu Bakr praised and glorified Allah and said, No doubt! Whoever worshipped Muhammad, then Muhammad is dead, but whoever worshipped Allah, then Allah is Alive and shall never die.\" Then he recited Allah's Statement.:-- \"(O Muhammad) Verily you will die, and they also will die.\" (39.30) He also recited:--  \"Muhammad is no more than an Apostle; and indeed many Apostles have passed away, before him, If he dies Or is killed, will you then Turn back on your heels? And he who turns back On his heels, not the least Harm will he do to Allah And Allah will give reward to those Who are grateful.\" (3.144)  The people wept loudly, and the Ansar were assembled with Sad bin 'Ubada in the shed of Bani Saida. They said (to the emigrants). \"There should be one 'Amir from us and one from you.\" Then Abu Bakr, Umar bin Al-Khattab and Abu 'baida bin Al-Jarrah went to them. 'Umar wanted to speak but Abu Bakr stopped him. 'Umar later on used to say, \"By Allah, I intended only to say something that appealed to me and I was afraid that Abu Bakr would not speak so well. Then Abu Bakr spoke and his speech was very eloquent. He said in his statement, \"We are the rulers and you (Ansars) are the ministers (i.e. advisers),\" Hubab bin Al-Mundhir said, \"No, by Allah we won't accept this. But there must be a ruler from us and a ruler from you.\" Abu Bakr said, \"No, we will be the rulers and you will be the ministers, for they (i.e. Quarish) are the best family amongst the 'Arabs and of best origin. So you should elect either 'Umar or Abu 'Ubaida bin Al-Jarrah as your ruler.\" 'Umar said (to Abu Bakr), \"No but we elect you, for you are our chief and the best amongst us and the most beloved of all of us to Allah's Messenger (ﷺ).\" So 'Umar took Abu Bakr's hand and gave the pledge of allegiance and the people too gave the pledge of allegiance to Abu Bakr. Someone said, \"You have killed Sad bin Ubada.\" 'Umar said, \"Allah has killed him.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَاتَ وَأَبُو بَكْرٍ بِالسُّنْحِ ـ قَالَ إِسْمَاعِيلُ يَعْنِي بِالْعَالِيَةِ ـ فَقَامَ عُمَرُ يَقُولُ وَاللَّهِ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَقَالَ عُمَرُ وَاللَّهِ مَا كَانَ يَقَعُ فِي نَفْسِي إِلاَّ ذَاكَ وَلَيَبْعَثَنَّهُ اللَّهُ فَلَيَقْطَعَنَّ أَيْدِيَ رِجَالٍ وَأَرْجُلَهُمْ‏.‏ فَجَاءَ أَبُو بَكْرٍ فَكَشَفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَّلَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي طِبْتَ حَيًّا وَمَيِّتًا، وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُذِيقُكَ اللَّهُ الْمَوْتَتَيْنِ أَبَدًا‏.‏ ثُمَّ خَرَجَ فَقَالَ أَيُّهَا الْحَالِفُ عَلَى رِسْلِكَ‏.‏ فَلَمَّا تَكَلَّمَ أَبُو بَكْرٍ جَلَسَ عُمَرُ‏.‏ فَحَمِدَ اللَّهَ أَبُو بَكْرٍ وَأَثْنَى عَلَيْهِ وَقَالَ أَلاَ مَنْ كَانَ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ‏.‏ وَقَالَ ‏{‏إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ‏}‏ وَقَالَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ‏}‏ قَالَ فَنَشَجَ النَّاسُ يَبْكُونَ ـ قَالَ ـ وَاجْتَمَعَتِ الأَنْصَارُ إِلَى سَعْدِ بْنِ عُبَادَةَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَقَالُوا مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَذَهَبَ إِلَيْهِمْ أَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ، فَذَهَبَ عُمَرُ يَتَكَلَّمُ فَأَسْكَتَهُ أَبُو بَكْرٍ، وَكَانَ عُمَرُ يَقُولُ وَاللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلاَّ أَنِّي قَدْ هَيَّأْتُ كَلاَمًا قَدْ أَعْجَبَنِي خَشِيتُ أَنْ لاَ يَبْلُغَهُ أَبُو بَكْرٍ، ثُمَّ تَكَلَّمَ أَبُو بَكْرٍ فَتَكَلَّمَ أَبْلَغَ النَّاسِ فَقَالَ فِي كَلاَمِهِ نَحْنُ الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ‏.‏ فَقَالَ حُبَابُ بْنُ الْمُنْذِرِ لاَ وَاللَّهِ لاَ نَفْعَلُ، مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ، وَلَكِنَّا الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ هُمْ أَوْسَطُ الْعَرَبِ دَارًا، وَأَعْرَبُهُمْ أَحْسَابًا فَبَايِعُوا عُمَرَ أَوْ أَبَا عُبَيْدَةَ‏.‏ فَقَالَ عُمَرُ بَلْ نُبَايِعُكَ أَنْتَ، فَأَنْتَ سَيِّدُنَا وَخَيْرُنَا وَأَحَبُّنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَخَذَ عُمَرُ بِيَدِهِ فَبَايَعَهُ، وَبَايَعَهُ النَّاسُ، فَقَالَ قَائِلٌ قَتَلْتُمْ سَعْدَ بْنَ عُبَادَةَ‏.‏ فَقَالَ عُمَرُ قَتَلَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3667, 3668In-book reference : Book 62, Hadith 19USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3668,
    "id": 3668,
    "url": "https://sunnah.com/bukhari:3668",
    "bookNumber": 62,
    "hadithNumber": 19,
    "narrator": "Narrated 'Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) died while Abu Bakr was at a place called As-Sunah (Al-'Aliya) 'Umar stood up and said, \"By Allah! Allah's Messenger (ﷺ) is not dead!\" 'Umar (later on) said, \"By Allah! Nothing occurred to my mind except that.\" He said, \"Verily! Allah will resurrect him and he will cut the hands and legs of some men.\" Then Abu Bakr came and uncovered the face of Allah's Messenger (ﷺ), kissed him and said, \"Let my mother and father be sacrificed for you, (O Allah's Messenger (ﷺ)), you are good in life and in death. By Allah in Whose Hands my life is, Allah will never make you taste death twice.\" Then he went out and said, \"O oath-taker! Don't be hasty.\" When Abu Bakr spoke, 'Umar sat down. Abu Bakr praised and glorified Allah and said, No doubt! Whoever worshipped Muhammad, then Muhammad is dead, but whoever worshipped Allah, then Allah is Alive and shall never die.\" Then he recited Allah's Statement.:-- \"(O Muhammad) Verily you will die, and they also will die.\" (39.30) He also recited:--  \"Muhammad is no more than an Apostle; and indeed many Apostles have passed away, before him, If he dies Or is killed, will you then Turn back on your heels? And he who turns back On his heels, not the least Harm will he do to Allah And Allah will give reward to those Who are grateful.\" (3.144)  The people wept loudly, and the Ansar were assembled with Sad bin 'Ubada in the shed of Bani Saida. They said (to the emigrants). \"There should be one 'Amir from us and one from you.\" Then Abu Bakr, Umar bin Al-Khattab and Abu 'baida bin Al-Jarrah went to them. 'Umar wanted to speak but Abu Bakr stopped him. 'Umar later on used to say, \"By Allah, I intended only to say something that appealed to me and I was afraid that Abu Bakr would not speak so well. Then Abu Bakr spoke and his speech was very eloquent. He said in his statement, \"We are the rulers and you (Ansars) are the ministers (i.e. advisers),\" Hubab bin Al-Mundhir said, \"No, by Allah we won't accept this. But there must be a ruler from us and a ruler from you.\" Abu Bakr said, \"No, we will be the rulers and you will be the ministers, for they (i.e. Quarish) are the best family amongst the 'Arabs and of best origin. So you should elect either 'Umar or Abu 'Ubaida bin Al-Jarrah as your ruler.\" 'Umar said (to Abu Bakr), \"No but we elect you, for you are our chief and the best amongst us and the most beloved of all of us to Allah's Messenger (ﷺ).\" So 'Umar took Abu Bakr's hand and gave the pledge of allegiance and the people too gave the pledge of allegiance to Abu Bakr. Someone said, \"You have killed Sad bin Ubada.\" 'Umar said, \"Allah has killed him.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَاتَ وَأَبُو بَكْرٍ بِالسُّنْحِ ـ قَالَ إِسْمَاعِيلُ يَعْنِي بِالْعَالِيَةِ ـ فَقَامَ عُمَرُ يَقُولُ وَاللَّهِ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَقَالَ عُمَرُ وَاللَّهِ مَا كَانَ يَقَعُ فِي نَفْسِي إِلاَّ ذَاكَ وَلَيَبْعَثَنَّهُ اللَّهُ فَلَيَقْطَعَنَّ أَيْدِيَ رِجَالٍ وَأَرْجُلَهُمْ‏.‏ فَجَاءَ أَبُو بَكْرٍ فَكَشَفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَّلَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي طِبْتَ حَيًّا وَمَيِّتًا، وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُذِيقُكَ اللَّهُ الْمَوْتَتَيْنِ أَبَدًا‏.‏ ثُمَّ خَرَجَ فَقَالَ أَيُّهَا الْحَالِفُ عَلَى رِسْلِكَ‏.‏ فَلَمَّا تَكَلَّمَ أَبُو بَكْرٍ جَلَسَ عُمَرُ‏.‏ فَحَمِدَ اللَّهَ أَبُو بَكْرٍ وَأَثْنَى عَلَيْهِ وَقَالَ أَلاَ مَنْ كَانَ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ‏.‏ وَقَالَ ‏{‏إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ‏}‏ وَقَالَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ‏}‏ قَالَ فَنَشَجَ النَّاسُ يَبْكُونَ ـ قَالَ ـ وَاجْتَمَعَتِ الأَنْصَارُ إِلَى سَعْدِ بْنِ عُبَادَةَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَقَالُوا مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَذَهَبَ إِلَيْهِمْ أَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ، فَذَهَبَ عُمَرُ يَتَكَلَّمُ فَأَسْكَتَهُ أَبُو بَكْرٍ، وَكَانَ عُمَرُ يَقُولُ وَاللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلاَّ أَنِّي قَدْ هَيَّأْتُ كَلاَمًا قَدْ أَعْجَبَنِي خَشِيتُ أَنْ لاَ يَبْلُغَهُ أَبُو بَكْرٍ، ثُمَّ تَكَلَّمَ أَبُو بَكْرٍ فَتَكَلَّمَ أَبْلَغَ النَّاسِ فَقَالَ فِي كَلاَمِهِ نَحْنُ الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ‏.‏ فَقَالَ حُبَابُ بْنُ الْمُنْذِرِ لاَ وَاللَّهِ لاَ نَفْعَلُ، مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ، وَلَكِنَّا الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ هُمْ أَوْسَطُ الْعَرَبِ دَارًا، وَأَعْرَبُهُمْ أَحْسَابًا فَبَايِعُوا عُمَرَ أَوْ أَبَا عُبَيْدَةَ‏.‏ فَقَالَ عُمَرُ بَلْ نُبَايِعُكَ أَنْتَ، فَأَنْتَ سَيِّدُنَا وَخَيْرُنَا وَأَحَبُّنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَخَذَ عُمَرُ بِيَدِهِ فَبَايَعَهُ، وَبَايَعَهُ النَّاسُ، فَقَالَ قَائِلٌ قَتَلْتُمْ سَعْدَ بْنَ عُبَادَةَ‏.‏ فَقَالَ عُمَرُ قَتَلَهُ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3667, 3668In-book reference : Book 62, Hadith 19USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3669,
    "id": 3669,
    "url": "https://sunnah.com/bukhari:3669",
    "bookNumber": 62,
    "hadithNumber": 20,
    "narrator": "'Aisha said (in another narration), (\"When the Prophet (ﷺ) was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:",
    "english": "-- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
    "arabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ سَالِمٍ عَنِ الزُّبَيْدِيِّ، قَالَ عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ أَخْبَرَنِي الْقَاسِمُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ شَخَصَ بَصَرُ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ ثَلاَثًا، وَقَصَّ الْحَدِيثَ، قَالَتْ فَمَا كَانَتْ مِنْ خُطْبَتِهِمَا مِنْ خُطْبَةٍ إِلاَّ نَفَعَ اللَّهُ بِهَا، لَقَدْ خَوَّفَ عُمَرُ النَّاسَ وَإِنَّ فِيهِمْ لَنِفَاقًا، فَرَدَّهُمُ اللَّهُ بِذَلِكَ‏.‏ ثُمَّ لَقَدْ بَصَّرَ أَبُو بَكْرٍ النَّاسَ الْهُدَى وَعَرَّفَهُمُ الْحَقَّ الَّذِي عَلَيْهِمْ وَخَرَجُوا بِهِ يَتْلُونَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3669, 3670In-book reference : Book 62, Hadith 20USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3670,
    "id": 3670,
    "url": "https://sunnah.com/bukhari:3670",
    "bookNumber": 62,
    "hadithNumber": 20,
    "narrator": "'Aisha said (in another narration), (\"When the Prophet (ﷺ) was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:",
    "english": "-- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
    "arabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ سَالِمٍ عَنِ الزُّبَيْدِيِّ، قَالَ عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ أَخْبَرَنِي الْقَاسِمُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ شَخَصَ بَصَرُ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ ثَلاَثًا، وَقَصَّ الْحَدِيثَ، قَالَتْ فَمَا كَانَتْ مِنْ خُطْبَتِهِمَا مِنْ خُطْبَةٍ إِلاَّ نَفَعَ اللَّهُ بِهَا، لَقَدْ خَوَّفَ عُمَرُ النَّاسَ وَإِنَّ فِيهِمْ لَنِفَاقًا، فَرَدَّهُمُ اللَّهُ بِذَلِكَ‏.‏ ثُمَّ لَقَدْ بَصَّرَ أَبُو بَكْرٍ النَّاسَ الْهُدَى وَعَرَّفَهُمُ الْحَقَّ الَّذِي عَلَيْهِمْ وَخَرَجُوا بِهِ يَتْلُونَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 3669, 3670In-book reference : Book 62, Hadith 20USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 19   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3671,
    "id": 3671,
    "url": "https://sunnah.com/bukhari:3671",
    "bookNumber": 62,
    "hadithNumber": 21,
    "narrator": "Narrated Muhammad bin Al-Hanafiya:",
    "english": "I asked my father (`Ali bin Abi Talib), \"Who are the best people after Allah's Messenger (ﷺ) ?\" He said, \n\"Abu Bakr.\" I asked, \"Who then?\" He said, \"Then `Umar. \" I was afraid he would say \"Uthman, so I \nsaid, \"Then you?\" He said, \"I am only an ordinary person.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا جَامِعُ بْنُ أَبِي رَاشِدٍ، حَدَّثَنَا أَبُو يَعْلَى، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، قَالَ قُلْتُ لأَبِي أَىُّ النَّاسِ خَيْرٌ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ثُمَّ عُمَرُ‏.‏ وَخَشِيتُ أَنْ يَقُولَ عُثْمَانُ قُلْتُ ثُمَّ أَنْتَ قَالَ مَا أَنَا إِلاَّ رَجُلٌ مِنَ الْمُسْلِمِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3671In-book reference : Book 62, Hadith 21USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 20   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3672,
    "id": 3672,
    "url": "https://sunnah.com/bukhari:3672",
    "bookNumber": 62,
    "hadithNumber": 22,
    "narrator": "Narrated `Aisha:",
    "english": "We went out with Allah's Messenger (ﷺ) on one of his journeys till we reached Al-Baida or Dhatul-Jaish \nwhere my necklace got broken (and lost). Allah's Messenger (ﷺ) stopped to search for it and the people too \nstopped with him. There was no water at that place and they had no water with them. So they went to \nAbu Bakr and said, \"Don't you see what `Aisha has done? She has made Allah's Messenger (ﷺ) and the \npeople stop where there is no water and they have no water with them. Abu Bakr came while Allah's \nApostle was sleeping with his head on my thigh and said, \"You detained Allah Apostle and the people \nwhere there is no water and they have no water.\" He then admonished me and said what Allah wished \nand pinched me at my flanks with his hands, but I did not move because the head of Allah's Messenger (ﷺ) \nwas on my thigh . \nAllah's Messenger (ﷺ) kept on sleeping till be got up in the morning and found no water. Then Allah revealed \nthe Divine Verse of Tayammum, and the people performed Tayammum. Usaid bin AlHudair said. \"O \nfamily of Abu Bakr! This is not the first blessings of yours.\" We urged the camel on which I was \nsitting to get up from its place and the necklace was found under it.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَأَتَى النَّاسُ أَبَا بَكْرٍ، فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ فَعَاتَبَنِي، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ، فَتَيَمَّمُوا، فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ فَقَالَتْ عَائِشَةُ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3672In-book reference : Book 62, Hadith 22USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 21   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3673,
    "id": 3673,
    "url": "https://sunnah.com/bukhari:3673",
    "bookNumber": 62,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The Prophet (ﷺ) said, \"Do not abuse my companions for if any one of you spent gold equal to Uhud (in \nAllah's Cause) it would not be equal to a Mud or even a half Mud spent by one of them.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسُبُّوا أَصْحَابِي، فَلَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيفَهُ ‏\"‏‏.‏ تَابَعَهُ جَرِيرٌ وَعَبْدُ اللَّهِ بْنُ دَاوُدَ وَأَبُو مُعَاوِيَةَ وَمُحَاضِرٌ عَنِ الأَعْمَشِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3673In-book reference : Book 62, Hadith 23USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 22   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3674,
    "id": 3674,
    "url": "https://sunnah.com/bukhari:3674",
    "bookNumber": 62,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "I performed ablution in my house and then went out and said, \"Today I shall stick to Allah's Messenger (ﷺ) \nand stay with him all this day of mine (in his service).\" I went to the Mosque and asked about the \nProphet . They said, \"He had gone in this direction.\" So I followed his way, asking about him till he \nentered a place called Bir Aris. I sat at its gate that was made of date-palm leaves till the Prophet (ﷺ) \nfinished answering the call of nature and performed ablution. Then I went up to him to see him sitting \nat the well of Aris at the middle of its edge with his legs uncovered, hanging in the well. I greeted him \nand went back and sat at the gate. I said, \"Today I will be the gatekeeper of the Prophet.\" Abu Bakr \ncame and pushed the gate. I asked, \"Who is it?\" He said, \"Abu Bakr.\" \nI told him to wait, went in and said, \"O Allah's Messenger (ﷺ)! Abu Bakr asks for permission to enter.\" He \nsaid, \"Admit him and give him the glad tidings that he will be in Paradise.\" So I went out and said to \nAbu Bakr, \"Come in, and Allah's Messenger (ﷺ) gives you the glad tidings that you will be in Paradise\" Abu \nBakr entered and sat on the right side of Allah's Messenger (ﷺ) on the built edge of the well and hung his legs \nn the well as the Prophet (ﷺ) did and uncovered his legs. I then returned and sat (at the gate). I had left my \nbrother performing ablution and he intended to follow me. So I said (to myself). \"If Allah wants good \nfor so-and-so (i.e. my brother) He will bring him here.\" \nSuddenly somebody moved the door. I asked, \"Who is it?\" He said, \"`Umar bin Al-Khattab.\" I asked \nhim to wait, went to Allah's Messenger (ﷺ), greeted him and said, `Umar bin Al-Khattab asks the permission \nto enter.\" He said, \"Admit him, and give him the glad tidings that he will be in Paradise.\" I went to \n\"`Umar and said \"Come in, and Allah's Messenger (ﷺ), gives you the glad tidings that you will be in \nParadise.\" So he entered and sat beside Allah's Messenger (ﷺ) on the built edge of the well on the left side \nand hung his legs in the well. I returned and sat (at the gate) and said, (to myself), \"If Allah wants \ngood for so-and-so, He will bring him here.\" Somebody came and moved the door. I asked \"Who is \nit?\" He replied, \"Uthman bin `Affan.\" I asked him to wait and went to the Prophet (ﷺ) and informed him. \nHe said, \"Admit him, and give him the glad tidings of entering Paradise, I asked him to wait and went \nto the Prophet (ﷺ) and informed him. He said, \"Adult him, and give him the glad tidings of entering \nParadise after a calamity that will befall him.\" So I went up to him and said to him, \"Come in; Allah's \nApostle gives you the glad tidings of entering Paradise after a calamity that will befall you. \"Uthman \nthen came in and found that the built edge of the well was occupied, so he sat opposite to the Prophet (ﷺ) \non the other side. Sa`id bin Al-Musaiyab said, \"I interpret this (narration) in terms of their graves.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ أَبُو الْحَسَنِ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا سُلَيْمَانُ، عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ أَخْبَرَنِي أَبُو مُوسَى الأَشْعَرِيُّ، أَنَّهُ تَوَضَّأَ فِي بَيْتِهِ ثُمَّ خَرَجَ، فَقُلْتُ لأَلْزَمَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَلأَكُونَنَّ مَعَهُ يَوْمِي هَذَا‏.‏ قَالَ فَجَاءَ الْمَسْجِدَ، فَسَأَلَ عَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا خَرَجَ وَوَجَّهَ هَا هُنَا، فَخَرَجْتُ عَلَى إِثْرِهِ أَسْأَلُ عَنْهُ، حَتَّى دَخَلَ بِئْرَ أَرِيسٍ، فَجَلَسْتُ عِنْدَ الْبَابِ، وَبَابُهَا مِنْ جَرِيدٍ حَتَّى قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم حَاجَتَهُ، فَتَوَضَّأَ فَقُمْتُ إِلَيْهِ، فَإِذَا هُوَ جَالِسٌ عَلَى بِئْرِ أَرِيسٍ، وَتَوَسَّطَ قُفَّهَا، وَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ انْصَرَفْتُ، فَجَلَسْتُ عِنْدَ الْبَابِ، فَقُلْتُ لأَكُونَنَّ بَوَّابَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْيَوْمَ، فَجَاءَ أَبُو بَكْرٍ فَدَفَعَ الْبَابَ‏.‏ فَقُلْتُ مَنْ هَذَا فَقَالَ أَبُو بَكْرٍ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ ثُمَّ ذَهَبْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا أَبُو بَكْرٍ يَسْتَأْذِنُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَأَقْبَلْتُ حَتَّى قُلْتُ لأَبِي بَكْرٍ ادْخُلْ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُبَشِّرُكَ بِالْجَنَّةِ‏.‏ فَدَخَلَ أَبُو بَكْرٍ فَجَلَسَ عَنْ يَمِينِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَهُ فِي الْقُفِّ، وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ، كَمَا صَنَعَ النَّبِيُّ صلى الله عليه وسلم، وَكَشَفَ عَنْ سَاقَيْهِ، ثُمَّ رَجَعْتُ فَجَلَسْتُ وَقَدْ تَرَكْتُ أَخِي يَتَوَضَّأُ وَيَلْحَقُنِي، فَقُلْتُ إِنْ يُرِدِ اللَّهُ بِفُلاَنٍ خَيْرًا ـ يُرِيدُ أَخَاهُ ـ يَأْتِ بِهِ‏.‏ فَإِذَا إِنْسَانٌ يُحَرِّكُ الْبَابَ‏.‏ فَقُلْتُ مَنْ هَذَا فَقَالَ عُمَرُ بْنُ الْخَطَّابِ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ ثُمَّ جِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ، فَقُلْتُ هَذَا عُمَرُ بْنُ الْخَطَّابِ يَسْتَأْذِنُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ ادْخُلْ وَبَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْجَنَّةِ‏.‏ فَدَخَلَ، فَجَلَسَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْقُفِّ عَنْ يَسَارِهِ، وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ، ثُمَّ رَجَعْتُ فَجَلَسْتُ، فَقُلْتُ إِنْ يُرِدِ اللَّهُ بِفُلاَنٍ خَيْرًا يَأْتِ بِهِ‏.‏ فَجَاءَ إِنْسَانٌ يُحَرِّكُ الْبَابَ، فَقُلْتُ مَنْ هَذَا فَقَالَ عُثْمَانُ بْنُ عَفَّانَ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُهُ ‏\"‏ فَجِئْتُهُ فَقُلْتُ لَهُ ادْخُلْ وَبَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُكَ‏.‏ فَدَخَلَ فَوَجَدَ الْقُفَّ قَدْ مُلِئَ، فَجَلَسَ وُجَاهَهُ مِنَ الشِّقِّ الآخَرِ‏.‏ قَالَ شَرِيكٌ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَأَوَّلْتُهَا قُبُورَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3674In-book reference : Book 62, Hadith 24USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 23   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3675,
    "id": 3675,
    "url": "https://sunnah.com/bukhari:3675",
    "bookNumber": 62,
    "hadithNumber": 25,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) once climbed the mountain of Uhud with Abu Bakr, `Umar and `Uthman. The mountain \nshook with them. The Prophet (ﷺ) said (to the mountain), \"Be firm, O Uhud! For on you there are no more \nthan a Prophet, a Siddiq and two martyrs.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَعِدَ أُحُدًا وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ فَقَالَ ‏\n\"‏ اثْبُتْ أُحُدُ فَإِنَّمَا عَلَيْكَ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3675In-book reference : Book 62, Hadith 25USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 24   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3676,
    "id": 3676,
    "url": "https://sunnah.com/bukhari:3676",
    "bookNumber": 62,
    "hadithNumber": 26,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said. \"While (in a dream), I was standing by a well, drawing water from it. Abu Bakr \nand `Umar came to me. Abu Bakr took the bucket (from me) and drew one or two buckets of water, \nand there was some weakness in his drawing. May Allah forgive him. Then Ibn Al-Khattab took the \nbucket from Abu Bakr, and the bucket turned into a very large one in his hands. I had never seen such \na mighty person amongst the people as him in performing such hard work. He drew so much water \nthat the people drank to their satisfaction and watered their camels.\" (Wahab, a sub-narrator said, \"till \ntheir camels drank and knelt down.\")",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا صَخْرٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بَيْنَمَا أَنَا عَلَى بِئْرٍ أَنْزِعُ مِنْهَا جَاءَنِي أَبُو بَكْرٍ وَعُمَرُ، فَأَخَذَ أَبُو بَكْرٍ الدَّلْوَ، فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ أَخَذَهَا ابْنُ الْخَطَّابِ مِنْ يَدِ أَبِي بَكْرٍ، فَاسْتَحَالَتْ فِي يَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرِيَّهُ، فَنَزَعَ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏ قَالَ وَهْبٌ الْعَطَنُ مَبْرَكُ الإِبِلِ، يَقُولُ حَتَّى رَوِيَتِ الإِبِلُ فَأَنَاخَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3676In-book reference : Book 62, Hadith 26USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 25   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3677,
    "id": 3677,
    "url": "https://sunnah.com/bukhari:3677",
    "bookNumber": 62,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "While I was standing amongst the people who were invoking Allah for `Umar bin Al-Khattab who \nwas lying (dead) on his bed, a man behind me rested his elbows on my shoulder and said, \"(O `Umar!) \nMay Allah bestow His Mercy on you. I always hoped that Allah will keep you with your two \ncompanions, for I often heard Allah's Messenger (ﷺ) saying, \"I, Abu Bakr and `Umar were (somewhere). I, \nAbu Bakr and `Umar did (something). I, Abu Bakr and `Umar set out.' So I hoped that Allah will keep \nyou with both of them.\" I turned back to see that the speaker was `Ali bin Abi Talib.",
    "arabic": "حَدَّثَنِي الْوَلِيدُ بْنُ صَالِحٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي الْحُسَيْنِ الْمَكِّيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنِّي لَوَاقِفٌ فِي قَوْمٍ، فَدَعَوُا اللَّهَ لِعُمَرَ بْنِ الْخَطَّابِ وَقَدْ وُضِعَ عَلَى سَرِيرِهِ، إِذَا رَجُلٌ مِنْ خَلْفِي قَدْ وَضَعَ مِرْفَقَهُ عَلَى مَنْكِبِي، يَقُولُ رَحِمَكَ اللَّهُ، إِنْ كُنْتُ لأَرْجُو أَنْ يَجْعَلَكَ اللَّهُ مَعَ صَاحِبَيْكَ، لأَنِّي كَثِيرًا مِمَّا كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ كُنْتُ وَأَبُو بَكْرٍ وَعُمَرُ، وَفَعَلْتُ وَأَبُو بَكْرٍ وَعُمَرُ، وَانْطَلَقْتُ وَأَبُو بَكْرٍ وَعُمَرُ‏.‏ فَإِنْ كُنْتُ لأَرْجُو أَنْ يَجْعَلَكَ اللَّهُ مَعَهُمَا‏.‏ فَالْتَفَتُّ فَإِذَا هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3677In-book reference : Book 62, Hadith 27USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 26   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3678,
    "id": 3678,
    "url": "https://sunnah.com/bukhari:3678",
    "bookNumber": 62,
    "hadithNumber": 28,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "I asked `Abdullah bin `Amr, \"What was the worst thing the pagans did to Allah's Messenger (ﷺ)?\" He said, \"I \nsaw `Uqba bin Abi Mu'ait coming to the Prophet (ﷺ) while he was praying.' `Uqba put his sheet round the \nProphet's neck and squeezed it very severely. Abu Bakr came and pulled `Uqba away from the \nProphet and said, \"Do you intend to kill a man just because he says: 'My Lord is Allah, and he has \nbrought forth to you the Evident Signs from your Lord?\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ يَزِيدَ الْكُوفِيُّ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو عَنْ أَشَدِّ، مَا صَنَعَ الْمُشْرِكُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ رَأَيْتُ عُقْبَةَ بْنَ أَبِي مُعَيْطٍ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُصَلِّي، فَوَضَعَ رِدَاءَهُ فِي عُنُقِهِ فَخَنَقَهُ بِهِ خَنْقًا شَدِيدًا، فَجَاءَ أَبُو بَكْرٍ حَتَّى دَفَعَهُ عَنْهُ فَقَالَ أَتَقْتُلُونَ رَجُلاً أَنْ يَقُولَ رَبِّيَ اللَّهُ‏.‏ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3678In-book reference : Book 62, Hadith 28USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 27   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3679,
    "id": 3679,
    "url": "https://sunnah.com/bukhari:3679",
    "bookNumber": 62,
    "hadithNumber": 29,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"I saw myself (in a dream) entering Paradise, and behold! I saw Ar-Rumaisa', Abu \nTalha's wife. I heard footsteps. I asked, Who is it? Somebody said, 'It is Bilal ' Then I saw a palace \nand a lady sitting in its courtyard. I asked, 'For whom is this palace?' Somebody replied, 'It is for \n`Umar.' I intended to enter it and see it, but I thought of your (`Umar's) Ghira (and gave up the \nattempt).\" `Umar said, \"Let my parents be sacrificed for you, O Allah's Messenger (ﷺ)! How dare I think of \nmy Ghira (self-respect) being offended by you?",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُنِي دَخَلْتُ الْجَنَّةَ، فَإِذَا أَنَا بِالرُّمَيْصَاءِ امْرَأَةِ أَبِي طَلْحَةَ وَسَمِعْتُ خَشَفَةً، فَقُلْتُ مَنْ هَذَا فَقَالَ هَذَا بِلاَلٌ‏.‏ وَرَأَيْتُ قَصْرًا بِفِنَائِهِ جَارِيَةٌ، فَقُلْتُ لِمَنْ هَذَا فَقَالَ لِعُمَرَ‏.‏ فَأَرَدْتُ أَنْ أَدْخُلَهُ فَأَنْظُرَ إِلَيْهِ، فَذَكَرْتُ غَيْرَتَكَ ‏\"‏‏.‏ فَقَالَ عُمَرُ بِأُمِّي وَأَبِي يَا رَسُولَ اللَّهِ أَعَلَيْكَ أَغَارُ",
    "reference": "Reference : Sahih al-Bukhari 3679In-book reference : Book 62, Hadith 29USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 28   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3680,
    "id": 3680,
    "url": "https://sunnah.com/bukhari:3680",
    "bookNumber": 62,
    "hadithNumber": 30,
    "narrator": "Narrated Abu Huraira:",
    "english": "While we were with Allah's Messenger (ﷺ) he said, \"While I was sleeping, I saw myself in Paradise, and \nsuddenly I saw a woman performing ablution beside a palace. I asked, 'For whom is this palace?' They \nreplied, 'It is for `Umar.' Then I remembered `Umar's Ghira (self-respect) and went away quickly.\" \n`Umar wept and said, O Allah's Messenger (ﷺ)! How dare I think of my ghira (self-respect) being offended \nby you?",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَالَ ‏\n\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ لِمَنْ هَذَا الْقَصْرُ قَالُوا لِعُمَرَ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ فَبَكَى وَقَالَ أَعَلَيْكَ أَغَارُ يَا رَسُولَ اللَّهِ",
    "reference": "Reference : Sahih al-Bukhari 3680In-book reference : Book 62, Hadith 30USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 29   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3681,
    "id": 3681,
    "url": "https://sunnah.com/bukhari:3681",
    "bookNumber": 62,
    "hadithNumber": 31,
    "narrator": "Narrated Hamza's father:",
    "english": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself drinking (i.e. milk), and I was so contented \nthat I saw the milk flowing through my nails. Then I gave (the milk) to `Umar.\" They (i.e. the \ncompanions of the Prophet) asked, \"What do you interpret it?\" He said, \"Knowledge.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الصَّلْتِ أَبُو جَعْفَرٍ الْكُوفِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حَمْزَةُ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ شَرِبْتُ ـ يَعْنِي اللَّبَنَ ـ حَتَّى أَنْظُرُ إِلَى الرِّيِّ يَجْرِي فِي ظُفُرِي أَوْ فِي أَظْفَارِي، ثُمَّ نَاوَلْتُ عُمَرَ ‏\"‏‏.‏ فَقَالُوا فَمَا أَوَّلْتَهُ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3681In-book reference : Book 62, Hadith 31USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3682,
    "id": 3682,
    "url": "https://sunnah.com/bukhari:3682",
    "bookNumber": 62,
    "hadithNumber": 32,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Prophet (ﷺ) said, \"In a dream I saw myself drawing water from a well with a bucket. Abu Bakr came \nand drew a bucket or two weakly. May Allah forgive him. Then `Umar bin Al-Khattab came and the \nbucket turned into a very large one in his hands. I had never seen such a mighty person as he in doing \nsuch hard work till all the people drank to their satisfaction and watered their camels that knelt down \nthere.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ سَالِمٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُرِيتُ فِي الْمَنَامِ أَنِّي أَنْزِعُ بِدَلْوِ بَكْرَةٍ عَلَى قَلِيبٍ، فَجَاءَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ نَزْعًا ضَعِيفًا، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ جَاءَ عُمَرُ بْنُ الْخَطَّابِ فَاسْتَحَالَتْ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا يَفْرِي فَرِيَّهُ حَتَّى رَوِيَ النَّاسُ وَضَرَبُوا بِعَطَنٍ ‏\"‏‏.‏ قَالَ ابْنُ جُبَيْرٍ الْعَبْقَرِيُّ عِتَاقُ الزَّرَابِيِّ‏.‏ وَقَالَ يَحْيَى الزَّرَابِيُّ الطَّنَافِسُ لَهَا خَمْلٌ رَقِيقٌ ‏{‏مَبْثُوثَةٌ‏}‏ كَثِيرَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3682In-book reference : Book 62, Hadith 32USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3683,
    "id": 3683,
    "url": "https://sunnah.com/bukhari:3683",
    "bookNumber": 62,
    "hadithNumber": 33,
    "narrator": "Narrated Sa`d bin Abi Waqqas:",
    "english": "`Umar bin Al-Khattab asked the permission of Allah's Messenger (ﷺ) to see him while some Quraishi women \nwere sitting with him, talking to him and asking him for more expenses, raising their voices above the \nvoice of Allah's Messenger (ﷺ). \nWhen `Umar asked for the permission to enter, the women quickly put on their veils. Allah'sf Apostle \nallowed him to enter and `Umar came in while Allah's Messenger (ﷺ) was smiling, `Umar said \"O Allah's \nApostle! May Allah always keep you smiling.\" The Prophet (ﷺ) said, \"These women who have been here, \nroused my wonder, for as soon as they heard your voice, they quickly put on their veils. \"`Umar said, \n\"O Allah's Messenger (ﷺ)! You have more right to be feared by them than I.\" Then `Umar addressed the \nwomen saying, \"O enemies of yourselves! You fear me more than you do Allah's Messenger (ﷺ) ?\" They \nsaid, \"Yes, for you are harsher and sterner than Allah's Messenger (ﷺ).\" Then Allah's Messenger (ﷺ) said, \"O Ibn \nAl-Khattab! By Him in Whose Hands my life is! Never does Satan find you going on a way, but he \ntakes another way other than yours.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ، أَنَّ مُحَمَّدَ بْنَ سَعْدٍ، أَخْبَرَهُ أَنَّ أَبَاهُ قَالَ ح حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، وَعِنْدَهُ نِسْوَةٌ مِنْ قُرَيْشٍ يُكَلِّمْنَهُ وَيَسْتَكْثِرْنَهُ، عَالِيَةً أَصْوَاتُهُنَّ عَلَى صَوْتِهِ فَلَمَّا اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ قُمْنَ فَبَادَرْنَ الْحِجَابَ فَأَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَخَلَ عُمَرُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَضْحَكُ، فَقَالَ عُمَرُ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَجِبْتُ مِنْ هَؤُلاَءِ اللاَّتِي كُنَّ عِنْدِي فَلَمَّا سَمِعْنَ صَوْتَكَ ابْتَدَرْنَ الْحِجَابِ ‏\"‏‏.‏ فَقَالَ عُمَرُ فَأَنْتَ أَحَقُّ أَنْ يَهَبْنَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ قَالَ عُمَرُ يَا عَدُوَّاتِ أَنْفُسِهِنَّ، أَتَهَبْنَنِي وَلاَ تَهَبْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْنَ نَعَمْ، أَنْتَ أَفَظُّ وَأَغْلَظُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِيهًا يَا ابْنَ الْخَطَّابِ وَالَّذِي نَفْسِي بِيَدِهِ مَا لَقِيَكَ الشَّيْطَانُ سَالِكًا فَجًّا قَطُّ إِلاَّ سَلَكَ فَجًّا غَيْرَ فَجِّكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3683In-book reference : Book 62, Hadith 33USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3684,
    "id": 3684,
    "url": "https://sunnah.com/bukhari:3684",
    "bookNumber": 62,
    "hadithNumber": 34,
    "narrator": "Narrated `Abdullah:",
    "english": "We have been powerful since `Umar embraced Islam.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ قَالَ عَبْدُ اللَّهِ مَا زِلْنَا أَعِزَّةً مُنْذُ أَسْلَمَ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3684In-book reference : Book 62, Hadith 34USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3685,
    "id": 3685,
    "url": "https://sunnah.com/bukhari:3685",
    "bookNumber": 62,
    "hadithNumber": 35,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When (the dead body of) `Umar was put on his deathbed, the people gathered around him and invoked \n(Allah) and prayed for him before the body was taken away, and I was amongst them. Suddenly I felt \nsomebody taking hold of my shoulder and found out that he was `Ali bin Abi Talib. `Ali invoked \nAllah's Mercy for `Umar and said, \"O `Umar! You have not left behind you a person whose deeds I \nlike to imitate and meet Allah with more than I like your deeds. By Allah! I always thought that Allah \nwould keep you with your two companions, for very often I used to hear the Prophet (ﷺ) saying, 'I, Abu \nBakr and `Umar went (somewhere); I, Abu Bakr and `Umar entered (somewhere); and I, Abu Bakr \nand `Umar went out.\"'",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ وُضِعَ عُمَرُ عَلَى سَرِيرِهِ، فَتَكَنَّفَهُ النَّاسُ يَدْعُونَ وَيُصَلُّونَ قَبْلَ أَنْ يُرْفَعَ، وَأَنَا فِيهِمْ، فَلَمْ يَرُعْنِي إِلاَّ رَجُلٌ آخِذٌ مَنْكِبِي، فَإِذَا عَلِيٌّ فَتَرَحَّمَ عَلَى عُمَرَ، وَقَالَ مَا خَلَّفْتَ أَحَدًا أَحَبَّ إِلَىَّ أَنْ أَلْقَى اللَّهَ بِمِثْلِ عَمَلِهِ مِنْكَ، وَايْمُ اللَّهِ، إِنْ كُنْتُ لأَظُنُّ أَنْ يَجْعَلَكَ اللَّهُ مَعَ صَاحِبَيْكَ، وَحَسِبْتُ أَنِّي كُنْتُ كَثِيرًا أَسْمَعُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ذَهَبْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَدَخَلْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَخَرَجْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3685In-book reference : Book 62, Hadith 35USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3686,
    "id": 3686,
    "url": "https://sunnah.com/bukhari:3686",
    "bookNumber": 62,
    "hadithNumber": 36,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) ascended the mountain of Uhud and he was accompanied by Abu Bakr, `Umar and \n`Uthman. The mountain shook beneath them. The Prophet (ﷺ) hit it with his foot and said, \"O Uhud ! Be \nfirm, for on you there is none but a Prophet, a Siddiq and a martyr (i.e. and two martyrs).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، وَقَالَ، لِي خَلِيفَةُ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، وَكَهْمَسُ بْنُ الْمِنْهَالِ، قَالاَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم إِلَى أُحُدٍ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ، فَضَرَبَهُ بِرِجْلِهِ، قَالَ ‏\n\"‏ اثْبُتْ أُحُدُ فَمَا عَلَيْكَ إِلاَّ نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3686In-book reference : Book 62, Hadith 36USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3687,
    "id": 3687,
    "url": "https://sunnah.com/bukhari:3687",
    "bookNumber": 62,
    "hadithNumber": 37,
    "narrator": "Narrated Aslam:",
    "english": "Ibn `Umar asked me about some matters concerning `Umar. He said, \"Since Allah's Messenger (ﷺ) died. I \nhave never seen anybody more serious, hard working and generous than `Umar bin Al-Khattab (till \nthe end of his life.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ، هُوَ ابْنُ مُحَمَّدٍ أَنَّ زَيْدَ بْنَ أَسْلَمَ، حَدَّثَهُ عَنْ أَبِيهِ، قَالَ سَأَلَنِي ابْنُ عُمَرَ عَنْ بَعْضِ، شَأْنِهِ ـ يَعْنِي عُمَرَ ـ فَأَخْبَرْتُهُ‏.‏ فَقَالَ، مَا رَأَيْتُ أَحَدًا قَطُّ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ حِينَ قُبِضَ كَانَ أَجَدَّ وَأَجْوَدَ حَتَّى انْتَهَى مِنْ عُمَرَ بْنِ الْخَطَّابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3687In-book reference : Book 62, Hadith 37USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3688,
    "id": 3688,
    "url": "https://sunnah.com/bukhari:3688",
    "bookNumber": 62,
    "hadithNumber": 38,
    "narrator": "Narrated Anas:",
    "english": "A man asked the Prophet (ﷺ) about the Hour (i.e. Day of Judgment) saying, \"When will the Hour be?\" \nThe Prophet (ﷺ) said, \"What have you prepared for it?\" The man said, \"Nothing, except that I love Allah \nand His Apostle.\" The Prophet (ﷺ) said, \"You will be with those whom you love.\" We had never been so \nglad as we were on hearing that saying of the Prophet (i.e., \"You will be with those whom you love.\") \nTherefore, I love the Prophet, Abu Bakr and `Umar, and I hope that I will be with them because of my \nlove for them though my deeds are not similar to theirs.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ السَّاعَةِ، فَقَالَ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَاذَا أَعْدَدْتَ لَهَا ‏\"‏‏.‏ قَالَ لاَ شَىْءَ إِلاَّ أَنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏ فَقَالَ ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَمَا فَرِحْنَا بِشَىْءٍ فَرَحَنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَأَنَا أُحِبُّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ، وَأَرْجُو أَنْ أَكُونَ مَعَهُمْ بِحُبِّي إِيَّاهُمْ، وَإِنْ لَمْ أَعْمَلْ بِمِثْلِ أَعْمَالِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3688In-book reference : Book 62, Hadith 38USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 37   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3689,
    "id": 3689,
    "url": "https://sunnah.com/bukhari:3689",
    "bookNumber": 62,
    "hadithNumber": 39,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Among the nations before you there used to be people who were inspired (though they were not prophets). And if there is any of such a persons amongst my followers, it is 'Umar.\" \n\nNarrated Abu Huraira: \nThe Prophet (ﷺ) said, \"Among the nation of Bani Israel who lived before you, there were men who used to be inspired with guidance though they were not prophets, and if there is any of such persons amongst my followers, it is 'Umar.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ كَانَ فِيمَا قَبْلَكُمْ مِنَ الأُمَمِ مُحَدَّثُونَ، فَإِنْ يَكُ فِي أُمَّتِي أَحَدٌ فَإِنَّهُ عُمَرُ ‏\"‏‏.‏ \nزَادَ زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ عَنْ سَعْدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَقَدْ كَانَ فِيمَنْ كَانَ قَبْلَكُمْ مِنْ بَنِي إِسْرَائِيلَ رِجَالٌ يُكَلَّمُونَ مِنْ غَيْرِ أَنْ يَكُونُوا أَنْبِيَاءَ، فَإِنْ يَكُنْ مِنْ أُمَّتِي مِنْهُمْ أَحَدٌ فَعُمَرُ ‏\"‏‏.‏ \nقال ابن عباس رضي الله عنهما: \"من نبيِّ ولا محدَّث.\"",
    "reference": "Reference : Sahih al-Bukhari 3689In-book reference : Book 62, Hadith 39USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 38   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3690,
    "id": 3690,
    "url": "https://sunnah.com/bukhari:3690",
    "bookNumber": 62,
    "hadithNumber": 40,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whilst a shepherd was amongst his sheep, a wolf attacked them and took away \na sheep. The shepherd chased it and got that sheep freed from the wolf. The wolf turned towards the \nshepherd and said, 'Who will guard the sheep on the day of wild animals when it will have no \nshepherd except myself?\" The people said, \"Glorified be Allah.\" The Prophet (ﷺ) said, \"But I believe in it \nand so do Abu Bakr and `Umar although Abu Bakr and `Umar were not present there (at the place of \nthe event).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالاَ سَمِعْنَا أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ عَدَا الذِّئْبُ فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهَا حَتَّى اسْتَنْقَذَهَا، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ لَهُ مَنْ لَهَا يَوْمَ السَّبُعِ، لَيْسَ لَهَا رَاعٍ غَيْرِي‏\"‏‏.‏ فَقَالَ النَّاسُ سُبْحَانَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُومِنُ بِهِ وَأَبُو بَكْرٍ وَعُمَرُ ‏\"‏ وَمَا ثَمَّ أَبُو بَكْرٍ وَعُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3690In-book reference : Book 62, Hadith 40USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 39   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3691,
    "id": 3691,
    "url": "https://sunnah.com/bukhari:3691",
    "bookNumber": 62,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, the people were presented to me (in a dream). \nThey were wearing shirts, some of which were merely covering their (chests). and some were a bit \nlonger. `Umar was presented before me and his shirt was so long that he was dragging it.\" They asked, \n\"How have you interpreted it, O Allah's Messenger (ﷺ)?\" He said, \"Religion.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ عُرِضُوا عَلَىَّ وَعَلَيْهِمْ قُمُصٌ، فَمِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَعُرِضَ عَلَىَّ عُمَرُ وَعَلَيْهِ قَمِيصٌ اجْتَرَّهُ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3691In-book reference : Book 62, Hadith 41USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3692,
    "id": 3692,
    "url": "https://sunnah.com/bukhari:3692",
    "bookNumber": 62,
    "hadithNumber": 42,
    "narrator": "Narrated Al-Miswar bin Makhrama:",
    "english": "When `Umar was stabbed, he showed signs of agony. Ibn `Abbas, as if intending to encourage `Umar, \nsaid to him, \"O Chief of the believers! Never mind what has happened to you, for you have been in \nthe company of Allah's Messenger (ﷺ) and you kept good relations with him and you parted with him while \nhe was pleased with you. Then you were in the company of Abu Bakr and kept good relations with \nhim and you parted with him (i.e. he died) while he was pleased with you. Then you were in the \ncompany of the Muslims, and you kept good relations with them, and if you leave them, you will \nleave them while they are pleased with you.\" `Umar said, (to Ibn \"Abbas), \"As for what you have said \nabout the company of Allah's Messenger (ﷺ) and his being pleased with me, it is a favor, Allah did to me; \nand as for what you have said about the company of Abu Bakr and his being pleased with me, it is a \nfavor Allah did to me; and concerning my impatience which you see, is because of you and your \ncompanions. By Allah! If (at all) I had gold equal to the earth, I would have ransomed myself with it \nfrom the Punishment of Allah before I meet Him.\"",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ لَمَّا طُعِنَ عُمَرُ جَعَلَ يَأْلَمُ، فَقَالَ لَهُ ابْنُ عَبَّاسٍ ـ وَكَأَنَّهُ يُجَزِّعُهُ ـ يَا أَمِيرَ الْمُؤْمِنِينَ، وَلَئِنْ كَانَ ذَاكَ لَقَدْ صَحِبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَحْسَنْتَ صُحْبَتَهُ، ثُمَّ فَارَقْتَهُ وَهْوَ عَنْكَ رَاضٍ، ثُمَّ صَحِبْتَ أَبَا بَكْرٍ فَأَحْسَنْتَ صُحْبَتَهُ، ثُمَّ فَارَقْتَهُ وَهْوَ عَنْكَ رَاضٍ، ثُمَّ صَحِبْتَ صَحَبَتَهُمْ فَأَحْسَنْتَ صُحْبَتَهُمْ، وَلَئِنْ فَارَقْتَهُمْ لَتُفَارِقَنَّهُمْ وَهُمْ عَنْكَ رَاضُونَ‏.‏ قَالَ أَمَّا مَا ذَكَرْتَ مِنْ صُحْبَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِضَاهُ، فَإِنَّمَا ذَاكَ مَنٌّ مِنَ اللَّهِ تَعَالَى مَنَّ بِهِ عَلَىَّ، وَأَمَّا مَا ذَكَرْتَ مِنْ صُحْبَةِ أَبِي بَكْرٍ وَرِضَاهُ، فَإِنَّمَا ذَاكَ مَنٌّ مِنَ اللَّهِ جَلَّ ذِكْرُهُ مَنَّ بِهِ عَلَىَّ، وَأَمَّا مَا تَرَى مِنْ جَزَعِي، فَهْوَ مِنْ أَجْلِكَ وَأَجْلِ أَصْحَابِكَ، وَاللَّهِ لَوْ أَنَّ لِي طِلاَعَ الأَرْضِ ذَهَبًا لاَفْتَدَيْتُ بِهِ مِنْ عَذَابِ اللَّهِ عَزَّ وَجَلَّ قَبْلَ أَنْ أَرَاهُ‏.‏ قَالَ حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، دَخَلْتُ عَلَى عُمَرَ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3692In-book reference : Book 62, Hadith 42USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3693,
    "id": 3693,
    "url": "https://sunnah.com/bukhari:3693",
    "bookNumber": 62,
    "hadithNumber": 43,
    "narrator": "Narrated Abu Musa:",
    "english": "While I was with the Prophet (ﷺ) in one of the gardens of Medina, a man came and asked me to open the \ngate. The Prophet (ﷺ) said to me, \"Open the gate for him and give him the glad tidings that he will enter \nParadise.\" I opened (the gate) for him, and behold! It was Abu Bakr. I informed him of the glad \ntidings the Prophet (ﷺ) had said, and he praised Allah. Then another man came and asked me to open the \ngate. The Prophet (ﷺ) said to me \"Open (the gate) and give him the glad tidings of entering Paradise.\" I \nopened (the gate) for him, and behold! It was `Umar. I informed him of what the Prophet (ﷺ) had said, and \nhe praised Allah. Then another man came and asked me to open the gate. The Prophet (ﷺ) said to me. \n\"Open (the gate) for him and inform him of the glad tidings, of entering Paradise with a calamity \nwhich will befall him. \" Behold ! It was `Uthman, I informed him of what Allah's Messenger (ﷺ) had said. \nHe praised Allah and said, \"I seek Allah's Aid.\"",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ غِيَاثٍ، حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ، فَجَاءَ رَجُلٌ فَاسْتَفْتَحَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَفَتَحْتُ لَهُ، فَإِذَا أَبُو بَكْرٍ، فَبَشَّرْتُهُ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَحَمِدَ اللَّهَ، ثُمَّ جَاءَ رَجُلٌ فَاسْتَفْتَحَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَفَتَحْتُ لَهُ، فَإِذَا هُوَ عُمَرُ، فَأَخْبَرْتُهُ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَحَمِدَ اللَّهَ، ثُمَّ اسْتَفْتَحَ رَجُلٌ، فَقَالَ لِي ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُهُ ‏\"‏‏.‏ فَإِذَا عُثْمَانُ، فَأَخْبَرْتُهُ بِمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَمِدَ اللَّهَ ثُمَّ قَالَ اللَّهُ الْمُسْتَعَانُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3693In-book reference : Book 62, Hadith 43USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3694,
    "id": 3694,
    "url": "https://sunnah.com/bukhari:3694",
    "bookNumber": 62,
    "hadithNumber": 44,
    "narrator": "Narrated `Abdullah bin Hisham:",
    "english": "We were with the Prophet (ﷺ) while he was holding `Umar bin Al-Khattab by the hand.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ أَنَّهُ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ هِشَامٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3694In-book reference : Book 62, Hadith 44USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 43   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3695,
    "id": 3695,
    "url": "https://sunnah.com/bukhari:3695",
    "bookNumber": 62,
    "hadithNumber": 45,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) entered a garden and ordered me to guard its gate. A man came and asked permission to \nenter. The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of entering Paradise.\" Behold! It \nwas Abu Bakr. Another man came and asked the permission to enter. The Prophet (ﷺ) said, \"Admit him \nand give him the glad tidings of entering Paradise.\" Behold! It was `Umar. Then another man came, \nasking the permission to enter. The Prophet (ﷺ) kept silent for a short while and then said, \"Admit him \nand give him the glad tidings of entering Paradise with a calamity which will befall him.\" Behold! It \nwas `Uthman bin `Affan. `Asim, in another narration, said that the Prophet (ﷺ) was sitting in a place \nwhere there was water, and he was uncovering both his knees or his knee, and when `Uthman entered, \nhe covered them (or it).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ حَائِطًا وَأَمَرَنِي بِحِفْظِ باب الْحَائِطِ، فَجَاءَ رَجُلٌ يَسْتَأْذِنُ، فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا أَبُو بَكْرٍ، ثُمَّ جَاءَ آخَرُ يَسْتَأْذِنُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا عُمَرُ، ثُمَّ جَاءَ آخَرُ يَسْتَأْذِنُ، فَسَكَتَ هُنَيْهَةً ثُمَّ قَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى سَتُصِيبُهُ ‏\"‏‏.‏ فَإِذَا عُثْمَانُ بْنُ عَفَّانَ‏.‏ قَالَ حَمَّادٌ وَحَدَّثَنَا عَاصِمٌ الأَحْوَلُ، وَعَلِيُّ بْنُ الْحَكَمِ، سَمِعَا أَبَا عُثْمَانَ، يُحَدِّثُ عَنْ أَبِي مُوسَى، بِنَحْوِهِ، وَزَادَ فِيهِ عَاصِمٌ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ قَاعِدًا فِي مَكَانٍ فِيهِ مَاءٌ، قَدِ انْكَشَفَتْ عَنْ رُكْبَتَيْهِ أَوْ رُكْبَتِهِ، فَلَمَّا دَخَلَ عُثْمَانُ غَطَّاهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3695In-book reference : Book 62, Hadith 45USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3696,
    "id": 3696,
    "url": "https://sunnah.com/bukhari:3696",
    "bookNumber": 62,
    "hadithNumber": 46,
    "narrator": "Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:",
    "english": "Al-Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth said (to me), \"What \nforbids you to talk to `Uthman about his brother Al-Walid because people have talked much about \nhim?\" So I went to `Uthman and when he went out for prayer I said (to him), \"I have something to say \nto you and it is a piece of advice for you \" `Uthman said, \"O man, from you.\" (`Umar said: I see that \nhe said, \"I seek Refuge with Allah from you.\") So I left him and went to them. Then the messenger of \n`Uthman came and I went to him (i.e. `Uthman), `Uthman asked, \"What is your advice?\" I replied, \n\"Allah sent Muhammad with the Truth, and revealed the Divine Book (i.e. Qur'an) to him; and you \nwere amongst those who followed Allah and His Apostle, and you participated in the two migrations \n(to Ethiopia and to Medina) and enjoyed the company of Allah's Messenger (ﷺ) and saw his way. No doubt, \nthe people are talking much about Al-Walid.\" `Uthman said, \"Did you receive your knowledge \ndirectly from Allah's Messenger (ﷺ) ?\" I said, \"No, but his knowledge did reach me and it reached (even) to a \nvirgin in her seclusion.\" `Uthman said, \"And then Allah sent Muhammad with the Truth and I was \namongst those who followed Allah and His Apostle and I believed in what ever he (i.e. the Prophet) \nwas sent with, and participated in two migrations, as you have said, and I enjoyed the company of \nAllah's Messenger (ﷺ) and gave the pledge of allegiance him. By Allah! I never disobeyed him, nor did I \ncheat him till Allah took him unto Him. Then I treated Abu Bakr and then `Umar similarly and then I \nwas made Caliph. So, don't I have rights similar to theirs?\" I said, \"Yes.\" He said, \"Then what are \nthese talks reaching me from you people? Now, concerning what you mentioned about the question of \nAl-Walid, Allah willing, I shall deal with him according to what is right.\" Then he called `Ali and \nordered him to flog him, and `Ali flogged him (i.e. Al-Walid) eighty lashes.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ قَالاَ مَا يَمْنَعُكَ أَنْ تُكَلِّمَ عُثْمَانَ لأَخِيهِ الْوَلِيدِ فَقَدْ أَكْثَرَ النَّاسُ فِيهِ‏.‏ فَقَصَدْتُ لِعُثْمَانَ حَتَّى خَرَجَ إِلَى الصَّلاَةِ، قُلْتُ إِنَّ لِي إِلَيْكَ حَاجَةً، وَهِيَ نَصِيحَةٌ لَكَ‏.‏ قَالَ يَا أَيُّهَا الْمَرْءُ ـ قَالَ مَعْمَرٌ أُرَاهُ قَالَ ـ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَانْصَرَفْتُ، فَرَجَعْتُ إِلَيْهِمْ إِذْ جَاءَ رَسُولُ عُثْمَانَ فَأَتَيْتُهُ، فَقَالَ مَا نَصِيحَتُكَ فَقُلْتُ إِنَّ اللَّهَ سُبْحَانَهُ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ، وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، وَكُنْتَ مِمَّنِ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ، فَهَاجَرْتَ الْهِجْرَتَيْنِ، وَصَحِبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَرَأَيْتَ هَدْيَهُ، وَقَدْ أَكْثَرَ النَّاسُ فِي شَأْنِ الْوَلِيدِ‏.‏ قَالَ أَدْرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ لاَ وَلَكِنْ خَلَصَ إِلَىَّ مِنْ عِلْمِهِ مَا يَخْلُصُ إِلَى الْعَذْرَاءِ فِي سِتْرِهَا‏.‏ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ، فَكُنْتُ مِمَّنِ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنْتُ بِمَا بُعِثَ بِهِ، وَهَاجَرْتُ الْهِجْرَتَيْنِ كَمَا قُلْتَ، وَصَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَبَايَعْتُهُ، فَوَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ أَبُو بَكْرٍ مِثْلُهُ، ثُمَّ عُمَرُ مِثْلُهُ، ثُمَّ اسْتُخْلِفْتُ، أَفَلَيْسَ لِي مِنَ الْحَقِّ مِثْلُ الَّذِي لَهُمْ قُلْتُ بَلَى‏.‏ قَالَ فَمَا هَذِهِ الأَحَادِيثُ الَّتِي تَبْلُغُنِي عَنْكُمْ أَمَّا مَا ذَكَرْتَ مِنْ شَأْنِ الْوَلِيدِ، فَسَنَأْخُذُ فِيهِ بِالْحَقِّ إِنْ شَاءَ اللَّهُ، ثُمَّ دَعَا عَلِيًّا فَأَمَرَهُ أَنْ يَجْلِدَهُ فَجَلَدَهُ ثَمَانِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3696In-book reference : Book 62, Hadith 46USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3697,
    "id": 3697,
    "url": "https://sunnah.com/bukhari:3697",
    "bookNumber": 62,
    "hadithNumber": 47,
    "narrator": "Narrated Ibn `Umar:",
    "english": "During the lifetime of the Prophet (ﷺ) we considered Abu Bakr as peerless and then `Umar and then \n`Uthman (coming next to him in superiority) and then we used not to differentiate between the \ncompanions of the Prophet.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيغٍ، حَدَّثَنَا شَاذَانُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم لاَ نَعْدِلُ بِأَبِي بَكْرٍ أَحَدًا ثُمَّ عُمَرَ ثُمَّ عُثْمَانَ، ثُمَّ نَتْرُكُ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم لاَ نُفَاضِلُ بَيْنَهُمْ‏.‏ تَابَعَهُ عَبْدُ اللَّهِ عَنْ عَبْدِ الْعَزِيزِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3697In-book reference : Book 62, Hadith 47USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3698,
    "id": 3698,
    "url": "https://sunnah.com/bukhari:3698",
    "bookNumber": 62,
    "hadithNumber": 48,
    "narrator": "Narrated `Uthman:",
    "english": "(the son of Muhib) An Egyptian who came and performed the Hajj to the Ka`ba saw some people \nsitting. He enquire, \"Who are these people?\" Somebody said, \"They are the tribe of Quraish.\" He said, \n\"Who is the old man sitting amongst them?\" The people replied, \"He is `Abdullah bin `Umar.\" He \nsaid, \"O Ibn `Umar! I want to ask you about something; please tell me about it. Do you know that \n`Uthman fled away on the day (of the battle) of Uhud?\" Ibn `Umar said, \"Yes.\" The (Egyptian) man \nsaid, \"Do you know that `Uthman was absent on the day (of the battle) of Badr and did not join it?\" \nIbn `Umar said, \"Yes.\" The man said, \"Do you know that he failed to attend the Ar Ridwan pledge and \ndid not witness it (i.e. Hudaibiya pledge of allegiance)?\" Ibn `Umar said, \"Yes.\" The man said, \n\"Allahu Akbar!\" Ibn `Umar said, \"Let me explain to you (all these three things). As for his flight on \nthe day of Uhud, I testify that Allah has excused him and forgiven him; and as for his absence from \nthe battle of Badr, it was due to the fact that the daughter of Allah's Messenger (ﷺ) was his wife and she was \nsick then. Allah's Messenger (ﷺ) said to him, \"You will receive the same reward and share (of the booty) as \nanyone of those who participated in the battle of Badr (if you stay with her).' As for his absence from \nthe Ar-Ridwan pledge of allegiance, had there been any person in Mecca more respectable than \n`Uthman (to be sent as a representative). Allah's Messenger (ﷺ) would have sent him instead of him. No \ndoubt, Allah's Messenger (ﷺ) had sent him, and the incident of the Ar-Ridwan pledge of Allegiance \nhappened after `Uthman had gone to Mecca. Allah's Messenger (ﷺ) held out his right hand saying, 'This is \n`Uthman's hand.' He stroke his (other) hand with it saying, 'This (pledge of allegiance) is on the behalf \nof `Uthman.' Then Ibn `Umar said to the man, 'Bear (these) excuses in mind with you.'",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عُثْمَانُ ـ هُوَ ابْنُ مَوْهَبٍ ـ قَالَ جَاءَ رَجُلٌ مَنْ أَهْلِ مِصْرَ حَجَّ الْبَيْتَ فَرَأَى قَوْمًا جُلُوسًا، فَقَالَ مَنْ هَؤُلاَءِ الْقَوْمُ قَالَ هَؤُلاَءِ قُرَيْشٌ‏.‏ قَالَ فَمَنِ الشَّيْخُ فِيهِمْ قَالُوا عَبْدُ اللَّهِ بْنُ عُمَرَ‏.‏ قَالَ يَا ابْنَ عُمَرَ إِنِّي سَائِلُكَ عَنْ شَىْءٍ فَحَدِّثْنِي هَلْ تَعْلَمُ أَنَّ عُثْمَانَ فَرَّ يَوْمَ أُحُدٍ قَالَ نَعَمْ‏.‏ قَالَ تَعْلَمُ أَنَّهُ تَغَيَّبَ عَنْ بَدْرٍ وَلَمْ يَشْهَدْ قَالَ نَعَمْ‏.‏ قَالَ تَعْلَمُ أَنَّهُ تَغَيَّبَ عَنْ بَيْعَةِ الرُّضْوَانِ فَلَمْ يَشْهَدْهَا قَالَ نَعَمْ‏.‏ قَالَ اللَّهُ أَكْبَرُ‏.‏ قَالَ ابْنُ عُمَرَ تَعَالَ أُبَيِّنْ لَكَ أَمَّا فِرَارُهُ يَوْمَ أُحُدٍ فَأَشْهَدُ أَنَّ اللَّهَ عَفَا عَنْهُ وَغَفَرَ لَهُ، وَأَمَّا تَغَيُّبُهُ عَنْ بَدْرٍ، فَإِنَّهُ كَانَتْ تَحْتَهُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ مَرِيضَةً، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لَكَ أَجْرَ رَجُلٍ مِمَّنْ شَهِدَ بَدْرًا وَسَهْمَهُ ‏\"‏‏.‏ وَأَمَّا تَغَيُّبُهُ عَنْ بَيْعَةِ الرُّضْوَانِ فَلَوْ كَانَ أَحَدٌ أَعَزَّ بِبَطْنِ مَكَّةَ مِنْ عُثْمَانَ لَبَعَثَهُ مَكَانَهُ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عُثْمَانَ وَكَانَتْ بَيْعَةُ الرُّضْوَانِ بَعْدَ مَا ذَهَبَ عُثْمَانُ إِلَى مَكَّةَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ الْيُمْنَى ‏\"‏ هَذِهِ يَدُ عُثْمَانَ ‏\"‏‏.‏ فَضَرَبَ بِهَا عَلَى يَدِهِ، فَقَالَ ‏\"‏ هَذِهِ لِعُثْمَانَ ‏\"‏‏.‏ فَقَالَ لَهُ ابْنُ عُمَرَ اذْهَبْ بِهَا الآنَ مَعَكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3698In-book reference : Book 62, Hadith 48USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3699,
    "id": 3699,
    "url": "https://sunnah.com/bukhari:3699",
    "bookNumber": 62,
    "hadithNumber": 49,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) ascended the mountain of Uhud and Abu Bakr, `Umar and `Uthman were accompanying \nhim. The mountain gave a shake (i.e. trembled underneath them) . The Prophet (ﷺ) said, \"O Uhud ! Be \ncalm.\" I think that the Prophet (ﷺ) hit it with his foot, adding, \"For upon you there are none but a Prophet, \na Siddiq and two martyrs.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُمْ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم أُحُدًا، وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ، فَرَجَفَ وَقَالَ ‏\n\"‏ اسْكُنْ أُحُدُ ـ أَظُنُّهُ ضَرَبَهُ بِرِجْلِهِ ـ فَلَيْسَ عَلَيْكَ إِلاَّ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3699In-book reference : Book 62, Hadith 49USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3700,
    "id": 3700,
    "url": "https://sunnah.com/bukhari:3700",
    "bookNumber": 62,
    "hadithNumber": 50,
    "narrator": "Narrated `Amr bin Maimun:",
    "english": "I saw `Umar bin Al-Khattab a few days before he was stabbed in Medina. He was standing with \nHudhaifa bin Al-Yaman and `Uthman bin Hunaif to whom he said, \"What have you done? Do you \nthink that you have imposed more taxation on the land (of As-Swad i.e. 'Iraq) than it can bear?\" They \nreplied, \"We have imposed on it what it can bear because of its great yield.\" `Umar again said, \"Check \nwhether you have imposed on the land what it can not bear.\" They said, \"No, (we haven't).\" `Umar \nadded, \"If Allah should keep me alive I will let the widows of Iraq need no men to support them after \nme.\" But only four days had elapsed when he was stabbed (to death ). The day he was stabbed, I was \nstanding and there was nobody between me and him (i.e. `Umar) except `Abdullah bin `Abbas. \nWhenever `Umar passed between the two rows, he would say, \"Stand in straight lines.\" \nWhen he saw no defect (in the rows), he would go forward and start the prayer with Takbir. He would \nrecite Surat Yusuf or An-Nahl or the like in the first rak`a so that the people may have the time to Join \nthe prayer. As soon as he said Takbir, I heard him saying, \"The dog has killed or eaten me,\" at the \ntime he (i.e. the murderer) stabbed him. A non-Arab infidel proceeded on carrying a double-edged \nknife and stabbing all the persons he passed by on the right and left (till) he stabbed thirteen persons \nout of whom seven died. When one of the Muslims saw that, he threw a cloak on him. Realizing that \nhe had been captured, the non-Arab infidel killed himself, `Umar held the hand of `Abdur-Rahman bin \n`Auf and let him lead the prayer. \nThose who were standing by the side of `Umar saw what I saw, but the people who were in the other \nparts of the Mosque did not see anything, but they lost the voice of `Umar and they were saying, \n\"Subhan Allah! Subhan Allah! (i.e. Glorified be Allah).\" `Abdur-Rahman bin `Auf led the people a \nshort prayer. When they finished the prayer, `Umar said, \"O Ibn `Abbas! Find out who attacked me.\" \nIbn `Abbas kept on looking here and there for a short time and came to say. \"The slave of Al \nMughira.\" On that `Umar said, \"The craftsman?\" Ibn `Abbas said, \"Yes.\" `Umar said, \"May Allah \ncurse him. I did not treat him unjustly. All the Praises are for Allah Who has not caused me to die at \nthe hand of a man who claims himself to be a Muslim. No doubt, you and your father (Abbas) used to \nlove to have more non-Arab infidels in Medina.\" Al-Abbas had the greatest number of slaves. Ibn \n`Abbas said to `Umar. \"If you wish, we will do.\" He meant, \"If you wish we will kill them.\" `Umar \nsaid, \"You are mistaken (for you can't kill them) after they have spoken your language, prayed \ntowards your Qibla, and performed Hajj like yours.\" \nThen `Umar was carried to his house, and we went along with him, and the people were as if they had \nnever suffered a calamity before. Some said, \"Do not worry (he will be Alright soon).\" Some said, \n\"We are afraid (that he will die).\" Then an infusion of dates was brought to him and he drank it but it \ncame out (of the wound) of his belly. Then milk was brought to him and he drank it, and it also came \nout of his belly. The people realized that he would die. We went to him, and the people came, praising \nhim. A young man came saying, \"O chief of the believers! Receive the glad tidings from Allah to you \ndue to your company with Allah's Messenger (ﷺ) and your superiority in Islam which you know. Then you \nbecame the ruler (i.e. Caliph) and you ruled with justice and finally you have been martyred.\" `Umar \nsaid, \"I wish that all these privileges will counterbalance (my shortcomings) so that I will neither lose \nnor gain anything.\" \nWhen the young man turned back to leave, his clothes seemed to be touching the ground. `Umar said, \n\"Call the young man back to me.\" (When he came back) `Umar said, \"O son of my brother! Lift your \nclothes, for this will keep your clothes clean and save you from the Punishment of your Lord.\" `Umar \nfurther said, \"O `Abdullah bin `Umar! See how much I am in debt to others.\" When the debt was \nchecked, it amounted to approximately eighty-six thousand. `Umar said, \"If the property of `Umar's \nfamily covers the debt, then pay the debt thereof; otherwise request it from Bani `Adi bin Ka`b, and if \nthat too is not sufficient, ask for it from Quraish tribe, and do not ask for it from any one else, and pay \nthis debt on my behalf.\" \n`Umar then said (to `Abdullah), \"Go to `Aisha (the mother of the believers) and say: \"`Umar is paying \nhis salutation to you. But don't say: 'The chief of the believers,' because today I am not the chief of the \nbelievers. And say: \"`Umar bin Al-Khattab asks the permission to be buried with his two companions \n(i.e. the Prophet, and Abu Bakr).\" `Abdullah greeted `Aisha and asked for the permission for entering, \nand then entered to her and found her sitting and weeping. He said to her, \"`Umar bin Al-Khattab is \npaying his salutations to you, and asks the permission to be buried with his two companions.\" She \nsaid, \"I had the idea of having this place for myself, but today I prefer `Umar to myself.\" When he \nreturned it was said (to `Umar), \"`Abdullah bin `Umar has come.\" `Umar said, \"Make me sit up.\" \nSomebody supported him against his body and `Umar asked (`Abdullah), \"What news do you have?\" \nHe said, \"O chief of the believers! It is as you wish. She has given the permission.\" `Umar said, \n\"Praise be to Allah, there was nothing more important to me than this. So when I die, take me, and \ngreet `Aisha and say: \"`Umar bin Al-Khattab asks the permission (to be buried with the Prophet (ﷺ) ), and \nif she gives the permission, bury me there, and if she refuses, then take me to the grave-yard of the \nMuslims.\" \nThen Hafsa (the mother of the believers) came with many other women walking with her. When we \nsaw her, we went away. She went in (to `Umar) and wept there for sometime. When the men asked for \npermission to enter, she went into another place, and we heard her weeping inside. The people said (to \n`Umar), \"O chief of the believers! Appoint a successor.\" `Umar said, \"I do not find anyone more \nsuitable for the job than the following persons or group whom Allah's Messenger (ﷺ) had been pleased with \nbefore he died.\" Then `Umar mentioned `Ali, `Uthman, AzZubair, Talha, Sa`d and `Abdur-Rahman \n(bin `Auf) and said, \"Abdullah bin `Umar will be a witness to you, but he will have no share in the \nrule. His being a witness will compensate him for not sharing the right of ruling. If Sa`d becomes the \nruler, it will be alright: otherwise, whoever becomes the ruler should seek his help, as I have not \ndismissed him because of disability or dishonesty.\" `Umar added, \"I recommend that my successor \ntakes care of the early emigrants; to know their rights and protect their honor and sacred things. \nI also recommend that he be kind to the Ansar who had lived in Medina before the emigrants and \nBelief had entered their hearts before them. I recommend that the (ruler) should accept the good of the \nrighteous among them and excuse their wrong-doers, and I recommend that he should do good to all \nthe people of the towns (Al-Ansar), as they are the protectors of Islam and the source of wealth and \nthe source of annoyance to the enemy. I also recommend that nothing be taken from them except from \ntheir surplus with their consent. I also recommend that he do good to the 'Arab bedouin, as they are \nthe origin of the 'Arabs and the material of Islam. He should take from what is inferior, amongst their \nproperties and distribute that to the poor amongst them. I also recommend him concerning Allah's and \nHis Apostle's protectees (i.e. Dhimmis) to fulfill their contracts and to fight for them and not to \noverburden them with what is beyond their ability.\" So when `Umar expired, we carried him out and \nset out walking. `Abdullah bin `Umar greeted (`Aisha) and said, \"`Umar bin Al-Khattab asks for the \npermission.\" `Aisha said, \"Bring him in.\" He was brought in and buried beside his two companions. \nWhen he was buried, the group (recommended by `Umar) held a meeting. Then `Abdur-Rahman said, \n\" Reduce the candidates for rulership to three of you.\" Az-Zubair said, \"I give up my right to `Ali.\" \nTalha said, \"I give up my right to `Uthman,\" Sa`d, 'I give up my right to `Abdur-Rahman bin `Auf.\" \n`Abdur-Rahman then said (to `Uthman and `Ali), \"Now which of you is willing to give up his right of \ncandidacy to that he may choose the better of the (remaining) two, bearing in mind that Allah and \nIslam will be his witnesses.\" So both the sheiks (i.e. `Uthman and `Ali) kept silent. `Abdur-Rahman \nsaid, \"Will you both leave this matter to me, and I take Allah as my Witness that I will not choose but \nthe better of you?\" They said, \"Yes.\" So `Abdur-Rahman took the hand of one of them (i.e. `Ali) and \nsaid, \"You are related to Allah's Messenger (ﷺ) and one of the earliest Muslims as you know well. So I ask \nyou by Allah to promise that if I select you as a ruler you will do justice, and if I select `Uthman as a \nruler you will listen to him and obey him.\" Then he took the other (i.e. `Uthman) aside and said the \nsame to him. When `Abdur-Rahman secured (their agreement to) this covenant, he said, \"O `Uthman! \nRaise your hand.\" So he (i.e. `Abdur-Rahman) gave him (i.e. `Uthman) the solemn pledge, and then \n`Ali gave him the pledge of allegiance and then all the (Medina) people gave him the pledge of \nallegiance.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَبْلَ أَنْ يُصَابَ بِأَيَّامٍ بِالْمَدِينَةِ وَقَفَ عَلَى حُذَيْفَةَ بْنِ الْيَمَانِ وَعُثْمَانَ بْنِ حُنَيْفٍ، قَالَ كَيْفَ فَعَلْتُمَا أَتَخَافَانِ أَنْ تَكُونَا قَدْ حَمَّلْتُمَا الأَرْضَ مَا لاَ تُطِيقُ قَالاَ حَمَّلْنَاهَا أَمْرًا هِيَ لَهُ مُطِيقَةٌ، مَا فِيهَا كَبِيرُ فَضْلٍ‏.‏ قَالَ انْظُرَا أَنْ تَكُونَا حَمَّلْتُمَا الأَرْضَ مَا لاَ تُطِيقُ، قَالَ قَالاَ لاَ‏.‏ فَقَالَ عُمَرُ لَئِنْ سَلَّمَنِي اللَّهُ لأَدَعَنَّ أَرَامِلَ أَهْلِ الْعِرَاقِ لاَ يَحْتَجْنَ إِلَى رَجُلٍ بَعْدِي أَبَدًا‏.‏ قَالَ فَمَا أَتَتْ عَلَيْهِ إِلاَّ رَابِعَةٌ حَتَّى أُصِيبَ‏.‏ قَالَ إِنِّي لَقَائِمٌ مَا بَيْنِي وَبَيْنَهُ إِلاَّ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ غَدَاةَ أُصِيبَ، وَكَانَ إِذَا مَرَّ بَيْنَ الصَّفَّيْنِ قَالَ اسْتَوُوا‏.‏ حَتَّى إِذَا لَمْ يَرَ فِيهِنَّ خَلَلاً تَقَدَّمَ فَكَبَّرَ، وَرُبَّمَا قَرَأَ سُورَةَ يُوسُفَ، أَوِ النَّحْلَ، أَوْ نَحْوَ ذَلِكَ، فِي الرَّكْعَةِ الأُولَى حَتَّى يَجْتَمِعَ النَّاسُ، فَمَا هُوَ إِلاَّ أَنْ كَبَّرَ فَسَمِعْتُهُ يَقُولُ قَتَلَنِي ـ أَوْ أَكَلَنِي ـ الْكَلْبُ‏.‏ حِينَ طَعَنَهُ، فَطَارَ الْعِلْجُ بِسِكِّينٍ ذَاتِ طَرَفَيْنِ لاَ يَمُرُّ عَلَى أَحَدٍ يَمِينًا وَلاَ شِمَالاً إِلاَّ طَعَنَهُ حَتَّى طَعَنَ ثَلاَثَةَ عَشَرَ رَجُلاً، مَاتَ مِنْهُمْ سَبْعَةٌ، فَلَمَّا رَأَى ذَلِكَ رَجُلٌ مِنَ الْمُسْلِمِينَ، طَرَحَ عَلَيْهِ بُرْنُسًا، فَلَمَّا ظَنَّ الْعِلْجُ أَنَّهُ مَأْخُوذٌ نَحَرَ نَفْسَهُ، وَتَنَاوَلَ عُمَرُ يَدَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فَقَدَّمَهُ، فَمَنْ يَلِي عُمَرَ فَقَدْ رَأَى الَّذِي أَرَى، وَأَمَّا نَوَاحِي الْمَسْجِدِ فَإِنَّهُمْ لاَ يَدْرُونَ غَيْرَ أَنَّهُمْ قَدْ فَقَدُوا صَوْتَ عُمَرَ وَهُمْ يَقُولُونَ سُبْحَانَ اللَّهِ سُبْحَانَ اللَّهِ‏.‏ فَصَلَّى بِهِمْ عَبْدُ الرَّحْمَنِ صَلاَةً خَفِيفَةً، فَلَمَّا انْصَرَفُوا‏.‏ قَالَ يَا ابْنَ عَبَّاسٍ، انْظُرْ مَنْ قَتَلَنِي‏.‏ فَجَالَ سَاعَةً، ثُمَّ جَاءَ، فَقَالَ غُلاَمُ الْمُغِيرَةِ‏.‏ قَالَ الصَّنَعُ قَالَ نَعَمْ‏.‏ قَالَ قَاتَلَهُ اللَّهُ لَقَدْ أَمَرْتُ بِهِ مَعْرُوفًا، الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَجْعَلْ مَنِيَّتِي بِيَدِ رَجُلٍ يَدَّعِي الإِسْلاَمَ، قَدْ كُنْتَ أَنْتَ وَأَبُوكَ تُحِبَّانِ أَنْ تَكْثُرَ الْعُلُوجُ بِالْمَدِينَةِ وَكَانَ ‏{‏الْعَبَّاسُ‏}‏ أَكْثَرَهُمْ رَقِيقًا‏.‏ فَقَالَ إِنْ شِئْتَ فَعَلْتُ‏.‏ أَىْ إِنْ شِئْتَ قَتَلْنَا‏.‏ قَالَ كَذَبْتَ، بَعْدَ مَا تَكَلَّمُوا بِلِسَانِكُمْ، وَصَلَّوْا قِبْلَتَكُمْ وَحَجُّوا حَجَّكُمْ فَاحْتُمِلَ إِلَى بَيْتِهِ فَانْطَلَقْنَا مَعَهُ، وَكَأَنَّ النَّاسَ لَمْ تُصِبْهُمْ مُصِيبَةٌ قَبْلَ يَوْمَئِذٍ، فَقَائِلٌ يَقُولُ لاَ بَأْسَ‏.‏ وَقَائِلٌ يَقُولُ أَخَافُ عَلَيْهِ، فَأُتِيَ بِنَبِيذٍ فَشَرِبَهُ فَخَرَجَ مِنْ جَوْفِهِ، ثُمَّ أُتِيَ بِلَبَنٍ فَشَرِبَهُ فَخَرَجَ مِنْ جُرْحِهِ، فَعَلِمُوا أَنَّهُ مَيِّتٌ، فَدَخَلْنَا عَلَيْهِ، وَجَاءَ النَّاسُ يُثْنُونَ عَلَيْهِ، وَجَاءَ رَجُلٌ شَابٌّ، فَقَالَ أَبْشِرْ يَا أَمِيرَ الْمُؤْمِنِينَ بِبُشْرَى اللَّهِ لَكَ مِنْ صُحْبَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدَمٍ فِي الإِسْلاَمِ مَا قَدْ عَلِمْتَ، ثُمَّ وَلِيتَ فَعَدَلْتَ، ثُمَّ شَهَادَةٌ‏.‏ قَالَ وَدِدْتُ أَنَّ ذَلِكَ كَفَافٌ لاَ عَلَىَّ وَلاَ لِي‏.‏ فَلَمَّا أَدْبَرَ، إِذَا إِزَارُهُ يَمَسُّ الأَرْضَ‏.‏ قَالَ رُدُّوا عَلَىَّ الْغُلاَمَ قَالَ ابْنَ أَخِي ارْفَعْ ثَوْبَكَ، فَإِنَّهُ أَبْقَى لِثَوْبِكَ وَأَتْقَى لِرَبِّكَ، يَا عَبْدَ اللَّهِ بْنَ عُمَرَ انْظُرْ مَا عَلَىَّ مِنَ الدَّيْنِ‏.‏ فَحَسَبُوهُ فَوَجَدُوهُ سِتَّةً وَثَمَانِينَ أَلْفًا أَوْ نَحْوَهُ، قَالَ إِنْ وَفَى لَهُ مَالُ آلِ عُمَرَ، فَأَدِّهِ مِنْ أَمْوَالِهِمْ، وَإِلاَّ فَسَلْ فِي بَنِي عَدِيِّ بْنِ كَعْبٍ، فَإِنْ لَمْ تَفِ أَمْوَالُهُمْ فَسَلْ فِي قُرَيْشٍ، وَلاَ تَعْدُهُمْ إِلَى غَيْرِهِمْ، فَأَدِّ عَنِّي هَذَا الْمَالَ، انْطَلِقْ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فَقُلْ يَقْرَأُ عَلَيْكِ عُمَرُ السَّلاَمَ‏.‏ وَلاَ تَقُلْ أَمِيرُ الْمُؤْمِنِينَ‏.‏ فَإِنِّي لَسْتُ الْيَوْمَ لِلْمُؤْمِنِينَ أَمِيرًا، وَقُلْ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ أَنْ يُدْفَنَ مَعَ صَاحِبَيْهِ‏.‏ فَسَلَّمَ وَاسْتَأْذَنَ، ثُمَّ دَخَلَ عَلَيْهَا، فَوَجَدَهَا قَاعِدَةً تَبْكِي فَقَالَ يَقْرَأُ عَلَيْكِ عُمَرُ بْنُ الْخَطَّابِ السَّلاَمَ وَيَسْتَأْذِنُ أَنْ يُدْفَنَ مَعَ صَاحِبَيْهِ‏.‏ فَقَالَتْ كُنْتُ أُرِيدُهُ لِنَفْسِي، وَلأُوثِرَنَّ بِهِ الْيَوْمَ عَلَى نَفْسِي‏.‏ فَلَمَّا أَقْبَلَ قِيلَ هَذَا عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ جَاءَ‏.‏ قَالَ ارْفَعُونِي، فَأَسْنَدَهُ رَجُلٌ إِلَيْهِ، فَقَالَ مَا لَدَيْكَ قَالَ الَّذِي تُحِبُّ يَا أَمِيرَ الْمُؤْمِنِينَ أَذِنَتْ‏.‏ قَالَ الْحَمْدُ لِلَّهِ، مَا كَانَ مِنْ شَىْءٍ أَهَمُّ إِلَىَّ مِنْ ذَلِكَ، فَإِذَا أَنَا قَضَيْتُ فَاحْمِلُونِي ثُمَّ سَلِّمْ فَقُلْ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ، فَإِنْ أَذِنَتْ لِي فَأَدْخِلُونِي، وَإِنْ رَدَّتْنِي رُدُّونِي إِلَى مَقَابِرِ الْمُسْلِمِينَ‏.‏ وَجَاءَتْ أُمُّ الْمُؤْمِنِينَ حَفْصَةُ وَالنِّسَاءُ تَسِيرُ مَعَهَا، فَلَمَّا رَأَيْنَاهَا قُمْنَا، فَوَلَجَتْ عَلَيْهِ فَبَكَتْ عِنْدَهُ سَاعَةً، وَاسْتَأْذَنَ الرِّجَالُ، فَوَلَجَتْ دَاخِلاً لَهُمْ، فَسَمِعْنَا بُكَاءَهَا مِنَ الدَّاخِلِ‏.‏ فَقَالُوا أَوْصِ يَا أَمِيرَ الْمُؤْمِنِينَ اسْتَخْلِفْ‏.‏ قَالَ مَا أَجِدُ أَحَقَّ بِهَذَا الأَمْرِ مِنْ هَؤُلاَءِ النَّفَرِ أَوِ الرَّهْطِ الَّذِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ عَنْهُمْ رَاضٍ‏.‏ فَسَمَّى عَلِيًّا وَعُثْمَانَ وَالزُّبَيْرَ وَطَلْحَةَ وَسَعْدًا وَعَبْدَ الرَّحْمَنِ وَقَالَ يَشْهَدُكُمْ عَبْدُ اللَّهِ بْنُ عُمَرَ وَلَيْسَ لَهُ مِنَ الأَمْرِ شَىْءٌ ـ كَهَيْئَةِ التَّعْزِيَةِ لَهُ ـ فَإِنْ أَصَابَتِ الإِمْرَةُ سَعْدًا فَهْوَ ذَاكَ، وَإِلاَّ فَلْيَسْتَعِنْ بِهِ أَيُّكُمْ مَا أُمِّرَ، فَإِنِّي لَمْ أَعْزِلْهُ عَنْ عَجْزٍ وَلاَ خِيَانَةٍ وَقَالَ أُوصِي الْخَلِيفَةَ مِنْ بَعْدِي بِالْمُهَاجِرِينَ الأَوَّلِينَ أَنْ يَعْرِفَ لَهُمْ حَقَّهُمْ، وَيَحْفَظَ لَهُمْ حُرْمَتَهُمْ، وَأُوصِيهِ بِالأَنْصَارِ خَيْرًا، الَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ مِنْ قَبْلِهِمْ، أَنْ يُقْبَلَ مِنْ مُحْسِنِهِمْ، وَأَنْ يُعْفَى عَنْ مُسِيئِهِمْ، وَأُوصِيهِ بِأَهْلِ الأَمْصَارِ خَيْرًا فَإِنَّهُمْ رِدْءُ الإِسْلاَمِ، وَجُبَاةُ الْمَالِ، وَغَيْظُ الْعَدُوِّ، وَأَنْ لاَ يُؤْخَذَ مِنْهُمْ إِلاَّ فَضْلُهُمْ عَنْ رِضَاهُمْ، وَأُوصِيهِ بِالأَعْرَابِ خَيْرًا، فَإِنَّهُمْ أَصْلُ الْعَرَبِ وَمَادَّةُ الإِسْلاَمِ أَنْ يُؤْخَذَ مِنْ حَوَاشِي أَمْوَالِهِمْ وَتُرَدَّ عَلَى فُقَرَائِهِمْ، وَأُوصِيهِ بِذِمَّةِ اللَّهِ وَذِمَّةِ رَسُولِهِ صلى الله عليه وسلم أَنْ يُوفَى لَهُمْ بِعَهْدِهِمْ، وَأَنْ يُقَاتَلَ مِنْ وَرَائِهِمْ، وَلاَ يُكَلَّفُوا إِلاَّ طَاقَتَهُمْ‏.‏ فَلَمَّا قُبِضَ خَرَجْنَا بِهِ فَانْطَلَقْنَا نَمْشِي فَسَلَّمَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ‏.‏ قَالَتْ أَدْخِلُوهُ‏.‏ فَأُدْخِلَ، فَوُضِعَ هُنَالِكَ مَعَ صَاحِبَيْهِ، فَلَمَّا فُرِغَ مِنْ دَفْنِهِ اجْتَمَعَ هَؤُلاَءِ الرَّهْطُ، فَقَالَ عَبْدُ الرَّحْمَنِ اجْعَلُوا أَمْرَكُمْ إِلَى ثَلاَثَةٍ مِنْكُمْ‏.‏ فَقَالَ الزُّبَيْرُ قَدْ جَعَلْتُ أَمْرِي إِلَى عَلِيٍّ‏.‏ فَقَالَ طَلْحَةُ قَدْ جَعَلْتُ أَمْرِي إِلَى عُثْمَانَ‏.‏ وَقَالَ سَعْدٌ قَدْ جَعَلْتُ أَمْرِي إِلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ‏.‏ فَقَالَ عَبْدُ الرَّحْمَنِ أَيُّكُمَا تَبَرَّأَ مِنْ هَذَا الأَمْرِ فَنَجْعَلُهُ إِلَيْهِ، وَاللَّهُ عَلَيْهِ وَالإِسْلاَمُ لَيَنْظُرَنَّ أَفْضَلَهُمْ فِي نَفْسِهِ‏.‏ فَأُسْكِتَ الشَّيْخَانِ، فَقَالَ عَبْدُ الرَّحْمَنِ أَفَتَجْعَلُونَهُ إِلَىَّ، وَاللَّهُ عَلَىَّ أَنْ لاَ آلُوَ عَنْ أَفْضَلِكُمْ قَالاَ نَعَمْ، فَأَخَذَ بِيَدِ أَحَدِهِمَا فَقَالَ لَكَ قَرَابَةٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَالْقَدَمُ فِي الإِسْلاَمِ مَا قَدْ عَلِمْتَ، فَاللَّهُ عَلَيْكَ لَئِنْ أَمَّرْتُكَ لَتَعْدِلَنَّ، وَلَئِنْ أَمَّرْتُ عُثْمَانَ لَتَسْمَعَنَّ وَلَتُطِيعَنَّ‏.‏ ثُمَّ خَلاَ بِالآخَرِ فَقَالَ لَهُ مِثْلَ ذَلِكَ، فَلَمَّا أَخَذَ الْمِيثَاقَ قَالَ ارْفَعْ يَدَكَ يَا عُثْمَانُ‏.‏ فَبَايَعَهُ، فَبَايَعَ لَهُ عَلِيٌّ، وَوَلَجَ أَهْلُ الدَّارِ فَبَايَعُوهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3700In-book reference : Book 62, Hadith 50USC-MSA web (English) reference : Vol. 5, Book 57, Hadith 50   (deprecated numbering scheme)"
  }
]