[
  {
    "hadithGlobalNumber": 4301,
    "id": 4301,
    "url": "https://sunnah.com/bukhari:4301",
    "bookNumber": 64,
    "hadithNumber": 334,
    "narrator": "Narrated Az-Zuhri:",
    "english": "While we were in the company of the Ibn Al-Musaiyab, Sunain Abi Jamila informed us (a Hadith), \nAbu Jamila said that he lived during the lifetime of the Prophet (ﷺ) and that he had accompanied him ( to \nMecca) during the year of the Conquest (of Mecca).",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سُنَيْنٍ أَبِي جَمِيلَةَ، قَالَ أَخْبَرَنَا وَنَحْنُ، مَعَ ابْنِ الْمُسَيَّبِ قَالَ وَزَعَمَ أَبُو جَمِيلَةَ أَنَّهُ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم، وَخَرَجَ مَعَهُ عَامَ الْفَتْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4301In-book reference : Book 64, Hadith 334USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 594   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4302,
    "id": 4302,
    "url": "https://sunnah.com/bukhari:4302",
    "bookNumber": 64,
    "hadithNumber": 335,
    "narrator": "Narrated `Amr bin Salama:",
    "english": "We were at a place which was a thoroughfare for the people, and the caravans used to pass by us and \nwe would ask them, \"What is wrong with the people? What is wrong with the people? Who is that \nman?. They would say, \"That man claims that Allah has sent him (as an Apostle), that he has been \ndivinely inspired, that Allah has revealed to him such-and-such.\" I used to memorize that (Divine) \nTalk, and feel as if it was inculcated in my chest (i.e. mind) And the 'Arabs (other than Quraish) \ndelayed their conversion to Islam till the Conquest (of Mecca). They used to say.\" \"Leave him (i.e. \nMuhammad) and his people Quraish: if he overpowers them then he is a true Prophet. So, when \nMecca was conquered, then every tribe rushed to embrace Islam, and my father hurried to embrace \nIslam before (the other members of) my tribe. When my father returned (from the Prophet) to his \ntribe, he said, \"By Allah, I have come to you from the Prophet (ﷺ) for sure!\" The Prophet (ﷺ) afterwards said \nto them, 'Offer such-and-such prayer at such-and-such time, and when the time for the prayer becomes \ndue, then one of you should pronounce the Adhan (for the prayer), and let the one amongst you who \nknows Qur'an most should, lead the prayer.\" So they looked for such a person and found none who \nknew more Qur'an than I because of the Qur'anic material which I used to learn from the caravans. \nThey therefore made me their Imam ((to lead the prayer) and at that time I was a boy of six or seven \nyears, wearing a Burda (i.e. a black square garment) proved to be very short for me (and my body \nbecame partly naked). A lady from the tribe said, \"Won't you cover the anus of your reciter for us?\" \nSo they bought (a piece of cloth) and made a shirt for me. I had never been so happy with anything \nbefore as I was with that shirt.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَمْرِو بْنِ سَلِمَةَ، قَالَ قَالَ لِي أَبُو قِلاَبَةَ أَلاَ تَلْقَاهُ فَتَسْأَلَهُ، قَالَ فَلَقِيتُهُ فَسَأَلْتُهُ فَقَالَ كُنَّا بِمَاءٍ مَمَرَّ النَّاسِ، وَكَانَ يَمُرُّ بِنَا الرُّكْبَانُ فَنَسْأَلُهُمْ مَا لِلنَّاسِ مَا لِلنَّاسِ مَا هَذَا الرَّجُلُ فَيَقُولُونَ يَزْعُمُ أَنَّ اللَّهَ أَرْسَلَهُ أَوْحَى إِلَيْهِ، أَوْ أَوْحَى اللَّهُ بِكَذَا‏.‏ فَكُنْتُ أَحْفَظُ ذَلِكَ الْكَلاَمَ، وَكَأَنَّمَا يُغْرَى فِي صَدْرِي، وَكَانَتِ الْعَرَبُ تَلَوَّمُ بِإِسْلاَمِهِمِ الْفَتْحَ، فَيَقُولُونَ اتْرُكُوهُ وَقَوْمَهُ، فَإِنَّهُ إِنْ ظَهَرَ عَلَيْهِمْ فَهْوَ نَبِيٌّ صَادِقٌ‏.‏ فَلَمَّا كَانَتْ وَقْعَةُ أَهْلِ الْفَتْحِ بَادَرَ كُلُّ قَوْمٍ بِإِسْلاَمِهِمْ، وَبَدَرَ أَبِي قَوْمِي بِإِسْلاَمِهِمْ، فَلَمَّا قَدِمَ قَالَ جِئْتُكُمْ وَاللَّهِ مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم حَقًّا فَقَالَ ‏\n\"‏ صَلُّوا صَلاَةَ كَذَا فِي حِينِ كَذَا، وَصَلُّوا كَذَا فِي حِينِ كَذَا، فَإِذَا حَضَرَتِ الصَّلاَةُ، فَلْيُؤَذِّنْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا ‏\"‏‏.‏ فَنَظَرُوا فَلَمْ يَكُنْ أَحَدٌ أَكْثَرَ قُرْآنًا مِنِّي، لِمَا كُنْتُ أَتَلَقَّى مِنَ الرُّكْبَانِ، فَقَدَّمُونِي بَيْنَ أَيْدِيهِمْ، وَأَنَا ابْنُ سِتٍّ أَوْ سَبْعِ، سِنِينَ وَكَانَتْ عَلَىَّ بُرْدَةٌ، كُنْتُ إِذَا سَجَدْتُ تَقَلَّصَتْ عَنِّي، فَقَالَتِ امْرَأَةٌ مِنَ الْحَىِّ أَلاَ تُغَطُّوا عَنَّا اسْتَ قَارِئِكُمْ‏.‏ فَاشْتَرَوْا فَقَطَعُوا لِي قَمِيصًا، فَمَا فَرِحْتُ بِشَىْءٍ فَرَحِي بِذَلِكَ الْقَمِيصِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4302In-book reference : Book 64, Hadith 335USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 595   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4303,
    "id": 4303,
    "url": "https://sunnah.com/bukhari:4303",
    "bookNumber": 64,
    "hadithNumber": 336,
    "narrator": "Narrated `Aisha:",
    "english": "`Utba bin Abi Waqqas authorized his brother Sa`d to take the son of the slave-girl of Zam`a into his \ncustody. `Utba said (to him). \"He is my son.\" When Allah's Messenger (ﷺ) arrived in Mecca during the \nConquest (of Mecca), Sa`d bin Abi Waqqas took the son of the slave-girl of Zam`a and took him to \nthe Prophet (ﷺ) `Abd bin Zam`a too came along with him. Sa`d said. \"This is the son of my brother and \nthe latter has informed me that he is his son.\" `Abd bin Zam`a said, \"O Allah's Messenger (ﷺ)! This is my \nbrother who is the son of the slave-girl of Zam`a and was born on his (i.e. Zam'as) bed.' Allah's \nApostle looked at the son of the slave-girl of Zam`a and noticed that he, of all the people had the \ngreatest resemblance to `Utba bin Abi Waqqas. Allah's Messenger (ﷺ) then said (to `Abd), \" He is yours; he \nis your brother, O `Abd bin Zam`a, he was born on the bed (of your father).\" (At the same time) \nAllah's Messenger (ﷺ) said (to his wife Sauda), \"Veil yourself before him (i.e. the son of the slave-girl) O \nSauda,\" because of the resemblance he noticed between him and `Utba bin Abi Waqqas. Allah's \nApostle added, \"The boy is for the bed (i.e. for the owner of the bed where he was born), and stone is \nfor the adulterer.\" (Ibn Shihab said, \"Abu Huraira used to say that (i.e. the last statement of the \nProphet in the above Hadith 596, publicly.\")",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنْ يَقْبِضَ ابْنَ وَلِيدَةِ زَمْعَةَ، وَقَالَ عُتْبَةُ إِنَّهُ ابْنِي‏.‏ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ فِي الْفَتْحِ أَخَذَ سَعْدُ بْنُ أَبِي وَقَّاصٍ ابْنَ وَلِيدَةِ زَمْعَةَ، فَأَقْبَلَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، وَأَقْبَلَ مَعَهُ عَبْدُ بْنُ زَمْعَةَ، فَقَالَ سَعْدُ بْنُ أَبِي وَقَّاصٍ هَذَا ابْنُ أَخِي، عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ‏.‏ قَالَ عَبْدُ بْنُ زَمْعَةَ يَا رَسُولَ اللَّهِ، هَذَا أَخِي، هَذَا ابْنُ زَمْعَةَ، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى ابْنِ وَلِيدَةِ زَمْعَةَ، فَإِذَا أَشْبَهُ النَّاسِ بِعُتْبَةَ بْنِ أَبِي وَقَّاصٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ، هُوَ أَخُوكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِرَاشِهِ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ‏.‏ قَالَ ابْنُ شِهَابٍ قَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ وَقَالَ ابْنُ شِهَابٍ وَكَانَ أَبُو هُرَيْرَةَ يَصِيحُ بِذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4303In-book reference : Book 64, Hadith 336USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4304,
    "id": 4304,
    "url": "https://sunnah.com/bukhari:4304",
    "bookNumber": 64,
    "hadithNumber": 337,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "A lady committed theft during the lifetime of Allah's Messenger (ﷺ) in the Ghazwa of Al-Fath, ((i.e. \nConquest of Mecca). Her folk went to Usama bin Zaid to intercede for her (with the Prophet). When \nUsama interceded for her with Allah's Messenger (ﷺ), the color of the face of Allah's Messenger (ﷺ) changed and he \nsaid, \"Do you intercede with me in a matter involving one of the legal punishments prescribed by \nAllah?\" Usama said, \"O Allah's Messenger (ﷺ)! Ask Allah's Forgiveness for me.\" So in the afternoon, Allah's \nApostle got up and addressed the people. He praised Allah as He deserved and then said, \"Amma \nba'du ! The nations prior to you were destroyed because if a noble amongst them stole, they used to \nexcuse him, and if a poor person amongst them stole, they would apply (Allah's) Legal Punishment to \nhim. By Him in Whose Hand Muhammad's soul is, if Fatima, the daughter of Muhammad stole, I \nwould cut her hand.\" Then Allah's Messenger (ﷺ) gave his order in the case of that woman and her hand was \ncut off. Afterwards her repentance proved sincere and she got married. `Aisha said, \"That lady used to \nvisit me and I used to convey her demands to Allah's Messenger (ﷺ).\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ امْرَأَةً، سَرَقَتْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ الْفَتْحِ، فَفَزِعَ قَوْمُهَا إِلَى أُسَامَةَ بْنِ زَيْدٍ يَسْتَشْفِعُونَهُ، قَالَ عُرْوَةُ فَلَمَّا كَلَّمَهُ أُسَامَةُ فِيهَا تَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتُكَلِّمُنِي فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏ قَالَ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَلَمَّا كَانَ الْعَشِيُّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَطِيبًا، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّمَا أَهْلَكَ النَّاسَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ فِيهِمِ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏ ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتِلْكَ الْمَرْأَةِ، فَقُطِعَتْ يَدُهَا، فَحَسُنَتْ تَوْبَتُهَا بَعْدَ ذَلِكَ وَتَزَوَّجَتْ‏.‏ قَالَتْ عَائِشَةُ فَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4304In-book reference : Book 64, Hadith 337USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4305,
    "id": 4305,
    "url": "https://sunnah.com/bukhari:4305",
    "bookNumber": 64,
    "hadithNumber": 338,
    "narrator": "Narrated Majashi:",
    "english": "I took my brother to the Prophet (ﷺ) after the Conquest (of Mecca) and said, \"O Allah's Messenger (ﷺ)! I have \ncome to you with my brother so that you may take a pledge of allegiance from him for migration.\" \nThe Prophet (ﷺ) said, The people of migration (i.e. those who migrated to Medina before the Conquest) \nenjoyed the privileges of migration (i.e. there is no need for migration anymore).\" I said to the \nProphet, \"For what will you take his pledge of allegiance?\" The Prophet (ﷺ) said, \"I will take his pledge of \nallegiance for Islam, Belief, and for Jihad (i.e. fighting in Allah's Cause).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي مُجَاشِعٌ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِأَخِي بَعْدَ الْفَتْحِ قُلْتُ يَا رَسُولَ اللَّهِ، جِئْتُكَ بِأَخِي لِتُبَايِعَهُ عَلَى الْهِجْرَةِ‏.‏ قَالَ ‏\"‏ ذَهَبَ أَهْلُ الْهِجْرَةِ بِمَا فِيهَا ‏\"‏‏.‏ فَقُلْتُ عَلَى أَىِّ شَىْءٍ تُبَايِعُهُ قَالَ ‏\"‏ أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالإِيمَانِ وَالْجِهَادِ‏\" فَلَقِيتُ أَبَا مَعْبَدٍ بَعْدُ وَكَانَ أَكْبَرَهُمَا فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.",
    "reference": "Reference : Sahih al-Bukhari 4305, 4306In-book reference : Book 64, Hadith 338USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4306,
    "id": 4306,
    "url": "https://sunnah.com/bukhari:4306",
    "bookNumber": 64,
    "hadithNumber": 338,
    "narrator": "Narrated Majashi:",
    "english": "I took my brother to the Prophet (ﷺ) after the Conquest (of Mecca) and said, \"O Allah's Messenger (ﷺ)! I have \ncome to you with my brother so that you may take a pledge of allegiance from him for migration.\" \nThe Prophet (ﷺ) said, The people of migration (i.e. those who migrated to Medina before the Conquest) \nenjoyed the privileges of migration (i.e. there is no need for migration anymore).\" I said to the \nProphet, \"For what will you take his pledge of allegiance?\" The Prophet (ﷺ) said, \"I will take his pledge of \nallegiance for Islam, Belief, and for Jihad (i.e. fighting in Allah's Cause).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي مُجَاشِعٌ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِأَخِي بَعْدَ الْفَتْحِ قُلْتُ يَا رَسُولَ اللَّهِ، جِئْتُكَ بِأَخِي لِتُبَايِعَهُ عَلَى الْهِجْرَةِ‏.‏ قَالَ ‏\"‏ ذَهَبَ أَهْلُ الْهِجْرَةِ بِمَا فِيهَا ‏\"‏‏.‏ فَقُلْتُ عَلَى أَىِّ شَىْءٍ تُبَايِعُهُ قَالَ ‏\"‏ أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالإِيمَانِ وَالْجِهَادِ‏\" فَلَقِيتُ أَبَا مَعْبَدٍ بَعْدُ وَكَانَ أَكْبَرَهُمَا فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.",
    "reference": "Reference : Sahih al-Bukhari 4305, 4306In-book reference : Book 64, Hadith 338USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4307,
    "id": 4307,
    "url": "https://sunnah.com/bukhari:4307",
    "bookNumber": 64,
    "hadithNumber": 339,
    "narrator": "Narrated Mujashi bin Masud:",
    "english": "I took Abu Mabad to the Prophet (ﷺ) in order that he might give him the pledge of allegiance for \nmigration. The Prophet (ﷺ) said, \"Migration has gone to its people, but I take the pledge from him (i.e. \nAbu Mabad) for Islam and Jihad.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ، انْطَلَقْتُ بِأَبِي مَعْبَدٍ إِلَى النَّبِيِّ صلى الله عليه وسلم لِيُبَايِعَهُ عَلَى الْهِجْرَةِ، قَالَ ‏\n\"‏ مَضَتِ الْهِجْرَةُ لأَهْلِهَا، أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالْجِهَادِ.\" فَلَقِيتُ أَبَا مَعْبَدٍ فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.‏ وَقَالَ خَالِدٌ عَنْ أَبِي عُثْمَانَ عَنْ مُجَاشِعٍ أَنَّهُ جَاءَ بِأَخِيهِ مُجَالِدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4307, 4308In-book reference : Book 64, Hadith 339USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 599   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4308,
    "id": 4308,
    "url": "https://sunnah.com/bukhari:4308",
    "bookNumber": 64,
    "hadithNumber": 339,
    "narrator": "Narrated Mujashi bin Masud:",
    "english": "I took Abu Mabad to the Prophet (ﷺ) in order that he might give him the pledge of allegiance for \nmigration. The Prophet (ﷺ) said, \"Migration has gone to its people, but I take the pledge from him (i.e. \nAbu Mabad) for Islam and Jihad.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ، انْطَلَقْتُ بِأَبِي مَعْبَدٍ إِلَى النَّبِيِّ صلى الله عليه وسلم لِيُبَايِعَهُ عَلَى الْهِجْرَةِ، قَالَ ‏\n\"‏ مَضَتِ الْهِجْرَةُ لأَهْلِهَا، أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالْجِهَادِ.\" فَلَقِيتُ أَبَا مَعْبَدٍ فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.‏ وَقَالَ خَالِدٌ عَنْ أَبِي عُثْمَانَ عَنْ مُجَاشِعٍ أَنَّهُ جَاءَ بِأَخِيهِ مُجَالِدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4307, 4308In-book reference : Book 64, Hadith 339USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 599   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4309,
    "id": 4309,
    "url": "https://sunnah.com/bukhari:4309",
    "bookNumber": 64,
    "hadithNumber": 340,
    "narrator": "Narrated Mujahid:",
    "english": "I said to Ibn `Umar, \"I want to migrate to Sham.\" He said, \"There is no migration, but Jihad (for \nAllah's Cause). Go and offer yourself for Jihad, and if you find an opportunity for Jihad (stay there) \notherwise, come back.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، قُلْتُ لاِبْنِ عُمَرَ ـ رضى الله عنهما ـ إِنِّي أُرِيدُ أَنْ أُهَاجِرَ إِلَى الشَّأْمِ‏.‏ قَالَ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ، فَانْطَلِقْ فَاعْرِضْ نَفْسَكَ، فَإِنْ وَجَدْتَ شَيْئًا وَإِلاَّ رَجَعْتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4309In-book reference : Book 64, Hadith 340USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 600   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4310,
    "id": 4310,
    "url": "https://sunnah.com/bukhari:4310",
    "bookNumber": 64,
    "hadithNumber": 341,
    "narrator": "(In an other narration) Ibn `Umar said:",
    "english": "\"There is no migration today or after \nAllah's Messenger (ﷺ).\" (and completed his statement as above.)",
    "arabic": "وَقَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو بِشْرٍ، سَمِعْتُ مُجَاهِدًا، قُلْتُ لاِبْنِ عُمَرَ فَقَالَ لاَ هِجْرَةَ الْيَوْمَ، أَوْ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4310In-book reference : Book 64, Hadith 341USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 600   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4311,
    "id": 4311,
    "url": "https://sunnah.com/bukhari:4311",
    "bookNumber": 64,
    "hadithNumber": 342,
    "narrator": "Narrated Mujahid bin Jabr:",
    "english": "`Abdullah bin `Umar used to say, \"There is no migration after the Conquest (of Mecca).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي أَبُو عَمْرٍو الأَوْزَاعِيُّ، عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ، عَنْ مُجَاهِدِ بْنِ جَبْرٍ الْمَكِّيِّ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَقُولُ لاَ هِجْرَةَ بَعْدَ الْفَتْحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4311In-book reference : Book 64, Hadith 342USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 601   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4312,
    "id": 4312,
    "url": "https://sunnah.com/bukhari:4312",
    "bookNumber": 64,
    "hadithNumber": 343,
    "narrator": "Narrated `Ata' bin Abi Rabah:",
    "english": "`Ubaid bin `Umar and I visited `Aisha, and he asked her about the migration. She said, \"There is no \nmigration today. A believer used to flee with his religion to Allah and His Prophet for fear that he \nmight be put to trial as regards his religion. Today Allah has rendered Islam victorious; therefore a \nbelieving one can worship one's Lord wherever one wishes. But there is Jihad (for Allah's Cause) and \nintentions.\" (See Hadith 42, in the 4th Vol. for its Explanation)",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، قَالَ زُرْتُ عَائِشَةَ مَعَ عُبَيْدِ بْنِ عُمَيْرٍ فَسَأَلَهَا عَنِ الْهِجْرَةِ، فَقَالَتْ لاَ هِجْرَةَ الْيَوْمَ، كَانَ الْمُؤْمِنُ يَفِرُّ أَحَدُهُمْ بِدِينِهِ إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى الله عليه وسلم مَخَافَةَ أَنْ يُفْتَنَ عَلَيْهِ، فَأَمَّا الْيَوْمَ فَقَدْ أَظْهَرَ اللَّهُ الإِسْلاَمَ، فَالْمُؤْمِنُ يَعْبُدُ رَبَّهُ حَيْثُ شَاءَ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4312In-book reference : Book 64, Hadith 343USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 602   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4313,
    "id": 4313,
    "url": "https://sunnah.com/bukhari:4313",
    "bookNumber": 64,
    "hadithNumber": 344,
    "narrator": "Narrated Mujahid:",
    "english": "Allah's Messenger (ﷺ) got up on the day of the Conquest of Mecca and said, \"Allah has made Mecca a \nsanctuary since the day He created the Heavens and the Earth, and it will remain a sanctuary by virtue \nof the sanctity Allah has bestowed on it till the Day of Resurrection. It (i.e. fighting in it) was not \nmade lawful to anyone before me!, nor will it be made lawful to anyone after me, and it was not made \nlawful for me except for a short period of time. Its game should not be chased, nor should its trees be \ncut, nor its vegetation or grass uprooted, not its Luqata (i.e. Most things) picked up except by one who \nmakes a public announcement about it.\" Al-Abbas bin `Abdul Muttalib said, \"Except the Idhkhir, O \nAllah's Messenger (ﷺ), as it is indispensable for blacksmiths and houses.\" On that, the Prophet (ﷺ) kept quiet and \nthen said, \"Except the Idhkhir as it is lawful to cut.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي حَسَنُ بْنُ مُسْلِمٍ، عَنْ مُجَاهِدٍ، أَنَّ رَسُولَ اللَّهِ قَامَ يَوْمَ الْفَتْحِ فَقَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، فَهْىَ حَرَامٌ بِحَرَامِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، لَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي، وَلَمْ تَحْلِلْ لِي إِلاَّ سَاعَةً مِنَ الدَّهْرِ، لاَ يُنَفَّرُ صَيْدُهَا، وَلاَ يُعْضَدُ شَوْكُهَا، وَلاَ يُخْتَلَى خَلاَهَا وَلاَ تَحِلُّ لُقَطَتُهَا إِلاَّ لِمُنْشِدٍ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ، فَإِنَّهُ لاَ بُدَّ مِنْهُ لِلْقَيْنِ وَالْبُيُوتِ، فَسَكَتَ ثُمَّ قَالَ ‏\"‏ إِلاَّ الإِذْخِرَ فَإِنَّهُ حَلاَلٌ ‏\"‏‏.‏ وَعَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْكَرِيمِ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ بِمِثْلِ هَذَا أَوْ نَحْوِ هَذَا‏.‏ رَوَاهُ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4313In-book reference : Book 64, Hadith 344USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 603   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4314,
    "id": 4314,
    "url": "https://sunnah.com/bukhari:4314",
    "bookNumber": 64,
    "hadithNumber": 345,
    "narrator": "Narrated Isma`il:",
    "english": "I saw (a healed scar of) blow over the hand of Ibn Abi `Aufa who said, \"I received that blow in the \nbattle of Hunain in the company of the Prophet.\" I said, \"Did you take part in the battle of Hunain?\" \nHe replied, \"Yes (and in other battles) before it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا إِسْمَاعِيلُ، رَأَيْتُ بِيَدِ ابْنِ أَبِي أَوْفَى ضَرْبَةً، قَالَ ضُرِبْتُهَا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ‏.‏ قُلْتُ شَهِدْتَ حُنَيْنًا قَالَ قَبْلَ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4314In-book reference : Book 64, Hadith 345USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 604   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4315,
    "id": 4315,
    "url": "https://sunnah.com/bukhari:4315",
    "bookNumber": 64,
    "hadithNumber": 346,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "I heard Al-Bara' narrating when a man came and said to him, \"O Abu '`Umara! Did you flee on the \nday (of the battle) of Hunain?\" Al-Bara' replied, \"I testify that the Prophet (ﷺ) did not flee, but the hasty \npeople hurried away and the people of Hawazin threw arrows at them. At that time, Abu Sufyan bin \nAl-Harith was holding the white mule of the Prophet (ﷺ) by the head, and the Prophet (ﷺ) was saying, \"I am \nthe Prophet (ﷺ) undoubtedly: I am the son of `Abdul-Muttalib.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، رضى الله عنه وَجَاءَهُ رَجُلٌ فَقَالَ يَا أَبَا عُمَارَةَ أَتَوَلَّيْتَ يَوْمَ حُنَيْنٍ فَقَالَ أَمَّا أَنَا فَأَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لَمْ يُوَلِّ، وَلَكِنْ عَجِلَ سَرَعَانُ الْقَوْمِ، فَرَشَقَتْهُمْ هَوَازِنُ، وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ آخِذٌ بِرَأْسِ بَغْلَتِهِ الْبَيْضَاءِ يَقُولُ ‏{‏أَنَا النَّبِيُّ لاَ كَذِبْ، أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4315In-book reference : Book 64, Hadith 346USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 605   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4316,
    "id": 4316,
    "url": "https://sunnah.com/bukhari:4316",
    "bookNumber": 64,
    "hadithNumber": 347,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "Al-Bara' was asked while I was listening, \"Did you flee (before the enemy) along with the Prophet (ﷺ) on \nthe day of (the battle of) Hunain?\" He replied, \"As for the Prophet, he did not (flee). The enemy were \ngood archers and the Prophet (ﷺ) was saying, \"I am the Prophet (ﷺ) undoubtedly; I am the son of `Abdul \nMuttalib.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قِيلَ لِلْبَرَاءِ وَأَنَا أَسْمَعُ، أَوَلَّيْتُمْ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ فَقَالَ أَمَّا النَّبِيُّ صلى الله عليه وسلم فَلاَ، كَانُوا رُمَاةً فَقَالَ ‏\n\"‏ أَنَا النَّبِيُّ لاَ كَذِبْ أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4316In-book reference : Book 64, Hadith 347USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 606   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4317,
    "id": 4317,
    "url": "https://sunnah.com/bukhari:4317",
    "bookNumber": 64,
    "hadithNumber": 348,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "That he heard Al-Bara narrating when a man from Qais (tribe) asked him \"Did you flee leaving \nAllah's Messenger (ﷺ) on the day (of the battle) of Hunain?\" Al-Bara' replied, \"But Allah's Messenger (ﷺ) did not \nflee. The people of Hawazin were good archers, and when we attacked them, they fled. But rushing \ntowards the booty, we were confronted by the arrows (of the enemy). I saw the Prophet (ﷺ) riding his \nwhite mule while Abu Sufyan was holding its reins, and the Prophet (ﷺ) was saying \"I am the Prophet (ﷺ) \nundoubtedly.\" (Israil and Zuhair said, \"The Prophet (ﷺ) dismounted from his Mule.\")",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ وَسَأَلَهُ رَجُلٌ مِنْ قَيْسٍ ـ أَفَرَرْتُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ فَقَالَ لَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَفِرَّ، كَانَتْ هَوَازِنُ رُمَاةً، وَإِنَّا لَمَّا حَمَلْنَا عَلَيْهِمِ انْكَشَفُوا، فَأَكْبَبْنَا عَلَى الْغَنَائِمِ، فَاسْتُقْبِلْنَا بِالسِّهَامِ، وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى بَغْلَتِهِ الْبَيْضَاءِ، وَإِنَّ أَبَا سُفْيَانَ آخِذٌ بِزِمَامِهَا وَهْوَ يَقُولُ ‏{‏أَنَا النَّبِيُّ لاَ كَذِبْ‏}‏‏.‏ قَالَ إِسْرَائِيلُ وَزُهَيْرٌ نَزَلَ النَّبِيُّ صلى الله عليه وسلم عَنْ بَغْلَتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4317In-book reference : Book 64, Hadith 348USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 607   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4318,
    "id": 4318,
    "url": "https://sunnah.com/bukhari:4318",
    "bookNumber": 64,
    "hadithNumber": 349,
    "narrator": "Narrated Marwan and Al-Miswar bin Makhrama:",
    "english": "When the delegate of Hawazin came to Allah's Messenger (ﷺ) declaring their conversion to Islam and asked \nhim to return their properties and captives, Allah's Messenger (ﷺ) got up and said to them, \"There Is involved \nin this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So \nchoose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. \nhave not distributed the booty).\" Allah's Messenger (ﷺ) had delayed the distribution of their booty over ten \nnights after his return from Ta'if. So when they came to know that Allah's Messenger (ﷺ) was not going to \nreturn to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Messenger (ﷺ) got \nup amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have \ncome to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to \ndo that as a favor then he can do it. And whoever of you likes to stick to his share till we give him \nfrom the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that \n(i.e. return the captives) willingly as a favor, 'O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"We do not \nknow which of you have agreed to it and which have not; so go back and let your chiefs forward us \nyour decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to \nAllah's Messenger (ﷺ) and informed him that all of them had agreed (to give up their captives) with pleasure, \nand had given their permission (i.e. that the captives be returned to their people). (The sub-narrator \nsaid, \"That is what has reached me about the captives of Hawazin tribe.\")",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ،، قَالَ مُحَمَّدُ بْنُ شِهَابٍ وَزَعَمَ عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ، فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْىَ، وَإِمَّا الْمَالَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِكُمْ ‏\"‏‏.‏ وَكَانَ أَنْظَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِضْعَ عَشْرَةَ لَيْلَةً، حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُسْلِمِينَ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّ إِخْوَانَكُمْ قَدْ جَاءُونَا تَائِبِينَ، وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ، حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا، فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِي ذَلِكَ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏ هَذَا الَّذِي بَلَغَنِي عَنْ سَبْىِ هَوَازِنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4318, 4319In-book reference : Book 64, Hadith 349USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 608   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4319,
    "id": 4319,
    "url": "https://sunnah.com/bukhari:4319",
    "bookNumber": 64,
    "hadithNumber": 349,
    "narrator": "Narrated Marwan and Al-Miswar bin Makhrama:",
    "english": "When the delegate of Hawazin came to Allah's Messenger (ﷺ) declaring their conversion to Islam and asked \nhim to return their properties and captives, Allah's Messenger (ﷺ) got up and said to them, \"There Is involved \nin this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So \nchoose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. \nhave not distributed the booty).\" Allah's Messenger (ﷺ) had delayed the distribution of their booty over ten \nnights after his return from Ta'if. So when they came to know that Allah's Messenger (ﷺ) was not going to \nreturn to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Messenger (ﷺ) got \nup amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have \ncome to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to \ndo that as a favor then he can do it. And whoever of you likes to stick to his share till we give him \nfrom the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that \n(i.e. return the captives) willingly as a favor, 'O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"We do not \nknow which of you have agreed to it and which have not; so go back and let your chiefs forward us \nyour decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to \nAllah's Messenger (ﷺ) and informed him that all of them had agreed (to give up their captives) with pleasure, \nand had given their permission (i.e. that the captives be returned to their people). (The sub-narrator \nsaid, \"That is what has reached me about the captives of Hawazin tribe.\")",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ،، قَالَ مُحَمَّدُ بْنُ شِهَابٍ وَزَعَمَ عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ، فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْىَ، وَإِمَّا الْمَالَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِكُمْ ‏\"‏‏.‏ وَكَانَ أَنْظَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِضْعَ عَشْرَةَ لَيْلَةً، حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُسْلِمِينَ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّ إِخْوَانَكُمْ قَدْ جَاءُونَا تَائِبِينَ، وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ، حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا، فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِي ذَلِكَ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏ هَذَا الَّذِي بَلَغَنِي عَنْ سَبْىِ هَوَازِنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4318, 4319In-book reference : Book 64, Hadith 349USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 608   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4320,
    "id": 4320,
    "url": "https://sunnah.com/bukhari:4320",
    "bookNumber": 64,
    "hadithNumber": 350,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When we returned from (the battle of) Hunain, `Umar asked the Prophet (ﷺ) about a vow which he had \nmade during the Pre-lslamic period of Ignorance that he would perform I`tikaf. The Prophet (ﷺ) ordered \nhim to fulfill his vow.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا قَفَلْنَا مِنْ حُنَيْنٍ سَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم عَنْ نَذْرٍ كَانَ نَذَرَهُ فِي الْجَاهِلِيَّةِ اعْتِكَافٍ، فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم بِوَفَائِهِ‏.‏ وَقَالَ بَعْضُهُمْ حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏ وَرَوَاهُ جَرِيرُ بْنُ حَازِمٍ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4320In-book reference : Book 64, Hadith 350USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 609   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4321,
    "id": 4321,
    "url": "https://sunnah.com/bukhari:4321",
    "bookNumber": 64,
    "hadithNumber": 351,
    "narrator": "Narrated Abu Qatada:",
    "english": "We set out along with the Prophet (ﷺ) during the year of (the battle of) Hunain, and when we faced the \nenemy, the Muslims (with the exception of the Prophet (ﷺ) and some of his companions) retreated (before \nthe enemy). I saw one of the pagans over-powering one of the Muslims, so I struck the pagan from \nbehind his neck causing his armor to be cut off. The pagan headed towards me and pressed me so \nforcibly that I felt as if I was dying. Then death took him over and he released me. Afterwards I \nfollowed `Umar and said to him, \"What is wrong with the people?\" He said, \"It is the Order of Allah.\" \nThen the Muslims returned (to the battle after the flight) and (after overcoming the enemy) the \nProphet sat and said, \"Whoever had killed an Infidel and has an evidence to this issue, will have the \nSalb (i.e. the belonging of the deceased e.g. clothes, arms, horse, etc).\" I (stood up) and said, \"Who \nwill be my witness?\" and then sat down. Then the Prophet (ﷺ) repeated his question. Then the Prophet (ﷺ) \nsaid the same (for the third time). I got up and said, \"Who will be my witness?\" and then sat down. \nThe Prophet (ﷺ) asked his former question again. So I got up. The Prophet (ﷺ) said, What is the matter, O \nAbu Qatada?\" So I narrated the whole story; A man said, \"Abu Qatada has spoken the truth, and the \nSalb of the deceased is with me, so please compensate Abu Qatada on my behalf.\" Abu Bakr said, \n\"No! By Allah, it will never happen that the Prophet (ﷺ) will leave a Lion of Allah who fights for the Sake \nof Allah and His Apostle and give his spoils to you.\" The Prophet (ﷺ) said, \"Abu Bakr has spoken the \ntruth. Give it (the spoils) back to him (O man)!\" So he gave it to me and I bought a garden in (the land \nof) Banu Salama with it (i.e. the spoils) and that was the first property I got after embracing Islam.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ حُنَيْنٍ، فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ، فَرَأَيْتُ رَجُلاً مِنَ الْمُشْرِكِينَ، قَدْ عَلاَ رَجُلاً مِنَ الْمُسْلِمِينَ، فَضَرَبْتُهُ مِنْ وَرَائِهِ عَلَى حَبْلِ عَاتِقِهِ بِالسَّيْفِ، فَقَطَعْتُ الدِّرْعَ، وَأَقْبَلَ عَلَىَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ، ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي، فَلَحِقْتُ عُمَرَ فَقُلْتُ مَا بَالُ النَّاسِ قَالَ أَمْرُ اللَّهِ عَزَّ وَجَلَّ‏.‏ ثُمَّ رَجَعُوا وَجَلَسَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏‏.‏ فَقُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ـ قَالَ ـ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ فَقُمْتُ فَقُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ قَالَ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ، فَقُمْتُ فَقَالَ ‏\"‏ مَالَكَ يَا أَبَا قَتَادَةَ ‏\"‏‏.‏ فَأَخْبَرْتُهُ‏.‏ فَقَالَ رَجُلٌ صَدَقَ وَسَلَبُهُ عِنْدِي، فَأَرْضِهِ مِنِّي‏.‏ فَقَالَ أَبُو بَكْرٍ لاَهَا اللَّهِ، إِذًا لاَ يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم فَيُعْطِيَكَ سَلَبَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَدَقَ فَأَعْطِهِ ‏\"‏‏.‏ فَأَعْطَانِيهِ فَابْتَعْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ، فَإِنَّهُ لأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4321In-book reference : Book 64, Hadith 351USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 610   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4322,
    "id": 4322,
    "url": "https://sunnah.com/bukhari:4322",
    "bookNumber": 64,
    "hadithNumber": 352,
    "narrator": "Narrated Abu Qatada:",
    "english": "When it was the day of (the battle of) Hunain, I saw a Muslim man fighting with one of the pagans \nand another pagan was hiding himself behind the Muslim in order to kill him. So I hurried towards the \npagan who was hiding behind the Muslim to kill him, and he raised his hand to hit me but I hit his \nhand and cut it off. That man got hold of me and pressed me so hard that I was afraid (that I would \ndie), then he knelt down and his grip became loose and I pushed him and killed him. The Muslims \n(excepting the Prophet (ﷺ) and some of his companions) started fleeing and I too, fled with them. \nSuddenly I met `Umar bin Al-Khattab amongst the people and I asked him, \"What is wrong with the \npeople?\" He said, \"It is the order of Allah\" Then the people returned to Allah's Messenger (ﷺ) (after \ndefeating the enemy). Allah's Messenger (ﷺ) said, \"Whoever produces a proof that he has killed an infidel, \nwill have the spoils of the killed man.\" So I got up to look for an evidence to prove that I had killed an \ninfidel, but I could not find anyone to bear witness for me, so I sat down. Then it came to my mind \n(that I should speak of it) and I mentioned the case to Allah's Messenger (ﷺ). A man from the persons who \nwere sitting with him (i.e. the Prophet), said, \"The arms of the deceased one whom he ( i.e. Abu \nQatada) has mentioned, are with me, so please compensate him for it (i.e. the spoils),\" Abu Bakr said, \n\"No, Allah's Messenger (ﷺ) will not give it (i.e. the spoils) to a weak humble person from Quraish and leave \none of Allah's Lions who fights on behalf of Allah and His Apostle.\" Allah's Messenger (ﷺ) then got up and \ngave that (spoils) to me, and I bought with it, a garden which was the first property I got after \nembracing Islam.",
    "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ أَنَّ أَبَا قَتَادَةَ، قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ نَظَرْتُ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ يُقَاتِلُ رَجُلاً مِنَ الْمُشْرِكِينَ، وَآخَرُ مِنَ الْمُشْرِكِينَ يَخْتِلُهُ مِنْ وَرَائِهِ لِيَقْتُلَهُ، فَأَسْرَعْتُ إِلَى الَّذِي يَخْتِلُهُ فَرَفَعَ يَدَهُ لِيَضْرِبَنِي، وَأَضْرِبُ يَدَهُ، فَقَطَعْتُهَا، ثُمَّ أَخَذَنِي، فَضَمَّنِي ضَمًّا شَدِيدًا حَتَّى تَخَوَّفْتُ، ثُمَّ تَرَكَ فَتَحَلَّلَ، وَدَفَعْتُهُ ثُمَّ قَتَلْتُهُ، وَانْهَزَمَ الْمُسْلِمُونَ، وَانْهَزَمْتُ مَعَهُمْ، فَإِذَا بِعُمَرَ بْنِ الْخَطَّابِ فِي النَّاسِ، فَقُلْتُ لَهُ مَا شَأْنُ النَّاسِ قَالَ أَمْرُ اللَّهِ، ثُمَّ تَرَاجَعَ النَّاسُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَقَامَ بَيِّنَةً عَلَى قَتِيلٍ قَتَلَهُ فَلَهُ سَلَبُهُ ‏\"‏‏.‏ فَقُمْتُ لأَلْتَمِسَ بَيِّنَةً عَلَى قَتِيلِي، فَلَمْ أَرَ أَحَدًا يَشْهَدُ لِي فَجَلَسْتُ، ثُمَّ بَدَا لِي، فَذَكَرْتُ أَمْرَهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ مِنْ جُلَسَائِهِ سِلاَحُ هَذَا الْقَتِيلِ الَّذِي يَذْكُرُ عِنْدِي فَأَرْضِهِ مِنْهُ‏.‏ فَقَالَ أَبُو بَكْرٍ كَلاَّ لاَ يُعْطِهِ أُصَيْبِغَ مِنْ قُرَيْشٍ، وَيَدَعَ أَسَدًا مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم قَالَ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَدَّاهُ إِلَىَّ، فَاشْتَرَيْتُ مِنْهُ خِرَافًا فَكَانَ أَوَّلَ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4322In-book reference : Book 64, Hadith 352USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 611   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4323,
    "id": 4323,
    "url": "https://sunnah.com/bukhari:4323",
    "bookNumber": 64,
    "hadithNumber": 353,
    "narrator": "Narrated Abu Musa:",
    "english": "When the Prophet (ﷺ) had finished from the battle of Hunain, he sent Abu Amir at the head of an army to \nAutas He (i.e. Abu Amir) met Duraid bin As Summa and Duraid was killed and Allah defeated his \ncompanions. The Prophet (ﷺ) sent me with Abu 'Amir. Abu Amir was shot at his knee with an arrow \nwhich a man from Jushm had shot and fixed into his knee. I went to him and said, \"O Uncle! Who \nshot you?\" He pointed me out (his killer) saying, \"That is my killer who shot me (with an arrow).\" So \nI headed towards him and overtook him, and when he saw me, he fled, and I followed him and started \nsaying to him, \"Won't you be ashamed? Won't you stop?\" So that person stopped, and we exchanged \ntwo hits with the swords and I killed him. \nThen I said to Abu 'Amir. \"Allah has killed your killer.\" He said, \"Take out this arrow\" So I removed \nit, and water oozed out of the wound. He then said, \"O son of my brother! Convey my compliments to \nthe Prophet (ﷺ) and request him to ask Allah's Forgiveness for me.\" Abu Amir made me his successor in \ncommanding the people (i.e. troops). He survived for a short while and then died. (Later) I returned \nand entered upon the Prophet (ﷺ) at his house, and found him lying in a bed made of stalks of date-palm \nleaves knitted with ropes, and on it there was bedding. The strings of the bed had their traces over his \nback and sides. Then I told the Prophet (ﷺ) about our and Abu Amir's news and how he had said \"Tell him \nto ask for Allah's Forgiveness for me.\" \nThe Prophet (ﷺ) asked for water, performed ablution and then raised hands, saying, \"O Allah's Forgive \n`Ubaid, Abu Amir.\" At that time I saw the whiteness of the Prophet's armpits. The Prophet (ﷺ) then said, \n\"O Allah, make him (i.e. Abu Amir) on the Day of Resurrection, superior to many of Your human \ncreatures.\" I said, \"Will you ask Allah's Forgiveness for me?\" (On that) the Prophet (ﷺ) said, \"O Allah, \nforgive the sins of `Abdullah bin Qais and admit him to a nice entrance (i.e. paradise) on the Day of \nResurrection.\" Abu Burda said, \"One of the prayers was for Abu 'Amir and the other was for Abu \nMusa (i.e. `Abdullah bin Qais).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ لَمَّا فَرَغَ النَّبِيُّ صلى الله عليه وسلم مِنْ حُنَيْنٍ بَعَثَ أَبَا عَامِرٍ عَلَى جَيْشٍ إِلَى أَوْطَاسٍ فَلَقِيَ دُرَيْدَ بْنَ الصِّمَّةِ، فَقُتِلَ دُرَيْدٌ وَهَزَمَ اللَّهُ أَصْحَابَهُ‏.‏ قَالَ أَبُو مُوسَى وَبَعَثَنِي مَعَ أَبِي عَامِرٍ فَرُمِيَ أَبُو عَامِرٍ فِي رُكْبَتِهِ، رَمَاهُ جُشَمِيٌّ بِسَهْمٍ فَأَثْبَتَهُ فِي رُكْبَتِهِ، فَانْتَهَيْتُ إِلَيْهِ فَقُلْتُ يَا عَمِّ مَنْ رَمَاكَ فَأَشَارَ إِلَى أَبِي مُوسَى فَقَالَ ذَاكَ قَاتِلِي الَّذِي رَمَانِي‏.‏ فَقَصَدْتُ لَهُ فَلَحِقْتُهُ فَلَمَّا رَآنِي وَلَّى فَاتَّبَعْتُهُ وَجَعَلْتُ أَقُولُ لَهُ أَلاَ تَسْتَحِي، أَلاَ تَثْبُتُ‏.‏ فَكَفَّ فَاخْتَلَفْنَا ضَرْبَتَيْنِ بِالسَّيْفِ فَقَتَلْتُهُ ثُمَّ قُلْتُ لأَبِي عَامِرٍ قَتَلَ اللَّهُ صَاحِبَكَ‏.‏ قَالَ فَانْزِعْ هَذَا السَّهْمَ فَنَزَعْتُهُ فَنَزَا مِنْهُ الْمَاءُ‏.‏ قَالَ يَا ابْنَ أَخِي أَقْرِئِ النَّبِيَّ صلى الله عليه وسلم السَّلاَمَ، وَقُلْ لَهُ اسْتَغْفِرْ لِي‏.‏ وَاسْتَخْلَفَنِي أَبُو عَامِرٍ عَلَى النَّاسِ، فَمَكَثَ يَسِيرًا ثُمَّ مَاتَ، فَرَجَعْتُ فَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِي بَيْتِهِ عَلَى سَرِيرٍ مُرْمَلٍ وَعَلَيْهِ فِرَاشٌ قَدْ أَثَّرَ رِمَالُ السَّرِيرِ بِظَهْرِهِ وَجَنْبَيْهِ، فَأَخْبَرْتُهُ بِخَبَرِنَا وَخَبَرِ أَبِي عَامِرٍ، وَقَالَ قُلْ لَهُ اسْتَغْفِرْ لِي، فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ ‏\"‏‏.‏ وَرَأَيْتُ بَيَاضَ إِبْطَيْهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ ‏\"‏‏.‏ فَقُلْتُ وَلِي فَاسْتَغْفِرْ‏.‏ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعَبْدِ اللَّهِ بْنِ قَيْسٍ ذَنْبَهُ وَأَدْخِلْهُ يَوْمَ الْقِيَامَةِ مُدْخَلاً كَرِيمًا ‏\"‏‏.‏ قَالَ أَبُو بُرْدَةَ إِحْدَاهُمَا لأَبِي عَامِرٍ وَالأُخْرَى لأَبِي مُوسَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4323In-book reference : Book 64, Hadith 353USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 612   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4324,
    "id": 4324,
    "url": "https://sunnah.com/bukhari:4324",
    "bookNumber": 64,
    "hadithNumber": 354,
    "narrator": "Narrated Um Salama:",
    "english": "The Prophet (ﷺ) came to me while there was an effeminate man sitting with me, and I heard him (i.e. the \neffeminate man) saying to `Abdullah bin Abi Umaiya, \"O `Abdullah! See if Allah should make you \nconquer Ta'if tomorrow, then take the daughter of Ghailan (in marriage) as (she is so beautiful and fat \nthat) she shows four folds of flesh when facing you, and eight when she turns her back.\" The Prophet (ﷺ) \nthen said, \"These (effeminate men) should never enter upon you (O women!).\" Ibn Juraij said, \"That \neffeminate man was called Hit.\"\nNarrated Hisham:\n\nThe above narration and added extra, that at that time, the Prophet, was besieging Taif.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، سَمِعَ سُفْيَانَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّهَا أُمِّ سَلَمَةَ ـ رضى الله عنها ـ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَعِنْدِي مُخَنَّثٌ فَسَمِعْتُهُ يَقُولُ لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ يَا عَبْدَ اللَّهِ أَرَأَيْتَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَعَلَيْكَ بِابْنَةِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُنَّ ‏\"‏‏.‏ قَالَ ابْنُ عُيَيْنَةَ وَقَالَ ابْنُ جُرَيْجٍ الْمُخَنَّثُ هِيتٌ‏.‏ حَدَّثَنَا مَحْمُودٌ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ بِهَذَا، وَزَادَ وَهْوَ مُحَاصِرٌ الطَّائِفَ يَوْمَئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4324In-book reference : Book 64, Hadith 354USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 613   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4325,
    "id": 4325,
    "url": "https://sunnah.com/bukhari:4325",
    "bookNumber": 64,
    "hadithNumber": 355,
    "narrator": "Narrated `Abdullah bin `Amr:",
    "english": "When Allah's Messenger (ﷺ) besieged Taif and could not conquer its people, he said, \"We will return (to \nMedina) If Allah wills.\" That distressed the Companions (of the Prophet (ﷺ) and they said, \"Shall we go \naway without conquering it (i.e. the Fort of Taif)?\" Once the Prophet (ﷺ) said, \"Let us return.\" Then the \nProphet said (to them), \"Fight tomorrow.\" They fought and (many of them) got wounded, whereupon \nthe Prophet (ﷺ) said, \"We will return (to Medina) tomorrow if Allah wills.\" That delighted them, \nwhereupon the Prophet (ﷺ) smiled. The sub-narrator, Sufyan said once, \"(The Prophet) smiled.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ الشَّاعِرِ الأَعْمَى، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ لَمَّا حَاصَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الطَّائِفَ فَلَمْ يَنَلْ مِنْهُمْ شَيْئًا قَالَ ‏\"‏ إِنَّا قَافِلُونَ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَثَقُلَ عَلَيْهِمْ وَقَالُوا نَذْهَبُ وَلاَ نَفْتَحُهُ ـ وَقَالَ مَرَّةً نَقْفُلُ ـ فَقَالَ ‏\"‏ اغْدُوا عَلَى الْقِتَالِ ‏\"‏‏.‏ فَغَدَوْا فَأَصَابَهُمْ جِرَاحٌ فَقَالَ ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَأَعْجَبَهُمْ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم، وَقَالَ سُفْيَانُ مَرَّةً فَتَبَسَّمَ‏.‏ قَالَ قَالَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ الْخَبَرَ كُلَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4325In-book reference : Book 64, Hadith 355USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 615   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4326,
    "id": 4326,
    "url": "https://sunnah.com/bukhari:4326",
    "bookNumber": 64,
    "hadithNumber": 356,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I heard from Sa`d, the first man who has thrown an arrow in Allah's Cause, and from Abu Bakra who \njumped over the wall of the Ta'if Fort along with a few persons and came to the Prophet. They both \nsaid, \"We heard the Prophet (ﷺ) saying, \" If somebody claims to be the son of somebody other than his \nfather knowingly, he will be denied Paradise (i.e. he will not enter Paradise).' \" \nNarrated Ma`mar from `Asim from Abu Al-`Aliya or Abu `Uthman An-Nahdi who said. \"I heard Sa`d \nand Abu Bakra narrating from the Prophet.\" `Asim said, \"I said (to him), 'Very trustworthy persons \nhave narrated to you.' He said, 'Yes, one of them was the first to throw an arrow in Allah's Cause and \nthe other came to the Prophet (ﷺ) in a group of thirty-three persons from Ta'if.'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، قَالَ سَمِعْتُ سَعْدًا ـ وَهْوَ أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ ـ وَأَبَا بَكْرَةَ ـ وَكَانَ تَسَوَّرَ حِصْنَ الطَّائِفِ فِي أُنَاسٍ ـ فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالاَ سَمِعْنَا النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهْوَ يَعْلَمُ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.‏   \nوَقَالَ هِشَامٌ وَأَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنْ أَبِي الْعَالِيَةِ، أَوْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ سَمِعْتُ سَعْدًا، وَأَبَا، بَكْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ عَاصِمٌ قُلْتُ لَقَدْ شَهِدَ عِنْدَكَ رَجُلاَنِ حَسْبُكَ بِهِمَا‏.‏ قَالَ أَجَلْ أَمَّا أَحَدُهُمَا فَأَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَأَمَّا الآخَرُ فَنَزَلَ إِلَى النَّبِيِّ صلى الله عليه وسلم ثَالِثَ ثَلاَثَةٍ وَعِشْرِينَ مِنَ الطَّائِفِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4326, 4327In-book reference : Book 64, Hadith 356USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 616   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4327,
    "id": 4327,
    "url": "https://sunnah.com/bukhari:4327",
    "bookNumber": 64,
    "hadithNumber": 356,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I heard from Sa`d, the first man who has thrown an arrow in Allah's Cause, and from Abu Bakra who \njumped over the wall of the Ta'if Fort along with a few persons and came to the Prophet. They both \nsaid, \"We heard the Prophet (ﷺ) saying, \" If somebody claims to be the son of somebody other than his \nfather knowingly, he will be denied Paradise (i.e. he will not enter Paradise).' \" \nNarrated Ma`mar from `Asim from Abu Al-`Aliya or Abu `Uthman An-Nahdi who said. \"I heard Sa`d \nand Abu Bakra narrating from the Prophet.\" `Asim said, \"I said (to him), 'Very trustworthy persons \nhave narrated to you.' He said, 'Yes, one of them was the first to throw an arrow in Allah's Cause and \nthe other came to the Prophet (ﷺ) in a group of thirty-three persons from Ta'if.'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، قَالَ سَمِعْتُ سَعْدًا ـ وَهْوَ أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ ـ وَأَبَا بَكْرَةَ ـ وَكَانَ تَسَوَّرَ حِصْنَ الطَّائِفِ فِي أُنَاسٍ ـ فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالاَ سَمِعْنَا النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهْوَ يَعْلَمُ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.‏   \nوَقَالَ هِشَامٌ وَأَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنْ أَبِي الْعَالِيَةِ، أَوْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ سَمِعْتُ سَعْدًا، وَأَبَا، بَكْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ عَاصِمٌ قُلْتُ لَقَدْ شَهِدَ عِنْدَكَ رَجُلاَنِ حَسْبُكَ بِهِمَا‏.‏ قَالَ أَجَلْ أَمَّا أَحَدُهُمَا فَأَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَأَمَّا الآخَرُ فَنَزَلَ إِلَى النَّبِيِّ صلى الله عليه وسلم ثَالِثَ ثَلاَثَةٍ وَعِشْرِينَ مِنَ الطَّائِفِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4326, 4327In-book reference : Book 64, Hadith 356USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 616   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4328,
    "id": 4328,
    "url": "https://sunnah.com/bukhari:4328",
    "bookNumber": 64,
    "hadithNumber": 357,
    "narrator": "Narrated Abu Burda:",
    "english": "Abu Musa said, \"I was with the Prophet (ﷺ) when he was encamping at Al-Jarana (a place) between \nMecca and Medina and Bilal was with him. A bedouin came to the Prophet (ﷺ) and said, \"Won't you \nfulfill what you have promised me?\" The Prophet (ﷺ) said, 'Rejoice (at what I will do for you).' The \nbedouin said, \"(You have said to me) rejoice too often.\" Then the Prophet (ﷺ) turned to me (i.e. Abu \nMusa) and Bilal in an angry mood and said, 'The bedouin has refused the good tidings, so you both \naccept them.' Bilal and I said, 'We accept them.' Then the Prophet (ﷺ) asked for a drinking bowl \ncontaining water and washed his hands and face in it, and then took a mouthful of water and threw it \ntherein saying (to us), \"Drink (some of) it and pour (some) over your faces and chests and be happy at \nthe good tidings.\" So they both took the drinking bowl and did as instructed. Um Salama called from \nbehind a screen, \"Keep something (of the water for your mother.\" So they left some of it for her.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ نَازِلٌ بِالْجِعْرَانَةِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ وَمَعَهُ بِلاَلٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم أَعْرَابِيٌّ فَقَالَ أَلاَ تُنْجِزُ لِي مَا وَعَدْتَنِي‏.‏ فَقَالَ لَهُ ‏\"‏ أَبْشِرْ ‏\"‏‏.‏ فَقَالَ قَدْ أَكْثَرْتَ عَلَىَّ مِنْ أَبْشِرْ‏.‏ فَأَقْبَلَ عَلَى أَبِي مُوسَى وَبِلاَلٍ كَهَيْئَةِ الْغَضْبَانِ فَقَالَ ‏\"‏ رَدَّ الْبُشْرَى فَاقْبَلاَ أَنْتُمَا ‏\"‏‏.‏ قَالاَ قَبِلْنَا‏.‏ ثُمَّ دَعَا بِقَدَحٍ فِيهِ مَاءٌ فَغَسَلَ يَدَيْهِ وَوَجْهَهُ فِيهِ، وَمَجَّ فِيهِ، ثُمَّ قَالَ ‏\"‏ اشْرَبَا مِنْهُ، وَأَفْرِغَا عَلَى وُجُوهِكُمَا وَنُحُورِكُمَا، وَأَبْشِرَا ‏\"‏‏.‏ فَأَخَذَا الْقَدَحَ فَفَعَلاَ، فَنَادَتْ أُمُّ سَلَمَةَ مِنْ وَرَاءِ السِّتْرِ أَنْ أَفْضِلاَ لأُمِّكُمَا‏.‏ فَأَفْضَلاَ لَهَا مِنْهُ طَائِفَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4328In-book reference : Book 64, Hadith 357USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 617   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4329,
    "id": 4329,
    "url": "https://sunnah.com/bukhari:4329",
    "bookNumber": 64,
    "hadithNumber": 358,
    "narrator": "Narrated Safwan bin Ya`la bin Umaiya:",
    "english": "Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time when he is being inspired divinely.\" \nYa`la added \"While the Prophet (ﷺ) was at Al-Ja'rana, shaded with a cloth sheet (in the form of a tent) and \nthere were staying with him, some of his companions under it, suddenly there came to him a bedouin \nwearing a cloak and perfumed extravagantly. He said, \"O Allah's Messenger (ﷺ) ! What is your opinion \nregarding a man who assumes the state of Ihram for `Umra wearing a cloak after applying perfume to \nhis body?\" `Umar signalled with his hand to Ya`la to come (near). Ya`la came and put his head \n(underneath that cloth sheet) and saw the Prophet (ﷺ) red-faced and when that state (of the Prophet (ﷺ) ) was \nover, he said, \"Where is he who as already asked me about the `Umra?\" The man was looked for and \nbrought to the Prophet (ﷺ) The Prophet (ﷺ) said (to him), \"As for the perfume you have applied to your body, \nwash it off your body) thrice, and take off your cloak, and then do in your `Umra the rites you do in \nyour Hajj.\"",
    "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّ صَفْوَانَ بْنَ يَعْلَى بْنِ أُمَيَّةَ، أَخْبَرَ أَنَّ يَعْلَى كَانَ يَقُولُ لَيْتَنِي أَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ يُنْزَلُ عَلَيْهِ‏.‏ قَالَ فَبَيْنَا النَّبِيُّ صلى الله عليه وسلم بِالْجِعْرَانَةِ وَعَلَيْهِ ثَوْبٌ قَدْ أُظِلَّ بِهِ، مَعَهُ فِيهِ نَاسٌ مِنْ أَصْحَابِهِ، إِذْ جَاءَهُ أَعْرَابِيٌّ عَلَيْهِ جُبَّةٌ مُتَضَمِّخٌ بِطِيبٍ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحْرَمَ بِعُمْرَةٍ فِي جُبَّةٍ بَعْدَ مَا تَضَمَّخَ بِالطِّيبِ فَأَشَارَ عُمَرُ إِلَى يَعْلَى بِيَدِهِ أَنْ تَعَالَ‏.‏ فَجَاءَ يَعْلَى فَأَدْخَلَ رَأْسَهُ، فَإِذَا النَّبِيُّ صلى الله عليه وسلم مُحْمَرُّ الْوَجْهِ، يَغِطُّ كَذَلِكَ سَاعَةً، ثُمَّ سُرِّيَ عَنْهُ فَقَالَ ‏\"‏ أَيْنَ الَّذِي يَسْأَلُنِي عَنِ الْعُمْرَةِ آنَفًا ‏\"‏‏.‏ فَالْتُمِسَ الرَّجُلُ فَأُتِيَ بِهِ فَقَالَ ‏\"‏ أَمَّا الطِّيبُ الَّذِي بِكَ فَاغْسِلْهُ ثَلاَثَ مَرَّاتٍ، وَأَمَّا الْجُبَّةُ فَانْزِعْهَا، ثُمَّ اصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4329In-book reference : Book 64, Hadith 358USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 618   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4330,
    "id": 4330,
    "url": "https://sunnah.com/bukhari:4330",
    "bookNumber": 64,
    "hadithNumber": 359,
    "narrator": "Narrated `Abdullah bin Zaid bin `Asim:",
    "english": "When Allah gave to His Apostle the war booty on the day of Hunain, he distributed that booty \namongst those whose hearts have been (recently) reconciled (to Islam), but did not give anything to \nthe Ansar. So they seemed to have felt angry and sad as they did not get the same as other people had \ngot. The Prophet (ﷺ) then delivered a sermon before them, saying, \"O, the assembly of Ansar! Didn't I \nfind you astray, and then Allah guided you on the Right Path through me? You were divided into \ngroups, and Allah brought you together through me; you were poor and Allah made you rich through \nme.\" Whatever the Prophet (ﷺ) said , they (i.e. the Ansar) said, \"Allah and his Apostle have more favours \nto do.\" The Prophet (ﷺ) said, \"What stops you from answering the Messenger of Allah?\" But whatever he \nsaid to them, they replied, \"Allah and His Apostle have more favours to do.\" The Prophet (ﷺ) then said, \n\"If you wish you could say: 'You came to us in such-and-such state (at Medina).' Wouldn't you be \nwilling to see the people go away with sheep and camels while you go with the Prophet (ﷺ) to your \nhomes? But for the migration, I would have been one of the Ansar, and if the people took their way \nthrough a valley or mountain pass, I would select the valley or mountain pass of the Ansar. The Ansar \nare Shiar (i.e. those clothes which are in direct contact with the body and worn inside the other \ngarments), and the people are Dithar (i.e. those clothes which are not in direct contact with the body \nand are worn over other garments). No doubt, you will see other people favoured over you, so you \nshould be patient till you meet me at the Tank (of Kauthar).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ، قَالَ لَمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ قَسَمَ فِي النَّاسِ فِي الْمُؤَلَّفَةِ قُلُوبُهُمْ، وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا، فَكَأَنَّهُمْ وَجَدُوا إِذْ لَمْ يُصِبْهُمْ مَا أَصَابَ النَّاسَ فَخَطَبَهُمْ فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ أَلَمْ أَجِدْكُمْ ضُلاَّلاً فَهَدَاكُمُ اللَّهُ بِي، وَكُنْتُمْ مُتَفَرِّقِينَ فَأَلَّفَكُمُ اللَّهُ بِي وَعَالَةً، فَأَغْنَاكُمُ اللَّهُ بِي ‏\"‏‏.‏ كُلَّمَا قَالَ شَيْئًا قَالُوا اللَّهُ وَرَسُولُهُ أَمَنُّ‏.‏ قَالَ ‏\"‏ مَا يَمْنَعُكُمْ أَنْ تُجِيبُوا رَسُولَ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ قَالَ كُلَّمَا قَالَ شَيْئًا قَالُوا اللَّهُ وَرَسُولُهُ أَمَنُّ‏.‏ قَالَ ‏\"‏ لَوْ شِئْتُمْ قُلْتُمْ جِئْتَنَا كَذَا وَكَذَا‏.‏ أَتَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالشَّاةِ وَالْبَعِيرِ، وَتَذْهَبُونَ بِالنَّبِيِّ صلى الله عليه وسلم إِلَى رِحَالِكُمْ، لَوْلاَ الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الأَنْصَارِ، وَلَوْ سَلَكَ النَّاسُ وَادِيًا وَشِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ وَشِعْبَهَا، الأَنْصَارُ شِعَارٌ وَالنَّاسُ دِثَارٌ، إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4330In-book reference : Book 64, Hadith 359USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 619   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4331,
    "id": 4331,
    "url": "https://sunnah.com/bukhari:4331",
    "bookNumber": 64,
    "hadithNumber": 360,
    "narrator": "Narrated Anas Bin Malik:",
    "english": "When Allah gave Allah's Messenger (ﷺ) what he gave of the properties of the Hawazin tribe as a war booty, \nthe Prophet (ﷺ) started giving some men 100 camels each. The Ansar (then) said, \"May Allah forgive \nAllah's Messenger (ﷺ)s as he gives to Quraish and leaves us although our swords are still dribbling with the \nblood of Quraish.\" Allah Apostle was informed of their statement, so he sent for the Ansar and \ngathered them in a leather tent, and did not call anybody else along with them. When they al I \ngathered, the Prophet (ﷺ) got up and said, \"What is this talk being informed to me about you?\" The \nlearned men amongst the Ansar said, \"O Allah's Messenger (ﷺ)! Our chiefs did not say anything, but some \npeople amongst us who are younger in age said. 'May Allah forgive Allah's Messenger (ﷺ) as he gives (of the \nbooty) to Quraish and leaves us though our swords are still dribbling with their blood.\" The Prophet (ﷺ) \nsaid, \"I give to these men who have newly deserted heathenism (and embraced Islam) so as to attract \ntheir hearts. Won't you be happy that the people take the wealth while you take the Prophet (ﷺ) with you \nto your homes? By Allah, what you are taking is better than whatever they are taking.\" They (i.e. the \nAnsar) said, \"O Allah's Messenger (ﷺ)! We are satisfied.\" The Prophet (ﷺ) then said to them. \"You will find \nothers favored over you greatly, so be patient till you meet Allah and His Apostle and I will be at the \nTank then.\" Anas added: But they did not remain patient.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ نَاسٌ مِنَ الأَنْصَارِ حِينَ أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مَا أَفَاءَ مِنْ أَمْوَالِ هَوَازِنَ، فَطَفِقَ النَّبِيُّ صلى الله عليه وسلم يُعْطِي رِجَالاً الْمِائَةَ مِنَ الإِبِلِ فَقَالُوا يَغْفِرُ اللَّهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يُعْطِي قُرَيْشًا وَيَتْرُكُنَا، وَسُيُوفُنَا تَقْطُرُ مِنْ دِمَائِهِمْ‏.‏ قَالَ أَنَسٌ فَحُدِّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَقَالَتِهِمْ، فَأَرْسَلَ إِلَى الأَنْصَارِ فَجَمَعَهُمْ فِي قُبَّةٍ مِنْ أَدَمٍ وَلَمْ يَدْعُ مَعَهُمْ غَيْرَهُمْ، فَلَمَّا اجْتَمَعُوا قَامَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا حَدِيثٌ بَلَغَنِي عَنْكُمْ ‏\"‏‏.‏ فَقَالَ فُقَهَاءُ الأَنْصَارِ أَمَّا رُؤَسَاؤُنَا يَا رَسُولَ اللَّهِ فَلَمْ يَقُولُوا شَيْئًا، وَأَمَّا نَاسٌ مِنَّا حَدِيثَةٌ أَسْنَانُهُمْ فَقَالُوا يَغْفِرُ اللَّهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يُعْطِي قُرَيْشًا وَيَتْرُكُنَا، وَسُيُوفُنَا تَقْطُرُ مِنْ دِمَائِهِمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُعْطِي رِجَالاً حَدِيثِي عَهْدٍ بِكُفْرٍ، أَتَأَلَّفُهُمْ، أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالأَمْوَالِ وَتَذْهَبُونَ بِالنَّبِيِّ صلى الله عليه وسلم إِلَى رِحَالِكُمْ، فَوَاللَّهِ لَمَا تَنْقَلِبُونَ بِهِ خَيْرٌ مِمَّا يَنْقَلِبُونَ بِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَدْ رَضِينَا‏.‏ فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ سَتَجِدُونَ أُثْرَةً شَدِيدَةً، فَاصْبِرُوا حَتَّى تَلْقَوُا اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم فَإِنِّي عَلَى الْحَوْضِ ‏\"‏‏.‏ قَالَ أَنَسٌ فَلَمْ يَصْبِرُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4331In-book reference : Book 64, Hadith 360USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 620   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4332,
    "id": 4332,
    "url": "https://sunnah.com/bukhari:4332",
    "bookNumber": 64,
    "hadithNumber": 361,
    "narrator": "Narrated Anas:",
    "english": "When it was the day of the Conquest (of Mecca) Allah's Messenger (ﷺ) distributed the war booty amongst \nthe people of Quraish which caused the Ansar to become angry. So the Prophet (ﷺ) said, \"Won't you be \npleased that the people take the worldly things and you take Allah's Messenger (ﷺ) with you? \"They said, \n\"Yes.\" The Prophet (ﷺ) said, \"If the people took their way through a valley or mountain pass, I would take \nmy way through the Ansar's valley or mountain pass.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ لَمَّا كَانَ يَوْمَ فَتْحِ مَكَّةَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم غَنَائِمَ بَيْنَ قُرَيْشٍ‏.‏ فَغَضِبَتِ الأَنْصَارُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالدُّنْيَا، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا أَوْ شِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ أَوْ شِعْبَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4332In-book reference : Book 64, Hadith 361USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 621   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4333,
    "id": 4333,
    "url": "https://sunnah.com/bukhari:4333",
    "bookNumber": 64,
    "hadithNumber": 362,
    "narrator": "Narrated Anas:",
    "english": "When it was the day of (the battle of) Hunain, the Prophet (ﷺ) confronted the tribe of Hawazin while there \nwere ten-thousand (men) besides the Tulaqa' (i.e. those who had embraced Islam on the day of the \nConquest of Mecca) with the Prophet. When they (i.e. Muslims) fled, the Prophet (ﷺ) said, \"O the group \nof Ansari\" They replied, \"Labbaik, O Allah's Messenger (ﷺ) and Sadaik! We are under your command.\" \nThen the Prophet (ﷺ) got down (from his mule) and said, \"I am Allah's Slave and His Apostle.\" Then the \npagans were defeated. The Prophet (ﷺ) distributed the war booty amongst the Tulaqa and Muhajirin (i.e. \nEmigrants) and did not give anything to the Ansar. So the Ansar spoke (i.e. were dissatisfied) and he \ncalled them and made them enter a leather tent and said, Won't you be pleased that the people take the \nsheep and camels, and you take Allah's Messenger (ﷺ) along with you?\" The Prophet (ﷺ) added, \"If the people \ntook their way through a valley and the Ansar took their way through a mountain pass, then I would \nchoose a mountain pass of the Ansar.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَزْهَرُ، عَنِ ابْنِ عَوْنٍ، أَنْبَأَنَا هِشَامُ بْنُ زَيْدِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمَ حُنَيْنٍ الْتَقَى هَوَازِنُ وَمَعَ النَّبِيِّ صلى الله عليه وسلم عَشَرَةُ آلاَفٍ وَالطُّلَقَاءُ فَأَدْبَرُوا قَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ، لَبَّيْكَ نَحْنُ بَيْنَ يَدَيْكَ، فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏‏.‏ فَانْهَزَمَ الْمُشْرِكُونَ، فَأَعْطَى الطُّلَقَاءَ وَالْمُهَاجِرِينَ وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا فَقَالُوا، فَدَعَاهُمْ فَأَدْخَلَهُمْ فِي قُبَّةٍ فَقَالَ ‏\"‏ أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالشَّاةِ وَالْبَعِيرِ، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتِ الأَنْصَارُ شِعْبًا لاَخْتَرْتُ شِعْبَ الأَنْصَارِ ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4333In-book reference : Book 64, Hadith 362USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 622   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4334,
    "id": 4334,
    "url": "https://sunnah.com/bukhari:4334",
    "bookNumber": 64,
    "hadithNumber": 363,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) gathered some people of Ansar and said, \"The People of Quraish are still close to their \nPre-lslamic period of ignorance and have suffered a lot, and I want to help them and attract their \nhearts (by giving them the war booty). Won't you be pleased that the people take the worldly things) \nand you take Allah's Messenger (ﷺ) with you to your homes?\" They said, \"Yes, (i.e. we are pleased with this \ndistribution).\" The Prophet (ﷺ) said, \"'If the people took their way through a valley and the Ansar took \ntheir way through a mountain pass, then I would take the Ansar's valley or the Ansar's mountain pass.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ جَمَعَ النَّبِيُّ صلى الله عليه وسلم نَاسًا مِنَ الأَنْصَارِ، فَقَالَ ‏\"‏ إِنَّ قُرَيْشًا حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ وَمُصِيبَةٍ، وَإِنِّي أَرَدْتُ أَنْ أَجْبُرَهُمْ وَأَتَأَلَّفَهُمْ أَمَا تَرْضَوْنَ أَنْ يَرْجِعَ النَّاسُ بِالدُّنْيَا، وَتَرْجِعُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى بُيُوتِكُمْ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتِ الأَنْصَارُ شِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ أَوْ شِعْبَ الأَنْصَارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4334In-book reference : Book 64, Hadith 363USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 623   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4335,
    "id": 4335,
    "url": "https://sunnah.com/bukhari:4335",
    "bookNumber": 64,
    "hadithNumber": 364,
    "narrator": "Narrated `Abdullah:",
    "english": "When the Prophet (ﷺ) distribute the war booty of Hunain, a man from the Ansar said, \"He (i.e. the \nProphet), did not intend to please Allah in this distribution.\" So I came to the Prophet (ﷺ) and informed \nhim of that (statement) whereupon the color of his face changed and he said, \"May Allah bestow His \nMercy on Moses, for he was troubled with more than this, but he remained patient.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا قَسَمَ النَّبِيُّ صلى الله عليه وسلم قِسْمَةَ حُنَيْنٍ قَالَ رَجُلٌ مِنَ الأَنْصَارِ مَا أَرَادَ بِهَا وَجْهَ اللَّهِ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَتَغَيَّرَ وَجْهُهُ ثُمَّ قَالَ ‏\n\"‏ رَحْمَةُ اللَّهِ عَلَى مُوسَى، لَقَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4335In-book reference : Book 64, Hadith 364USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 624   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4336,
    "id": 4336,
    "url": "https://sunnah.com/bukhari:4336",
    "bookNumber": 64,
    "hadithNumber": 365,
    "narrator": "Narrated `Abdullah:",
    "english": "When it was the day of Hunain, Prophet favored some people over some others (in the distribution of \nthe booty). He gave Al-Aqra' one-hundred camels and gave Uyaina the same, and also gave other \npeople (of Quraish). A man said, \"Allah's Pleasure was not the aim, in this distribution.\" I said, \"I will \ninform the Prophet (about your statement).\" The Prophet (ﷺ) said, \"May Allah bestow Mercy on Moses, \nfor he was troubled more this but he remained patient.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ آثَرَ النَّبِيُّ صلى الله عليه وسلم نَاسًا، أَعْطَى الأَقْرَعَ مِائَةً مِنَ الإِبِلِ، وَأَعْطَى عُيَيْنَةَ مِثْلَ ذَلِكَ، وَأَعْطَى نَاسًا، فَقَالَ رَجُلٌ مَا أُرِيدَ بِهَذِهِ الْقِسْمَةِ وَجْهُ اللَّهِ‏.‏ فَقُلْتُ لأُخْبِرَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَحِمَ اللَّهُ مُوسَى‏.‏ قَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4336In-book reference : Book 64, Hadith 365USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 625   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4337,
    "id": 4337,
    "url": "https://sunnah.com/bukhari:4337",
    "bookNumber": 64,
    "hadithNumber": 366,
    "narrator": "Narrated Anas Bin Malik:",
    "english": "When it was the day (of the battle) of Hunain, the tributes of Hawazin and Ghatafan and others, along \nwith their animals and offspring (and wives) came to fight against the Prophet (ﷺ) The Prophet (ﷺ) had with \nhim, ten thousand men and some of the Tulaqa. The companions fled, leaving the Prophet (ﷺ) alone. The \nProphet then made two calls which were clearly distinguished from each other. He turned right and \nsaid, \"O the group of Ansar!\" They said, \"Labbaik, O Allah's Messenger (ﷺ)! Rejoice, for we are with you!\" \nThen he turned left and said, \"O the group of Ansar!\" They said, \"Labbaik! O Allah's Messenger (ﷺ)! \nRejoice, for we are with you!\" The Prophet (ﷺ) at that time, was riding on a white mule; then he \ndismounted and said, \"I am Allah's Slave and His Apostle.\" The infidels then were defeated, and on \nthat day the Prophet (ﷺ) gained a large amount of booty which he distributed amongst the Muhajirin and \nthe Tulaqa and did not give anything to the Ansar. The Ansar said, \"When there is a difficulty, we are \ncalled, but the booty is given to other than us.\" The news reached the Prophet (ﷺ) and he gathered them in \na leather tent and said, \"What is this news reaching me from you, O the group of Ansar?\" They kept \nsilent, He added,\" O the group of Ansar! Won't you be happy that the people take the worldly things \nand you take Allah's Messenger (ﷺ) to your homes reserving him for yourself?\" They said, \"Yes.\" Then the \nProphet said, \"If the people took their way through a valley, and the Ansar took their way through a \nmountain pass, surely, I would take the Ansar's mountain pass.\" Hisham said, \"O Abu Hamza (i.e. \nAnas)! Did you witness that? \" He replied, \"And how could I be absent from him?\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ أَقْبَلَتْ هَوَازِنُ وَغَطَفَانُ وَغَيْرُهُمْ بِنَعَمِهِمْ وَذَرَارِيِّهِمْ، وَمَعَ النَّبِيِّ صلى الله عليه وسلم عَشَرَةُ آلاَفٍ وَمِنَ الطُّلَقَاءِ، فَأَدْبَرُوا عَنْهُ حَتَّى بَقِيَ وَحْدَهُ، فَنَادَى يَوْمَئِذٍ نِدَاءَيْنِ لَمْ يَخْلِطْ بَيْنَهُمَا، الْتَفَتَ عَنْ يَمِينِهِ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ، أَبْشِرْ نَحْنُ مَعَكَ‏.‏ ثُمَّ الْتَفَتَ عَنْ يَسَارِهِ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ، أَبْشِرْ نَحْنُ مَعَكَ‏.‏ وَهْوَ عَلَى بَغْلَةٍ بَيْضَاءَ، فَنَزَلَ فَقَالَ ‏\"‏ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏، فَانْهَزَمَ الْمُشْرِكُونَ، فَأَصَابَ يَوْمَئِذٍ غَنَائِمَ كَثِيرَةً، فَقَسَمَ فِي الْمُهَاجِرِينَ وَالطُّلَقَاءِ وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا، فَقَالَتِ الأَنْصَارُ إِذَا كَانَتْ شَدِيدَةٌ فَنَحْنُ نُدْعَى، وَيُعْطَى الْغَنِيمَةَ غَيْرُنَا‏.‏ فَبَلَغَهُ ذَلِكَ، فَجَمَعَهُمْ فِي قُبَّةٍ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ مَا حَدِيثٌ بَلَغَنِي عَنْكُمْ ‏\"‏‏.‏ فَسَكَتُوا فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ أَلاَ تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالدُّنْيَا، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم تَحُوزُونَهُ إِلَى بُيُوتِكُمْ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا، وَسَلَكَتِ الأَنْصَارُ شِعْبًا لأَخَذْتُ شِعْبَ الأَنْصَارِ ‏\"‏‏.‏ فَقَالَ هِشَامٌ يَا أَبَا حَمْزَةَ، وَأَنْتَ شَاهِدٌ ذَاكَ قَالَ وَأَيْنَ أَغِيبُ عَنْهُ",
    "reference": "Reference : Sahih al-Bukhari 4337In-book reference : Book 64, Hadith 366USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 626   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4338,
    "id": 4338,
    "url": "https://sunnah.com/bukhari:4338",
    "bookNumber": 64,
    "hadithNumber": 367,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) sent a Sariya towards Najd and I was in it, and our share from the booty amounted to \ntwelve camels each, and we were given an additional camel each. So we returned with thirteen camels \neach.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً قِبَلَ نَجْدٍ، فَكُنْتُ فِيهَا، فَبَلَغَتْ سِهَامُنَا اثْنَىْ عَشَرَ بَعِيرًا، وَنُفِّلْنَا بَعِيرًا بَعِيرًا، فَرَجَعْنَا بِثَلاَثَةَ عَشَرَ بَعِيرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4338In-book reference : Book 64, Hadith 367USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 627   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4339,
    "id": 4339,
    "url": "https://sunnah.com/bukhari:4339",
    "bookNumber": 64,
    "hadithNumber": 368,
    "narrator": "Narrated Salim's father:",
    "english": "The Prophet (ﷺ) sent Khalid bin Al-Walid to the tribe of Jadhima and Khalid invited them to Islam but \nthey could not express themselves by saying, \"Aslamna (i.e. we have embraced Islam),\" but they \nstarted saying \"Saba'na! Saba'na (i.e. we have come out of one religion to another).\" Khalid kept on \nkilling (some of) them and taking (some of) them as captives and gave every one of us his Captive. \nWhen there came the day then Khalid ordered that each man (i.e. Muslim soldier) should kill his \ncaptive, I said, \"By Allah, I will not kill my captive, and none of my companions will kill his captive.\" \nWhen we reached the Prophet, we mentioned to him the whole story. On that, the Prophet (ﷺ) raised both \nhis hands and said twice, \"O Allah! I am free from what Khalid has done.\"",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَحَدَّثَنِي نُعَيْمٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ، فَدَعَاهُمْ إِلَى الإِسْلاَمِ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا أَسْلَمْنَا‏.‏ فَجَعَلُوا يَقُولُونَ صَبَأْنَا، صَبَأْنَا‏.‏ فَجَعَلَ خَالِدٌ يَقْتُلُ مِنْهُمْ وَيَأْسِرُ، وَدَفَعَ إِلَى كُلِّ رَجُلٍ مِنَّا أَسِيرَهُ، حَتَّى إِذَا كَانَ يَوْمٌ أَمَرَ خَالِدٌ أَنْ يَقْتُلَ كُلُّ رَجُلٍ مِنَّا أَسِيرَهُ فَقُلْتُ وَاللَّهِ لاَ أَقْتُلُ أَسِيرِي، وَلاَ يَقْتُلُ رَجُلٌ مِنْ أَصْحَابِي أَسِيرَهُ، حَتَّى قَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرْنَاهُ، فَرَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدٌ ‏\"‏‏.‏ مَرَّتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4339In-book reference : Book 64, Hadith 368USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 628   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4340,
    "id": 4340,
    "url": "https://sunnah.com/bukhari:4340",
    "bookNumber": 64,
    "hadithNumber": 369,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) sent a Sariya under the command of a man from the Ansar and ordered the soldiers to \nobey him. He (i.e. the commander) became angry and said \"Didn't the Prophet (ﷺ) order you to obey me!\" \nThey replied, \"Yes.\" He said, \"Collect fire-wood for me.\" So they collected it. He said, \"Make a fire.\" \nWhen they made it, he said, \"Enter it (i.e. the fire).\" So they intended to do that and started holding \neach other and saying, \"We run towards (i.e. take refuge with) the Prophet (ﷺ) from the fire.\" They kept \non saying that till the fire was extinguished and the anger of the commander abated. When that news \nreached the Prophet (ﷺ) he said, \"If they had entered it (i.e. the fire), they would not have come out of it \ntill the Day of Resurrection. Obedience (to somebody) is required when he enjoins what is good.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي سَعْدُ بْنُ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً فَاسْتَعْمَلَ رَجُلاً مِنَ الأَنْصَارِ، وَأَمَرَهُمْ أَنْ يُطِيعُوهُ، فَغَضِبَ فَقَالَ أَلَيْسَ أَمَرَكُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ تُطِيعُونِي‏.‏ قَالُوا بَلَى‏.‏ قَالَ فَاجْمَعُوا لِي حَطَبًا‏.‏ فَجَمَعُوا، فَقَالَ أَوْقِدُوا نَارًا‏.‏ فَأَوْقَدُوهَا، فَقَالَ ادْخُلُوهَا‏.‏ فَهَمُّوا، وَجَعَلَ بَعْضُهُمْ يُمْسِكُ بَعْضًا، وَيَقُولُونَ فَرَرْنَا إِلَى النَّبِيِّ صلى الله عليه وسلم مِنَ النَّارِ‏.‏ فَمَا زَالُوا حَتَّى خَمَدَتِ النَّارُ، فَسَكَنَ غَضَبُهُ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَوْ دَخَلُوهَا مَا خَرَجُوا مِنْهَا إِلَى يَوْمِ الْقِيَامَةِ، الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4340In-book reference : Book 64, Hadith 369USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 629   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4341,
    "id": 4341,
    "url": "https://sunnah.com/bukhari:4341",
    "bookNumber": 64,
    "hadithNumber": 370,
    "narrator": "Narrated Abu Burda:",
    "english": "Allah's Messenger (ﷺ) sent Abu Musa and Mu`adh bin Jabal to Yemen. He sent each of them to administer a \nprovince as Yemen consisted of two provinces. The Prophet (ﷺ) said (to them), \"Facilitate things for the \npeople and do not make things difficult for them (Be kind and lenient (both of you) with the people, \nand do not be hard on them) and give the people good tidings and do not repulse them. So each of \nthem went to carry on his job. So when any one of them toured his province and happened to come \nnear (the border of the province of) his companion, he would visit him and greet him. Once Mu`adh \ntoured that part of his state which was near (the border of the province of) his companion Abu Musa. \nMu`adh came riding his mule till he reached Abu Musa and saw him sitting, and the people had \ngathered around him. Behold! There was a man tied with his hands behind his neck. Mu`adh said to \nAbu Musa, \"O `Abdullah bin Qais! What is this?\" Abu Musa replied. \"This man has reverted to \nHeathenism after embracing Islam.\" Mu`adh said, \"I will not dismount till he is killed.\" Abu Musa \nreplied, \"He has been brought for this purpose, so come down.\" Mu`adh said, \"I will not dismount till \nhe is killed.\" So Abu Musa ordered that he be killed, and he was killed. Then Mu`adh dismounted and \nsaid, \"O `Abdullah (bin Qais)! How do you recite the Qur'an ?\" Abu Musa said, \"I recite the Qur'an \nregularly at intervals and piecemeal. How do you recite it O Mu`adh?\" Mu`adh said, \"I sleep in the \nfirst part of the night and then get up after having slept for the time devoted for my sleep and then \nrecite as much as Allah has written for me. So I seek Allah's Reward for both my sleep as well as my \nprayer (at night).",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ أَبِي بُرْدَةَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا مُوسَى وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ، قَالَ وَبَعَثَ كُلَّ وَاحِدٍ مِنْهُمَا عَلَى مِخْلاَفٍ قَالَ وَالْيَمَنُ مِخْلاَفَانِ ثُمَّ قَالَ ‏\n\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا ‏\"‏‏.‏ فَانْطَلَقَ كُلُّ وَاحِدٍ مِنْهُمَا إِلَى عَمَلِهِ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا إِذَا سَارَ فِي أَرْضِهِ كَانَ قَرِيبًا مِنْ صَاحِبِهِ أَحْدَثَ بِهِ عَهْدًا، فَسَلَّمَ عَلَيْهِ، فَسَارَ مُعَاذٌ فِي أَرْضِهِ قَرِيبًا مِنْ صَاحِبِهِ أَبِي مُوسَى، فَجَاءَ يَسِيرُ عَلَى بَغْلَتِهِ حَتَّى انْتَهَى إِلَيْهِ، وَإِذَا هُوَ جَالِسٌ، وَقَدِ اجْتَمَعَ إِلَيْهِ النَّاسُ، وَإِذَا رَجُلٌ عِنْدَهُ قَدْ جُمِعَتْ يَدَاهُ إِلَى عُنُقِهِ فَقَالَ لَهُ مُعَاذٌ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ، أَيَّمَ هَذَا قَالَ هَذَا رَجُلٌ كَفَرَ بَعْدَ إِسْلاَمِهِ‏.‏ قَالَ لاَ أَنْزِلُ حَتَّى يُقْتَلَ‏.‏ قَالَ إِنَّمَا جِيءَ بِهِ لِذَلِكَ فَانْزِلْ‏.‏ قَالَ مَا أَنْزِلُ حَتَّى يُقْتَلَ فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ نَزَلَ فَقَالَ يَا عَبْدَ اللَّهِ، كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ أَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ فَكَيْفَ تَقْرَأُ أَنْتَ يَا مُعَاذُ قَالَ أَنَامُ أَوَّلَ اللَّيْلِ فَأَقُومُ وَقَدْ قَضَيْتُ جُزْئِي مِنَ النَّوْمِ، فَأَقْرَأُ مَا كَتَبَ اللَّهُ لِي، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4341, 4342In-book reference : Book 64, Hadith 370USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 630   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4342,
    "id": 4342,
    "url": "https://sunnah.com/bukhari:4342",
    "bookNumber": 64,
    "hadithNumber": 370,
    "narrator": "Narrated Abu Burda:",
    "english": "Allah's Messenger (ﷺ) sent Abu Musa and Mu`adh bin Jabal to Yemen. He sent each of them to administer a \nprovince as Yemen consisted of two provinces. The Prophet (ﷺ) said (to them), \"Facilitate things for the \npeople and do not make things difficult for them (Be kind and lenient (both of you) with the people, \nand do not be hard on them) and give the people good tidings and do not repulse them. So each of \nthem went to carry on his job. So when any one of them toured his province and happened to come \nnear (the border of the province of) his companion, he would visit him and greet him. Once Mu`adh \ntoured that part of his state which was near (the border of the province of) his companion Abu Musa. \nMu`adh came riding his mule till he reached Abu Musa and saw him sitting, and the people had \ngathered around him. Behold! There was a man tied with his hands behind his neck. Mu`adh said to \nAbu Musa, \"O `Abdullah bin Qais! What is this?\" Abu Musa replied. \"This man has reverted to \nHeathenism after embracing Islam.\" Mu`adh said, \"I will not dismount till he is killed.\" Abu Musa \nreplied, \"He has been brought for this purpose, so come down.\" Mu`adh said, \"I will not dismount till \nhe is killed.\" So Abu Musa ordered that he be killed, and he was killed. Then Mu`adh dismounted and \nsaid, \"O `Abdullah (bin Qais)! How do you recite the Qur'an ?\" Abu Musa said, \"I recite the Qur'an \nregularly at intervals and piecemeal. How do you recite it O Mu`adh?\" Mu`adh said, \"I sleep in the \nfirst part of the night and then get up after having slept for the time devoted for my sleep and then \nrecite as much as Allah has written for me. So I seek Allah's Reward for both my sleep as well as my \nprayer (at night).",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ أَبِي بُرْدَةَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا مُوسَى وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ، قَالَ وَبَعَثَ كُلَّ وَاحِدٍ مِنْهُمَا عَلَى مِخْلاَفٍ قَالَ وَالْيَمَنُ مِخْلاَفَانِ ثُمَّ قَالَ ‏\n\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا ‏\"‏‏.‏ فَانْطَلَقَ كُلُّ وَاحِدٍ مِنْهُمَا إِلَى عَمَلِهِ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا إِذَا سَارَ فِي أَرْضِهِ كَانَ قَرِيبًا مِنْ صَاحِبِهِ أَحْدَثَ بِهِ عَهْدًا، فَسَلَّمَ عَلَيْهِ، فَسَارَ مُعَاذٌ فِي أَرْضِهِ قَرِيبًا مِنْ صَاحِبِهِ أَبِي مُوسَى، فَجَاءَ يَسِيرُ عَلَى بَغْلَتِهِ حَتَّى انْتَهَى إِلَيْهِ، وَإِذَا هُوَ جَالِسٌ، وَقَدِ اجْتَمَعَ إِلَيْهِ النَّاسُ، وَإِذَا رَجُلٌ عِنْدَهُ قَدْ جُمِعَتْ يَدَاهُ إِلَى عُنُقِهِ فَقَالَ لَهُ مُعَاذٌ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ، أَيَّمَ هَذَا قَالَ هَذَا رَجُلٌ كَفَرَ بَعْدَ إِسْلاَمِهِ‏.‏ قَالَ لاَ أَنْزِلُ حَتَّى يُقْتَلَ‏.‏ قَالَ إِنَّمَا جِيءَ بِهِ لِذَلِكَ فَانْزِلْ‏.‏ قَالَ مَا أَنْزِلُ حَتَّى يُقْتَلَ فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ نَزَلَ فَقَالَ يَا عَبْدَ اللَّهِ، كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ أَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ فَكَيْفَ تَقْرَأُ أَنْتَ يَا مُعَاذُ قَالَ أَنَامُ أَوَّلَ اللَّيْلِ فَأَقُومُ وَقَدْ قَضَيْتُ جُزْئِي مِنَ النَّوْمِ، فَأَقْرَأُ مَا كَتَبَ اللَّهُ لِي، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4341, 4342In-book reference : Book 64, Hadith 370USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 630   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4343,
    "id": 4343,
    "url": "https://sunnah.com/bukhari:4343",
    "bookNumber": 64,
    "hadithNumber": 371,
    "narrator": "Narrated Abi Burda:",
    "english": "That Abu Musa Al-Ash`ari said that the Prophet (ﷺ) had sent him to Yemen and he asked the Prophet (ﷺ) \nabout certain (alcoholic) drink which used to be prepared there The Prophet (ﷺ) said, \"What are they?\" \nAbu Musa said, \"Al-Bit' and Al-Mizr?\" He said, \"Al-Bit is an alcoholic drink made from honey; and \nAl-Mizr is an alcoholic drink made from barley.\" The Prophet (ﷺ) said, \"All intoxicants are prohibited.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنِ الشَّيْبَانِيِّ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ إِلَى الْيَمَنِ، فَسَأَلَهُ عَنْ أَشْرِبَةٍ تُصْنَعُ بِهَا، فَقَالَ ‏\"‏ وَمَا هِيَ ‏\"‏‏.‏ قَالَ الْبِتْعُ وَالْمِزْرُ‏.‏ فَقُلْتُ لأَبِي بُرْدَةَ مَا الْبِتْعُ قَالَ نَبِيذُ الْعَسَلِ، وَالْمِزْرُ نَبِيذُ الشَّعِيرِ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ رَوَاهُ جَرِيرٌ وَعَبْدُ الْوَاحِدِ عَنِ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4343In-book reference : Book 64, Hadith 371USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 631   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4344,
    "id": 4344,
    "url": "https://sunnah.com/bukhari:4344",
    "bookNumber": 64,
    "hadithNumber": 372,
    "narrator": "Narrated Abu Burda:",
    "english": "That the Prophet (ﷺ) sent his (i.e. Abu Burda's) grandfather, Abu Musa and Mu`adh to Yemen and said to \nboth of them \"Facilitate things for the people (Be kind and lenient) and do not make things difficult \n(for people), and give them good tidings, and do not repulse them and both of you should obey each \nother.\" Abu Musa said, \"O Allah's Prophet! In our land there is an alcoholic drink (prepared) from \nbarley called Al-Mizr, and another (prepared) from honey, called Al-Bit\"' The Prophet (ﷺ) said, \"All \nintoxicants are prohibited.\" Then both of them proceeded and Mu`adh asked Abu Musa, \"How do you \nrecite the Qur'an?\" Abu Musa replied, \"I recite it while I am standing, sitting or riding my riding \nanimals, at intervals and piecemeal.\" Mu`adh said, \"But I sleep and then get up. I sleep and hope for \nAllah's Reward for my sleep as I seek His Reward for my night prayer.\" Then he (i.e. Mu`adh) pitched \na tent and they started visiting each other. Once Mu`adh paid a visit to Abu Musa and saw a chained \nman. Mu`adh asked, \"What is this?\" Abu Musa said, \"(He was) a Jew who embraced Islam and has \nnow turned apostate.\" Mu`adh said, \"I will surely chop off his neck!\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم جَدَّهُ أَبَا مُوسَى، وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ ‏\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا ‏\"‏‏.‏ فَقَالَ أَبُو مُوسَى يَا نَبِيَّ اللَّهِ، إِنَّ أَرْضَنَا بِهَا شَرَابٌ مِنَ الشَّعِيرِ الْمِزْرُ، وَشَرَابٌ مِنَ الْعَسَلِ الْبِتْعُ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ فَانْطَلَقَا فَقَالَ مُعَاذٌ لأَبِي مُوسَى كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ قَائِمًا وَقَاعِدًا وَعَلَى رَاحِلَتِهِ وَأَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ أَمَّا أَنَا فَأَنَامُ وَأَقُومُ، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي، وَضَرَبَ فُسْطَاطًا، فَجَعَلاَ يَتَزَاوَرَانِ، فَزَارَ مُعَاذٌ أَبَا مُوسَى، فَإِذَا رَجُلٌ مُوثَقٌ، فَقَالَ مَا هَذَا فَقَالَ أَبُو مُوسَى يَهُودِيٌّ أَسْلَمَ ثُمَّ ارْتَدَّ‏.‏ فَقَالَ مُعَاذٌ لأَضْرِبَنَّ عُنُقَهُ‏.‏ تَابَعَهُ الْعَقَدِيُّ وَوَهْبٌ عَنْ شُعْبَةَ‏.‏   وَقَالَ وَكِيعٌ وَالنَّضْرُ وَأَبُو دَاوُدَ عَنْ شُعْبَةَ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ رَوَاهُ جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنِ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4344, 4345In-book reference : Book 64, Hadith 372USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 632   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4345,
    "id": 4345,
    "url": "https://sunnah.com/bukhari:4345",
    "bookNumber": 64,
    "hadithNumber": 372,
    "narrator": "Narrated Abu Burda:",
    "english": "That the Prophet (ﷺ) sent his (i.e. Abu Burda's) grandfather, Abu Musa and Mu`adh to Yemen and said to \nboth of them \"Facilitate things for the people (Be kind and lenient) and do not make things difficult \n(for people), and give them good tidings, and do not repulse them and both of you should obey each \nother.\" Abu Musa said, \"O Allah's Prophet! In our land there is an alcoholic drink (prepared) from \nbarley called Al-Mizr, and another (prepared) from honey, called Al-Bit\"' The Prophet (ﷺ) said, \"All \nintoxicants are prohibited.\" Then both of them proceeded and Mu`adh asked Abu Musa, \"How do you \nrecite the Qur'an?\" Abu Musa replied, \"I recite it while I am standing, sitting or riding my riding \nanimals, at intervals and piecemeal.\" Mu`adh said, \"But I sleep and then get up. I sleep and hope for \nAllah's Reward for my sleep as I seek His Reward for my night prayer.\" Then he (i.e. Mu`adh) pitched \na tent and they started visiting each other. Once Mu`adh paid a visit to Abu Musa and saw a chained \nman. Mu`adh asked, \"What is this?\" Abu Musa said, \"(He was) a Jew who embraced Islam and has \nnow turned apostate.\" Mu`adh said, \"I will surely chop off his neck!\"",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم جَدَّهُ أَبَا مُوسَى، وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ ‏\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا ‏\"‏‏.‏ فَقَالَ أَبُو مُوسَى يَا نَبِيَّ اللَّهِ، إِنَّ أَرْضَنَا بِهَا شَرَابٌ مِنَ الشَّعِيرِ الْمِزْرُ، وَشَرَابٌ مِنَ الْعَسَلِ الْبِتْعُ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ فَانْطَلَقَا فَقَالَ مُعَاذٌ لأَبِي مُوسَى كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ قَائِمًا وَقَاعِدًا وَعَلَى رَاحِلَتِهِ وَأَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ أَمَّا أَنَا فَأَنَامُ وَأَقُومُ، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي، وَضَرَبَ فُسْطَاطًا، فَجَعَلاَ يَتَزَاوَرَانِ، فَزَارَ مُعَاذٌ أَبَا مُوسَى، فَإِذَا رَجُلٌ مُوثَقٌ، فَقَالَ مَا هَذَا فَقَالَ أَبُو مُوسَى يَهُودِيٌّ أَسْلَمَ ثُمَّ ارْتَدَّ‏.‏ فَقَالَ مُعَاذٌ لأَضْرِبَنَّ عُنُقَهُ‏.‏ تَابَعَهُ الْعَقَدِيُّ وَوَهْبٌ عَنْ شُعْبَةَ‏.‏   وَقَالَ وَكِيعٌ وَالنَّضْرُ وَأَبُو دَاوُدَ عَنْ شُعْبَةَ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ رَوَاهُ جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنِ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4344, 4345In-book reference : Book 64, Hadith 372USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 632   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4346,
    "id": 4346,
    "url": "https://sunnah.com/bukhari:4346",
    "bookNumber": 64,
    "hadithNumber": 373,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "Allah's Messenger (ﷺ) sent me (as a governor) to the land of my people, and I came while Allah's Messenger (ﷺ) \nwas encamping at a place called Al-Abtah. The Prophet (ﷺ) said, \"Have you made the intention to \nperform the Hajj, O `Abdullah bin Qais?\" I replied, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"What did you \nsay?\" I replied, \"I said, 'Labbaik' and expressed the same intention as yours.\" He said, \"Have you \ndriven the Hadi along with you?\" I replied, \"No, I did not drive the Hadi.\" He said, \"So perform the \nTawaf of the Ka`ba and then the Sai, between Safa and Marwa and then finish the state of Ihram.\" So \nI did the same, and one of the women of (the tribe of) Banu-Qais combed my hair. We continued \nfollow in that tradition till the caliphate of `Umar.",
    "arabic": "حَدَّثَنِي عَبَّاسُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ أَيُّوبَ بْنِ عَائِذٍ، حَدَّثَنَا قَيْسُ بْنُ مُسْلِمٍ، قَالَ سَمِعْتُ طَارِقَ بْنَ شِهَابٍ، يَقُولُ حَدَّثَنِي أَبُو مُوسَى الأَشْعَرِيُّ ـ رضى الله عنه ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَرْضِ قَوْمِي، فَجِئْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُنِيخٌ بِالأَبْطَحِ فَقَالَ ‏\"‏ أَحَجَجْتَ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ‏\"‏‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ كَيْفَ قُلْتَ ‏\"‏‏.‏ قَالَ قُلْتُ لَبَّيْكَ إِهْلاَلاً كَإِهْلاَلِكَ‏.‏ قَالَ ‏\"‏ فَهَلْ سُقْتَ مَعَكَ هَدْيًا ‏\"‏‏.‏ قُلْتُ لَمْ أَسُقْ‏.‏ قَالَ ‏\"‏ فَطُفْ بِالْبَيْتِ وَاسْعَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حِلَّ ‏\"‏‏.‏ فَفَعَلْتُ حَتَّى مَشَطَتْ لِي امْرَأَةٌ مِنْ نِسَاءِ بَنِي قَيْسٍ، وَمَكُثْنَا بِذَلِكَ حَتَّى اسْتُخْلِفَ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4346In-book reference : Book 64, Hadith 373USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 633   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4347,
    "id": 4347,
    "url": "https://sunnah.com/bukhari:4347",
    "bookNumber": 64,
    "hadithNumber": 374,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) said to Mu`adh bin Jabal when he sent him to Yemen. \"You will come to the people of \nScripture, and when you reach them, invite them to testify that none has the right to be worshipped \nexcept Allah and that Muhammad is His Apostle. And if they obey you in that, then tell them that \nAllah has enjoined on them five prayers to be performed every day and night. And if they obey you in \nthat, then tell them that Allah has enjoined on them Sadaqa (i.e. rak`at) to be taken from the rich \namongst them and given to the poor amongst them. And if they obey you in that, then be cautious! \nDon't take their best properties (as Zakat) and be afraid of the curse of an oppressed person as there is \nno screen between his invocation and Allah.",
    "arabic": "حَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّاءَ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُعَاذِ بْنِ جَبَلٍ حِينَ بَعَثَهُ إِلَى الْيَمَنِ ‏\n\"‏ إِنَّكَ سَتَأْتِي قَوْمًا مِنْ أَهْلِ الْكِتَابِ، فَإِذَا جِئْتَهُمْ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ، فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْكُمْ صَدَقَةً، تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ، فَتُرَدُّ عَلَى فُقَرَائِهِمْ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ، فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ، وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهُ وَبَيْنَ اللَّهِ حِجَابٌ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏طَوَّعَتْ‏}‏ طَاعَتْ وَأَطَاعَتْ لُغَةٌ، طِعْتُ وَطُعْتُ وَأَطَعْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4347In-book reference : Book 64, Hadith 374USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 634   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4348,
    "id": 4348,
    "url": "https://sunnah.com/bukhari:4348",
    "bookNumber": 64,
    "hadithNumber": 375,
    "narrator": "Narrated `Amr bin Maimuin:",
    "english": "When Mu`adh arrived at Yemen, he led them (i.e. the people of Yemen) in the Fajr prayer wherein he \nrecited: 'Allah took Abraham as a Khalil.' A man amongst the people said, \"(How) glad the mother of \nAbraham is!\" (In another narration) `Amr said, \"The Prophet (ﷺ) sent Mu`adh to Yemen and he (led the \npeople) in the Fajr prayer and recited: 'Allah took Abraham as a Khalil. A man behind him said, \n\"(How) glad the mother of Abraham is!\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، أَنَّ مُعَاذًا ـ رضى الله عنه ـ لَمَّا قَدِمَ الْيَمَنَ صَلَّى بِهِمِ الصُّبْحَ فَقَرَأَ ‏{‏وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلاً‏}‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ لَقَدْ قَرَّتْ عَيْنُ أُمِّ إِبْرَاهِيمَ‏.‏ زَادَ مُعَاذٌ عَنْ شُعْبَةَ عَنْ حَبِيبٍ عَنْ سَعِيدٍ عَنْ عَمْرٍو أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا إِلَى الْيَمَنِ، فَقَرَأَ مُعَاذٌ فِي صَلاَةِ الصُّبْحِ سُورَةَ النِّسَاءِ فَلَمَّا قَالَ ‏{‏وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلاً‏}‏ قَالَ رَجُلٌ خَلْفَهُ قَرَّتْ عَيْنُ أُمِّ إِبْرَاهِيمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4348In-book reference : Book 64, Hadith 375USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 635   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4349,
    "id": 4349,
    "url": "https://sunnah.com/bukhari:4349",
    "bookNumber": 64,
    "hadithNumber": 376,
    "narrator": "Narrated Al-Bara:",
    "english": "Allah's Messenger (ﷺ) sent us to Yemen along with Khalid bin Al-Walid. Later on he sent `Ali bin Abi Talib \nin his place. The Prophet (ﷺ) said to `Ali, \"Give Khalid's companions the choice of either staying with you \n(in Yemen) or returning to Medina.\" I was one of those who stayed with him (i.e. `Ali) and got several \nAwaq (of gold from the war booty.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانُ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ إِسْحَاقَ بْنِ أَبِي إِسْحَاقَ، حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ‏.‏ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ خَالِدِ بْنِ الْوَلِيدِ إِلَى الْيَمَنِ، قَالَ ثُمَّ بَعَثَ عَلِيًّا بَعْدَ ذَلِكَ مَكَانَهُ فَقَالَ مُرْ أَصْحَابَ خَالِدٍ، مَنْ شَاءَ مِنْهُمْ أَنْ يُعَقِّبَ مَعَكَ فَلْيُعَقِّبْ، وَمَنْ شَاءَ فَلْيُقْبِلْ‏.‏ فَكُنْتُ فِيمَنْ عَقَّبَ مَعَهُ، قَالَ فَغَنِمْتُ أَوَاقٍ ذَوَاتِ عَدَدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4349In-book reference : Book 64, Hadith 376USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 636   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4350,
    "id": 4350,
    "url": "https://sunnah.com/bukhari:4350",
    "bookNumber": 64,
    "hadithNumber": 377,
    "narrator": "Narrated Buraida:",
    "english": "The Prophet (ﷺ) sent `Ali to Khalid to bring the Khumus (of the booty) and I hated `Ali, and `Ali had \ntaken a bath (after a sexual act with a slave-girl from the Khumus). I said to Khalid, \"Don't you see \nthis (i.e. `Ali)?\" When we reached the Prophet (ﷺ) I mentioned that to him. He said, \"O Buraida! Do you \nhate `Ali?\" I said, \"Yes.\" He said, \"Do you hate him, for he deserves more than that from the \nKhumlus.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا عَلِيُّ بْنُ سُوَيْدِ بْنِ مَنْجُوفٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم عَلِيًّا إِلَى خَالِدٍ لِيَقْبِضَ الْخُمُسَ وَكُنْتُ أُبْغِضُ عَلِيًّا، وَقَدِ اغْتَسَلَ، فَقُلْتُ لِخَالِدٍ أَلاَ تَرَى إِلَى هَذَا فَلَمَّا قَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ يَا بُرَيْدَةُ أَتُبْغِضُ عَلِيًّا ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ لاَ تُبْغِضْهُ فَإِنَّ لَهُ فِي الْخُمُسِ أَكْثَرَ مِنْ ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4350In-book reference : Book 64, Hadith 377USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 637   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4351,
    "id": 4351,
    "url": "https://sunnah.com/bukhari:4351",
    "bookNumber": 64,
    "hadithNumber": 378,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "`Ali bin Abi Talib sent a piece of gold not yet taken out of its ore, in a tanned leather container to \nAllah's Messenger (ﷺ) . Allah's Messenger (ﷺ) distributed that amongst four Persons: 'Uyaina bin Badr, Aqra bin \nH`Abis, Zaid Al-Khail and the fourth was either Alqama or Amir bin at-Tufail. On that, one of his \ncompanions said, \"We are more deserving of this (gold) than these (persons).\" When that news \nreached the Prophet (ﷺ) , he said, \"Don't you trust me though I am the truth worthy man of the One in the \nHeavens, and I receive the news of Heaven (i.e. Divine Inspiration) both in the morning and in the \nevening?\" There got up a man with sunken eyes, raised cheek bones, raised forehead, a thick beard, a \nshaven head and a waist sheet that was tucked up and he said, \"O Allah's Messenger (ﷺ)! Be afraid of Allah.\" \nThe Prophet (ﷺ) said, \"Woe to you! Am I not of all the people of the earth the most entitled to fear \nAllah?\" Then that man went away. Khalid bin Al-Wahd said, \"O Allah's Messenger (ﷺ)! Shall I chop his \nneck off?\" The Prophet (ﷺ) said, \"No, for he may offer prayers.\" Khalid said, \"Numerous are those who \noffer prayers and say by their tongues (i.e. mouths) what is not in their hearts.\" Allah's Messenger (ﷺ) said, \"I \nhave not been ordered (by Allah) to search the hearts of the people or cut open their bellies.\" Then the \nProphet looked at him (i.e. that man) while the latter was going away and said, \"From the offspring of \nthis (man there will come out (people) who will recite the Qur'an continuously and elegantly but it \nwill not exceed their throats. (They will neither understand it nor act upon it). They would go out of \nthe religion (i.e. Islam) as an arrow goes through a game's body.\" I think he also said, \"If I should be \npresent at their time I would kill them as the nations a Thamud were killed.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ بْنِ شُبْرُمَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ بَعَثَ عَلِيُّ بْنُ أَبِي طَالِبٍ ـ رضى الله عنه ـ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْيَمَنِ بِذُهَيْبَةٍ فِي أَدِيمٍ مَقْرُوظٍ لَمْ تُحَصَّلْ مِنْ تُرَابِهَا، قَالَ فَقَسَمَهَا بَيْنَ أَرْبَعَةِ نَفَرٍ بَيْنَ عُيَيْنَةَ بْنِ بَدْرٍ، وَأَقْرَعَ بْنِ حَابِسٍ وَزَيْدِ الْخَيْلِ، وَالرَّابِعُ إِمَّا عَلْقَمَةُ وَإِمَّا عَامِرُ بْنُ الطُّفَيْلِ، فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ كُنَّا نَحْنُ أَحَقَّ بِهَذَا مِنْ هَؤُلاَءِ‏.‏ قَالَ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلاَ تَأْمَنُونِي وَأَنَا أَمِينُ مَنْ فِي السَّمَاءِ، يَأْتِينِي خَبَرُ السَّمَاءِ صَبَاحًا وَمَسَاءً ‏\"‏‏.‏ قَالَ فَقَامَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ، مُشْرِفُ الْوَجْنَتَيْنِ، نَاشِزُ الْجَبْهَةِ، كَثُّ اللِّحْيَةِ، مَحْلُوقُ الرَّأْسِ، مُشَمَّرُ الإِزَارِ، فَقَالَ يَا رَسُولَ اللَّهِ، اتَّقِ اللَّهَ‏.‏ قَالَ ‏\"‏ وَيْلَكَ أَوَلَسْتُ أَحَقَّ أَهْلِ الأَرْضِ أَنْ يَتَّقِيَ اللَّهَ ‏\"‏‏.‏ قَالَ ثُمَّ وَلَّى الرَّجُلُ، قَالَ خَالِدُ بْنُ الْوَلِيدِ يَا رَسُولَ اللَّهِ، أَلاَ أَضْرِبُ عُنُقَهُ قَالَ ‏\"‏ لاَ، لَعَلَّهُ أَنْ يَكُونَ يُصَلِّي ‏\"‏‏.‏ فَقَالَ خَالِدٌ وَكَمْ مِنْ مُصَلٍّ يَقُولُ بِلِسَانِهِ مَا لَيْسَ فِي قَلْبِهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَمْ أُومَرْ أَنْ أَنْقُبَ قُلُوبَ النَّاسِ، وَلاَ أَشُقَّ بُطُونَهُمْ ‏\"‏ قَالَ ثُمَّ نَظَرَ إِلَيْهِ وَهْوَ مُقَفٍّ فَقَالَ ‏\"‏ إِنَّهُ يَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَتْلُونَ كِتَابَ اللَّهِ رَطْبًا، لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏ وَأَظُنُّهُ قَالَ ‏\"‏ لَئِنْ أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4351In-book reference : Book 64, Hadith 378USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 638   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4352,
    "id": 4352,
    "url": "https://sunnah.com/bukhari:4352",
    "bookNumber": 64,
    "hadithNumber": 379,
    "narrator": "Narrated 'Ata:",
    "english": "Jabir said, \"The Prophet (ﷺ) ordered `Ali to keep the state of Ihram.\" Jabir added, \"Ali bin Abi Talib \nreturned (from Yemen) when he was a governor (of Yemen). The Prophet (ﷺ) said to him, 'With what \nintention have you assumed the state of Ihram?' `Ali said, \"I have assumed Ihram with an intention as \nthat of the Prophet.\" Then the Prophet (ﷺ) said (to him), 'Offer a Hadi and keep the state of Ihram in \nwhich you are now.' `Ali slaughtered a Hadi on his behalf.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ أَمَرَ النَّبِيُّ صلى الله عليه وسلم عَلِيًّا أَنْ يُقِيمَ عَلَى إِحْرَامِهِ‏.‏   زَادَ مُحَمَّدُ بْنُ بَكْرٍ عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ فَقَدِمَ عَلِيُّ بْنُ أَبِي طَالِبٍ رضى الله عنه بِسِعَايَتِهِ، قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ يَا عَلِيُّ ‏\"‏‏.‏ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَأَهْدِ وَامْكُثْ حَرَامًا كَمَا أَنْتَ ‏\"‏‏.‏ قَالَ وَأَهْدَى لَهُ عَلِيٌّ هَدْيًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4352In-book reference : Book 64, Hadith 379USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 639   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4353,
    "id": 4353,
    "url": "https://sunnah.com/bukhari:4353",
    "bookNumber": 64,
    "hadithNumber": 380,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) assumed the state of Ihram for Umra and Hajj, and we to assumed it for Hajj with him. \nWhen we arrived at Mecca, the Prophet (ﷺ) said, \"Whoever does not possess a Hadi should regard his \nIhram for Umra only.\" The Prophet (ﷺ) had a Hadi with him. `Ali bin Abi Talib came to us from Yemen \nwith the intention of performing Hajj. The Prophet (ﷺ) said (to him), \"With what intention have you \nassumed the Ihram, for your wife is with us?\" `Ali said, \"I assumed the lhram with the same intention \nas that of the Prophet (ﷺ) .\" The Prophet (ﷺ) said, \"Keep on the state of lhram, as we have got the Hadi.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ حُمَيْدٍ الطَّوِيلِ، حَدَّثَنَا بَكْرٌ، أَنَّهُ ذَكَرَ لاِبْنِ عُمَرَ أَنَّ أَنَسًا حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ بِعُمْرَةٍ وَحَجَّةٍ، فَقَالَ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم بِالْحَجِّ، وَأَهْلَلْنَا بِهِ مَعَهُ، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ فَلْيَجْعَلْهَا عُمْرَةً ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم هَدْىٌ، فَقَدِمَ عَلَيْنَا عَلِيُّ بْنُ أَبِي طَالِبٍ مِنَ الْيَمَنِ حَاجًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ فَإِنَّ مَعَنَا أَهْلَكَ ‏\"‏‏.‏ قَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ فَأَمْسِكْ، فَإِنَّ مَعَنَا هَدْيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4353, 4354In-book reference : Book 64, Hadith 380USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 640   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4354,
    "id": 4354,
    "url": "https://sunnah.com/bukhari:4354",
    "bookNumber": 64,
    "hadithNumber": 380,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) assumed the state of Ihram for Umra and Hajj, and we to assumed it for Hajj with him. \nWhen we arrived at Mecca, the Prophet (ﷺ) said, \"Whoever does not possess a Hadi should regard his \nIhram for Umra only.\" The Prophet (ﷺ) had a Hadi with him. `Ali bin Abi Talib came to us from Yemen \nwith the intention of performing Hajj. The Prophet (ﷺ) said (to him), \"With what intention have you \nassumed the Ihram, for your wife is with us?\" `Ali said, \"I assumed the lhram with the same intention \nas that of the Prophet (ﷺ) .\" The Prophet (ﷺ) said, \"Keep on the state of lhram, as we have got the Hadi.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ حُمَيْدٍ الطَّوِيلِ، حَدَّثَنَا بَكْرٌ، أَنَّهُ ذَكَرَ لاِبْنِ عُمَرَ أَنَّ أَنَسًا حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ بِعُمْرَةٍ وَحَجَّةٍ، فَقَالَ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم بِالْحَجِّ، وَأَهْلَلْنَا بِهِ مَعَهُ، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ فَلْيَجْعَلْهَا عُمْرَةً ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم هَدْىٌ، فَقَدِمَ عَلَيْنَا عَلِيُّ بْنُ أَبِي طَالِبٍ مِنَ الْيَمَنِ حَاجًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ فَإِنَّ مَعَنَا أَهْلَكَ ‏\"‏‏.‏ قَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ فَأَمْسِكْ، فَإِنَّ مَعَنَا هَدْيًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4353, 4354In-book reference : Book 64, Hadith 380USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 640   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4355,
    "id": 4355,
    "url": "https://sunnah.com/bukhari:4355",
    "bookNumber": 64,
    "hadithNumber": 381,
    "narrator": "Narrated Jarir:",
    "english": "In the Pre-lslamic Period of Ignorance there was a house called Dhu-l-Khalasa or Al-Ka`ba Al- \nYamaniya or Al-Ka`ba Ash-Shamiya. The Prophet (ﷺ) said to me, \"Won't you relieve me from Dhu-l- \nKhalasa?\" So I set out with one-hundred-and-fifty riders, and we dismantled it and killed whoever was \npresent there. Then I came to the Prophet (ﷺ) and informed him, and he invoked good upon us and Al- \nAhmas (tribe) .",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا بَيَانٌ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ كَانَ بَيْتٌ فِي الْجَاهِلِيَّةِ يُقَالُ لَهُ ذُو الْخَلَصَةِ وَالْكَعْبَةُ الْيَمَانِيَةُ وَالْكَعْبَةُ الشَّأْمِيَّةُ، فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ فَنَفَرْتُ فِي مِائَةٍ وَخَمْسِينَ رَاكِبًا، فَكَسَرْنَاهُ وَقَتَلْنَا مَنْ وَجَدْنَا عِنْدَهُ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَدَعَا لَنَا وَلأَحْمَسَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4355In-book reference : Book 64, Hadith 381USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 641   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4356,
    "id": 4356,
    "url": "https://sunnah.com/bukhari:4356",
    "bookNumber": 64,
    "hadithNumber": 382,
    "narrator": "Narrated Qais:",
    "english": "Jarir said to me, The Prophet (ﷺ) said to me, \"Won't you relieve me from Dhu-l-Khalasa?\" And that was a \nhouse (in Yemem belonging to the tribe of) Khatham called Al-Ka`ba Al Yamaniya. I proceeded with \none-hundred and-fifty cavalry from Ahmas (tribe) who were horse riders. I used not to sit firm on \nhorses, so the Prophet (ﷺ) stroke me over my chest till I saw the mark of his fingers over my chest, and \nthen he said, 'O Allah! Make him (i.e. Jarir) firm and one who guides others and is guided on the right \npath.\" So Jarir proceeded to it dismantled and burnt it, and then sent a messenger to Allah's Messenger (ﷺ). \nThe messenger of Jarir said (to the Prophet), \"By Him Who sent you with the Truth, I did not leave \nthat place till it was like a scabby camel.\" The Prophet (ﷺ) blessed the horses of Ahmas and their men five \ntimes.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا قَيْسٌ، قَالَ قَالَ لِي جَرِيرٌ ـ رضى الله عنه ـ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ وَكَانَ بَيْتًا فِي خَثْعَمَ يُسَمَّى الْكَعْبَةَ الْيَمَانِيَةَ، فَانْطَلَقْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ مِنْ أَحْمَسَ، وَكَانُوا أَصْحَابَ خَيْلٍ، وَكُنْتُ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ فِي صَدْرِي حَتَّى رَأَيْتُ أَثَرَ أَصَابِعِهِ فِي صَدْرِي، وَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ، وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ فَانْطَلَقَ إِلَيْهَا فَكَسَرَهَا وَحَرَّقَهَا، ثُمَّ بَعَثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ جَرِيرٍ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا جِئْتُكَ حَتَّى تَرَكْتُهَا كَأَنَّهَا جَمَلٌ أَجْرَبُ‏.‏ قَالَ فَبَارَكَ فِي خَيْلِ أَحْمَسَ وَرِجَالِهَا خَمْسَ مَرَّاتٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4356In-book reference : Book 64, Hadith 382USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 642   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4357,
    "id": 4357,
    "url": "https://sunnah.com/bukhari:4357",
    "bookNumber": 64,
    "hadithNumber": 383,
    "narrator": "Narrated Qais:",
    "english": "Jarir said \"Allah's Messenger (ﷺ) said to me, \"Won't you relieve me from Dhul-Khalasa?\" I replied, \"Yes, (I \nwill relieve you).\" So I proceeded along with one-hundred and fifty cavalry from Ahmas tribe who \nwere skillful in riding horses. I used not to sit firm over horses, so I informed the Prophet (ﷺ) of that, and \nhe stroke my chest with his hand till I saw the marks of his hand over my chest and he said, O Allah! \nMake him firm and one who guides others and is guided (on the right path).' Since then I have never \nfallen from a horse. Dhul-l--Khulasa was a house in Yemen belonging to the tribe of Khatham and \nBajaila, and in it there were idols which were worshipped, and it was called Al-Ka`ba.\" Jarir went \nthere, burnt it with fire and dismantled it. When Jarir reached Yemen, there was a man who used to \nforetell and give good omens by casting arrows of divination. Someone said to him. \"The messenger \nof Allah's Messenger (ﷺ) is present here and if he should get hold of you, he would chop off your neck.\" One \nday while he was using them (i.e. arrows of divination), Jarir stopped there and said to him, \"Break \nthem (i.e. the arrows) and testify that None has the right to be worshipped except Allah, or else I will \nchop off your neck.\" So the man broke those arrows and testified that none has the right to be \nworshipped except Allah. Then Jarir sent a man called Abu Artata from the tribe of Ahmas to the \nProphet to convey the good news (of destroying Dhu-l-Khalasa). So when the messenger reached the \nProphet, he said, \"O Allah's Messenger (ﷺ)! By Him Who sent you with the Truth, I did not leave it till it was \nlike a scabby camel.\" Then the Prophet (ﷺ) blessed the horses of Ahmas and their men five times.",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ فَقُلْتُ بَلَى‏.‏ فَانْطَلَقْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ مِنْ أَحْمَسَ وَكَانُوا أَصْحَابَ خَيْلٍ وَكُنْتُ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَضَرَبَ يَدَهُ عَلَى صَدْرِي حَتَّى رَأَيْتُ أَثَرَ يَدِهِ فِي صَدْرِي وَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ قَالَ فَمَا وَقَعْتُ عَنْ فَرَسٍ بَعْدُ‏.‏ قَالَ وَكَانَ ذُو الْخَلَصَةِ بَيْتًا بِالْيَمَنِ لِخَثْعَمَ وَبَجِيلَةَ، فِيهِ نُصُبٌ تُعْبَدُ، يُقَالُ لَهُ الْكَعْبَةُ‏.‏ قَالَ فَأَتَاهَا فَحَرَّقَهَا بِالنَّارِ وَكَسَرَهَا‏.‏ قَالَ وَلَمَّا قَدِمَ جَرِيرٌ الْيَمَنَ كَانَ بِهَا رَجُلٌ يَسْتَقْسِمُ بِالأَزْلاَمِ فَقِيلَ لَهُ إِنَّ رَسُولَ رَسُولِ اللَّهِ صلى الله عليه وسلم هَا هُنَا فَإِنْ قَدَرَ عَلَيْكَ ضَرَبَ عُنُقَكَ‏.‏ قَالَ فَبَيْنَمَا هُوَ يَضْرِبُ بِهَا إِذْ وَقَفَ عَلَيْهِ جَرِيرٌ فَقَالَ لَتَكْسِرَنَّهَا وَلَتَشْهَدَنَّ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَوْ لأَضْرِبَنَّ عُنُقَكَ‏.‏ قَالَ فَكَسَرَهَا وَشَهِدَ، ثُمَّ بَعَثَ جَرِيرٌ رَجُلاً مِنْ أَحْمَسَ يُكْنَى أَبَا أَرْطَاةَ إِلَى النَّبِيِّ صلى الله عليه وسلم يُبَشِّرُهُ بِذَلِكَ، فَلَمَّا أَتَى النَّبِيَّ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا جِئْتُ حَتَّى تَرَكْتُهَا كَأَنَّهَا جَمَلٌ أَجْرَبُ‏.‏ قَالَ فَبَرَّكَ النَّبِيُّ صلى الله عليه وسلم عَلَى خَيْلِ أَحْمَسَ وَرِجَالِهَا خَمْسَ مَرَّاتٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4357In-book reference : Book 64, Hadith 383USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 643   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4358,
    "id": 4358,
    "url": "https://sunnah.com/bukhari:4358",
    "bookNumber": 64,
    "hadithNumber": 384,
    "narrator": "Narrated Abu `Uthman:",
    "english": "Allah's Messenger (ﷺ) sent `Amr bin Al As as the commander of the troops of Dhat-us-Salasil. `Amr bin Al- \n`As said, \"(On my return) I came to the Prophet (ﷺ) and said, 'Which people do you love most?' He \nreplied, `Aisha.' I said, 'From amongst the men?' He replied, 'Her father (Abu Bakr)'. I said, 'Whom \n(do you love) next?' He replied, \"`Umar.' Then he counted the names of many men, and I became \nsilent for fear that he might regard me as the last of them.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي عُثْمَانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ عَمْرَو بْنَ الْعَاصِ عَلَى جَيْشِ ذَاتِ السَّلاَسِلِ قَالَ فَأَتَيْتُهُ فَقُلْتُ أَىُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ ‏\"‏ عَائِشَةُ ‏\"‏‏.‏ قُلْتُ مِنَ الرِّجَالِ قَالَ ‏\"‏ أَبُوهَا ‏\"‏‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ‏\"‏ عُمَرُ ‏\"‏‏.‏ فَعَدَّ رِجَالاً فَسَكَتُّ مَخَافَةَ أَنْ يَجْعَلَنِي فِي آخِرِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4358In-book reference : Book 64, Hadith 384USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 644   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4359,
    "id": 4359,
    "url": "https://sunnah.com/bukhari:4359",
    "bookNumber": 64,
    "hadithNumber": 385,
    "narrator": "Narrated Jarir:",
    "english": "While I was at Yemen, I met two men from Yemen called Dhu Kala and Dhu `Amr, and I started \ntelling them about Allah's Messenger (ﷺ). Dhu `Amr said to me, \"If what you are saying about your friend \n(i.e. the Prophet) is true, then he has died three days ago.\" Then both of them accompanied me to \nMedina, and when we had covered some distance on the way to Medina, we saw some riders coming \nfrom Medina. We asked them and they said, \"Allah's Messenger (ﷺ) has died and Abu Bakr has been \nappointed as the Caliph and the people are in a good state.' Then they said, \"Tell your friend (Abu \nBakr) that we have come (to visit him), and if Allah will, we will come again.\" So they both returned \nto Yemen. When I told Abu Bakr their statement, he said to me, \"I wish you had brought them (to \nme).\" Afterwards I met Dhu `Amr, and he said to me, \"O Jarir! You have done a favor to me and I am \ngoing to tell you something, i.e. you, the nation of 'Arabs, will remain prosperous as long as you \nchoose and appoint another chief whenever a former one is dead. But if authority is obtained by the \npower of the sword, then the rulers will become kings who will get angry, as kings get angry, and will \nbe delighted as kings get delighted.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ الْعَبْسِيُّ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ كُنْتُ بِالْبَحْرِ فَلَقِيتُ رَجُلَيْنِ مِنْ أَهْلِ الْيَمَنِ ذَا كَلاَعٍ وَذَا عَمْرٍو، فَجَعَلْتُ أُحَدِّثُهُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ ذُو عَمْرٍو لَئِنْ كَانَ الَّذِي تَذْكُرُ مِنْ أَمْرِ صَاحِبِكَ، لَقَدْ مَرَّ عَلَى أَجَلِهِ مُنْذُ ثَلاَثٍ‏.‏ وَأَقْبَلاَ مَعِي حَتَّى إِذَا كُنَّا فِي بَعْضِ الطَّرِيقِ رُفِعَ لَنَا رَكْبٌ مِنْ قِبَلِ الْمَدِينَةِ فَسَأَلْنَاهُمْ فَقَالُوا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ وَالنَّاسُ صَالِحُونَ‏.‏ فَقَالاَ أَخْبِرْ صَاحِبَكَ أَنَّا قَدْ جِئْنَا وَلَعَلَّنَا سَنَعُودُ إِنْ شَاءَ اللَّهُ، وَرَجَعَا إِلَى الْيَمَنِ فَأَخْبَرْتُ أَبَا بَكْرٍ بِحَدِيثِهِمْ قَالَ أَفَلاَ جِئْتَ بِهِمْ‏.‏ فَلَمَّا كَانَ بَعْدُ قَالَ لِي ذُو عَمْرٍو يَا جَرِيرُ إِنَّ بِكَ عَلَىَّ كَرَامَةً، وَإِنِّي مُخْبِرُكَ خَبَرًا، إِنَّكُمْ مَعْشَرَ الْعَرَبِ لَنْ تَزَالُوا بِخَيْرٍ مَا كُنْتُمْ إِذَا هَلَكَ أَمِيرٌ تَأَمَّرْتُمْ فِي آخَرَ، فَإِذَا كَانَتْ بِالسَّيْفِ كَانُوا مُلُوكًا يَغْضَبُونَ غَضَبَ الْمُلُوكِ وَيَرْضَوْنَ رِضَا الْمُلُوكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4359In-book reference : Book 64, Hadith 385USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 645   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4360,
    "id": 4360,
    "url": "https://sunnah.com/bukhari:4360",
    "bookNumber": 64,
    "hadithNumber": 386,
    "narrator": "Narrated Wahab bin Kaisan:",
    "english": "Jabir bin `Abdullah said, \"Allah's Messenger (ﷺ) sent troops to the sea coast and appointed Abu 'Ubaida bin \nAl-Jarrah as their commander, and they were 300 (men). We set out, and we had covered some \ndistance on the way, when our journey food ran short. So Abu 'Ubaida ordered that all the food \npresent with the troops be collected, and it was collected. Our journey food was dates, and Abu \nUbaida kept on giving us our daily ration from it little by little (piecemeal) till it decreased to such an \nextent that we did not receive except a date each.\" I asked (Jabir), \"How could one date benefit you?\" \nHe said, \"We came to know its value when even that finished.\" Jabir added, \"Then we reached the sea \n(coast) where we found a fish like a small mountain. The people (i.e. troops) ate of it for 18 nights (i.e. \ndays). Then Abu 'Ubaida ordered that two of its ribs be fixed on the ground (in the form of an arch) \nand that a she-camel be ridden and passed under them. So it passed under them without touching \nthem.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا قِبَلَ السَّاحِلِ وَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَهُمْ ثَلاَثُمِائَةٍ، فَخَرَجْنَا وَكُنَّا بِبَعْضِ الطَّرِيقِ فَنِيَ الزَّادُ فَأَمَرَ أَبُو عُبَيْدَةَ بِأَزْوَادِ الْجَيْشِ، فَجُمِعَ فَكَانَ مِزْوَدَىْ تَمْرٍ، فَكَانَ يَقُوتُنَا كُلَّ يَوْمٍ قَلِيلٌ قَلِيلٌ حَتَّى فَنِيَ، فَلَمْ يَكُنْ يُصِيبُنَا إِلاَّ تَمْرَةٌ تَمْرَةٌ فَقُلْتُ مَا تُغْنِي عَنْكُمْ تَمْرَةٌ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَنِيَتْ‏.‏ ثُمَّ انْتَهَيْنَا إِلَى الْبَحْرِ، فَإِذَا حُوتٌ مِثْلُ الظَّرِبِ فَأَكَلَ مِنْهَا الْقَوْمُ ثَمَانَ عَشْرَةَ لَيْلَةً، ثُمَّ أَمَرَ أَبُو عُبَيْدَةَ بِضِلَعَيْنِ مِنْ أَضْلاَعِهِ فَنُصِبَا، ثُمَّ أَمَرَ بِرَاحِلَةٍ فَرُحِلَتْ ثُمَّ مَرَّتْ تَحْتَهُمَا فَلَمْ تُصِبْهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4360In-book reference : Book 64, Hadith 386USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 646   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4361,
    "id": 4361,
    "url": "https://sunnah.com/bukhari:4361",
    "bookNumber": 64,
    "hadithNumber": 387,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) sent us who were three-hundred riders under the command of Abu Ubaida bin Al- \nJarrah in order to watch the caravan of the Quraish pagans. We stayed at the seashore for half a month \nand were struck with such severe hunger that we ate even the Khabt (i.e. the leaves of the Salam, a \nthorny desert tree), and because of that, the army was known as Jaish-ul-Khabt. Then the sea threw \nout, an animal (i.e. a fish) called Al-`Anbar and we ate of that for half a month, and rubbed its fat on \nour bodies till our bodies returned to their original state (i.e. became strong and healthy). Abu Ubaida \ntook one of its ribs, fixed it on the ground; then he went to the tallest man of his companions (to let \nhim pass under the rib). Once Sufyan said, \"He took a rib from its parts and fixed it, and then took a \nman and camel and they passed from underneath it (without touching it). \" Jabir added: There was a \nman amongst the people who slaughtered three camels and then slaughtered another three camels and \nthen slaughtered other three camels, and then Abu 'Ubaida forbade him to do so. \nNarrated Abu Salih: Qais bin Sa`d said to his father. \"I was present in the army and the people were \nstruck with severe hunger.\" He said, \"You should have slaughtered (camels) (for them).\" Qais said, \"I \ndid slaughter camels but they were hungry again. He said, \"You should have slaughtered (camels) \nagain.\" Qais said, \"I did slaughter (camels) again but the people felt hungry again.\" He said, \"You \nshould have slaughtered (camels) again.\" Qais said, \"I did slaughter (camels) again, but the people \nagain felt hungry.\" He said, \"You should have slaughtered (camels) again.\" Qais said, \"But I was \nforbidden (by Abu 'Ubaida this time).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الَّذِي حَفِظْنَاهُ مِنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَمِائَةِ رَاكِبٍ أَمِيرُنَا أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ نَرْصُدُ عِيرَ قُرَيْشٍ، فَأَقَمْنَا بِالسَّاحِلِ نِصْفَ شَهْرٍ فَأَصَابَنَا جُوعٌ شَدِيدٌ حَتَّى أَكَلْنَا الْخَبَطَ، فَسُمِّيَ ذَلِكَ الْجَيْشُ جَيْشَ الْخَبَطِ، فَأَلْقَى لَنَا الْبَحْرُ دَابَّةً يُقَالُ لَهَا الْعَنْبَرُ، فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ وَادَّهَنَّا مِنْ وَدَكِهِ حَتَّى ثَابَتْ إِلَيْنَا أَجْسَامُنَا، فَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَنَصَبَهُ فَعَمَدَ إِلَى أَطْوَلِ رَجُلٍ مَعَهُ ـ قَالَ سُفْيَانُ مَرَّةً ضِلَعًا مِنْ أَعْضَائِهِ فَنَصَبَهُ وَأَخَذَ رَجُلاً وَبَعِيرًا ـ فَمَرَّ تَحْتَهُ قَالَ جَابِرٌ وَكَانَ رَجُلٌ مِنَ الْقَوْمِ نَحَرَ ثَلاَثَ جَزَائِرَ، ثُمَّ نَحَرَ ثَلاَثَ جَزَائِرَ، ثُمَّ نَحَرَ ثَلاَثَ جَزَائِرَ، ثُمَّ إِنَّ أَبَا عُبَيْدَةَ نَهَاهُ‏.‏ وَكَانَ عَمْرٌو يَقُولُ أَخْبَرَنَا أَبُو صَالِحٍ أَنَّ قَيْسَ بْنَ سَعْدٍ قَالَ لأَبِيهِ كُنْتُ فِي الْجَيْشِ فَجَاعُوا‏.‏ قَالَ انْحَرْ‏.‏ قَالَ نَحَرْتُ‏.‏ قَالَ ثُمَّ جَاعُوا قَالَ انْحَرْ‏.‏ قَالَ نَحَرْتُ‏.‏ قَالَ ثُمَّ جَاعُوا قَالَ انْحَرْ‏.‏ قَالَ نَحَرْتُ ثُمَّ جَاعُوا قَالَ انْحَرْ‏.‏ قَالَ نُهِيتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4361In-book reference : Book 64, Hadith 387USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 647   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4362,
    "id": 4362,
    "url": "https://sunnah.com/bukhari:4362",
    "bookNumber": 64,
    "hadithNumber": 388,
    "narrator": "Narrated Jabir:",
    "english": "We set out in the army of Al-Khabt and Abu Ubaida was the commander of the troops. We were \nstruck with severe hunger and the sea threw out a dead fish the like of which we had never seen, and it \nwas called Al-`Anbar. We ate of it for half a month. Abu Ubaida took (and fixed) one of its bones and \na rider passed underneath it (without touching it). (Jabir added:) Abu 'Ubaida said (to us), \"Eat (of that \nfish).\" When we arrived at Medina, we informed the Prophet (ﷺ) about that, and he said, \"Eat, for it is \nfood Allah has brought out for you, and feed us if you have some of it.\" So some of them gave him (of \nthat fish) and he ate it.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّهُ سَمِعَ جَابِرًا ـ رضى الله عنه ـ يَقُولُ غَزَوْنَا جَيْشَ الْخَبَطِ وَأُمِّرَ أَبُو عُبَيْدَةَ، فَجُعْنَا جُوعًا شَدِيدًا فَأَلْقَى الْبَحْرُ حُوتًا مَيِّتًا، لَمْ نَرَ مِثْلَهُ، يُقَالُ لَهُ الْعَنْبَرُ، فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ، فَأَخَذَ أَبُو عُبَيْدَةَ عَظْمًا مِنْ عِظَامِهِ فَمَرَّ الرَّاكِبُ تَحْتَهُ‏.‏ فَأَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ قَالَ أَبُو عُبَيْدَةَ كُلُوا‏.‏ فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ كُلُوا رِزْقًا أَخْرَجَهُ اللَّهُ، أَطْعِمُونَا إِنْ كَانَ مَعَكُمْ ‏\"‏‏.‏ فَأَتَاهُ بَعْضُهُمْ ‏{‏بِعُضْوٍ‏}‏ فَأَكَلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4362In-book reference : Book 64, Hadith 388USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 648   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4363,
    "id": 4363,
    "url": "https://sunnah.com/bukhari:4363",
    "bookNumber": 64,
    "hadithNumber": 389,
    "narrator": "Narrated Abu Huraira:",
    "english": "That during the Hajj in which the Prophet (ﷺ) had made Abu Bakr As Siddiq as chief of the, Hajj before \nthe Hajj-ul-Wida,' on the day of Nahr, Abu Bakr sent him along with a group of persons to announce \nto the people. \"No pagan is permitted to perform Hajj after this year, and nobody is permitted to \nperform the Tawaf of the Ka`ba naked.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، حَدَّثَنَا فُلَيْحٌ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ ـ رضى الله عنه ـ بَعَثَهُ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ النَّبِيُّ صلى الله عليه وسلم قَبْلَ حَجَّةِ الْوَدَاعِ يَوْمَ النَّحْرِ فِي رَهْطٍ يُؤَذِّنُ فِي النَّاسِ لاَ يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4363In-book reference : Book 64, Hadith 389USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 649   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4364,
    "id": 4364,
    "url": "https://sunnah.com/bukhari:4364",
    "bookNumber": 64,
    "hadithNumber": 390,
    "narrator": "Narrated Al-Bara:",
    "english": "The last Sura which was revealed in full was Baraa (i.e. Sura-at-Tauba), and the last Sura (i.e. part of a \nSura) which was revealed was the last Verses of Sura-an-Nisa':-- \"They ask you for a legal decision. \nSay: Allah directs (thus) About those who have No descendants or ascendants As heirs.\" (4.177)",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ آخِرُ سُورَةٍ نَزَلَتْ كَامِلَةً بَرَاءَةٌ، وَآخِرُ سُورَةٍ نَزَلَتْ خَاتِمَةُ سُورَةِ النِّسَاءِ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4364In-book reference : Book 64, Hadith 390USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 650   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4365,
    "id": 4365,
    "url": "https://sunnah.com/bukhari:4365",
    "bookNumber": 64,
    "hadithNumber": 391,
    "narrator": "Narrated `Imran bin Hussein:",
    "english": "A delegation from Banu Tamim came to the Prophet (ﷺ) . The Prophet (ﷺ) said, \"Accept the good tidings, O \nBanu Tamim!\" They said, \"O Allah's Messenger (ﷺ)! You have given us good tidings, so give us \n(something).\" Signs of displeasure appeared on his face. Then another delegation from Yemen came \nand he said (to them), \"Accept the good tidings, for Banu Tamim refuses to accept them.\" They \nreplied, \"We have accepted them, O Allah's Messenger (ﷺ)!\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي صَخْرَةَ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ الْمَازِنِيِّ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ قَالَ أَتَى نَفَرٌ مِنْ بَنِي تَمِيمٍ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اقْبَلُوا الْبُشْرَى يَا بَنِي تَمِيمٍ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَدْ بَشَّرْتَنَا فَأَعْطِنَا‏.‏ فَرِيءَ ذَلِكَ فِي وَجْهِهِ فَجَاءَ نَفَرٌ مِنَ الْيَمَنِ فَقَالَ ‏\"‏ اقْبَلُوا الْبُشْرَى إِذْ لَمْ يَقْبَلْهَا بَنُو تَمِيمٍ ‏\"‏‏.‏ قَالُوا قَدْ قَبِلْنَا يَا رَسُولَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4365In-book reference : Book 64, Hadith 391USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 651   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4366,
    "id": 4366,
    "url": "https://sunnah.com/bukhari:4366",
    "bookNumber": 64,
    "hadithNumber": 392,
    "narrator": "Narrated Abu Huraira:",
    "english": "I have not ceased to like Banu Tamim ever since I heard of three qualities attributed to them by \nAllah's Messenger (ﷺ) (He said): They, out of all my followers, will be the strongest opponent of Ad-Dajjal; \n`Aisha had a slave-girl from them, and the Prophet (ﷺ) told her to manumit her as she was from the \ndescendants of (the Prophet) Ishmael; and, when their Zakat was brought, the Prophet (ﷺ) said, \"This is \nthe Zakat of my people.\"",
    "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لاَ أَزَالُ أُحِبُّ بَنِي تَمِيمٍ بَعْدَ ثَلاَثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُهَا فِيهِمْ ‏\"‏ هُمْ أَشَدُّ أُمَّتِي عَلَى الدَّجَّالِ ‏\"‏‏.‏ وَكَانَتْ فِيهِمْ سَبِيَّةٌ عِنْدَ عَائِشَةَ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّهَا مِنْ وَلَدِ إِسْمَاعِيلَ ‏\"‏‏.‏ وَجَاءَتْ صَدَقَاتُهُمْ فَقَالَ ‏\"‏ هَذِهِ صَدَقَاتُ قَوْمٍ، أَوْ قَوْمِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4366In-book reference : Book 64, Hadith 392USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 652   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4367,
    "id": 4367,
    "url": "https://sunnah.com/bukhari:4367",
    "bookNumber": 64,
    "hadithNumber": 393,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "`Abdullah bin Az-Zubair said that a group of riders belonging to Banu Tamim came to the Prophet, \nAbu Bakr said (to the Prophet (ﷺ) ), \"Appoint Al-Qa'qa bin Mabad bin Zurara as (their) ruler.\" `Umar said \n(to the Prophet). \"No! But appoint Al-Aqra bin H`Abis.\" Thereupon Abu Bakr said (to `Umar). \"You \njust wanted to oppose me.\" `Umar replied. \"I did not want to oppose you.\" So both of them argued so \nmuch that their voices became louder, and then the following Divine Verses were revealed in that \nconnection:-- \"O you who believe ! Do not be forward in the presence of Allah and His Apostle...\" \n(till the end of Verse)...(49.1)",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، أَخْبَرَهُمْ أَنَّهُ، قَدِمَ رَكْبٌ مِنْ بَنِي تَمِيمٍ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَمِّرِ الْقَعْقَاعَ بْنَ مَعْبَدِ بْنِ زُرَارَةَ‏.‏ قَالَ عُمَرُ بَلْ أَمِّرِ الأَقْرَعَ بْنَ حَابِسٍ‏.‏ قَالَ أَبُو بَكْرٍ مَا أَرَدْتَ إِلاَّ خِلاَفِي‏.‏ قَالَ عُمَرُ مَا أَرَدْتُ خِلاَفَكَ‏.‏ فَتَمَارَيَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا فَنَزَلَ فِي ذَلِكَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُقَدِّمُوا‏}‏ حَتَّى انْقَضَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4367In-book reference : Book 64, Hadith 393USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 653   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4368,
    "id": 4368,
    "url": "https://sunnah.com/bukhari:4368",
    "bookNumber": 64,
    "hadithNumber": 394,
    "narrator": "Narrated Abu Jamra:",
    "english": "I said to Ibn `Abbas, \"I have an earthenware pot containing Nabidh (i.e. water and dates or grapes) for \nme, and I drink of it while it is sweet. If I drink much of it and stay with the people for a long time, I \nget afraid that they may discover it (for I will appear as if I were drunk). Ibn `Abbas said, \"A \ndelegation of `Abdul Qais came to Allah's Messenger (ﷺ) and he said, \"Welcome, O people! Neither will you \nhave disgrace nor will you regret.\" They said, \"O Allah's Messenger (ﷺ)! There are the Mudar pagans \nbetween you and us, so we cannot come to you except in the sacred Months. So please teach us some \norders on acting upon which we will enter Paradise. Besides, we will preach that to our people who \nare behind us.\" The Prophet (ﷺ) said, \"I order you to do four things and forbid you from four things (I \norder you): To believe in Allah...Do you know what is to believe in Allah? That is to testify that None \nhas the right to be worshipped except Allah: (I order you also to offer prayers perfectly to pay Zakat; \nand to fast the month of Ramadan and to give the Khumus (i.e. one-fifth of the booty) (for Allah's \nSake). I forbid you from four other things (i.e. the wine that is prepared in) Ad-Dubba, An-Naquir, \nAz-Hantam and Al-Muzaffat. (See Hadith No. 50 Vol. 1)",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا قُرَّةُ، عَنْ أَبِي جَمْرَةَ، قُلْتُ لاِبْنِ عَبَّاسٍ ـ رضى الله عنهما ـ إِنَّ لِي جَرَّةً يُنْتَبَذُ لِي نَبِيذٌ، فَأَشْرَبُهُ حُلْوًا فِي جَرٍّ إِنْ أَكْثَرْتُ مِنْهُ، فَجَالَسْتُ الْقَوْمَ، فَأَطَلْتُ الْجُلُوسَ خَشِيتُ أَنْ أَفْتَضِحَ فَقَالَ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ غَيْرَ خَزَايَا وَلاَ النَّدَامَى ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، إِنَّ بَيْنَنَا وَبَيْنَكَ الْمُشْرِكِينَ مِنْ مُضَرَ، وَإِنَّا لاَ نَصِلُ إِلَيْكَ إِلاَّ فِي أَشْهُرِ الْحُرُمِ، حَدِّثْنَا بِجُمَلٍ مِنَ الأَمْرِ، إِنْ عَمِلْنَا بِهِ دَخَلْنَا الْجَنَّةَ، وَنَدْعُو بِهِ مَنْ وَرَاءَنَا‏.‏ قَالَ ‏\"‏ آمُرُكُمْ بِأَرْبَعٍ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ، الإِيمَانِ بِاللَّهِ، هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ وَصَوْمُ رَمَضَانَ، وَأَنْ تُعْطُوا مِنَ الْمَغَانِمِ الْخُمُسَ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ مَا انْتُبِذَ فِي الدُّبَّاءِ، وَالنَّقِيرِ، وَالْحَنْتَمِ، وَالْمُزَفَّتِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4368In-book reference : Book 64, Hadith 394USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 654   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4369,
    "id": 4369,
    "url": "https://sunnah.com/bukhari:4369",
    "bookNumber": 64,
    "hadithNumber": 395,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The delegation of `Abdul Qais came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ) We belong to the \ntribe of Rabi`a. The infidels of Mudar tribe intervened between us and you so that we cannot come to \nyou except in the Sacred Months, so please order us some things we may act on and invite those left \nbehind to act on. The Prophet (ﷺ) said, \"I order you to observe four things and forbid you from four \nthings: (I order you) to believe in Allah, i.e. to testify that None has the right to be worshipped except \nAllah.\" The Prophet (ﷺ) pointed with finger indicating one and added, \"To offer prayers perfectly: to give \nZakat, and to give one-fifth of the booty you win (for Allah's Sake). I forbid you to use Ad-Dubba', \nAn-Naquir, Al-Hantam and Al-Muzaffat, (Utensils used for preparing alcoholic liquors and drinks).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا هَذَا الْحَىَّ مِنْ رَبِيعَةَ، وَقَدْ حَالَتْ بَيْنَنَا وَبَيْنَكَ كُفَّارُ مُضَرَ، فَلَسْنَا نَخْلُصُ إِلَيْكَ إِلاَّ فِي شَهْرٍ حَرَامٍ، فَمُرْنَا بِأَشْيَاءَ نَأْخُذُ بِهَا وَنَدْعُو إِلَيْهَا مَنْ وَرَاءَنَا‏.‏ قَالَ ‏\n\"‏ آمُرُكُمْ بِأَرْبَعٍ وَأَنْهَاكُمْ عَنْ أَرْبَعٍ، الإِيمَانِ بِاللَّهِ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ـ وَعَقَدَ وَاحِدَةً ـ وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَأَنْ تُؤَدُّوا لِلَّهِ خُمْسَ مَا غَنِمْتُمْ، وَأَنْهَاكُمْ عَنِ الدُّبَّاءِ، وَالنَّقِيرِ وَالْحَنْتَمِ وَالْمُزَفَّتِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4369In-book reference : Book 64, Hadith 395USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 655   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4370,
    "id": 4370,
    "url": "https://sunnah.com/bukhari:4370",
    "bookNumber": 64,
    "hadithNumber": 396,
    "narrator": "Narrated Bukair:",
    "english": "That Kuraib, the freed slave of Ibn `Abbas told him that Ibn `Abbas, `Abdur-Rahman bin Azhar and \nAl-Miswar bin Makhrama sent him to `Aisha saying, \"Pay her our greetings and ask her about our \noffering of the two-rak`at after `Asr Prayer, and tell her that we have been informed that you offer \nthese two rak`at while we have heard that the Prophet (ﷺ) had forbidden their offering.\" Ibn `Abbas said, \n\"I and `Umar used to beat the people for their offering them.\" Kuraib added, \"I entered upon her and \ndelivered their message to her.' She said, 'Ask Um Salama.' So, I informed them (of `Aisha's answer) \nand they sent me to Um Salama for the same purpose as they sent me to `Aisha. Um Salama replied, 'I \nheard the Prophet (ﷺ) forbidding the offering of these two rak`at. Once the Prophet (ﷺ) offered the `Asr \nprayer, and then came to me. And at that time some Ansari women from the Tribe of Banu Haram \nwere with me. Then (the Prophet (ﷺ) ) offered those two rak`at, and I sent my (lady) servant to him, \nsaying, 'Stand beside him and say (to him): Um Salama says, 'O Allah's Messenger (ﷺ)! Didn't I hear you \nforbidding the offering of these two rak`at (after the `Asr prayer yet I see you offering them?' And if \nhe beckons to you with his hand, then wait behind.' So the lady slave did that and the Prophet (ﷺ) \nbeckoned her with his hand, and she stayed behind, and when the Prophet (ﷺ) finished his prayer, he said, \n'O the daughter of Abu Umaiya (i.e. Um Salama), You were asking me about these two rak`at after the \n`Asr prayer. In fact, some people from the tribe of `Abdul Qais came to me to embrace Islam and \nbusied me so much that I did not offer the two rak`at which were offered after Zuhr compulsory \nprayer, and these two rak`at (you have seen me offering) make up for those.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو،‏.‏ وَقَالَ بَكْرُ بْنُ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، أَنَّ كُرَيْبًا، مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوا إِلَى عَائِشَةَ ـ رضى الله عنها ـ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلاَمَ مِنَّا جَمِيعًا، وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ، وَإِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّيهَا، وَقَدْ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْهَا، قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ مَعَ عُمَرَ النَّاسَ عَنْهُمَا‏.‏ قَالَ كُرَيْبٌ فَدَخَلْتُ عَلَيْهَا، وَبَلَّغْتُهَا مَا أَرْسَلُونِي، فَقَالَتْ سَلْ أُمَّ سَلَمَةَ‏.‏ فَأَخْبَرْتُهُمْ، فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي إِلَى عَائِشَةَ، فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَنْهَى عَنْهُمَا، وَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ عَلَىَّ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنَ الأَنْصَارِ، فَصَلاَّهُمَا، فَأَرْسَلْتُ إِلَيْهِ الْخَادِمَ فَقُلْتُ قُومِي إِلَى جَنْبِهِ فَقُولِي تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ أَلَمْ أَسْمَعْكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ فَأَرَاكَ تُصَلِّيهِمَا‏.‏ فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي‏.‏ فَفَعَلَتِ الْجَارِيَةُ، فَأَشَارَ بِيَدِهِ، فَاسْتَأْخَرَتْ عَنْهُ، فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ يَا بِنْتَ أَبِي أُمَيَّةَ، سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ، إِنَّهُ أَتَانِي أُنَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالإِسْلاَمِ مِنْ قَوْمِهِمْ، فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ، فَهُمَا هَاتَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4370In-book reference : Book 64, Hadith 396USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 656   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4371,
    "id": 4371,
    "url": "https://sunnah.com/bukhari:4371",
    "bookNumber": 64,
    "hadithNumber": 397,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The first Friday (i.e. Jumua) prayer offered after the Friday Prayer offered at the Mosque of Allah's \nApostle was offered at the mosque of `Abdul Qais situated at Jawathi, that is a village at Al Bahrain .",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ، حَدَّثَنَا إِبْرَاهِيمُ ـ هُوَ ابْنُ طَهْمَانَ ـ عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما قَالَ أَوَّلُ جُمُعَةٍ جُمِّعَتْ بَعْدَ جُمُعَةٍ جُمِّعَتْ فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ عَبْدِ الْقَيْسِ بِجُوَاثَى‏.‏ يَعْنِي قَرْيَةً مِنَ الْبَحْرَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4371In-book reference : Book 64, Hadith 397USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 657   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4372,
    "id": 4372,
    "url": "https://sunnah.com/bukhari:4372",
    "bookNumber": 64,
    "hadithNumber": 398,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) sent some cavalry towards Najd and they brought a man from the tribe of Banu Hanifa \nwho was called Thumama bin Uthal. They fastened him to one of the pillars of the Mosque. The \nProphet went to him and said, \"What have you got, O Thumama?\" He replied,\" I have got a good \nthought, O Muhammad! If you should kill me, you would kill a person who has already killed \nsomebody, and if you should set me free, you would do a favor to one who is grateful, and if you want \nproperty, then ask me whatever wealth you want.\" He was left till the next day when the Prophet (ﷺ) said \nto him, \"What have you got, Thumama? He said, \"What I told you, i.e. if you set me free, you would \ndo a favor to one who is grateful.\" The Prophet (ﷺ) left him till the day after, when he said, \"What have \nyou got, O Thumama?\" He said, \"I have got what I told you. \"On that the Prophet (ﷺ) said, \"Release \nThumama.\" So he (i.e. Thumama) went to a garden of date-palm trees near to the Mosque, took a bath \nand then entered the Mosque and said, \"I testify that None has the right to be worshipped except \nAllah, and also testify that Muhammad is His Apostle! By Allah, O Muhammad! There was no face \non the surface of the earth most disliked by me than yours, but now your face has become the most \nbeloved face to me. By Allah, there was no religion most disliked by me than yours, but now it is the \nmost beloved religion to me. By Allah, there was no town most disliked by me than your town, but \nnow it is the most beloved town to me. Your cavalry arrested me (at the time) when I was intending to \nperform the `Umra. And now what do you think?\" The Prophet (ﷺ) gave him good tidings (congratulated \nhim) and ordered him to perform the `Umra. So when he came to Mecca, someone said to him, \"You \nhave become a Sabian?\" Thumama replied, \"No! By Allah, I have embraced Islam with Muhammad, \nApostle of Allah. No, by Allah! Not a single grain of wheat will come to you from Yamamah unless the \nProphet gives his permission.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ، فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ، فَخَرَجَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا عِنْدَكَ يَا ثُمَامَةُ ‏\"‏‏.‏ فَقَالَ عِنْدِي خَيْرٌ يَا مُحَمَّدُ، إِنْ تَقْتُلْنِي تَقْتُلْ ذَا دَمٍ، وَإِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ، وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ مِنْهُ مَا شِئْتَ‏.‏ حَتَّى كَانَ الْغَدُ ثُمَّ قَالَ لَهُ ‏\"‏ مَا عِنْدَكَ يَا ثُمَامَةُ ‏\"‏‏.‏ قَالَ مَا قُلْتُ لَكَ إِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ‏.‏ فَتَرَكَهُ حَتَّى كَانَ بَعْدَ الْغَدِ، فَقَالَ ‏\"‏ مَا عِنْدَكَ يَا ثُمَامَةُ ‏\"‏‏.‏ فَقَالَ عِنْدِي مَا قُلْتُ لَكَ‏.‏ فَقَالَ ‏\"‏ أَطْلِقُوا ثُمَامَةَ ‏\"‏، فَانْطَلَقَ إِلَى نَخْلٍ قَرِيبٍ مِنَ الْمَسْجِدِ فَاغْتَسَلَ ثُمَّ دَخَلَ الْمَسْجِدَ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، يَا مُحَمَّدُ وَاللَّهِ مَا كَانَ عَلَى الأَرْضِ وَجْهٌ أَبْغَضَ إِلَىَّ مِنْ وَجْهِكَ، فَقَدْ أَصْبَحَ وَجْهُكَ أَحَبَّ الْوُجُوهِ إِلَىَّ، وَاللَّهِ مَا كَانَ مِنْ دِينٍ أَبْغَضَ إِلَىَّ مِنْ دِينِكَ، فَأَصْبَحَ دِينُكَ أَحَبَّ الدِّينِ إِلَىَّ، وَاللَّهِ مَا كَانَ مِنْ بَلَدٍ أَبْغَضُ إِلَىَّ مِنْ بَلَدِكَ، فَأَصْبَحَ بَلَدُكَ أَحَبَّ الْبِلاَدِ إِلَىَّ، وَإِنَّ خَيْلَكَ أَخَذَتْنِي وَأَنَا أُرِيدُ الْعُمْرَةَ، فَمَاذَا تَرَى فَبَشَّرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَمَرَهُ أَنْ يَعْتَمِرَ، فَلَمَّا قَدِمَ مَكَّةَ قَالَ لَهُ قَائِلٌ صَبَوْتَ‏.‏ قَالَ لاَ، وَلَكِنْ أَسْلَمْتُ مَعَ مُحَمَّدٍ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلاَ وَاللَّهِ لاَ يَأْتِيكُمْ مِنَ الْيَمَامَةِ حَبَّةُ حِنْطَةٍ حَتَّى يَأْذَنَ فِيهَا النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4372In-book reference : Book 64, Hadith 398USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 658   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4373,
    "id": 4373,
    "url": "https://sunnah.com/bukhari:4373",
    "bookNumber": 64,
    "hadithNumber": 399,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Musailima Al-Kadhdhab came during the lifetime of the Prophet (ﷺ) and started saying, \"If Muhammad \ngives me the rule after him, I will follow him.\" And he came to Medina with a great number of the \npeople of his tribe. Allah's Messenger (ﷺ) went to him in the company of Thabit bin Qais bin Shammas, and \nat that time, Allah's Messenger (ﷺ) had a stick of a date-palm tree in his hand. When he (i.e. the Prophet (ﷺ) ) \nstopped near Musailima while the latter was amidst his companions, he said to him, \"If you ask me for \nthis piece (of stick), I will not give it to you, and Allah's Order you cannot avoid, (but you will be \ndestroyed), and if you turn your back from this religion, then Allah will destroy you. And I think you \nare the same person who was shown to me in my dream, and this is Thabit bin Qais who will answer \nyour questions on my behalf.\" Then the Prophet (ﷺ) went away from him. I asked about the statement of \nAllah's Messenger (ﷺ) : \"You seem to be the same person who was shown to me in my dream,\" and Abu \nHuraira informed me that Allah's Messenger (ﷺ) said, \"When I was sleeping, I saw (in a dream) two bangles \nof gold on my hands and that worried me. And then I was inspired Divinely in the dream that I should \nblow on them, so I blew on them and both the bangles flew away. And I interpreted it that two liars \n(who would claim to be prophets) would appear after me. One of them has proved to be Al Ansi and \nthe other, Musailima.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ مِنْ بَعْدِهِ تَبِعْتُهُ‏.‏ وَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ، فَأَقْبَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قِطْعَةُ جَرِيدٍ حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ، فَقَالَ ‏\"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا وَلَنْ تَعْدُوَ أَمْرَ اللَّهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ، وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيهِ مَا رَأَيْتُ، وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي ‏\"‏‏.‏ ثُمَّ انْصَرَفَ عَنْهُ‏.‏ \nقَالَ ابْنُ عَبَّاسٍ فَسَأَلْتُ عَنْ قَوْلِ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ أُرَى الَّذِي أُرِيتُ فِيهِ مَا أُرِيتُ ‏\"‏‏.‏ فَأَخْبَرَنِي أَبُو هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ، فَأَهَمَّنِي شَأْنُهُمَا، فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ بَعْدِي، أَحَدُهُمَا الْعَنْسِيُّ، وَالآخَرُ مُسَيْلِمَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4373, 4374In-book reference : Book 64, Hadith 399USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 659   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4374,
    "id": 4374,
    "url": "https://sunnah.com/bukhari:4374",
    "bookNumber": 64,
    "hadithNumber": 399,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Musailima Al-Kadhdhab came during the lifetime of the Prophet (ﷺ) and started saying, \"If Muhammad \ngives me the rule after him, I will follow him.\" And he came to Medina with a great number of the \npeople of his tribe. Allah's Messenger (ﷺ) went to him in the company of Thabit bin Qais bin Shammas, and \nat that time, Allah's Messenger (ﷺ) had a stick of a date-palm tree in his hand. When he (i.e. the Prophet (ﷺ) ) \nstopped near Musailima while the latter was amidst his companions, he said to him, \"If you ask me for \nthis piece (of stick), I will not give it to you, and Allah's Order you cannot avoid, (but you will be \ndestroyed), and if you turn your back from this religion, then Allah will destroy you. And I think you \nare the same person who was shown to me in my dream, and this is Thabit bin Qais who will answer \nyour questions on my behalf.\" Then the Prophet (ﷺ) went away from him. I asked about the statement of \nAllah's Messenger (ﷺ) : \"You seem to be the same person who was shown to me in my dream,\" and Abu \nHuraira informed me that Allah's Messenger (ﷺ) said, \"When I was sleeping, I saw (in a dream) two bangles \nof gold on my hands and that worried me. And then I was inspired Divinely in the dream that I should \nblow on them, so I blew on them and both the bangles flew away. And I interpreted it that two liars \n(who would claim to be prophets) would appear after me. One of them has proved to be Al Ansi and \nthe other, Musailima.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ مِنْ بَعْدِهِ تَبِعْتُهُ‏.‏ وَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ، فَأَقْبَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قِطْعَةُ جَرِيدٍ حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ، فَقَالَ ‏\"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا وَلَنْ تَعْدُوَ أَمْرَ اللَّهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ، وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيهِ مَا رَأَيْتُ، وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي ‏\"‏‏.‏ ثُمَّ انْصَرَفَ عَنْهُ‏.‏ \nقَالَ ابْنُ عَبَّاسٍ فَسَأَلْتُ عَنْ قَوْلِ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ أُرَى الَّذِي أُرِيتُ فِيهِ مَا أُرِيتُ ‏\"‏‏.‏ فَأَخْبَرَنِي أَبُو هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ، فَأَهَمَّنِي شَأْنُهُمَا، فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ بَعْدِي، أَحَدُهُمَا الْعَنْسِيُّ، وَالآخَرُ مُسَيْلِمَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4373, 4374In-book reference : Book 64, Hadith 399USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 659   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4375,
    "id": 4375,
    "url": "https://sunnah.com/bukhari:4375",
    "bookNumber": 64,
    "hadithNumber": 400,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I was given the treasures of the earth and two gold \nbangles were put in my hands, and I did not like that, but I received the inspiration that I should blow \non them, and I did so, and both of them vanished. I interpreted it as referring to the two liars between \nwhom I am present; the ruler of Sana and the Ruler of Yamaha.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِخَزَائِنِ الأَرْضِ، فَوُضِعَ فِي كَفِّي سِوَارَانِ مِنْ ذَهَبٍ، فَكَبُرَا عَلَىَّ فَأُوحِيَ إِلَىَّ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ، وَصَاحِبَ الْيَمَامَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4375In-book reference : Book 64, Hadith 400USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 660   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4376,
    "id": 4376,
    "url": "https://sunnah.com/bukhari:4376",
    "bookNumber": 64,
    "hadithNumber": 401,
    "narrator": "Narrated Abu Raja Al-Utaridi:",
    "english": "We used to worship stones, and when we found a better stone than the first one, we would throw the \nfirst one and take the latter, but if we could not get a stone then we would collect some earth (i.e. soil) \nand then bring a sheep and milk that sheep over it, and perform the Tawaf around it. When the month \nof Rajab came, we used (to stop the military actions), calling this month the iron remover, for we used \nto remove and throw away the iron parts of every spear and arrow in the month of Rajab. Abu Raja' \nadded: When the Prophet (ﷺ) sent with (Allah's) Message, I was a boy working as a shepherd of my \nfamily camels. When we heard the news about the appearance of the Prophet, we ran to the fire, i.e. to \nMusailima al-Kadhdhab.",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، قَالَ سَمِعْتُ مَهْدِيَّ بْنَ مَيْمُونٍ، قَالَ سَمِعْتُ أَبَا رَجَاءٍ الْعُطَارِدِيَّ، يَقُولُ كُنَّا نَعْبُدُ الْحَجَرَ، فَإِذَا وَجَدْنَا حَجَرًا هُوَ أَخْيَرُ مِنْهُ أَلْقَيْنَاهُ وَأَخَذْنَا الآخَرَ، فَإِذَا لَمْ نَجِدْ حَجَرًا جَمَعْنَا جُثْوَةً مِنْ تُرَابٍ، ثُمَّ جِئْنَا بِالشَّاةِ فَحَلَبْنَاهُ عَلَيْهِ، ثُمَّ طُفْنَا بِهِ، فَإِذَا دَخَلَ شَهْرُ رَجَبٍ قُلْنَا مُنَصِّلُ الأَسِنَّةِ‏.‏ فَلاَ نَدَعُ رُمْحًا فِيهِ حَدِيدَةٌ وَلاَ سَهْمًا فِيهِ حَدِيدَةٌ إِلاَّ نَزَعْنَاهُ وَأَلْقَيْنَاهُ شَهْرَ رَجَبٍ‏.‏\nوَسَمِعْتُ أَبَا رَجَاءٍ، يَقُولُ كُنْتُ يَوْمَ بُعِثَ النَّبِيُّ صلى الله عليه وسلم غُلاَمًا أَرْعَى الإِبِلَ عَلَى أَهْلِي، فَلَمَّا سَمِعْنَا بِخُرُوجِهِ فَرَرْنَا إِلَى النَّارِ إِلَى مُسَيْلِمَةَ الْكَذَّابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4376, 4377In-book reference : Book 64, Hadith 401USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 661   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4377,
    "id": 4377,
    "url": "https://sunnah.com/bukhari:4377",
    "bookNumber": 64,
    "hadithNumber": 401,
    "narrator": "Narrated Abu Raja Al-Utaridi:",
    "english": "We used to worship stones, and when we found a better stone than the first one, we would throw the \nfirst one and take the latter, but if we could not get a stone then we would collect some earth (i.e. soil) \nand then bring a sheep and milk that sheep over it, and perform the Tawaf around it. When the month \nof Rajab came, we used (to stop the military actions), calling this month the iron remover, for we used \nto remove and throw away the iron parts of every spear and arrow in the month of Rajab. Abu Raja' \nadded: When the Prophet (ﷺ) sent with (Allah's) Message, I was a boy working as a shepherd of my \nfamily camels. When we heard the news about the appearance of the Prophet, we ran to the fire, i.e. to \nMusailima al-Kadhdhab.",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، قَالَ سَمِعْتُ مَهْدِيَّ بْنَ مَيْمُونٍ، قَالَ سَمِعْتُ أَبَا رَجَاءٍ الْعُطَارِدِيَّ، يَقُولُ كُنَّا نَعْبُدُ الْحَجَرَ، فَإِذَا وَجَدْنَا حَجَرًا هُوَ أَخْيَرُ مِنْهُ أَلْقَيْنَاهُ وَأَخَذْنَا الآخَرَ، فَإِذَا لَمْ نَجِدْ حَجَرًا جَمَعْنَا جُثْوَةً مِنْ تُرَابٍ، ثُمَّ جِئْنَا بِالشَّاةِ فَحَلَبْنَاهُ عَلَيْهِ، ثُمَّ طُفْنَا بِهِ، فَإِذَا دَخَلَ شَهْرُ رَجَبٍ قُلْنَا مُنَصِّلُ الأَسِنَّةِ‏.‏ فَلاَ نَدَعُ رُمْحًا فِيهِ حَدِيدَةٌ وَلاَ سَهْمًا فِيهِ حَدِيدَةٌ إِلاَّ نَزَعْنَاهُ وَأَلْقَيْنَاهُ شَهْرَ رَجَبٍ‏.‏\nوَسَمِعْتُ أَبَا رَجَاءٍ، يَقُولُ كُنْتُ يَوْمَ بُعِثَ النَّبِيُّ صلى الله عليه وسلم غُلاَمًا أَرْعَى الإِبِلَ عَلَى أَهْلِي، فَلَمَّا سَمِعْنَا بِخُرُوجِهِ فَرَرْنَا إِلَى النَّارِ إِلَى مُسَيْلِمَةَ الْكَذَّابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4376, 4377In-book reference : Book 64, Hadith 401USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 661   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4378,
    "id": 4378,
    "url": "https://sunnah.com/bukhari:4378",
    "bookNumber": 64,
    "hadithNumber": 402,
    "narrator": "Narrated Ubaidullah bin `Abdullah bin `Utba:",
    "english": "We were informed that Musailima Al-Kadhdhab had arrived in Medina and stayed in the house of the \ndaughter of Al-Harith. The daughter of Al-Harith bin Kuraiz was his wife and she was the mother of \n`Abdullah bin 'Amir. There came to him Allah's Messenger (ﷺ) accompanied by Thabit bin Qais bin \nShammas who was called the orator of Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) had a stick in his hand then. \nThe Prophet (ﷺ) stopped before Musailima and spoke to him. Musailima said to him, \"If you wish, we \nwould not interfere between you and the rule, on condition that the rule will be ours after you... The \nProphet said, \"If you asked me for this stick, I would not give it to you. I think you are the same \nperson who was shown to me in a dream. And this is Thabit bin Al-Qais who will answer you on my \nbehalf.\" The Prophet (ﷺ) then went away. I asked Ibn `Abbas about the dream Allah's Messenger (ﷺ) had \nmentioned. Ibn `Abbas said, \"Someone told me that the Prophet (ﷺ) said, \"When I was sleeping, I saw in a \ndream that two gold bangles were put in my hands, and that frightened me and made me dislike them. \nThen I was allowed to blow on them, and when I blew at them, both of them flew. Then I interpreted \nthem as two liars who would appear.' One of them was Al-`Ansi who was killed by Fairuz in Yemen \nand the other was Musailima Al-Kadhdbab.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ عُبَيْدَةَ بْنِ نَشِيطٍ ـ وَكَانَ فِي مَوْضِعٍ آخَرَ اسْمُهُ عَبْدُ اللَّهِ ـ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ بَلَغَنَا أَنَّ مُسَيْلِمَةَ الْكَذَّابَ قَدِمَ الْمَدِينَةَ، فَنَزَلَ فِي دَارِ بِنْتِ الْحَارِثِ، وَكَانَ تَحْتَهُ بِنْتُ الْحَارِثِ بْنِ كُرَيْزٍ، وَهْىَ أُمُّ عَبْدِ اللَّهِ بْنِ عَامِرٍ، فَأَتَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَهْوَ الَّذِي يُقَالُ لَهُ خَطِيبُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَضِيبٌ، فَوَقَفَ عَلَيْهِ فَكَلَّمَهُ فَقَالَ لَهُ مُسَيْلِمَةُ إِنْ شِئْتَ خَلَّيْتَ بَيْنَنَا وَبَيْنَ الأَمْرِ، ثُمَّ جَعَلْتَهُ لَنَا بَعْدَكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ سَأَلْتَنِي هَذَا الْقَضِيبَ مَا أَعْطَيْتُكَهُ وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيهِ مَا أُرِيتُ، وَهَذَا ثَابِتُ بْنُ قَيْسٍ وَسَيُجِيبُكَ عَنِّي ‏\"‏‏.‏ فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم‏.‏   قَالَ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَنْ رُؤْيَا، رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي ذَكَرَ فَقَالَ ابْنُ عَبَّاسٍ ذُكِرَ لِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُرِيتُ أَنَّهُ وُضِعَ فِي يَدَىَّ سِوَارَانِ مِنْ ذَهَبٍ، فَفُظِعْتُهُمَا وَكَرِهْتُهُمَا، فَأُذِنَ لِي فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ ‏\"‏‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَحَدُهُمَا الْعَنْسِيُّ الَّذِي قَتَلَهُ فَيْرُوزُ بِالْيَمَنِ، وَالآخَرُ مُسَيْلِمَةُ الْكَذَّابُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4378, 4379In-book reference : Book 64, Hadith 402USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 662   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4379,
    "id": 4379,
    "url": "https://sunnah.com/bukhari:4379",
    "bookNumber": 64,
    "hadithNumber": 402,
    "narrator": "Narrated Ubaidullah bin `Abdullah bin `Utba:",
    "english": "We were informed that Musailima Al-Kadhdhab had arrived in Medina and stayed in the house of the \ndaughter of Al-Harith. The daughter of Al-Harith bin Kuraiz was his wife and she was the mother of \n`Abdullah bin 'Amir. There came to him Allah's Messenger (ﷺ) accompanied by Thabit bin Qais bin \nShammas who was called the orator of Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) had a stick in his hand then. \nThe Prophet (ﷺ) stopped before Musailima and spoke to him. Musailima said to him, \"If you wish, we \nwould not interfere between you and the rule, on condition that the rule will be ours after you... The \nProphet said, \"If you asked me for this stick, I would not give it to you. I think you are the same \nperson who was shown to me in a dream. And this is Thabit bin Al-Qais who will answer you on my \nbehalf.\" The Prophet (ﷺ) then went away. I asked Ibn `Abbas about the dream Allah's Messenger (ﷺ) had \nmentioned. Ibn `Abbas said, \"Someone told me that the Prophet (ﷺ) said, \"When I was sleeping, I saw in a \ndream that two gold bangles were put in my hands, and that frightened me and made me dislike them. \nThen I was allowed to blow on them, and when I blew at them, both of them flew. Then I interpreted \nthem as two liars who would appear.' One of them was Al-`Ansi who was killed by Fairuz in Yemen \nand the other was Musailima Al-Kadhdbab.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ عُبَيْدَةَ بْنِ نَشِيطٍ ـ وَكَانَ فِي مَوْضِعٍ آخَرَ اسْمُهُ عَبْدُ اللَّهِ ـ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ بَلَغَنَا أَنَّ مُسَيْلِمَةَ الْكَذَّابَ قَدِمَ الْمَدِينَةَ، فَنَزَلَ فِي دَارِ بِنْتِ الْحَارِثِ، وَكَانَ تَحْتَهُ بِنْتُ الْحَارِثِ بْنِ كُرَيْزٍ، وَهْىَ أُمُّ عَبْدِ اللَّهِ بْنِ عَامِرٍ، فَأَتَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، وَهْوَ الَّذِي يُقَالُ لَهُ خَطِيبُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَضِيبٌ، فَوَقَفَ عَلَيْهِ فَكَلَّمَهُ فَقَالَ لَهُ مُسَيْلِمَةُ إِنْ شِئْتَ خَلَّيْتَ بَيْنَنَا وَبَيْنَ الأَمْرِ، ثُمَّ جَعَلْتَهُ لَنَا بَعْدَكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ سَأَلْتَنِي هَذَا الْقَضِيبَ مَا أَعْطَيْتُكَهُ وَإِنِّي لأَرَاكَ الَّذِي أُرِيتُ فِيهِ مَا أُرِيتُ، وَهَذَا ثَابِتُ بْنُ قَيْسٍ وَسَيُجِيبُكَ عَنِّي ‏\"‏‏.‏ فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم‏.‏   قَالَ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَنْ رُؤْيَا، رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي ذَكَرَ فَقَالَ ابْنُ عَبَّاسٍ ذُكِرَ لِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُرِيتُ أَنَّهُ وُضِعَ فِي يَدَىَّ سِوَارَانِ مِنْ ذَهَبٍ، فَفُظِعْتُهُمَا وَكَرِهْتُهُمَا، فَأُذِنَ لِي فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ ‏\"‏‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَحَدُهُمَا الْعَنْسِيُّ الَّذِي قَتَلَهُ فَيْرُوزُ بِالْيَمَنِ، وَالآخَرُ مُسَيْلِمَةُ الْكَذَّابُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4378, 4379In-book reference : Book 64, Hadith 402USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 662   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4380,
    "id": 4380,
    "url": "https://sunnah.com/bukhari:4380",
    "bookNumber": 64,
    "hadithNumber": 403,
    "narrator": "Narrated Hudhaifa:",
    "english": "Al-`Aqib and Saiyid, the rulers of Najran, came to Allah's Messenger (ﷺ) with the intention of doing Lian \none of them said to the other, \"Do not do (this Lian) for, by Allah, if he is a Prophet and we do this \nLian, neither we, nor our offspring after us will be successful.\" Then both of them said (to the Prophet (ﷺ) \n), \"We will give what you should ask but you should send a trustworthy man with us, and do not send \nany person with us but an honest one.\" The Prophet (ﷺ) said, \"I will send an honest man who Is really \ntrustworthy.\" Then every one of the companions of Allah's Messenger (ﷺ) wished to be that one. Then the \nProphet said, \"Get up, O Abu 'Ubaida bin Al-Jarrah.\" When he got up, Allah's Messenger (ﷺ) said, \"This is \nthe Trustworthy man of this (Muslim) nation.\"",
    "arabic": "حَدَّثَنِي عَبَّاسُ بْنُ الْحُسَيْنِ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ بْنِ زُفَرَ، عَنْ حُذَيْفَةَ، قَالَ جَاءَ الْعَاقِبُ وَالسَّيِّدُ صَاحِبَا نَجْرَانَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يُرِيدَانِ أَنْ يُلاَعِنَاهُ، قَالَ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ لاَ تَفْعَلْ، فَوَاللَّهِ لَئِنْ كَانَ نَبِيًّا فَلاَعَنَّا، لاَ نُفْلِحُ نَحْنُ وَلاَ عَقِبُنَا مِنْ بَعْدِنَا‏.‏ قَالاَ إِنَّا نُعْطِيكَ مَا سَأَلْتَنَا، وَابْعَثْ مَعَنَا رَجُلاً أَمِينًا، وَلاَ تَبْعَثْ مَعَنَا إِلاَّ أَمِينًا‏.‏ فَقَالَ ‏\"‏ لأَبْعَثَنَّ مَعَكُمْ رَجُلاً أَمِينًا حَقَّ أَمِينٍ ‏\"‏‏.‏ فَاسْتَشْرَفَ لَهُ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ قُمْ يَا أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ ‏\"‏‏.‏ فَلَمَّا قَامَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا أَمِينُ هَذِهِ الأُمَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4380In-book reference : Book 64, Hadith 403USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 663   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4381,
    "id": 4381,
    "url": "https://sunnah.com/bukhari:4381",
    "bookNumber": 64,
    "hadithNumber": 404,
    "narrator": "Narrated Hudhaifa:",
    "english": "The people of Najran came to the Prophet (ﷺ) and said, \"Send an honest man to us.\" The Prophet (ﷺ) said, \"I \nwill send to you an honest man who is really trustworthy.\" Everyone of the (Muslim) people hoped to \nbe that one. The Prophet (ﷺ) then sent Abu Ubaida bin Al-Jarrah.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، عَنْ صِلَةَ بْنِ زُفَرَ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ جَاءَ أَهْلُ نَجْرَانَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا ابْعَثْ لَنَا رَجُلاً أَمِينًا‏.‏ فَقَالَ ‏\n\"‏ لأَبْعَثَنَّ إِلَيْكُمْ رَجُلاً أَمِينًا حَقَّ أَمِينٍ ‏\"‏‏.‏ فَاسْتَشْرَفَ لَهُ النَّاسُ، فَبَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4381In-book reference : Book 64, Hadith 404USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 664   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4382,
    "id": 4382,
    "url": "https://sunnah.com/bukhari:4382",
    "bookNumber": 64,
    "hadithNumber": 405,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Every nation has an Amin (i.e. the most honest man), and the Amin of this nation \nis Abu 'Ubaida bin Al-Jarrah.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لِكُلِّ أُمَّةٍ أَمِينٌ، وَأَمِينُ هَذِهِ الأُمَّةِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4382In-book reference : Book 64, Hadith 405USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 665   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4383,
    "id": 4383,
    "url": "https://sunnah.com/bukhari:4383",
    "bookNumber": 64,
    "hadithNumber": 406,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said to me, \"If the revenue of Al-Bahrain should come, I will give you so much and so \nmuch,\" repeating \"so much\" thrice. But the revenue of Al-Bahrain did not come till Allah's Messenger (ﷺ) \nhad died. When the revenue came during the rule of Abu Bakr. Abu Bakr ordered an announcer to \nannounce, \"Whoever had any debt or promise due upon the Prophet, should present himself to me (i.e. \nAbu Bakr). I came to Abu Bakr and informed him that the Prophet (ﷺ) had said (to me), \"If the revenue of \nAl-Bahrain should come, I will give you so-much and so much,\" repeating \"so much\" thrice. So Abu \nBakr gave me (in another narration Jaibir said,). I met Abu Bakr after that and asked him (to give me \nwhat the Prophet (ﷺ) had promised me) but he did not give me. I again went to him but he did not give \nme. I again went to him (for the third time) but he did not give me; On that I said to him, \"I came to \nyou but you did not give me, then I came to you and you did not give me, and then again I came to \nyou, but you did not give me; so you should either give me or else you are like a miserly to me, on \nthat, Abu Bakr said, \"Do you say, 'You are like a miserly to me?' There is no worse disease than \nmiserliness.\" Abu Bakr said it thrice and added, \"Whenever I refused to give you, I had the intention \nof giving you.\" (In another narration) Jabir bin `Abdullah said, \"I went to Abu Bakr (and he gave me a \nhandful of money) and told me to count it, I counted and found it five-hundred, and then Abu Bakr \nsaid (to me), \"Take the same amount twice.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، سَمِعَ ابْنُ الْمُنْكَدِرِ، جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ قَدْ جَاءَ مَالُ الْبَحْرَيْنِ لَقَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا ثَلاَثًا ‏\"‏‏.‏ فَلَمْ يَقْدَمْ مَالُ الْبَحْرَيْنِ حَتَّى قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا قَدِمَ عَلَى أَبِي بَكْرٍ أَمَرَ مُنَادِيًا فَنَادَى مَنْ كَانَ لَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم دَيْنٌ أَوْ عِدَةٌ فَلْيَأْتِنِي‏.‏ قَالَ جَابِرٌ فَجِئْتُ أَبَا بَكْرٍ، فَأَخْبَرْتُهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ جَاءَ مَالُ الْبَحْرَيْنِ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا ثَلاَثًا ‏\"‏‏.‏ قَالَ فَأَعْطَانِي‏.‏ قَالَ جَابِرٌ فَلَقِيتُ أَبَا بَكْرٍ بَعْدَ ذَلِكَ فَسَأَلْتُهُ، فَلَمْ يُعْطِنِي، ثُمَّ أَتَيْتُهُ فَلَمْ يُعْطِنِي، ثُمَّ أَتَيْتُهُ الثَّالِثَةَ فَلَمْ يُعْطِنِي، فَقُلْتُ لَهُ قَدْ أَتَيْتُكَ فَلَمْ تُعْطِنِي، ثُمَّ أَتَيْتُكَ فَلَمْ تُعْطِنِي، ثُمَّ أَتَيْتُكَ فَلَمْ تُعْطِنِي، فَإِمَّا أَنْ تُعْطِيَنِي، وَإِمَّا أَنْ تَبْخَلَ عَنِّي‏.‏ فَقَالَ أَقُلْتَ تَبْخَلُ عَنِّي وَأَىُّ دَاءٍ أَدْوَأُ مِنَ الْبُخْلِ ـ قَالَهَا ثَلاَثًا ـ مَا مَنَعْتُكَ مِنْ مَرَّةٍ إِلاَّ وَأَنَا أُرِيدُ أَنْ أُعْطِيَكَ‏.‏ وَعَنْ عَمْرٍو عَنْ مُحَمَّدِ بْنِ عَلِيٍّ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جِئْتُهُ، فَقَالَ لِي أَبُو بَكْرٍ عُدَّهَا‏.‏ فَعَدَدْتُهَا فَوَجَدْتُهَا خَمْسَمِائَةٍ، فَقَالَ خُذْ مِثْلَهَا مَرَّتَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4383In-book reference : Book 64, Hadith 406USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 666   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4384,
    "id": 4384,
    "url": "https://sunnah.com/bukhari:4384",
    "bookNumber": 64,
    "hadithNumber": 407,
    "narrator": "Narrated Abu Musa:",
    "english": "My brother and I came from Yemen (to Medina) and remained for some time, thinking that Ibn Masud \nand his mother belonged to the family of the Prophet (ﷺ) because of their frequent entrance (upon the \nProphet) and their being attached to him.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، وَإِسْحَاقُ بْنُ نَصْرٍ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَدِمْتُ أَنَا وَأَخِي، مِنَ الْيَمَنِ، فَمَكَثْنَا حِينًا مَا نُرَى ابْنَ مَسْعُودٍ وَأُمَّهُ إِلاَّ مِنْ أَهْلِ الْبَيْتِ، مِنْ كَثْرَةِ دُخُولِهِمْ وَلُزُومِهِمْ لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4384In-book reference : Book 64, Hadith 407USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 667   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4385,
    "id": 4385,
    "url": "https://sunnah.com/bukhari:4385",
    "bookNumber": 64,
    "hadithNumber": 408,
    "narrator": "Narrated Zahdam:",
    "english": "When Abu Musa arrived (at Kufa as a governor) he honored this family of Jarm (by paying them a \nvisit). I was sitting near to him, and he was eating chicken as his lunch, and there was a man sitting \namongst the people. Abu Musa invited the man to the lunch, but the latter said, \"I saw chickens \n(eating something (dirty) so I consider them unclean.\" Abu Musa said, \"Come on! I saw the Prophet (ﷺ) \neating it (i.e. chicken).\" The man said \"I have taken an oath that I will not ea (chicken)\" Abu Musa \nsaid.\" Come on! I will tell you about your oath. We, a group of Al-Ash`ariyin people went to the \nProphet and asked him to give us something to ride, but the Prophet (ﷺ) refused. Then we asked him for \nthe second time to give us something to ride, but the Prophet (ﷺ) took an oath that he would not give us \nanything to ride. After a while, some camels of booty were brought to the Prophet (ﷺ) and he ordered that \nfive camels be given to us. When we took those camels we said, \"We have made the Prophet (ﷺ) forget \nhis oath, and we will not be successful after that.\" So I went to the Prophet (ﷺ) and said, \"O Allah' Apostle \n! You took an oath that you would not give us anything to ride, but you have given us.\" He said, \"Yes, \nfor if I take an oath and later I see a better solution than that, I act on the later (and gave the expiation \nof that oaths\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ السَّلاَمِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ زَهْدَمٍ، قَالَ لَمَّا قَدِمَ أَبُو مُوسَى أَكْرَمَ هَذَا الْحَىَّ مِنْ جَرْمٍ، وَإِنَّا لَجُلُوسٌ عِنْدَهُ وَهْوَ يَتَغَدَّى دَجَاجًا، وَفِي الْقَوْمِ رَجُلٌ جَالِسٌ، فَدَعَاهُ إِلَى الْغَدَاءِ، فَقَالَ إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا فَقَذِرْتُهُ‏.‏ فَقَالَ هَلُمَّ، فَإِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُهُ‏.‏ فَقَالَ إِنِّي حَلَفْتُ لاَ آكُلُهُ‏.‏ فَقَالَ هَلُمَّ أُخْبِرْكَ عَنْ يَمِينِكَ، إِنَّا أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم نَفَرٌ مِنَ الأَشْعَرِيِّينَ، فَاسْتَحْمَلْنَاهُ فَأَبَى أَنْ يَحْمِلَنَا فَاسْتَحْمَلْنَاهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا، ثُمَّ لَمْ يَلْبَثِ النَّبِيُّ صلى الله عليه وسلم أَنْ أُتِيَ بِنَهْبِ إِبِلٍ، فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ، فَلَمَّا قَبَضْنَاهَا قُلْنَا تَغَفَّلْنَا النَّبِيَّ صلى الله عليه وسلم يَمِينَهُ، لاَ نُفْلِحُ بَعْدَهَا أَبَدًا فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ حَلَفْتَ أَنْ لاَ تَحْمِلَنَا وَقَدْ حَمَلْتَنَا‏.‏ قَالَ ‏\n\"‏ أَجَلْ، وَلَكِنْ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ مِنْهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4385In-book reference : Book 64, Hadith 408USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 668   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4386,
    "id": 4386,
    "url": "https://sunnah.com/bukhari:4386",
    "bookNumber": 64,
    "hadithNumber": 409,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "The people of Banu Tamim came to Allah's Messenger (ﷺ), and he said, \"Be glad (i.e. have good tidings). O \nBanu Tamim!\" They said, \"As you have given us good tidings then give us (some material things).\" \nOn that the features of Allah's Messenger (ﷺ) changed (i.e. he took it ill). Then some people from Yemen \ncame, and the Prophet (ﷺ) said (to them) \"Accept good tidings as Banu Tamim have not accepted them.\" \nThey said, \"We accept them, O Allah's Messenger (ﷺ)!\"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو صَخْرَةَ، جَامِعُ بْنُ شَدَّادٍ حَدَّثَنَا صَفْوَانُ بْنُ مُحْرِزٍ الْمَازِنِيُّ، حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْنٍ، قَالَ جَاءَتْ بَنُو تَمِيمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبْشِرُوا يَا بَنِي تَمِيمٍ ‏\"‏‏.‏ قَالُوا أَمَّا إِذْ بَشَّرْتَنَا فَأَعْطِنَا‏.‏ فَتَغَيَّرَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَجَاءَ نَاسٌ مِنْ أَهْلِ الْيَمَنِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْبَلُوا الْبُشْرَى إِذْ لَمْ يَقْبَلْهَا بَنُو تَمِيمٍ ‏\"‏‏.‏ قَالُوا قَدْ قَبِلْنَا يَا رَسُولَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4386In-book reference : Book 64, Hadith 409USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 669   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4387,
    "id": 4387,
    "url": "https://sunnah.com/bukhari:4387",
    "bookNumber": 64,
    "hadithNumber": 410,
    "narrator": "Narrated Abu Masud:",
    "english": "The Prophet (ﷺ) beckoned with his hand towards Yemen and said, \"Belief is there.\" The harshness and \nmercilessness are the qualities of those farmers etc, who are busy with their camels and pay no \nattention to the religion (is towards the east) from where the side of the head of Satan will appear; \nthose are the tribes of Rabi`a and Mudar.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الإِيمَانُ هَا هُنَا ‏\"‏‏.‏ وَأَشَارَ بِيَدِهِ إِلَى الْيَمَنِ ‏\"‏ وَالْجَفَاءُ وَغِلَظُ الْقُلُوبِ فِي الْفَدَّادِينَ، عِنْدَ أُصُولِ أَذْنَابِ الإِبِلِ مِنْ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4387In-book reference : Book 64, Hadith 410USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 670   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4388,
    "id": 4388,
    "url": "https://sunnah.com/bukhari:4388",
    "bookNumber": 64,
    "hadithNumber": 411,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The people of Yemen have come to you and they are more gentle and soft-hearted. \nBelief is Yemenite and Wisdom is Yemenite, while pride and haughtiness are the qualities of the \nowners of camels (i.e. bedouins). Calmness and solemnity are the characters of the owners of sheep.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَتَاكُمْ أَهْلُ الْيَمَنِ، هُمْ أَرَقُّ أَفْئِدَةً وَأَلْيَنُ قُلُوبًا، الإِيمَانُ يَمَانٍ وَالْحِكْمَةُ يَمَانِيَةٌ، وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَصْحَابِ الإِبِلِ، وَالسَّكِينَةُ وَالْوَقَارُ فِي أَهْلِ الْغَنَمِ ‏\"‏‏.‏   وَقَالَ غُنْدَرٌ عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4388In-book reference : Book 64, Hadith 411USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 671   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4389,
    "id": 4389,
    "url": "https://sunnah.com/bukhari:4389",
    "bookNumber": 64,
    "hadithNumber": 412,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Belief is Yemenite while afflictions appear from there (the east) from where the \nside of the head of Satan will appear.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الإِيمَانُ يَمَانٍ، وَالْفِتْنَةُ هَا هُنَا، هَا هُنَا يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4389In-book reference : Book 64, Hadith 412USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 672   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4390,
    "id": 4390,
    "url": "https://sunnah.com/bukhari:4390",
    "bookNumber": 64,
    "hadithNumber": 413,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The people of Yemen have come to you, and they are more soft hearted and gentle \nhearted people. The capacity for understanding religion is Yemenite and Wisdom is Yemenite.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَتَاكُمْ أَهْلُ الْيَمَنِ، أَضْعَفُ قُلُوبًا وَأَرَقُّ أَفْئِدَةً، الْفِقْهُ يَمَانٍ، وَالْحِكْمَةُ يَمَانِيَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4390In-book reference : Book 64, Hadith 413USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 673   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4391,
    "id": 4391,
    "url": "https://sunnah.com/bukhari:4391",
    "bookNumber": 64,
    "hadithNumber": 414,
    "narrator": "Narrated Alqama:",
    "english": "We were sitting with Ibn Masud when Khabbab came and said, \"O Abu `Abdur-Rahman! Can these \nyoung fellows recite Qur'an as you do?\" Ibn Mas`ud said, \"If you wish I can order one of them to \nrecite (Qur'an) for you .\" Khabbab replied, \"Yes. \"Ibn Mas`ud said, \"Recite, O 'Alqama!\" On that, \nZaid bin Hudair, the brother of Ziyad bin Hudair said, (to Ibn Mas`ud), \"Why have you ordered \n'Alqama to recite though he does not recite better than we?\" Ibn Mas`ud said, \"If you like, I would tell \nyou what the Prophet (ﷺ) said about your nation and his (i.e. 'Alqama's) nation.\" So I recited fifty Verses \nfrom Sura-Maryam. `Abdullah (bin Mas`ud) said to Khabbab, \"What do you think (about 'Alqama's \nrecitation)?\" Khabbab said, \"He has recited well.\" `Abdullah said, \"Whatever I recite, 'Alqama \nrecites.\" Then `Abdullah turned towards Khabbab and saw that he was wearing a gold ring, \nwhereupon he said, \"Hasn't the time for its throwing away come yet?\" Khabbab said, \"You will not \nsee me wearing it after today,\" and he throw it away.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنَّا جُلُوسًا مَعَ ابْنِ مَسْعُودٍ، فَجَاءَ خَبَّابٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَيَسْتَطِيعُ هَؤُلاَءِ الشَّبَابُ أَنْ يَقْرَءُوا كَمَا تَقْرَأُ قَالَ أَمَا إِنَّكَ لَوْ شِئْتَ أَمَرْتُ بَعْضَهُمْ يَقْرَأُ عَلَيْكَ قَالَ أَجَلْ‏.‏ قَالَ اقْرَأْ يَا عَلْقَمَةُ‏.‏ فَقَالَ زَيْدُ بْنُ حُدَيْرٍ أَخُو زِيَادِ بْنِ حُدَيْرٍ أَتَأْمُرُ عَلْقَمَةَ أَنْ يَقْرَأَ وَلَيْسَ بِأَقْرَئِنَا قَالَ أَمَا إِنَّكَ إِنْ شِئْتَ أَخْبَرْتُكَ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فِي قَوْمِكَ وَقَوْمِهِ‏.‏ فَقَرَأْتُ خَمْسِينَ آيَةً مِنْ سُورَةِ مَرْيَمَ، فَقَالَ عَبْدُ اللَّهِ كَيْفَ تَرَى قَالَ قَدْ أَحْسَنَ‏.‏ قَالَ عَبْدُ اللَّهِ مَا أَقْرَأُ شَيْئًا إِلاَّ وَهُوَ يَقْرَؤُهُ، ثُمَّ الْتَفَتَ إِلَى خَبَّابٍ وَعَلَيْهِ خَاتَمٌ مِنْ ذَهَبٍ فَقَالَ أَلَمْ يَأْنِ لِهَذَا الْخَاتَمِ أَنْ يُلْقَى قَالَ أَمَا إِنَّكَ لَنْ تَرَاهُ عَلَىَّ بَعْدَ الْيَوْمِ، فَأَلْقَاهُ‏.‏ رَوَاهُ غُنْدَرٌ عَنْ شُعْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4391In-book reference : Book 64, Hadith 414USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 674   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4392,
    "id": 4392,
    "url": "https://sunnah.com/bukhari:4392",
    "bookNumber": 64,
    "hadithNumber": 415,
    "narrator": "Narrated Abu Huraira:",
    "english": "Tufail bin `Amr came to the Prophet (ﷺ) and said, \"The Daus (nation) have perished as they disobeyed \nand refused to accept Islam. So invoke Allah against them.\" But the Prophet (ﷺ) said, \"O Allah! Give \nguidance to the Daus (tribe) and bring them (to Islam)!\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ الطُّفَيْلُ بْنُ عَمْرٍو إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ دَوْسًا قَدْ هَلَكَتْ، عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهِمْ‏.‏ فَقَالَ ‏\n\"‏ اللَّهُمَّ اهْدِ دَوْسًا وَأْتِ بِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4392In-book reference : Book 64, Hadith 415USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 675   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4393,
    "id": 4393,
    "url": "https://sunnah.com/bukhari:4393",
    "bookNumber": 64,
    "hadithNumber": 416,
    "narrator": "Narrated Abu Huraira:",
    "english": "When I came to the Prophet (ﷺ) said on my way, \"O what a long tedious tiresome night; nevertheless, it \nhas rescued me from the place of Heathenism.\" A slave of mine ran away on the way. When I reached \nthe Prophet (ﷺ) I gave him the oath of allegiance (for Islam), and while I was sitting with him, suddenly \nthe slave appeared. The Prophet (ﷺ) said to me. \"O Abu Huraira! Here is your slave,\" I said, \"He (i.e. the \nslave) is (free) for Allah's Sake,\" and manumitted him.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم قُلْتُ فِي الطَّرِيقِ:\n يَا لَيْلَةً مِنْ طُولِهَا وَعَنَائِهَا     عَلَى أَنَّهَا مِنْ دَارَةِ الْكُفْرِ نَجَّتِ\nوَأَبَقَ غُلاَمٌ لِي فِي الطَّرِيقِ، فَلَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَبَايَعْتُهُ، فَبَيْنَا أَنَا عِنْدَهُ إِذْ طَلَعَ الْغُلاَمُ، فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا أَبَا هُرَيْرَةَ هَذَا غُلاَمُكَ ‏\"‏‏.‏ فَقُلْتُ هُوَ لِوَجْهِ اللَّهِ تَعَالَى‏.‏ فَأَعْتَقْتُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4393In-book reference : Book 64, Hadith 416USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 676   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4394,
    "id": 4394,
    "url": "https://sunnah.com/bukhari:4394",
    "bookNumber": 64,
    "hadithNumber": 417,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "We came to `Umar in a delegation (during his rule). He started calling the men one by one, calling \neach by his name. (As he did not call me early) I said to him. \"Don't you know me, O chief of the \nBelievers?\" He said, \"Yes, you embraced Islam when they (i.e. your people) disbelieved; you have \ncome (to the Truth) when they ran away; you fulfilled your promises when they broke theirs; and you \nrecognized it (i.e. the Truth of Islam) when they denied it.\" On that, `Adi said, \"I therefore don't care.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ أَتَيْنَا عُمَرَ فِي وَفْدٍ، فَجَعَلَ يَدْعُو رَجُلاً رَجُلاً وَيُسَمِّيهِمْ فَقُلْتُ أَمَا تَعْرِفُنِي يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ بَلَى، أَسْلَمْتَ إِذْ كَفَرُوا، وَأَقْبَلْتَ إِذْ أَدْبَرُوا، وَوَفَيْتَ إِذْ غَدَرُوا، وَعَرَفْتَ إِذْ أَنْكَرُوا‏.‏ فَقَالَ عَدِيٌّ فَلاَ أُبَالِي إِذًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4394In-book reference : Book 64, Hadith 417USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 677   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4395,
    "id": 4395,
    "url": "https://sunnah.com/bukhari:4395",
    "bookNumber": 64,
    "hadithNumber": 418,
    "narrator": "Narrated `Aisha:",
    "english": "We went out with Allah's Messenger (ﷺ) during Hajjat-ul-Wada` and we assumed the Ihram for `Umra. Then \nAllah's Messenger (ﷺ) said to us, \"Whoever has got the Hadi should assume the Ihram for Hajj and `Umra \nand should not finish his Ihram till he has performed both (`Umra and Hajj).\" I arrived at Mecca along \nwith him (i.e. the Prophet (ﷺ) ) while I was menstruating, so I did not perform the Tawaf around the Ka`ba \nor between Safa and Marwa. I informed Allah's Messenger (ﷺ) about that and he said, \"Undo your braids and \ncomb your hair, and then assume the lhram for Hajj and leave the `Umra.\" I did so, and when we \nperformed and finished the Hajj, Allah's Messenger (ﷺ)s sent me to at-Tan`im along with (my brother) \n`Abdur-Rahman bin Abu Bakr As-Siddiq, to perform the `Umra. The Prophet (ﷺ) said, \"This `Umra is in \nlieu of your missed `Umra.\" Those who had assumed the lhram for `Umra, performed the Tawaf \naround the Ka`ba and between Safa and Marwa, and then finished their Ihram, and on their return \nfrom Mina, they performed another Tawaf (around the Ka`ba and between Safa and Marwa), but those \nwho combined their Hajj and `Umra, performed only one Tawaf (between Safa and Marwa) (for \nboth).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَأَهْلَلْنَا بِعُمْرَةٍ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ الْعُمْرَةِ، ثُمَّ لاَ يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏‏.‏ فَقَدِمْتُ مَعَهُ مَكَّةَ وَأَنَا حَائِضٌ، وَلَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْقُضِي رَأْسَكِ، وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ ‏\"‏‏.‏ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ ‏\"‏ هَذِهِ مَكَانَ عُمْرَتِكِ ‏\"‏‏.‏ قَالَتْ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلُّوا، ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى، وَأَمَّا الَّذِينَ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4395In-book reference : Book 64, Hadith 418USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 678   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4396,
    "id": 4396,
    "url": "https://sunnah.com/bukhari:4396",
    "bookNumber": 64,
    "hadithNumber": 419,
    "narrator": "Narrated Ibn Juraij:",
    "english": "`Ata' said, \"Ibn `Abbas said, 'If he (i.e. the one intending to perform `Umra) has performed the Tawaf \naround the Ka`ba, his Ihram is considered to have finished.' said, 'What proof does Ibn `Abbas has as \nto this saying?\" `Ata' said, \"(The proof is taken) from the Statement of Allah:-- \"And afterwards they \nare brought For sacrifice unto Ancient House (Ka`ba at Mecca)\" (22.33) and from the order of the \nProphet to his companions to finish their Ihram during Hajjat-ul-Wada`.\" I said (to `Ata'), \"That (i.e. \nfinishing the Ihram) was after coming form `Arafat.\" `Ata' said, \"Ibn `Abbas used to allow it before \ngoing to `Arafat (after finishing the `Umra) and after coming from it (i.e. after performing the Hajj).",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، إِذَا طَافَ بِالْبَيْتِ فَقَدْ حَلَّ‏.‏ فَقُلْتُ مِنْ أَيْنَ قَالَ هَذَا ابْنُ عَبَّاسٍ قَالَ مِنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ‏}‏ وَمِنْ أَمْرِ النَّبِيِّ صلى الله عليه وسلم أَصْحَابَهُ أَنْ يَحِلُّوا فِي حَجَّةِ الْوَدَاعِ‏.‏ قُلْتُ إِنَّمَا كَانَ ذَلِكَ بَعْدَ الْمُعَرَّفِ‏.‏ قَالَ كَانَ ابْنُ عَبَّاسٍ يَرَاهُ قَبْلُ وَبَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4396In-book reference : Book 64, Hadith 419USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 679   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4397,
    "id": 4397,
    "url": "https://sunnah.com/bukhari:4397",
    "bookNumber": 64,
    "hadithNumber": 420,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "I came to the Prophet (ﷺ) at a place called Al-Batha'. The Prophet (ﷺ) said, \"Did you assume the Ihram for \nHajj?\" I said, \"Yes,\" He said, \"How did you express your intention (for performing Hajj)? \" I said, \n\"Labbaik (i.e. I am ready) to assume the Ihram with the same intention as that of Allah's Messenger (ﷺ).\" The \nProphet said, \"Perform the Tawaf around the Ka`ba and between Safa and Marwa, and then finish \nyour Ihram.\" So I performed the Tawaf around the Ka`ba and between Safa and Marwa and then I \ncame to a woman from the tribe of Qais who removed the lice from my head.",
    "arabic": "حَدَّثَنِي بَيَانٌ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ طَارِقًا، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ كَيْفَ أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، وَأَتَيْتُ امْرَأَةً مِنْ قَيْسٍ فَفَلَتْ رَأْسِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4397In-book reference : Book 64, Hadith 420USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 680   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4398,
    "id": 4398,
    "url": "https://sunnah.com/bukhari:4398",
    "bookNumber": 64,
    "hadithNumber": 421,
    "narrator": "Narrated Hafsa:",
    "english": "(the wife of the Prophet) The Prophet (ﷺ) ordered all his wives to finish their Ihram during the year of \nHajjat-ul-Wada`. On that, I asked the Prophet (ﷺ) \"What stops you from finishing your lhram?\" He said, \n\"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram unless I have \nslaughtered my Hadi.\"",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، أَخْبَرَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُ أَنَّ حَفْصَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ أَزْوَاجَهُ أَنْ يَحْلِلْنَ عَامَ حَجَّةِ الْوَدَاعِ، فَقَالَتْ حَفْصَةُ فَمَا يَمْنَعُكَ فَقَالَ ‏\n\"‏ لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي، فَلَسْتُ أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4398In-book reference : Book 64, Hadith 421USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 681   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4399,
    "id": 4399,
    "url": "https://sunnah.com/bukhari:4399",
    "bookNumber": 64,
    "hadithNumber": 422,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A woman from the tribe of Khath'am asked for the verdict of Allah's Messenger (ﷺ) (regarding something) \nduring Hajjat-ul-Wada` while Al-Fadl bin `Abbas was the companion-rider behind Allah's Messenger (ﷺ). \nShe asked, \"Allah's ordained obligation (i.e. compulsory Hajj) enjoined on His slaves has become due \non my old father who cannot sit firmly on the riding animal. Will it be sufficient if I perform the Hajj \non his behalf?\" He said, \"Yes.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ حَدَّثَنِي شُعَيْبٌ، عَنِ الزُّهْرِيِّ، وَقَالَ، مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً، مِنْ خَثْعَمَ اسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَالْفَضْلُ بْنُ عَبَّاسٍ رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ، فَهَلْ يَقْضِي أَنْ أَحُجَّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4399In-book reference : Book 64, Hadith 422USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 682   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4400,
    "id": 4400,
    "url": "https://sunnah.com/bukhari:4400",
    "bookNumber": 64,
    "hadithNumber": 423,
    "narrator": "Narrated (Abdullah) bin `Umar:",
    "english": "The Prophet (ﷺ) arrived (at Mecca) in the year of the Conquest (of Mecca) while Usama was riding \nbehind him on (his she-camel)'. Al-Qaswa.' Bilal and `Uthman bin Talha were accompanying him. \nWhen he made his she-camel kneel down near the Ka`ba, he said to `Uthman, \"Get us the key (of the \nKa`ba). He brought the key to him and opened the gate (of the Ka`ba), for him. The Prophet, Usama, \nBilal and `Uthman (bin Talha) entered the Ka`ba and then closed the gate behind them (from inside). \nThe Prophet (ﷺ) stayed there for a long period and then came out. The people rushed to get in, but I went \nin before them and found Bilal standing behind the gate, and I said to him, \"Where did the Prophet (ﷺ) \npray?\" He said, \"He prayed between those two front pillars.\" The Ka`ba was built on six pillars, \narranged in two rows, and he prayed between the two pillars of the front row leaving the gate of the \nKa`ba at his back and facing (in prayer) the wall which faces one when one enters the Ka`ba. Between \nhim and that wall (was the distance of about three cubits). But I forgot to ask Bilal about the number \nof rak`at the Prophet (ﷺ) had prayed. There was a red piece of marble at the place where he (i.e. the \nProphet) had offered the prayer.",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، حَدَّثَنَا فُلَيْحٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَقْبَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ وَهْوَ مُرْدِفٌ أُسَامَةَ عَلَى الْقَصْوَاءِ‏.‏ وَمَعَهُ بِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ حَتَّى أَنَاخَ عِنْدَ الْبَيْتِ، ثُمَّ قَالَ لِعُثْمَانَ ‏\n\"‏ ائْتِنَا بِالْمِفْتَاحِ ‏\"‏، فَجَاءَهُ بِالْمِفْتَاحِ فَفَتَحَ لَهُ الْبَابَ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم وَأُسَامَةُ وَبِلاَلٌ وَعُثْمَانُ، ثُمَّ أَغْلَقُوا عَلَيْهِمِ الْبَابَ، فَمَكَثَ نَهَارًا طَوِيلاً ثُمَّ خَرَجَ، وَابْتَدَرَ النَّاسُ الدُّخُولَ، فَسَبَقْتُهُمْ فَوَجَدْتُ بِلاَلاً قَائِمًا مِنْ وَرَاءِ الْبَابِ فَقُلْتُ لَهُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ صَلَّى بَيْنَ ذَيْنِكَ الْعَمُودَيْنِ الْمُقَدَّمَيْنِ‏.‏ وَكَانَ الْبَيْتُ عَلَى سِتَّةِ أَعْمِدَةٍ سَطْرَيْنِ، صَلَّى بَيْنَ الْعَمُودَيْنِ مِنَ السَّطْرِ الْمُقَدَّمِ، وَجَعَلَ باب الْبَيْتِ خَلْفَ ظَهْرِهِ، وَاسْتَقْبَلَ بِوَجْهِهِ الَّذِي يَسْتَقْبِلُكَ حِينَ تَلِجُ الْبَيْتَ بَيْنَهُ وَبَيْنَ الْجِدَارِ، قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى وَعِنْدَ الْمَكَانِ الَّذِي صَلَّى فِيهِ مَرْمَرَةٌ حَمْرَاءُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4400In-book reference : Book 64, Hadith 423USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 683   (deprecated numbering scheme)"
  }
]