[
  {
    "hadithGlobalNumber": 5401,
    "id": 5401,
    "url": "https://sunnah.com/bukhari:5401",
    "bookNumber": 70,
    "hadithNumber": 29,
    "narrator": "Narrated 'Urban bin Malik:",
    "english": "who attended the Badr battle and was from the Ansar, that he came to the Prophet (ﷺ) and said, \"O Allah's \nApostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the \nvalley which is between me and my people, flows with water, and then I cannot go to their mosque to \nlead them in the prayer. O Allah's Messenger (ﷺ)! I wish that you could come and pray in my house so that I \nmay take it as a praying place. The Prophet (ﷺ) said, \"Allah willing, I will do that.\" The next morning, \nsoon after the sun had risen, Allah's Messenger (ﷺ) came with Abu Bakr. The Prophet (ﷺ) asked for the \npermission to enter and I admitted him. The Prophet (ﷺ) had not sat till he had entered the house and said \nto me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he \nstood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with \nTaslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large \nnumber of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin \nAd-Dukhshun?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The \nProphet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped \nbut Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have \nalways seen him mixing with hypocrites and giving them advice.\" The Prophet (ﷺ) said, \"Allah has \nforbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, \nseeking Allah's pleasure. \"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا مِنَ الأَنْصَارِ ـ أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَنْكَرْتُ بَصَرِي وَأَنَا أُصَلِّي لِقَوْمِي، فَإِذَا كَانَتِ الأَمْطَارُ سَالَ الْوَادِي الَّذِي بَيْنِي وَبَيْنَهُمْ، لَمْ أَسْتَطِعْ أَنْ آتِيَ مَسْجِدَهُمْ فَأُصَلِّيَ لَهُمْ، فَوَدِدْتُ يَا رَسُولَ اللَّهِ أَنَّكَ تَأْتِي فَتُصَلِّي فِي بَيْتِي، فَأَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ ‏\"‏ سَأَفْعَلُ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ عِتْبَانُ فَغَدَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ حِينَ ارْتَفَعَ النَّهَارُ، فَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى دَخَلَ الْبَيْتَ، ثُمَّ قَالَ لِي ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَكَبَّرَ، فَصَفَفْنَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَحَبَسْنَاهُ عَلَى خَزِيرٍ صَنَعْنَاهُ، فَثَابَ فِي الْبَيْتِ رِجَالٌ مِنْ أَهْلِ الدَّارِ ذَوُو عَدَدٍ فَاجْتَمَعُوا، فَقَالَ قَائِلٌ مِنْهُمْ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ بَعْضُهُمْ ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ، أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يُرِيدُ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ قُلْنَا فَإِنَّا نَرَى وَجْهَهُ وَنَصِيحَتَهُ إِلَى الْمُنَافِقِينَ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ ثُمَّ سَأَلْتُ الْحُصَيْنَ بْنَ مُحَمَّدٍ الأَنْصَارِيَّ أَحَدَ بَنِي سَالِمٍ وَكَانَ مِنْ سَرَاتِهِمْ عَنْ حَدِيثِ مَحْمُودٍ فَصَدَّقَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5401In-book reference : Book 70, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 313   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5402,
    "id": 5402,
    "url": "https://sunnah.com/bukhari:5402",
    "bookNumber": 70,
    "hadithNumber": 30,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "My aunt presented (roasted) mastigures, Iqt and milk to the Prophet (ﷺ) . The mastigures were put on his \ndining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet (ﷺ) drank the \nmilk and ate the Iqt only.",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَهْدَتْ خَالَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم ضِبَابًا وَأَقِطًا وَلَبَنًا، فَوُضِعَ الضَّبُّ عَلَى مَائِدَتِهِ، فَلَوْ كَانَ حَرَامًا لَمْ يُوضَعْ وَشَرِبَ اللَّبَنَ، وَأَكَلَ الأَقِطَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5402In-book reference : Book 70, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 314   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5403,
    "id": 5403,
    "url": "https://sunnah.com/bukhari:5403",
    "bookNumber": 70,
    "hadithNumber": 31,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "We used to be happy on Fridays, for there was an old lady who used to pull out the roots of Silq and \nput it in a cooking pot with some barley. When we had finished the prayer, we would visit her and she \nwould present that dish before us. So we used to be happy on Fridays because of that, and we never \nused to take our meals or have a mid-day nap except after the Friday prayer. By Allah, that meal \ncontained no fat.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ إِنْ كُنَّا لَنَفْرَحُ بِيَوْمِ الْجُمُعَةِ، كَانَتْ لَنَا عَجُوزٌ تَأْخُذُ أُصُولَ السِّلْقِ، فَتَجْعَلُهُ فِي قِدْرٍ لَهَا، فَتَجْعَلُ فِيهِ حَبَّاتٍ مِنْ شَعِيرٍ، إِذَا صَلَّيْنَا زُرْنَاهَا فَقَرَّبَتْهُ إِلَيْنَا، وَكُنَّا نَفْرَحُ بِيَوْمِ الْجُمُعَةِ مِنْ أَجْلِ ذَلِكَ، وَمَا كُنَّا نَتَغَدَّى وَلاَ نَقِيلُ إِلاَّ بَعْدَ الْجُمُعَةِ، وَاللَّهِ مَا فِيهِ شَحْمٌ وَلاَ وَدَكٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5403In-book reference : Book 70, Hadith 31USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 315   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5404,
    "id": 5404,
    "url": "https://sunnah.com/bukhari:5404",
    "bookNumber": 70,
    "hadithNumber": 32,
    "narrator": "Narrated Ibn 'Abbas:",
    "english": "The Prophet (ﷺ) ate of the meat of a shoulder (by cutting the meat with \n     his teeth), and then got up and offered the prayer without performing \n     the ablution anew.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ تَعَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَتِفًا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5404In-book reference : Book 70, Hadith 32USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 316   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5405,
    "id": 5405,
    "url": "https://sunnah.com/bukhari:5405",
    "bookNumber": 70,
    "hadithNumber": 33,
    "narrator": "Narrated Ibn 'Abbas:",
    "english": "The Prophet (ﷺ) took out a bone \n     with meat on it from a cooking pot and ate of it, and then offered the\n     prayer without performing ablution anew.",
    "arabic": "وَعَنْ أَيُّوبَ، وَعَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْتَشَلَ النَّبِيُّ صلى الله عليه وسلم عَرْقًا مِنْ قِدْرٍ فَأَكَلَ، ثُمَّ صَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5405In-book reference : Book 70, Hadith 33USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 316   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5406,
    "id": 5406,
    "url": "https://sunnah.com/bukhari:5406",
    "bookNumber": 70,
    "hadithNumber": 34,
    "narrator": "Narrated Abu Qatada:",
    "english": "We went out towards Mecca with the Prophet.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا أَبُو حَازِمٍ الْمَدَنِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَحْوَ مَكَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5406In-book reference : Book 70, Hadith 34USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 317   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5407,
    "id": 5407,
    "url": "https://sunnah.com/bukhari:5407",
    "bookNumber": 70,
    "hadithNumber": 35,
    "narrator": "Narrated Abu Qatada:",
    "english": "Once, while I was sitting with the companions of the Prophet (ﷺ) at a station on the road to Mecca and \nAllah's Messenger (ﷺ) was stationing ahead of us and all the people were assuming Ihram while I was not. \nMy companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the \nonager but they wished that I would see it Suddenly I looked and saw the onager Then I headed \ntowards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my \ncompanions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in \nany way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the \nonager and wounded it Then I brought it when it had dyed. My companions started eating of its \n(cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a \nstate of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's \nApostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that \nforeleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ السَّلَمِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ يَوْمًا جَالِسًا مَعَ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي مَنْزِلٍ فِي طَرِيقِ مَكَّةَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَازِلٌ أَمَامَنَا، وَالْقَوْمُ مُحْرِمُونَ وَأَنَا غَيْرُ مُحْرِمٍ، فَأَبْصَرُوا حِمَارًا وَحْشِيًّا وَأَنَا مَشْغُولٌ أَخْصِفُ نَعْلِي، فَلَمْ يُؤْذِنُونِي لَهُ، وَأَحَبُّوا لَوْ أَنِّي أَبْصَرْتُهُ، فَالْتَفَتُّ فَأَبْصَرْتُهُ فَقُمْتُ إِلَى الْفَرَسِ فَأَسْرَجْتُهُ‏.‏ ثُمَّ رَكِبْتُ وَنَسِيتُ السَّوْطَ وَالرُّمْحَ فَقُلْتُ لَهُمْ نَاوِلُونِي السَّوْطَ وَالرُّمْحَ‏.‏ فَقَالُوا لاَ وَاللَّهِ لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ‏.‏ فَغَضِبْتُ فَنَزَلْتُ فَأَخَذْتُهُمَا، ثُمَّ رَكِبْتُ فَشَدَدْتُ عَلَى الْحِمَارِ فَعَقَرْتُهُ، ثُمَّ جِئْتُ بِهِ وَقَدْ مَاتَ فَوَقَعُوا فِيهِ يَأْكُلُونَهُ، ثُمَّ إِنَّهُمْ شَكُّوا فِي أَكْلِهِمْ إِيَّاهُ وَهُمْ حُرُمٌ، فَرُحْنَا وَخَبَأْتُ الْعَضُدَ مَعِي، فَأَدْرَكْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَنَاوَلْتُهُ الْعَضُدَ فَأَكَلَهَا حَتَّى تَعَرَّقَهَا، وَهْوَ مُحْرِمٌ‏.‏ قَالَ ابْنُ جَعْفَرٍ وَحَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5407In-book reference : Book 70, Hadith 35USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 318   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5408,
    "id": 5408,
    "url": "https://sunnah.com/bukhari:5408",
    "bookNumber": 70,
    "hadithNumber": 36,
    "narrator": "Narrated `Amr bin Umaiyya:",
    "english": "that he saw the Prophet (ﷺ) holding a shoulder piece of mutton in his hand and cutting part of it with a \nknife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with \nwhich he was cutting it, and then stood for prayer without performing ablution again.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5408In-book reference : Book 70, Hadith 36USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 319   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5409,
    "id": 5409,
    "url": "https://sunnah.com/bukhari:5409",
    "bookNumber": 70,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) never criticized any food (he was invited to) but he used to eat if he liked the food, and \nleave it if he disliked it.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِنْ كَرِهَهُ تَرَكَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5409In-book reference : Book 70, Hadith 37USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 320   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5410,
    "id": 5410,
    "url": "https://sunnah.com/bukhari:5410",
    "bookNumber": 70,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Hazim:",
    "english": "that he asked Sahl, \"Did you use white flour during the lifetime of the Prophet (ﷺ) ?\" Sahl replied, \"No. \nHazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of \nthe barley).",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، أَنَّهُ سَأَلَ سَهْلاً هَلْ رَأَيْتُمْ فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم النَّقِيَّ قَالَ لاَ‏.‏ فَقُلْتُ فَهَلْ كُنْتُمْ تَنْخُلُونَ الشَّعِيرَ قَالَ لاَ وَلَكِنْ كُنَّا نَنْفُخُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5410In-book reference : Book 70, Hadith 38USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 321   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5411,
    "id": 5411,
    "url": "https://sunnah.com/bukhari:5411",
    "bookNumber": 70,
    "hadithNumber": 39,
    "narrator": "Narrated Abu Huraira:",
    "english": "Once the Prophet (ﷺ) distributed dates among his companions and gave each one seven dates. He gave me \nseven dates too, one of which was dry and hard, but none of the other dates was more liked by me \nthan that one, for it prolonged my chewing it.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بَيْنَ أَصْحَابِهِ تَمْرًا، فَأَعْطَى كُلَّ إِنْسَانٍ سَبْعَ تَمَرَاتٍ، فَأَعْطَانِي سَبْعَ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ، فَلَمْ يَكُنْ فِيهِنَّ تَمْرَةٌ أَعْجَبَ إِلَىَّ مِنْهَا، شَدَّتْ فِي مَضَاغِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5411In-book reference : Book 70, Hadith 39USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 322   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5412,
    "id": 5412,
    "url": "https://sunnah.com/bukhari:5412",
    "bookNumber": 70,
    "hadithNumber": 40,
    "narrator": "Narrated Sa`d:",
    "english": "I was one of (the first) seven (who had embraced Islam) with Allah's Messenger (ﷺ) and we had nothing to \neat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of \nsheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts \nwould be in vain (if I learn Islam anew from them).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ سَعْدٍ، قَالَ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ النَّبِيِّ صلى الله عليه وسلم مَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ ـ أَوِ الْحَبَلَةِ ـ حَتَّى يَضَعَ أَحَدُنَا مَا تَضَعُ الشَّاةُ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خَسِرْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5412In-book reference : Book 70, Hadith 40USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 323   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5413,
    "id": 5413,
    "url": "https://sunnah.com/bukhari:5413",
    "bookNumber": 70,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Hazim:",
    "english": "I asked Sahl bin Sa`d, \"Did Allah's Messenger (ﷺ) ever eat white flour?\" Sahl said, \"Allah's Messenger (ﷺ) never \nsaw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the \npeople have (use) sieves during the lifetime of Allah's Messenger (ﷺ)?\" Sahl said, \"Allah's Messenger (ﷺ) never saw \n(used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could \nyou eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk \nflew away, we used to prepare the dough (bake) and eat it.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، قَالَ سَأَلْتُ سَهْلَ بْنَ سَعْدٍ فَقُلْتُ هَلْ أَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ فَقَالَ سَهْلٌ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ‏.‏ قَالَ فَقُلْتُ هَلْ كَانَتْ لَكُمْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنَاخِلُ قَالَ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مُنْخُلاً مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ‏.‏ قَالَ قُلْتُ كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ قَالَ كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ، فَيَطِيرُ مَا طَارَ وَمَا بَقِيَ ثَرَّيْنَاهُ فَأَكَلْنَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5413In-book reference : Book 70, Hadith 41USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 324   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5414,
    "id": 5414,
    "url": "https://sunnah.com/bukhari:5414",
    "bookNumber": 70,
    "hadithNumber": 42,
    "narrator": "Narrated Abu Huraira:",
    "english": "that he passed by a group of people in front of whom there was a roasted sheep. They invited him but \nhe refused to eat and said, \"Allah's Messenger (ﷺ) left this world without satisfying his hunger even with \nbarley bread.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ مَرَّ بِقَوْمٍ بَيْنَ أَيْدِيهِمْ شَاةٌ مَصْلِيَّةٌ، فَدَعَوْهُ فَأَبَى أَنْ يَأْكُلَ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الدُّنْيَا وَلَمْ يَشْبَعْ مِنَ الْخُبْزِ الشَّعِيرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5414In-book reference : Book 70, Hadith 42USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 325   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5415,
    "id": 5415,
    "url": "https://sunnah.com/bukhari:5415",
    "bookNumber": 70,
    "hadithNumber": 43,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked \nbread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada \nsaid, \"On leather dining sheets.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنِي أَبِي، عَنْ يُونُسَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ، وَلاَ فِي سُكْرُجَةٍ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ‏.‏ قُلْتُ لِقَتَادَةَ عَلَى مَا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5415In-book reference : Book 70, Hadith 43USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 326   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5416,
    "id": 5416,
    "url": "https://sunnah.com/bukhari:5416",
    "bookNumber": 70,
    "hadithNumber": 44,
    "narrator": "Narrated `Aisha:",
    "english": "The family of Muhammad had not eaten wheat bread to their satisfaction for three consecutive days \nsince his arrival at Medina till he died.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ الْبُرِّ ثَلاَثَ لَيَالٍ تِبَاعًا، حَتَّى قُبِضَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5416In-book reference : Book 70, Hadith 44USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 327   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5417,
    "id": 5417,
    "url": "https://sunnah.com/bukhari:5417",
    "bookNumber": 70,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) that whenever one of her relatives died, the women assembled and then \ndispersed (returned to their houses) except her relatives and close friends. She would order that a pot \nof Talbina be cooked. Then Tharid (a dish prepared from meat and bread) would be prepared and the \nTalbina would be poured on it. `Aisha would say (to the women),\"Eat of it, for I heard Allah's Messenger (ﷺ) \nsaying, 'The Talbina soothes the heart of the patient and relieves him from some of his sadness.' \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ، ثُمَّ تَفَرَّقْنَ، إِلاَّ أَهْلَهَا وَخَاصَّتَهَا، أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ، ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ، تَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5417In-book reference : Book 70, Hadith 45USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 328   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5418,
    "id": 5418,
    "url": "https://sunnah.com/bukhari:5418",
    "bookNumber": 70,
    "hadithNumber": 46,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"Many men reached perfection but none among the women reached perfection \nexcept Mary, the daughter of ' `Imran, and Asia, Pharoah's wife. And the superiority of `Aisha to other \nwomen is like the superiority of Tharid to other kinds of food.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5418In-book reference : Book 70, Hadith 46USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 329   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5419,
    "id": 5419,
    "url": "https://sunnah.com/bukhari:5419",
    "bookNumber": 70,
    "hadithNumber": 47,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"The superiority of `Aisha to other women is like the superiority of Tharid to other \nkinds of food . \"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي طُوَالَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5419In-book reference : Book 70, Hadith 47USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 330   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5420,
    "id": 5420,
    "url": "https://sunnah.com/bukhari:5420",
    "bookNumber": 70,
    "hadithNumber": 48,
    "narrator": "Narrated Anas:",
    "english": "I went along with the Prophet (ﷺ) to the house of a young tailor of his. The tailor presented a dish of \nTharid to the Prophet (ﷺ) and resumed his work. The Prophet (ﷺ) started picking the pieces of gourd and I too, \nstarted picking them and putting it before him. Since then I have always loved (to eat) gourd.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا حَاتِمٍ الأَشْهَلَ بْنَ حَاتِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَقَدَّمَ إِلَيْهِ قَصْعَةً فِيهَا ثَرِيدٌ ـ قَالَ ـ وَأَقْبَلَ عَلَى عَمَلِهِ ـ قَالَ ـ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَجَعَلْتُ أَتَتَبَّعُهُ فَأَضَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَمَا زِلْتُ بَعْدُ أُحِبُّ الدُّبَّاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5420In-book reference : Book 70, Hadith 48USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 331   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5421,
    "id": 5421,
    "url": "https://sunnah.com/bukhari:5421",
    "bookNumber": 70,
    "hadithNumber": 49,
    "narrator": "Narrated Qatada:",
    "english": "We used to visit Anas bin Malik while his baker was standing (and baking). Anas would say, \"Eat! I \ndo not know that the Prophet (ﷺ) had ever seen well-baked bread till he met Allah, nor had he ever seen a \nroasted sheep with his own eyes.\"",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ وَخَبَّازُهُ قَائِمٌ قَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5421In-book reference : Book 70, Hadith 49USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 332   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5422,
    "id": 5422,
    "url": "https://sunnah.com/bukhari:5422",
    "bookNumber": 70,
    "hadithNumber": 50,
    "narrator": "Narrated `Amr bin Umaiyay Ad-Damri:",
    "english": "I saw Allah's Messenger (ﷺ) cutting part of the shoulder of mutton with a knife. He ate of it and then was \ncalled for prayer whereupon he got up and put down the knife and offered the prayer without \nperforming new ablution.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلاَةِ، فَقَامَ فَطَرَحَ السِّكِّينَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5422In-book reference : Book 70, Hadith 50USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 333   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5423,
    "id": 5423,
    "url": "https://sunnah.com/bukhari:5423",
    "bookNumber": 70,
    "hadithNumber": 51,
    "narrator": "Narrated `Abis:",
    "english": "I asked `Aisha \"Did the Prophet (ﷺ) forbid eating the meat of sacrifices offered on `Id-ul-Adha for more \nthan three days\" She said, \"The Prophet (ﷺ) did not do this except in the year when the people were \nhungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to \neat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The \nfamily of Muhammad did not eat to their satisfaction white bread with meat soup for three successive \ndays till he met Allah.\"",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِعَائِشَةَ أَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ فِيهِ، فَأَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ خَمْسَ عَشْرَةَ‏.‏ قِيلَ مَا اضْطَرَّكُمْ إِلَيْهِ فَضَحِكَتْ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ وَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5423In-book reference : Book 70, Hadith 51USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 334   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5424,
    "id": 5424,
    "url": "https://sunnah.com/bukhari:5424",
    "bookNumber": 70,
    "hadithNumber": 52,
    "narrator": "Narrated Jabir:",
    "english": "We used to carry the meat of the Hadis (sacrificed animals) to Medina during the life-time of the \nProphet .",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الْهَدْىِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ‏.‏ تَابَعَهُ مُحَمَّدٌ عَنِ ابْنِ عُيَيْنَةَ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ أَقَالَ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5424In-book reference : Book 70, Hadith 52USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 335   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5425,
    "id": 5425,
    "url": "https://sunnah.com/bukhari:5425",
    "bookNumber": 70,
    "hadithNumber": 53,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said to Abu Talha, \"Seek one of your boys to serve me.\" Abu Talha mounted me \nbehind him (on his riding animal) and took me (to the Prophet (ﷺ) ). So I used to serve Allah's Messenger (ﷺ) \nwhenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek \nrefuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from \nbeing heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we \n-returned from the battle of Khaibar. The Prophet (ﷺ) then brought Safiyya bint Huyai whom he had won \nfrom the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). \nWhen he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent \nme to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the \nProphet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves \nus, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two \nmountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa \n(special kinds of measure).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ، يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ فَلَمْ أَزَلْ أَخْدُمُهُ حَتَّى أَقْبَلْنَا مِنْ خَيْبَرَ، وَأَقْبَلَ بِصَفِيَّةَ بِنْتِ حُيَىٍّ قَدْ حَازَهَا، فَكُنْتُ أَرَاهُ يُحَوِّي وَرَاءَهُ بِعَبَاءَةٍ أَوْ بِكِسَاءٍ، ثُمَّ يُرْدِفُهَا وَرَاءَهُ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ صَنَعَ حَيْسًا فِي نِطَعٍ، ثُمَّ أَرْسَلَنِي فَدَعَوْتُ رِجَالاً فَأَكَلُوا، وَكَانَ ذَلِكَ بِنَاءَهُ بِهَا، ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5425In-book reference : Book 70, Hadith 53USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 336   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5426,
    "id": 5426,
    "url": "https://sunnah.com/bukhari:5426",
    "bookNumber": 70,
    "hadithNumber": 54,
    "narrator": "Narrated `Abdur-Rahman bin Abi Laila:",
    "english": "We were sitting in the company of Hudhaifa who asked for water and a Magian brought him water. \nBut when he placed the cup in his hand, he threw it at him and said, \"Had I not forbidden him to do so \nmore than once or twice?\" He wanted to say, \"I would not have done so,\" adding, \"but I heard the \nProphet saying, \"Do not wear silk or Dibaja, and do not drink in silver or golden vessels, and do not \neat in plates of such metals, for such things are for the unbelievers in this worldly life and for us in the \nHereafter.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، أَنَّهُمْ كَانُوا عِنْدَ حُذَيْفَةَ فَاسْتَسْقَى فَسَقَاهُ مَجُوسِيٌّ‏.‏ فَلَمَّا وَضَعَ الْقَدَحَ فِي يَدِهِ رَمَاهُ بِهِ وَقَالَ لَوْلاَ أَنِّي نَهَيْتُهُ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ‏.‏ كَأَنَّهُ يَقُولُ لَمْ أَفْعَلْ هَذَا، وَلَكِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَلْبَسُوا الْحَرِيرَ وَلاَ الدِّيبَاجَ وَلاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَأْكُلُوا فِي صِحَافِهَا، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5426In-book reference : Book 70, Hadith 54USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 337   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5427,
    "id": 5427,
    "url": "https://sunnah.com/bukhari:5427",
    "bookNumber": 70,
    "hadithNumber": 55,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "Allah's Messenger (ﷺ) said, \"The example of a Believer who recites the Qur'an, is that of a citron which \nsmells good and tastes good; And the example of a Believer who does not recite the Qur'an, is that of \na date which has no smell but tastes sweet; and the example of a hypocrite who recites the Qur'an, is \nthat of an aromatic plant which smells good but tastes bitter; and the example of a hypocrite who does \nnot recite the Qur'an, is that of a colocynth plant which has no smell and is bitter in taste.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ، وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ، لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5427In-book reference : Book 70, Hadith 55USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 338   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5428,
    "id": 5428,
    "url": "https://sunnah.com/bukhari:5428",
    "bookNumber": 70,
    "hadithNumber": 56,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid to other \nkinds of food.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5428In-book reference : Book 70, Hadith 56USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 339   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5429,
    "id": 5429,
    "url": "https://sunnah.com/bukhari:5429",
    "bookNumber": 70,
    "hadithNumber": 57,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when \none has finished his job, he should return quickly to his family.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ، فَإِذَا قَضَى نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5429In-book reference : Book 70, Hadith 57USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 340   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5430,
    "id": 5430,
    "url": "https://sunnah.com/bukhari:5430",
    "bookNumber": 70,
    "hadithNumber": 58,
    "narrator": "Narrated Qasim bin Muhammad:",
    "english": "Three traditions have been established because of Barira: `Aisha intended to buy her and set her free, \nbut Barira's masters said, \"Her wala' will be for us.\" `Aisha mentioned that to Allah's Messenger (ﷺ) who \nsaid, \"You could accept their condition if you wished, for the wala is for the one who manumits the \nslave.\" Barira was manumitted, then she was given the choice either to stay with her husband or leave \nhim; One day Allah's Messenger (ﷺ) entered `Aisha's house while there was a cooking pot of food boiling on \nthe fire. The Prophet (ﷺ) asked for lunch, and he was presented with bread and some extra food from the \nhome-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's \nApostle! But it is the meat that has been given to Barira in charity and she has given it to us as a \npresent.\" He said, \"For Barira it is alms, but for us it is a present.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ، أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَهَا فَتُعْتِقَهَا، فَقَالَ أَهْلُهَا، وَلَنَا الْوَلاَءُ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوْ شِئْتِ شَرَطْتِيهِ لَهُمْ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ وَأُعْتِقَتْ فَخُيِّرَتْ فِي أَنْ تَقِرَّ تَحْتَ زَوْجِهَا أَوْ تُفَارِقَهُ، وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا بَيْتَ عَائِشَةَ وَعَلَى النَّارِ بُرْمَةٌ تَفُورُ، فَدَعَا بِالْغَدَاءِ فَأُتِيَ بِخُبْزٍ وَأُدْمٍ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ أَلَمْ أَرَ لَحْمًا ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ، وَلَكِنَّهُ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَأَهْدَتْهُ لَنَا‏.‏ فَقَالَ‏\"‏ هُوَ صَدَقَةٌ عَلَيْهَا، وَهَدِيَّةٌ لَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5430In-book reference : Book 70, Hadith 58USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 341   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5431,
    "id": 5431,
    "url": "https://sunnah.com/bukhari:5431",
    "bookNumber": 70,
    "hadithNumber": 59,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) used to love sweet edible things and honey.",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5431In-book reference : Book 70, Hadith 59USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 342   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5432,
    "id": 5432,
    "url": "https://sunnah.com/bukhari:5432",
    "bookNumber": 70,
    "hadithNumber": 60,
    "narrator": "Narrated Abu Huraira:",
    "english": "I used to accompany Allah's Messenger (ﷺ) to fill my stomach; and that was when I did not eat baked bread, \nnor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my \nbelly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me \nto his house and feed me. Ja`far bin Abi Talib was very kind to the poor, and he used to take us and \nfeed us with what ever was available in his house, (and if nothing was available), he used to give us \nthe empty (honey or butter) skin which we would tear and lick whatever was in it.",
    "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنْتُ أَلْزَمُ النَّبِيَّ صلى الله عليه وسلم لِشِبَعِ بَطْنِي حِينَ لاَ آكُلُ الْخَمِيرَ، وَلاَ أَلْبَسُ الْحَرِيرَ، وَلاَ يَخْدُمُنِي فُلاَنٌ وَلاَ فُلاَنَةُ، وَأُلْصِقُ بَطْنِي بِالْحَصْبَاءِ، وَأَسْتَقْرِئُ الرَّجُلَ الآيَةَ وَهْىَ مَعِي كَىْ يَنْقَلِبَ بِي فَيُطْعِمَنِي، وَخَيْرُ النَّاسِ لِلْمَسَاكِينِ جَعْفَرُ بْنُ أَبِي طَالِبٍ، يَنْقَلِبُ بِنَا فَيُطْعِمُنَا مَا كَانَ فِي بَيْتِهِ، حَتَّى إِنْ كَانَ لَيُخْرِجُ إِلَيْنَا الْعُكَّةَ لَيْسَ فِيهَا شَىْءٌ، فَنَشْتَقُّهَا فَنَلْعَقُ مَا فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5432In-book reference : Book 70, Hadith 60USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 343   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5433,
    "id": 5433,
    "url": "https://sunnah.com/bukhari:5433",
    "bookNumber": 70,
    "hadithNumber": 61,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which \nhe started eating. I have loved to eat gourd since I saw Allah's Messenger (ﷺ) eating it.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى مَوْلًى لَهُ خَيَّاطًا، فَأُتِيَ بِدُبَّاءٍ، فَجَعَلَ يَأْكُلُهُ، فَلَمْ أَزَلْ أُحِبُّهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5433In-book reference : Book 70, Hadith 61USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 344   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5434,
    "id": 5434,
    "url": "https://sunnah.com/bukhari:5434",
    "bookNumber": 70,
    "hadithNumber": 62,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \n\"Prepare a meal to which I may invite Allah's Messenger (ﷺ) along with four other men.\" So he invited \nAllah's Messenger (ﷺ) and four other men, but another man followed them whereupon the Prophet (ﷺ) said, \n\"You have invited me as one of five guests, but now another man has followed us. If you wish you \ncan admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" \nNarrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to \ncarry food from other tables to theirs, but they can pass on food from their own table to each other; \notherwise they should leave it.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ كَانَ مِنَ الأَنْصَارِ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَدَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّكَ دَعَوْتَنَا خَامِسَ خَمْسَةٍ وَهَذَا رَجُلٌ قَدْ تَبِعَنَا، فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ بَلْ أَذِنْتُ لَهُ‏.‏ \nقَالَ مُحَمَّدُ بْنُ يُوسُفَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيْلَ يَقُولُ إِذَا كَانَ الْقَوْمُ عَلَى الْمَائِدَةِ لَيْسَ لَهُمْ أَنْ يُنَاوِلُوا مِنْ مَائِدَةٍ إِلَى مَائِدَةٍ أُخْرَى وَلَكِنْ يُنَاوِلُ بَعْضُهُمْ بَعْضًا فِي تِلْكَ الْمَائِدَةِ أَوْ يَدَعُ",
    "reference": "Reference : Sahih al-Bukhari 5434In-book reference : Book 70, Hadith 62USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 345   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5435,
    "id": 5435,
    "url": "https://sunnah.com/bukhari:5435",
    "bookNumber": 70,
    "hadithNumber": 63,
    "narrator": "Narrated Anas:",
    "english": "I was a young boy when I once was walking with Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) entered the house \nof his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's \nApostle started picking and eating the gourd. When I saw that, I started collecting and placing the \ngourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since \nI saw Allah's Messenger (ﷺ) doing what he was doing.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ النَّضْرَ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنْتُ غُلاَمًا أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَأَتَاهُ بِقَصْعَةٍ فِيهَا طَعَامٌ وَعَلَيْهِ دُبَّاءٌ، فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَلَمَّا رَأَيْتُ ذَلِكَ جَعَلْتُ أَجْمَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَأَقْبَلَ الْغُلاَمُ عَلَى عَمَلِهِ‏.‏ قَالَ أَنَسٌ لاَ أَزَالُ أُحِبُّ الدُّبَّاءَ بَعْدَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ مَا صَنَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5435In-book reference : Book 70, Hadith 63USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 346   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5436,
    "id": 5436,
    "url": "https://sunnah.com/bukhari:5436",
    "bookNumber": 70,
    "hadithNumber": 64,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A tailor invited the Prophet (ﷺ) to a meal which he had prepared, and I went along with the Prophet (ﷺ) . The \ntailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet (ﷺ) picking the \npieces of gourd from around the dish, and since then I have kept on liking gourd.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، أَنَّ خَيَّاطًا، دَعَا النَّبِيَّ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ، فَذَهَبْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ يَوْمِئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5436In-book reference : Book 70, Hadith 64USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 347   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5437,
    "id": 5437,
    "url": "https://sunnah.com/bukhari:5437",
    "bookNumber": 70,
    "hadithNumber": 65,
    "narrator": "Narrated Anas:",
    "english": "I saw the Prophet (ﷺ) being served with soup and containing gourd and cured meat, and I saw him picking \nand eating the pieces of gourd.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ يَأْكُلُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5437In-book reference : Book 70, Hadith 65USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 348   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5438,
    "id": 5438,
    "url": "https://sunnah.com/bukhari:5438",
    "bookNumber": 70,
    "hadithNumber": 66,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except \n(he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen \ndays later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction \nfor three successive days.",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ، أَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ بَعْدَ خَمْسَ عَشْرَةَ، وَمَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مَنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5438In-book reference : Book 70, Hadith 66USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 349   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5439,
    "id": 5439,
    "url": "https://sunnah.com/bukhari:5439",
    "bookNumber": 70,
    "hadithNumber": 67,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went with Allah's Messenger (ﷺ) to that \nmeal, and the tailor served the Prophet (ﷺ) with barley bread and soup of gourd and cured meat. I saw \nAllah's Messenger (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking \ngourd.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ، فَقَرَّبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ ـ قَالَ أَنَسٌ ـ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الصَّحْفَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏ وَقَالَ ثُمَامَةُ عَنْ أَنَسٍ، فَجَعَلْتُ أَجْمَعُ الدُّبَّاءَ بَيْنَ يَدَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5439In-book reference : Book 70, Hadith 67USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 350   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5440,
    "id": 5440,
    "url": "https://sunnah.com/bukhari:5440",
    "bookNumber": 70,
    "hadithNumber": 68,
    "narrator": "Narrated `Abdullah bin Ja`far bin Abi Talib:",
    "english": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumber.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5440In-book reference : Book 70, Hadith 68USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 351   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5441,
    "id": 5441,
    "url": "https://sunnah.com/bukhari:5441",
    "bookNumber": 70,
    "hadithNumber": 69,
    "narrator": "Narrated Abu `Uthman:",
    "english": "I was a guest of Abu Huraira for seven days. Abu Huraira, his wife and his slave used to get up and \nremain awake for one-third of the night by turns. Each would offer the night prayer and then awaken \nthe other. I heard Abu Huraira saying, \"Allah's Messenger (ﷺ) distributed dates among his companions and \nmy share was seven dates, one of which was a Hashafa (a date which dried on the tree before it was \nfully ripe).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ، قَالَ تَضَيَّفْتُ أَبَا هُرَيْرَةَ سَبْعًا، فَكَانَ هُوَ وَامْرَأَتُهُ وَخَادِمُهُ يَعْتَقِبُونَ اللَّيْلَ أَثْلاَثًا، يُصَلِّي هَذَا، ثُمَّ يُوقِظُ هَذَا‏.‏ وَسَمِعْتُهُ يَقُولُ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنِ أَصْحَابِهِ تَمْرًا، فَأَصَابَنِي سَبْعُ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5441In-book reference : Book 70, Hadith 69USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 352   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5442,
    "id": 5442,
    "url": "https://sunnah.com/bukhari:5442",
    "bookNumber": 70,
    "hadithNumber": 71,
    "narrator": "",
    "english": "Aishah (ra) said, \"When Allah's Messenger (ﷺ) died, we had been satisfied by the two black things, i.e., dates and water.\"",
    "arabic": "وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، حَدَّثَتْنِي أُمِّي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5442In-book reference : Book 70, Hadith 71USC-MSA web (English) reference : Vol. 1, Book 65, Hadith 353   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5443,
    "id": 5443,
    "url": "https://sunnah.com/bukhari:5443",
    "bookNumber": 70,
    "hadithNumber": 72,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir had \na piece of land which was on the way to Ruma). That year the land was not promising, so the payment \nof the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing \nfrom my land. I asked him to give me one year respite, but he refused. This news reached the Prophet (ﷺ) \nwhereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir.\" All of them \ncame to me in my garden, and the Prophet (ﷺ) started speaking to the Jew, but he Jew said, \"O Abu \nQasim! I will not grant him respite.\" When the Prophet (ﷺ) saw the Jew's attitude, he stood up and walked \nall around the garden and came again and talked to the Jew, but the Jew refused his request. I got up \nand brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \n\"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread \nout a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of \nit and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet (ﷺ) \ngot up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck \ndates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all \nhis right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the \nProphet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Messenger (ﷺ).\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما قَالَ كَانَ بِالْمَدِينَةِ يَهُودِيٌّ وَكَانَ يُسْلِفُنِي فِي تَمْرِي إِلَى الْجِدَادِ، وَكَانَتْ لِجَابِرٍ الأَرْضُ الَّتِي بِطَرِيقِ رُومَةَ فَجَلَسَتْ، فَخَلاَ عَامًا فَجَاءَنِي الْيَهُودِيُّ عِنْدَ الْجَدَادِ، وَلَمْ أَجُدَّ مِنْهَا شَيْئًا، فَجَعَلْتُ أَسْتَنْظِرُهُ إِلَى قَابِلٍ فَيَأْبَى، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ لأَصْحَابِهِ ‏\"‏ امْشُوا نَسْتَنْظِرْ لِجَابِرٍ مِنَ الْيَهُودِيِّ ‏\"‏‏.‏ فَجَاءُونِي فِي نَخْلِي فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يُكَلِّمُ الْيَهُودِيَّ فَيَقُولُ أَبَا الْقَاسِمِ لاَ أُنْظِرُهُ‏.‏ فَلَمَّا رَأَى النَّبِيُّ صلى الله عليه وسلم قَامَ فَطَافَ فِي النَّخْلِ، ثُمَّ جَاءَهُ فَكَلَّمَهُ فَأَبَى فَقُمْتُ فَجِئْتُ بِقَلِيلِ رُطَبٍ فَوَضَعْتُهُ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم فَأَكَلَ ثُمَّ قَالَ ‏\"‏ أَيْنَ عَرِيشُكَ يَا جَابِرُ ‏\"‏‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ افْرُشْ لِي فِيهِ ‏\"‏‏.‏ فَفَرَشْتُهُ فَدَخَلَ فَرَقَدَ، ثُمَّ اسْتَيْقَظَ فَجِئْتُهُ بِقَبْضَةٍ أُخْرَى فَأَكَلَ مِنْهَا، ثُمَّ قَامَ فَكَلَّمَ الْيَهُودِيَّ فَأَبَى عَلَيْهِ فَقَامَ فِي الرِّطَابِ فِي النَّخْلِ الثَّانِيَةَ ثُمَّ قَالَ ‏\"‏ يَا جَابِرُ جُدَّ وَاقْضِ ‏\"‏‏.‏ فَوَقَفَ فِي الْجَدَادِ فَجَدَدْتُ مِنْهَا مَا قَضَيْتُهُ وَفَضَلَ مِنْهُ فَخَرَجْتُ حَتَّى جِئْتُ النَّبِيَّ صلى الله عليه وسلم فَبَشَّرْتُهُ فَقَالَ ‏\"‏ أَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏ \nعُرُوشٌ وَعَرِيشٌ بِنَاءٌ وَقَالَ ابْنُ عَبَّاسٍ  مَعْرُوشَاتٍ  مَا يُعَرَّشُ مِنْ الْكُرُومِ وَغَيْرِ ذَلِكَ يُقَالُ عُرُوشُهَا أَبْنِيَتُهَا",
    "reference": "Reference : Sahih al-Bukhari 5443In-book reference : Book 70, Hadith 72USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 354   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5444,
    "id": 5444,
    "url": "https://sunnah.com/bukhari:5444",
    "bookNumber": 70,
    "hadithNumber": 73,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "While we were sitting with the Prophet, fresh dates were brought to him. The Prophet (ﷺ) said, \"There is a \ntree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and \nintended to say, \"It is the date-palm tree, O Allah's Messenger (ﷺ)!\" but I looked behind to see that I was the \ntenth and youngest of ten men present there, so I kept quiet' Then the Prophet (ﷺ) said, \"It is the datepalm \ntree.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَيْنَا نَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسٌ إِذْ أُتِيَ بِجُمَّارِ نَخْلَةٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ لَمَا بَرَكَتُهُ كَبَرَكَةِ الْمُسْلِمِ ‏\"‏‏.‏ فَظَنَنْتُ أَنَّهُ يَعْنِي النَّخْلَةَ، فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ الْتَفَتُّ فَإِذَا أَنَا عَاشِرُ عَشَرَةٍ أَنَا أَحْدَثُهُمْ فَسَكَتُّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5444In-book reference : Book 70, Hadith 73USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 355   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5445,
    "id": 5445,
    "url": "https://sunnah.com/bukhari:5445",
    "bookNumber": 70,
    "hadithNumber": 74,
    "narrator": "Narrated Sa`d:",
    "english": "Allah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or \nmagic on the day he eats them.\"",
    "arabic": "حَدَّثَنَا جُمْعَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، أَخْبَرَنَا عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَصَبَّحَ كُلَّ يَوْمٍ سَبْعَ تَمَرَاتٍ عَجْوَةً لَمْ يَضُرُّهُ فِي ذَلِكَ الْيَوْمِ سُمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5445In-book reference : Book 70, Hadith 74USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 356   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5446,
    "id": 5446,
    "url": "https://sunnah.com/bukhari:5446",
    "bookNumber": 70,
    "hadithNumber": 75,
    "narrator": "Narrated Jabala bin Suhaim.:",
    "english": "At the time of Ibn Az-Zubair, we were struck with famine, and he provided us with dates for our food. \n`Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together \nat a time, for the Prophet (ﷺ) forbade the taking of two dates together at a time (in a gathering).\" Ibn \n`Umar used to add, \"Unless one takes the permission of one's companions.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ أَصَابَنَا عَامُ سَنَةٍ مَعَ ابْنِ الزُّبَيْرِ فَرَزَقَنَا تَمْرًا، فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمُرُّ بِنَا وَنَحْنُ نَأْكُلُ وَيَقُولُ لاَ تُقَارِنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْقِرَانِ‏.‏ ثُمَّ يَقُولُ إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ‏.‏ قَالَ شُعْبَةُ الإِذْنُ مِنْ قَوْلِ ابْنِ عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5446In-book reference : Book 70, Hadith 75USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 357   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5447,
    "id": 5447,
    "url": "https://sunnah.com/bukhari:5447",
    "bookNumber": 70,
    "hadithNumber": 76,
    "narrator": "Narrated `Abdullah bin Ja`far:",
    "english": "I saw the Prophet (ﷺ) eating fresh dates with snake cucumbers.",
    "arabic": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5447In-book reference : Book 70, Hadith 76USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 358   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5448,
    "id": 5448,
    "url": "https://sunnah.com/bukhari:5448",
    "bookNumber": 70,
    "hadithNumber": 77,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that \nis the date palm tree.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنْ مُجَاهِدٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏مِنَ الشَّجَرِ شَجَرَةٌ تَكُونُ مِثْلَ الْمُسْلِمِ، وَهْىَ النَّخْلَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5448In-book reference : Book 70, Hadith 77USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 359   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5449,
    "id": 5449,
    "url": "https://sunnah.com/bukhari:5449",
    "bookNumber": 70,
    "hadithNumber": 78,
    "narrator": "Narrated `Abdullah bin Ja`far:",
    "english": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumbers.",
    "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5449In-book reference : Book 70, Hadith 78USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 360   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5450,
    "id": 5450,
    "url": "https://sunnah.com/bukhari:5450",
    "bookNumber": 70,
    "hadithNumber": 79,
    "narrator": "Narrated Anas:",
    "english": "My mother, Um Sulaim, took a Mudd of barley grain, ground it and made porridge from it, and \npressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him \nwhile he was sitting with his companions. I invited him, whereupon he said, \"And those who are with \nme?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \n\"O Allah's Messenger (ﷺ)! It is just a meal prepared by Um Sulaim.\" The Prophet (ﷺ) entered and the food was \nbrought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again \nhe said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten \n(more) enter upon me.\" He called forty persons in all Then Allah's Messenger (ﷺ) ate and got up. I started \nlooking (at the food) to see if it decreased or not.",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسٍ،‏.‏ وَعَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ،‏.‏ وَعَنْ سِنَانٍ أَبِي رَبِيعَةَ، عَنْ أَنَسٍ، أَنَّ أُمَّ سُلَيْمٍ، أُمَّهُ عَمَدَتْ إِلَى مُدٍّ مِنْ شَعِيرٍ، جَشَّتْهُ وَجَعَلَتْ مِنْهُ خَطِيفَةً، وَعَصَرَتْ عُكَّةً عِنْدَهَا، ثُمَّ بَعَثَتْنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَدَعَوْتُهُ قَالَ ‏\"‏ وَمَنْ مَعِي ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ إِنَّهُ يَقُولُ، وَمَنْ مَعِي، فَخَرَجَ إِلَيْهِ أَبُو طَلْحَةَ قَالَ يَا رَسُولَ اللَّهِ إِنَّمَا هُوَ شَىْءٌ صَنَعَتْهُ أُمُّ سُلَيْمٍ، فَدَخَلَ فَجِيءَ بِهِ وَقَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ حَتَّى عَدَّ أَرْبَعِينَ، ثُمَّ أَكَلَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَامَ، فَجَعَلْتُ أَنْظُرُ هَلْ نَقَصَ مِنْهَا شَىْءٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5450In-book reference : Book 70, Hadith 79USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 361   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5451,
    "id": 5451,
    "url": "https://sunnah.com/bukhari:5451",
    "bookNumber": 70,
    "hadithNumber": 80,
    "narrator": "Narrated `Abdul `Aziz:",
    "english": "It was said to Anas \"What did you hear the Prophet (ﷺ) saying about garlic?\" Anas replied, \"Whoever has \neaten (garlic) should not approach our mosque.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ قِيلَ لأَنَسٍ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي الثُّومِ فَقَالَ ‏\n\"‏ مَنْ أَكَلَ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5451In-book reference : Book 70, Hadith 80USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 362   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5452,
    "id": 5452,
    "url": "https://sunnah.com/bukhari:5452",
    "bookNumber": 70,
    "hadithNumber": 81,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion should keep away from us (or should keep away \nfrom our mosque).'",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءٌ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ زَعَمَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً فَلْيَعْتَزِلْنَا، أَوْ لِيَعْتَزِلْ مَسْجِدَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5452In-book reference : Book 70, Hadith 81USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 363   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5453,
    "id": 5453,
    "url": "https://sunnah.com/bukhari:5453",
    "bookNumber": 70,
    "hadithNumber": 82,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "We were with Allah's Messenger (ﷺ) collecting Al-Kabath at Mar-Az-Zahran. The Prophet (ﷺ) said, \"Collect the \nblack ones, for they are better.\" Somebody said, (O Allah's Messenger (ﷺ)!) Have you ever shepherded \nsheep?\" He said, \"There has been no prophet but has shepherded them. \"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ ‏\"‏ عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ، فَإِنَّهُ أَيْطَبُ ‏\"‏‏.‏ فَقَالَ أَكُنْتَ تَرْعَى الْغَنَمَ قَالَ ‏\"‏ نَعَمْ، وَهَلْ مِنْ نَبِيٍّ إِلاَّ رَعَاهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5453In-book reference : Book 70, Hadith 82USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 364   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5454,
    "id": 5454,
    "url": "https://sunnah.com/bukhari:5454",
    "bookNumber": 70,
    "hadithNumber": 83,
    "narrator": "Narrated Suwaid bin An Nu`man:",
    "english": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we reached As-Sahba', the Prophet (ﷺ) asked for \nfood, and he was offered nothing but Sawiq. We ate, and then Allah's Messenger (ﷺ) stood up for the prayer. \nHe rinsed his mouth with water, and we too, rinsed our mouths.",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَأَكَلْنَا فَقَامَ إِلَى الصَّلاَةِ، فَتَمَضْمَضَ وَمَضْمَضْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5454In-book reference : Book 70, Hadith 83USC-MSA web (English) reference : Vol. 1, Book 65, Hadith 365   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5455,
    "id": 5455,
    "url": "https://sunnah.com/bukhari:5455",
    "bookNumber": 70,
    "hadithNumber": 84,
    "narrator": "Narrated Suwaid:",
    "english": "We went out with \nAllah's Messenger (ﷺ) to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey \nfrom Khaibar, the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq which we chewed \nand ate. Then the Prophet (ﷺ) asked for water and rinsed his mouth, and we too, rinsed our mouths along \nwith him. He then led us in the Maghrib prayer without performing ablution again.",
    "arabic": "قَالَ يَحْيَى سَمِعْتُ بُشَيْرًا، يَقُولُ حَدَّثَنَا سُوَيْدٌ، خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا مَعَهُ، ثُمَّ صَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ وَقَالَ سُفْيَانُ كَأَنَّكَ تَسْمَعُهُ مِنْ يَحْيَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5455In-book reference : Book 70, Hadith 84USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 365   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5456,
    "id": 5456,
    "url": "https://sunnah.com/bukhari:5456",
    "bookNumber": 70,
    "hadithNumber": 85,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, 'When you eat, do not wipe your hands till you have licked it, or had it licked by \nsomebody else.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلاَ يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5456In-book reference : Book 70, Hadith 85USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 366   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5457,
    "id": 5457,
    "url": "https://sunnah.com/bukhari:5457",
    "bookNumber": 70,
    "hadithNumber": 86,
    "narrator": "Narrated Sa`id bin Al-Harith:",
    "english": "that he asked Jabir bin `Abdullah about performing ablution after taking a cooked meal. He replied, \"It \nis not essential,\" and added, \"We never used to get such kind of food during the lifetime of the \nProphet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our \nhands with except the palms of our hands, our forearms and our feet. We would perform the prayer \nthereafter with-out performing new ablution.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَأَلَهُ عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ، فَقَالَ لاَ قَدْ كُنَّا زَمَانَ النَّبِيِّ صلى الله عليه وسلم لاَ نَجِدُ مِثْلَ ذَلِكَ مِنَ الطَّعَامِ إِلاَّ قَلِيلاً، فَإِذَا نَحْنُ وَجَدْنَاهُ لَمْ يَكُنْ لَنَا مَنَادِيلُ، إِلاَّ أَكُفَّنَا وَسَوَاعِدَنَا وَأَقْدَامَنَا، ثُمَّ نُصَلِّي وَلاَ نَتَوَضَّأُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5457In-book reference : Book 70, Hadith 86USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 367   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5458,
    "id": 5458,
    "url": "https://sunnah.com/bukhari:5458",
    "bookNumber": 70,
    "hadithNumber": 87,
    "narrator": "Narrated Abu Umama:",
    "english": "Whenever the dining sheet of the Prophet (ﷺ) was taken away (i.e., whenever he finished his meal), he \nused to say: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala \nmustaghna'anhu Rabbuna.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ ‏\n\"‏ الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ وَلاَ مُسْتَغْنًى عَنْهُ، رَبَّنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5458In-book reference : Book 70, Hadith 87USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 368   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5459,
    "id": 5459,
    "url": "https://sunnah.com/bukhari:5459",
    "bookNumber": 70,
    "hadithNumber": 88,
    "narrator": "Narrated Abu Umama:",
    "english": "Whenever the Prophet (ﷺ) finished his meals (or when his dining sheet was taken away), he used to say. \n\"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by \ncompensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be \ncompensated, nor can be left, nor can be dispensed with, O our Lord!\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ ـ وَقَالَ مَرَّةً إِذَا رَفَعَ مَائِدَتَهُ ـ قَالَ ‏\n\"‏ الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا، غَيْرَ مَكْفِيٍّ، وَلاَ مَكْفُورٍ ـ وَقَالَ مَرَّةً الْحَمْدُ لِلَّهِ رَبِّنَا، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ ـ وَلاَ مُسْتَغْنًى، رَبَّنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5459In-book reference : Book 70, Hadith 88USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 369   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5460,
    "id": 5460,
    "url": "https://sunnah.com/bukhari:5460",
    "bookNumber": 70,
    "hadithNumber": 89,
    "narrator": "Narrated .Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"When your servant brings your food to you, if you do not ask him to join you, then \nat least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and \nhas taken pains to cook it nicely.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ زِيَادٍ ـ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ فَلْيُنَاوِلْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ، أَوْ لُقْمَةً أَوْ لُقْمَتَيْنِ، فَإِنَّهُ وَلِيَ حَرَّهُ وَعِلاَجَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5460In-book reference : Book 70, Hadith 89USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 370   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5461,
    "id": 5461,
    "url": "https://sunnah.com/bukhari:5461",
    "bookNumber": 70,
    "hadithNumber": 90,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "There was an Ansari man nicknamed, Abu Shu'aib, who had a slave who was a butcher. He came to \nthe Prophet (ﷺ) while he was sitting with his companions and noticed the signs of hunger on the face of \nthe Prophet (ﷺ) . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five \npersons so that I may invite the Prophet (ﷺ) along with four other men.\" He had the meal prepared for him \nand invited him. A (sixth) man followed them. The Prophet (ﷺ) said, \"O Abu Shu'aib! Another man has \nfollowed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib \nsaid, \"No, I will admit him.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا أَبُو مَسْعُودٍ الأَنْصَارِيُّ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي أَصْحَابِهِ، فَعَرَفَ الْجُوعَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ إِلَى غُلاَمِهِ اللَّحَّامِ فَقَالَ اصْنَعْ لِي طَعَامًا يَكْفِي خَمْسَةً، لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ فَصَنَعَ لَهُ طُعَيِّمًا، ثُمَّ أَتَاهُ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا شُعَيْبٍ إِنَّ رَجُلاً تَبِعَنَا فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ لاَ بَلْ أَذِنْتُ لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5461In-book reference : Book 70, Hadith 90USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 371   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5462,
    "id": 5462,
    "url": "https://sunnah.com/bukhari:5462",
    "bookNumber": 70,
    "hadithNumber": 91,
    "narrator": "Narrated `Amr bin Umaiyya:",
    "english": "That he saw Allah's Messenger (ﷺ) cutting a piece of mutton from its shoulder part he was carrying in his \nhand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then \nhe stood up and offered the prayer without performing new ablution.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي كَانَ يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5462In-book reference : Book 70, Hadith 91USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 372   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5463,
    "id": 5463,
    "url": "https://sunnah.com/bukhari:5463",
    "bookNumber": 70,
    "hadithNumber": 92,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, If supper is served and the Iqama for (Isha) prayer \n     is proclaimed, start with you supper first.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5463In-book reference : Book 70, Hadith 92USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 373   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5464,
    "id": 5464,
    "url": "https://sunnah.com/bukhari:5464",
    "bookNumber": 70,
    "hadithNumber": 93,
    "narrator": "Narrated Nafi:",
    "english": "Once Ibn Umar was taking his supper while he was listening to the \n     recitation of (Quran by) the Imam (in the Isha prayer).",
    "arabic": "وَعَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏\nوَعَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ تَعَشَّى مَرَّةً وَهْوَ يَسْمَعُ قِرَاءَةَ الإِمَامِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5464In-book reference : Book 70, Hadith 93USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 373   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5465,
    "id": 5465,
    "url": "https://sunnah.com/bukhari:5465",
    "bookNumber": 70,
    "hadithNumber": 94,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) said, \"If the Iqama for (`Isha') prayer is proclaimed and supper is served, take your supper \nfirst.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ وَحَضَرَ الْعَشَاءُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏ قَالَ وُهَيْبٌ وَيَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ ‏\"‏ إِذَا وُضِعَ الْعَشَاءُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5465In-book reference : Book 70, Hadith 94USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 374   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5466,
    "id": 5466,
    "url": "https://sunnah.com/bukhari:5466",
    "bookNumber": 70,
    "hadithNumber": 95,
    "narrator": "Narrated Anas:",
    "english": "I know (about) the Hijab (the order of veiling of women) more than anybody else. Ubai bin Ka`b used \nto ask me about it. Allah's Messenger (ﷺ) became the bridegroom of Zainab bint Jahsh whom he married at \nMedina. After the sun had risen high in the sky, the Prophet (ﷺ) invited the people to a meal. Allah's \nApostle remained sitting and some people remained sitting with him after the other guests had left. \nThen Allah's Messenger (ﷺ) got up and went away, and I too, followed him till he reached the door of \n`Aisha's room. Then he thought that the people must have left the place by then, so he returned and I \nalso returned with him. Behold, the people were still sitting at their places. So he went back again for \nthe second time, and I went along with him too. When we reached the door of `Aisha's room, he \nreturned and I also returned with him to see that the people had left. Thereupon the Prophet (ﷺ) hung a \ncurtain between me and him and the Verse regarding the order for (veiling of women) Hijab was \nrevealed.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَنَسًا، قَالَ أَنَا أَعْلَمُ النَّاسِ، بِالْحِجَابِ كَانَ أُبَىُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ ابْنَةِ جَحْشٍ وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ، فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ، فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ، حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَشَى وَمَشَيْتُ مَعَهُ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا فَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ، فَرَجَعَ وَرَجَعْتُ مَعَهُ الثَّانِيَةَ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ قَامُوا، فَضَرَبَ بَيْنِي وَبَيْنَهُ سِتْرًا، وَأُنْزِلَ الْحِجَابُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5466In-book reference : Book 70, Hadith 95USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 375   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5467,
    "id": 5467,
    "url": "https://sunnah.com/bukhari:5467",
    "bookNumber": 71,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Musa:",
    "english": "A son was born to me and I took him to the Prophet (ﷺ) who named him Ibrahim, did Tahnik for him with \na date, invoked Allah to bless him and returned him to me. (The narrator added: That was Abu Musa's \neldest son.)",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي بُرَيْدٌ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ وُلِدَ لِي غُلاَمٌ، فَأَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَسَمَّاهُ إِبْرَاهِيمَ، فَحَنَّكَهُ بِتَمْرَةٍ، وَدَعَا لَهُ بِالْبَرَكَةِ وَدَفَعَهُ إِلَىَّ، وَكَانَ أَكْبَرَ وَلَدِ أَبِي مُوسَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5467In-book reference : Book 71, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 376   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5468,
    "id": 5468,
    "url": "https://sunnah.com/bukhari:5468",
    "bookNumber": 71,
    "hadithNumber": 2,
    "narrator": "Narrated `Aisha:",
    "english": "A boy was brought to the Prophet (ﷺ) to do Tahnik for him, but the boy urinated on him, whereupon the \nProphet had water poured on the place of urine.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِصَبِيٍّ يُحَنِّكُهُ، فَبَالَ عَلَيْهِ، فَأَتْبَعَهُ الْمَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5468In-book reference : Book 71, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 377   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5469,
    "id": 5469,
    "url": "https://sunnah.com/bukhari:5469",
    "bookNumber": 71,
    "hadithNumber": 3,
    "narrator": "Narrated Asma' bint Abu Bakr:",
    "english": "I conceived `Abdullah bin AzZubair at Mecca and went out (of Mecca) while I was about to give \nbirth. I came to Medina and encamped at Quba', and gave birth at Quba'. Then I brought the child to \nAllah's Messenger (ﷺ) and placed it (on his lap). He asked for a date, chewed it, and put his saliva in the \nmouth of the child. So the first thing to enter its stomach was the saliva of Allah's Messenger (ﷺ). Then he \ndid its Tahnik with a date, and invoked Allah to bless him. It was the first child born in the Islamic \nera, therefore they (Muslims) were very happy with its birth, for it had been said to them that the Jews \nhad bewitched them, and so they would not produce any offspring.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّهَا حَمَلَتْ بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ بِمَكَّةَ قَالَتْ فَخَرَجْتُ وَأَنَا مُتِمٌّ، فَأَتَيْتُ الْمَدِينَةَ فَنَزَلْتُ قُبَاءً فَوَلَدْتُ بِقُبَاءٍ، ثُمَّ أَتَيْتُ بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَوَضَعْتُهُ فِي حَجْرِهِ، ثُمَّ دَعَا بِتَمْرَةٍ فَمَضَغَهَا، ثُمَّ تَفَلَ فِي فِيهِ فَكَانَ أَوَّلَ شَىْءٍ دَخَلَ جَوْفَهُ رِيقُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ حَنَّكَهُ بِالتَّمْرَةِ، ثُمَّ دَعَا لَهُ فَبَرَّكَ عَلَيْهِ، وَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الإِسْلاَمِ، فَفَرِحُوا بِهِ فَرَحًا شَدِيدًا، لأَنَّهُمْ قِيلَ لَهُمْ إِنَّ الْيَهُودَ قَدْ سَحَرَتْكُمْ فَلاَ يُولَدُ لَكُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5469In-book reference : Book 71, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 378   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5470,
    "id": 5470,
    "url": "https://sunnah.com/bukhari:5470",
    "bookNumber": 71,
    "hadithNumber": 4,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Talha had a child who was sick. Once, while Abu Talha was out, the\n     child died. When Abu Talha returned home, he asked, \"How does my son \n     fare?\" Um Salaim (his wife) replied, \"He is quieter than he has ever \n     been.\" Then she brought supper for him and he took his supper and \n     slept with her. When he had finished, she said (to him), \"Bury the \n     child (as he's dead).\" Next morning Abu Talha came to Allah's Messenger (ﷺ) \n     and told him about that. The Prophet (ﷺ) said (to him), \"Did you sleep \n     with your wife last night?\" Abu Talha said, \"Yes\". The Prophet (ﷺ) said, \n     \"O Allah! Bestow your blessing on them as regards that night of \n     theirs.\" Um Sulaim gave birth to a boy. Abu Talha told me to take care\n     of the child till it was taken to the Prophet. Then Abu Talha took the\n     child to the Prophet (ﷺ) and Um Sulaim sent some dates along with the \n     child. The Prophet (ﷺ) took the child (on his lap) and asked if there was \n     something with him. The people replied, \"Yes, a few dates.\" The \n     Prophet took a date, chewed it, took some of it out of his mouth, put \n     it into the child's mouth and did Tahnik for him with that, and named \n     him 'Abdullah.",
    "arabic": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ، عَنْ أَنَسِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ ابْنٌ لأَبِي طَلْحَةَ يَشْتَكِي، فَخَرَجَ أَبُو طَلْحَةَ، فَقُبِضَ الصَّبِيُّ فَلَمَّا رَجَعَ أَبُو طَلْحَةَ قَالَ مَا فَعَلَ ابْنِي قَالَتْ أُمُّ سُلَيْمٍ هُوَ أَسْكَنُ مَا كَانَ‏.‏ فَقَرَّبَتْ إِلَيْهِ الْعَشَاءَ فَتَعَشَّى، ثُمَّ أَصَابَ مِنْهَا، فَلَمَّا فَرَغَ قَالَتْ وَارِ الصَّبِيَّ‏.‏ فَلَمَّا أَصْبَحَ أَبُو طَلْحَةَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ فَقَالَ ‏\"‏ أَعْرَسْتُمُ اللَّيْلَةَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ بَارِكْ لَهُمَا ‏\"‏‏.‏ فَوَلَدَتْ غُلاَمًا قَالَ لِي أَبُو طَلْحَةَ احْفَظْهُ حَتَّى تَأْتِيَ بِهِ النَّبِيَّ صلى الله عليه وسلم فَأَتَى بِهِ النَّبِيَّ صلى الله عليه وسلم وَأَرْسَلَتْ مَعَهُ بِتَمَرَاتٍ، فَأَخَذَهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَمَعَهُ شَىْءٌ ‏\"‏‏.‏ قَالُوا نَعَمْ تَمَرَاتٌ‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم فَمَضَغَهَا، ثُمَّ أَخَذَ مِنْ فِيهِ فَجَعَلَهَا فِي فِي الصَّبِيِّ، وَحَنَّكَهُ بِهِ، وَسَمَّاهُ عَبْدَ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5470In-book reference : Book 71, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 379   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5471,
    "id": 5471,
    "url": "https://sunnah.com/bukhari:5471",
    "bookNumber": 71,
    "hadithNumber": 6,
    "narrator": "",
    "english": "Narrated Salman bin 'Amri Ad-Dabbi, the Prophet (ﷺ) said, 'Aqiqa is to be offered for a (newly born) boy.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ سَلْمَانَ بْنِ عَامِرٍ، قَالَ مَعَ الْغُلاَمِ عَقِيقَةٌ‏.‏ وَقَالَ حَجَّاجٌ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا أَيُّوبُ وَقَتَادَةُ وَهِشَامٌ وَحَبِيبٌ عَنِ ابْنِ سِيرِينَ عَنْ سَلْمَانَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5471In-book reference : Book 71, Hadith 6USC-MSA web (English) reference : Vol. 1, Book 66, Hadith 379   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5472,
    "id": 5472,
    "url": "https://sunnah.com/bukhari:5472",
    "bookNumber": 71,
    "hadithNumber": 7,
    "narrator": "Narrated Salman bin 'Amir Ad-Dabbi:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"'Aqiqa is to be offered for a (newly born) boy, so slaughter (an \nanimal) for him, and relieve him of his suffering.\" \n\n\nNarrated Habib bin Ash-Shahid:\n\nIbn Seereen told me to ask Al-Hassan from whom he had heard the narration of 'Aqiqa. I asked him \nand he said, \"From Samura bin Jundab.\"",
    "arabic": "وَقَالَ غَيْرُ وَاحِدٍ عَنْ عَاصِمٍ، وَهِشَامٍ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنِ الرَّبَابِ، عَنْ سَلْمَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ يَزِيدُ بْنُ إِبْرَاهِيمَ عَنِ ابْنِ سِيرِينَ عَنْ سَلْمَانَ قَوْلَهُ‏.‏ وَقَالَ أَصْبَغُ أَخْبَرَنِي ابْنُ وَهْبٍ عَنْ جَرِيرِ بْنِ حَازِمٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ حَدَّثَنَا سَلْمَانُ بْنُ عَامِرٍ الضَّبِّيُّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَعَ الْغُلاَمِ عَقِيقَةٌ، فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الأَذَى ‏\"‏‏.‏ \nحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ أَمَرَنِي ابْنُ سِيرِينَ أَنْ أَسْأَلَ الْحَسَنَ، مِمَّنْ سَمِعَ حَدِيثَ الْعَقِيقَةِ، فَسَأَلْتُهُ فَقَالَ مِنْ سَمُرَةَ بْنِ جُنْدَبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5472In-book reference : Book 71, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 380   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5473,
    "id": 5473,
    "url": "https://sunnah.com/bukhari:5473",
    "bookNumber": 71,
    "hadithNumber": 8,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Neither Fara' nor 'Atira (is permissible):\" Al-Fara' nor 'Atira (is permissible):\" Al- \nFara' was the first offspring (of camels or sheep) which the pagans used to offer (as a sacrifice) to their \nidols. And Al-`Atira was (a sheep which was to be slaughtered) during the month of Rajab.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، أَخْبَرَنَا الزُّهْرِيُّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏‏.‏ وَالْفَرَعُ أَوَّلُ النِّتَاجِ، كَانُوا يَذْبَحُونَهُ لَطِوَاغِيتِهِمْ، وَالْعَتِيرَةُ فِي رَجَبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5473In-book reference : Book 71, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 382   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5474,
    "id": 5474,
    "url": "https://sunnah.com/bukhari:5474",
    "bookNumber": 71,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Neither Fara' nor 'Atira) is permissible).\" Al-Fara' was the first offspring (they got \nof camels or sheep) which they (pagans) used to offer (as a sacrifice) to their idols. 'Atira was (a sheep \nwhich used to be slaughtered) during the month of Rajab.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَا عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏‏.‏ قَالَ وَالْفَرَعَ أَوَّلُ نِتَاجٍ كَانَ يُنْتَجُ لَهُمْ، كَانُوا يَذْبَحُونَهُ لِطَوَاغِيتِهِمْ، وَالْعَتِيرَةُ فِي رَجَبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5474In-book reference : Book 71, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 66, Hadith 383   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5475,
    "id": 5475,
    "url": "https://sunnah.com/bukhari:5475",
    "bookNumber": 72,
    "hadithNumber": 1,
    "narrator": "Narrated Adi bin Hatim:",
    "english": "I asked the Prophet (ﷺ) about the game killed by a Mi'rad (i.e. a sharp-edged piece of wood or a piece of \nwood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its \nsharp edge, eat of it, but if it is killed with its shaft, with a hit by its broad side then the game is \n(unlawful to eat) for it has been beaten to death.\" I asked him about the game killed by a trained \nhound. He said, \"If the hound catches the game for you, eat of it, for killing the game by the hound, is \nlike its slaughtering. But if you see with your hound or hounds another dog, and you are afraid that it \nmight have shared in hunting the game with your hound and killed it, then you should not eat of it, \nbecause you have mentioned Allah's name on (sending) your hound only, but you have not mentioned \nit on some other hound.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ قَالَ ‏\"‏ مَا أَصَابَ بِحَدِّهِ فَكُلْهُ، وَمَا أَصَابَ بِعَرْضِهِ فَهْوَ وَقِيذٌ ‏\"‏‏.‏ وَسَأَلْتُهُ عَنْ صَيْدِ الْكَلْبِ فَقَالَ ‏\"‏ مَا أَمْسَكَ عَلَيْكَ فَكُلْ، فَإِنَّ أَخْذَ الْكَلْبِ ذَكَاةٌ، وَإِنْ وَجَدْتَ مَعَ كَلْبِكَ أَوْ كِلاَبِكَ كَلْبًا غَيْرَهُ فَخَشِيتَ أَنْ يَكُونَ أَخَذَهُ مَعَهُ، وَقَدْ قَتَلَهُ، فَلاَ تَأْكُلْ، فَإِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْهُ عَلَى غَيْرِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5475In-book reference : Book 72, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 384   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5476,
    "id": 5476,
    "url": "https://sunnah.com/bukhari:5476",
    "bookNumber": 72,
    "hadithNumber": 2,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "I asked Allah's Messenger (ﷺ) about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if \nthe Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to \ndeath with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" \nHe said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can \neat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has \nhunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some \nother hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your \ndog only and not on the other.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمِعْرَاضِ فَقَالَ ‏\"‏ إِذَا أَصَبْتَ بِحَدِّهِ فَكُلْ، فَإِذَا أَصَابَ بِعَرْضِهِ فَقَتَلَ فَإِنَّهُ وَقِيذٌ، فَلاَ تَأْكُلْ ‏\"‏‏.‏ فَقُلْتُ أُرْسِلُ كَلْبِي‏.‏ قَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَسَمَّيْتَ، فَكُلْ ‏\"‏‏.‏ قُلْتُ فَإِنْ أَكَلَ قَالَ ‏\"‏ فَلاَ تَأْكُلْ، فَإِنَّهُ لَمْ يُمْسِكْ عَلَيْكَ، إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ ‏\"‏‏.‏ قُلْتُ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَهُ كَلْبًا آخَرَ‏.‏ قَالَ ‏\"‏ لاَ تَأْكُلْ، فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ، وَلَمْ تُسَمِّ عَلَى آخَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5476In-book reference : Book 72, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 385   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5477,
    "id": 5477,
    "url": "https://sunnah.com/bukhari:5477",
    "bookNumber": 72,
    "hadithNumber": 3,
    "narrator": "Narrated Adi bin Hatim:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! We let loose our trained hounds after a game?\" He said, \"Eat what they \nhunt for you.\" I said, \"Even if they killed (the game)?\" He replied, 'Even if they killed (the game).\" I \nsaid, 'We also hit (the game) with the Mi'rad?\" He said, \"Eat of the animal which the Mi'rad kills by \npiercing its body, but do not eat of the animal which is killed by the broad side of the Mi'rad.''",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نُرْسِلُ الْكِلاَبَ الْمُعَلَّمَةَ‏.‏ قَالَ ‏\"‏ كُلْ مَا أَمْسَكْنَ عَلَيْكَ ‏\"‏‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ ‏\"‏‏.‏ قُلْتُ وَإِنَّا نَرْمِي بِالْمِعْرَاضِ‏.‏ قَالَ ‏\"‏ كُلْ مَا خَزَقَ، وَمَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5477In-book reference : Book 72, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 386   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5478,
    "id": 5478,
    "url": "https://sunnah.com/bukhari:5478",
    "bookNumber": 72,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Tha`laba Al-Khushani:",
    "english": "I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take \nour meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and \nwith my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He \nsaid, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other \nthan theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat \nout of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt \nsomething with your trained hound after mentioning Allah's Name, eat of it, and if you hunt \nsomething with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ، قَالَ أَخْبَرَنِي رَبِيعَةُ بْنُ يَزِيدَ الدِّمَشْقِيُّ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِنَّا بِأَرْضِ قَوْمٍ أَهْلِ الْكِتَابِ، أَفَنَأْكُلُ فِي آنِيَتِهِمْ وَبِأَرْضِ صَيْدٍ، أَصِيدُ بِقَوْسِي وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ، وَبِكَلْبِي الْمُعَلَّمِ، فَمَا يَصْلُحُ لِي قَالَ ‏\n\"‏ أَمَّا مَا ذَكَرْتَ مِنْ أَهْلِ الْكِتَابِ فَإِنْ وَجَدْتُمْ غَيْرَهَا فَلاَ تَأْكُلُوا فِيهَا، وَإِنْ لَمْ تَجِدُوا فَاغْسِلُوهَا وَكُلُوا فِيهَا، وَمَا صِدْتَ بِقَوْسِكَ فَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ، وَمَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ فَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ، وَمَا صِدْتَ بِكَلْبِكَ غَيْرَ مُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5478In-book reference : Book 72, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 387   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5479,
    "id": 5479,
    "url": "https://sunnah.com/bukhari:5479",
    "bookNumber": 72,
    "hadithNumber": 5,
    "narrator": "Narrated `Abdullah bin Maghaffal:",
    "english": "that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw \nstones, for Allah's Messenger (ﷺ) has forbidden throwing stones, or he used to dislike it.\" `Abdullah added: \nThrowing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or \ngouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I \ntell you that Allah's Messenger (ﷺ) has forbidden or disliked the throwing the stones (in such a way), yet you \nare throwing stones! I shall not talk to you for such-and-such a period.\"",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ رَاشِدٍ، حَدَّثَنَا وَكِيعٌ، وَيَزِيدُ بْنُ هَارُونَ ـ وَاللَّفْظُ لِيَزِيدَ ـ عَنْ كَهْمَسِ بْنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّهُ رَأَى رَجُلاً يَخْذِفُ فَقَالَ لَهُ لاَ تَخْذِفْ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْخَذْفِ ـ أَوْ كَانَ يَكْرَهُ الْخَذْفَ ـ وَقَالَ ‏\n\"‏ إِنَّهُ لاَ يُصَادُ بِهِ صَيْدٌ وَلاَ يُنْكَى بِهِ عَدُوٌّ، وَلَكِنَّهَا قَدْ تَكْسِرُ السِّنَّ وَتَفْقَأُ الْعَيْنَ ‏\"‏‏.‏ ثُمَّ رَآهُ بَعْدَ ذَلِكَ يَخْذِفُ فَقَالَ لَهُ أُحَدِّثُكَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ الْخَذْفِ‏.‏ أَوْ كَرِهَ الْخَذْفَ، وَأَنْتَ تَخْذِفُ لاَ أُكَلِّمُكَ كَذَا وَكَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5479In-book reference : Book 72, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 388   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5480,
    "id": 5480,
    "url": "https://sunnah.com/bukhari:5480",
    "bookNumber": 72,
    "hadithNumber": 6,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"Whoever keeps a (pet) dog which is neither a watch dog nor a hunting dog, will get \na daily deduction of two Qirat from his good deeds.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ مَاشِيَةٍ أَوْ ضَارِيَةٍ، نَقَصَ كُلَّ يَوْمٍ مِنْ عَمَلِهِ قِيرَاطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5480In-book reference : Book 72, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 389   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5481,
    "id": 5481,
    "url": "https://sunnah.com/bukhari:5481",
    "bookNumber": 72,
    "hadithNumber": 7,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "I heard the Prophet (ﷺ) saying, \"If someone keeps a dog neither for hunting, nor for guarding livestock, \nthe reward (for his good deeds) will be reduced by two Qirats per day.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، قَالَ سَمِعْتُ سَالِمًا، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبٌ ضَارٍ لِصَيْدٍ أَوْ كَلْبَ مَاشِيَةٍ، فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5481In-book reference : Book 72, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 390   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5482,
    "id": 5482,
    "url": "https://sunnah.com/bukhari:5482",
    "bookNumber": 72,
    "hadithNumber": 8,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"If someone keeps a dog neither for guarding livestock, nor for hunting, his good \ndeeds will decrease (in reward) by two Qirats a day.'",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ ضَارٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5482In-book reference : Book 72, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 391   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5483,
    "id": 5483,
    "url": "https://sunnah.com/bukhari:5483",
    "bookNumber": 72,
    "hadithNumber": 9,
    "narrator": "Narrated Adi bin Hatim:",
    "english": "I asked Allah's Messenger (ﷺ). \"We hunt with the help of these hounds.\" He said, \"If you let loose your \ntrained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch \nfor you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then \nit is likely that the hound has caught the game for itself. And if other hounds join your hound in \nhunting the game, then do not eat of it.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ بَيَانٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ إِنَّا قَوْمٌ نَصِيدُ بِهَذِهِ الْكِلاَبِ‏.‏ فَقَالَ ‏\n\"‏ إِذَا أَرْسَلْتَ كِلاَبَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ، فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكُمْ، وَإِنْ قَتَلْنَ إِلاَّ أَنْ يَأْكُلَ الْكَلْبُ، فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَهُ عَلَى نَفْسِهِ، وَإِنْ خَالَطَهَا كِلاَبٌ مِنْ غَيْرِهَا فَلاَ تَأْكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5483In-book reference : Book 72, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 392   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5484,
    "id": 5484,
    "url": "https://sunnah.com/bukhari:5484",
    "bookNumber": 72,
    "hadithNumber": 10,
    "narrator": "Narrated Adi bin Hatim:",
    "english": "The Prophet (ﷺ) said, \"If you let loose your hound after a game and mention Allah's Name on sending it, \nand the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you \nshould not eat thereof, for the hound has caught it for itself. And if along with your hound, joined other \nhounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal \nand kill it, you should not eat of it, for you will not know which of them has killed it. And if you have \nthrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other \nthan the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in \nwater, then do not eat of it.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَسَمَّيْتَ فَأَمْسَكَ وَقَتَلَ، فَكُلْ، وَإِنْ أَكَلَ فَلاَ تَأْكُلْ، فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ، وَإِذَا خَالَطَ كِلاَبًا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهَا فَأَمْسَكْنَ وَقَتَلْنَ فَلاَ تَأْكُلْ، فَإِنَّكَ لاَ تَدْرِي أَيُّهَا قَتَلَ، وَإِنْ رَمَيْتَ الصَّيْدَ فَوَجَدْتَهُ بَعْدَ يَوْمٍ أَوْ يَوْمَيْنِ، لَيْسَ بِهِ إِلاَّ أَثَرُ سَهْمِكَ، فَكُلْ، وَإِنْ وَقَعَ فِي الْمَاءِ فَلاَ تَأْكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5484In-book reference : Book 72, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 393   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5485,
    "id": 5485,
    "url": "https://sunnah.com/bukhari:5485",
    "bookNumber": 72,
    "hadithNumber": 11,
    "narrator": "",
    "english": "And it has also been narrated by `Adi bin Hatim that he asked the Prophet (ﷺ) \n\"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but \nstill bearing his arrow, (can he eat of it)?\" The Prophet (ﷺ) replied, \"He can eat if he wishes.\"",
    "arabic": "وَقَالَ عَبْدُ الأَعْلَى عَنْ دَاوُدَ، عَنْ عَامِرٍ، عَنْ عَدِيٍّ، أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم، يَرْمِي الصَّيْدَ فَيَقْتَفِرُ أَثَرَهُ الْيَوْمَيْنِ وَالثَّلاَثَةَ، ثُمَّ يَجِدُهُ مَيِّتًا وَفِيهِ سَهْمُهُ قَالَ ‏\n\"‏ يَأْكُلُ إِنْ شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5485In-book reference : Book 72, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 393   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5486,
    "id": 5486,
    "url": "https://sunnah.com/bukhari:5486",
    "bookNumber": 72,
    "hadithNumber": 12,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! I let loose my hound after a game and mention Allah's Name on sending \nit.\" The Prophet (ﷺ) said, \"If you let loose your hound after a game and you mention Allah's Name on \nsending it and the hound catches and kills the game and eats of it, then you should not eat of it, for it \nhas killed it for itself.\" I said, \"Sometimes when I send my hound after a game, I find another hound \nalong with it and I do not know which of them has caught the game.\" He said, \"You must not eat of it \nbecause you have not mentioned, the Name of Allah except on sending your own hound, and you did \nnot mention it on the other hound.\" Then I asked him about the game hunted with a Mi'rad (i.e. a \nsharp edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). \nHe said, \"If the game is killed with its sharp edge, you can eat of it, but if it is killed by its broad side \n(shaft), you cannot eat of it, for then it is like an animal beaten to death with a piece of wood.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ كَلْبِي وَأُسَمِّي فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَسَمَّيْتَ، فَأَخَذَ فَقَتَلَ فَأَكَلَ فَلاَ تَأْكُلْ، فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ ‏\"‏‏.‏ قُلْتُ إِنِّي أُرْسِلُ كَلْبِي أَجِدُ مَعَهُ كَلْبًا آخَرَ، لاَ أَدْرِي أَيُّهُمَا أَخَذَهُ‏.‏ فَقَالَ ‏\"‏ لاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏‏.‏ وَسَأَلْتُهُ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏\"‏ إِذَا أَصَبْتَ بِحَدِّهِ، فَكُلْ، وَإِذَا أَصَبْتَ بِعَرْضِهِ فَقَتَلَ، فَإِنَّهُ وَقِيذٌ، فَلاَ تَأْكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5486In-book reference : Book 72, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 394   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5487,
    "id": 5487,
    "url": "https://sunnah.com/bukhari:5487",
    "bookNumber": 72,
    "hadithNumber": 13,
    "narrator": "Narrated Adi Bin Hatim:",
    "english": "I asked Allah's Messenger (ﷺ), \"We hunt with these hounds.\" He said, \"If you send your trained hounds after \na game and mention Allah's Name on sending, you can eat of what they catch for you. But if the \nhound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, \nand if another hound joins your hounds (during the hunt), you should not eat of the game.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنِي ابْنُ فُضَيْلٍ، عَنْ بَيَانٍ، عَنْ عَامِرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنَّا قَوْمٌ نَتَصَيَّدُ بِهَذِهِ الْكِلاَبِ‏.‏ فَقَالَ ‏\n\"‏ إِذَا أَرْسَلْتَ كِلاَبَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ، فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، إِلاَّ أَنْ يَأْكُلَ الْكَلْبُ، فَلاَ تَأْكُلْ فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ، وَإِنْ خَالَطَهَا كَلْبٌ مِنْ غَيْرِهَا، فَلاَ تَأْكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5487In-book reference : Book 72, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 395   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5488,
    "id": 5488,
    "url": "https://sunnah.com/bukhari:5488",
    "bookNumber": 72,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Tha`laba Al-Khushani:",
    "english": "I came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow \nand trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your \nsaying that you are living in the land of the people of the Scripture and that you eat in their utensils, if \nyou can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than \ntheirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if \nyou hung something with your bow, and have mentioned Allah's Name while hunting, then you can \neat (the game). And if you hunt something with your trained hound, and have mentioned Allah's \nName on sending it for hunting then you can eat (the game). But if you hunt something with your \nuntrained hound and you were able to slaughter it before its death, you can eat of it.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ حَيْوَةَ،‏.‏ وَحَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ، قَالَ أَخْبَرَنِي أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ ـ رضى الله عنه ـ يَقُولُ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ قَوْمٍ أَهْلِ الْكِتَابِ، نَأْكُلُ فِي آنِيَتِهِمْ، وَأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي، وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ، وَالَّذِي لَيْسَ مُعَلَّمًا، فَأَخْبِرْنِي مَا الَّذِي يَحِلُّ لَنَا مِنْ ذَلِكَ فَقَالَ ‏\n\"‏ أَمَّا مَا ذَكَرْتَ أَنَّكَ بِأَرْضِ قَوْمٍ أَهْلِ الْكِتَابِ، تَأْكُلُ فِي آنِيَتِهِمْ، فَإِنْ وَجَدْتُمْ غَيْرَ آنِيَتِهِمْ، فَلاَ تَأْكُلُوا فِيهَا، وَإِنْ لَمْ تَجِدُوا فَاغْسِلُوهَا ثُمَّ كُلُوا فِيهَا، وَأَمَّا مَا ذَكَرْتَ أَنَّكَ بِأَرْضِ صَيْدٍ، فَمَا صِدْتَ بِقَوْسِكَ، فَاذْكُرِ اسْمَ اللَّهِ، ثُمَّ كُلْ، وَمَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ، فَاذْكُرِ اسْمَ اللَّهِ، ثُمَّ كُلْ، وَمَا صِدْتَ بِكَلْبِكَ الَّذِي لَيْسَ مُعَلَّمًا فَأَدْرَكْتَ ذَكَاتَهُ، فَكُلْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5488In-book reference : Book 72, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 396   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5489,
    "id": 5489,
    "url": "https://sunnah.com/bukhari:5489",
    "bookNumber": 72,
    "hadithNumber": 15,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We provoked a rabbit at Marr Az-Zahran till it started jumping. My companions chased it till they got \ntired. But I alone ran after it and caught it and brought it to Abu Talha. He sent both its legs to the \nProphet who accepted them.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي هِشَامُ بْنُ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ، فَسَعَوْا عَلَيْهَا حَتَّى لَغِبُوا، فَسَعَيْتُ عَلَيْهَا حَتَّى أَخَذْتُهَا، فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ، فَبَعَثَ إِلَى النَّبِيِّ صلى الله عليه وسلم بِوَرِكِهَا وَفَخِذَيْهَا فَقَبِلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5489In-book reference : Book 72, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 397   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5490,
    "id": 5490,
    "url": "https://sunnah.com/bukhari:5490",
    "bookNumber": 72,
    "hadithNumber": 16,
    "narrator": "Narrated Abu Qatada:",
    "english": "that once he was with Allah's Messenger (ﷺ) (on the way to Mecca). When he had covered some of the way \nto Mecca, he and some companions of his, who were in the state of lhram. remained behind the \nProphet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode \nhis horse and asked his companions to hand him a whip, but they refused. He then asked them to hand \nhim his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of \nthe Companions of Allah's Messenger (ﷺ) ate of it, but some others refused to eat. When they met Allah's \nApostle they asked him about that. He said, \"It was meal given to you by Allah.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ، أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ، وَهْوَ غَيْرُ مُحْرِمٍ، فَرَأَى حِمَارًا وَحْشِيًّا، فَاسْتَوَى عَلَى فَرَسِهِ، ثُمَّ سَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطًا، فَأَبَوْا فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ، فَقَتَلَهُ فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبَى بَعْضُهُمْ، فَلَمَّا أَدْرَكُوا رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلُوهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5490In-book reference : Book 72, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 398   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5491,
    "id": 5491,
    "url": "https://sunnah.com/bukhari:5491",
    "bookNumber": 72,
    "hadithNumber": 17,
    "narrator": "Narrated Abu Qatada:",
    "english": "(the same Hadith above, but he added); The Prophet (ﷺ) asked, \"Is there any of its meat left with you?\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي قَتَادَةَ، مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏\n\"‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5491In-book reference : Book 72, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 399   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5492,
    "id": 5492,
    "url": "https://sunnah.com/bukhari:5492",
    "bookNumber": 72,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Qatada:",
    "english": "I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet (ﷺ) \nand his companions) were in the state of Ihram, while I was not in that state. I was riding my horse \nand I used to be fond of ascending mountains. So while I was doing so I noticed that the people were \nlooking at something. I went to see what it was, and behold it was an onager. I asked my companions, \n\"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have \nseen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you \nin that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and \ndid not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not \neven touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some \nrefused to eat of it. I said (to them), \"I will ask the Prophet (ﷺ) about it (on your behalf).\" When I met the \nProphet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \n\"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ وَأَبِي صَالِحٍ مَوْلَى التَّوْأَمَةِ سَمِعْتُ أَبَا قَتَادَةَ، قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِيمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِ وَهُمْ مُحْرِمُونَ وَأَنَا رَجُلٌ حِلٌّ عَلَى فَرَسٍ، وَكُنْتُ رَقَّاءً عَلَى الْجِبَالِ، فَبَيْنَا أَنَا عَلَى ذَلِكَ إِذْ رَأَيْتُ النَّاسَ مُتَشَوِّفِينَ لِشَىْءٍ، فَذَهَبْتُ أَنْظُرُ، فَإِذَا هُوَ حِمَارُ وَحْشٍ فَقُلْتُ لَهُمْ مَا هَذَا قَالُوا لاَ نَدْرِي‏.‏ قُلْتُ هُوَ حِمَارٌ وَحْشِيٌّ‏.‏ فَقَالُوا هُوَ مَا رَأَيْتَ‏.‏ وَكُنْتُ نَسِيتُ سَوْطِي فَقُلْتُ لَهُمْ نَاوِلُونِي سَوْطِي‏.‏ فَقَالُوا لاَ نُعِينُكَ عَلَيْهِ‏.‏ فَنَزَلْتُ فَأَخَذْتُهُ، ثُمَّ ضَرَبْتُ فِي أَثَرِهِ، فَلَمْ يَكُنْ إِلاَّ ذَاكَ، حَتَّى عَقَرْتُهُ، فَأَتَيْتُ إِلَيْهِمْ فَقُلْتُ لَهُمْ قُومُوا فَاحْتَمِلُوا‏.‏ قَالُوا لاَ نَمَسُّهُ‏.‏ فَحَمَلْتُهُ حَتَّى جِئْتُهُمْ بِهِ، فَأَبَى بَعْضُهُمْ، وَأَكَلَ بَعْضُهُمْ، فَقُلْتُ أَنَا أَسْتَوْقِفُ لَكُمُ النَّبِيَّ صلى الله عليه وسلم فَأَدْرَكْتُهُ فَحَدَّثْتُهُ الْحَدِيثَ فَقَالَ لِي ‏\"‏ أَبَقِيَ مَعَكُمْ شَىْءٌ مِنْهُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ كُلُوا فَهْوَ طُعْمٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5492In-book reference : Book 72, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 400   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5493,
    "id": 5493,
    "url": "https://sunnah.com/bukhari:5493",
    "bookNumber": 72,
    "hadithNumber": 19,
    "narrator": "Narrated Jabir:",
    "english": "We went out in a campaign and the army was called The Army of the Khabt, and Abu 'Ubaida was \nour commander. We were struck with severe hunger. Then the sea threw a huge dead fish called Al- \n`Anbar, the like of which had never been seen. We ate of it for half a month, and then Abu 'Ubaida \ntook one of its bones (and made an arch of it) so that a rider could easily pass under it.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّهُ سَمِعَ جَابِرًا ـ رضى الله عنه ـ يَقُولُ غَزَوْنَا جَيْشَ الْخَبَطِ وَأُمِّرَ أَبُو عُبَيْدَةَ فَجُعْنَا جُوعًا شَدِيدًا فَأَلْقَى الْبَحْرُ حُوتًا مَيِّتًا لَمْ يُرَ مِثْلُهُ يُقَالُ لَهُ الْعَنْبَرُ فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ فَأَخَذَ أَبُو عُبَيْدَةَ عَظْمًا مِنْ عِظَامِهِ فَمَرَّ الرَّاكِبُ تَحْتَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5493In-book reference : Book 72, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 401   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5494,
    "id": 5494,
    "url": "https://sunnah.com/bukhari:5494",
    "bookNumber": 72,
    "hadithNumber": 20,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) sent us as an army unit of three hundred warriors under the command of Abu 'Ubaida to \nambush a caravan of the Quraish. But we were struck with such severe hunger that we ate the Khabt \n(desert bushes), so our army was called the Army of the Khabt. Then the sea threw a huge fish called \nAl-`Anbar and we ate of it for half a month and rubbed our bodies with its fat till our bodies became \nhealthy. Then Abu Ubaida took one of its ribs and fixed it over the ground and a rider passed \nunderneath it. There was a man amongst us who slaughtered three camels when hunger became \nsevere, and he slaughtered three more, but after that Abu 'Ubaida forbade him to do so.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ بَعَثَنَا النَّبِيُّ صلى الله عليه وسلم ثَلاَثَمِائَةِ رَاكِبٍ وَأَمِيرُنَا أَبُو عُبَيْدَةَ نَرْصُدُ عِيرًا لِقُرَيْشٍ فَأَصَابَنَا جُوعٌ شَدِيدٌ حَتَّى أَكَلْنَا الْخَبَطَ، فَسُمِّيَ جَيْشَ الْخَبَطِ وَأَلْقَى الْبَحْرُ حُوتًا يُقَالُ لَهُ الْعَنْبَرُ فَأَكَلْنَا نِصْفَ شَهْرٍ وَادَّهَنَّا بِوَدَكِهِ حَتَّى صَلَحَتْ أَجْسَامُنَا قَالَ فَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَنَصَبَهُ فَمَرَّ الرَّاكِبُ تَحْتَهُ، وَكَانَ فِينَا رَجُلٌ فَلَمَّا اشْتَدَّ الْجُوعُ نَحَرَ ثَلاَثَ جَزَائِرَ، ثُمَّ ثَلاَثَ جَزَائِرَ، ثُمَّ نَهَاهُ أَبُو عُبَيْدَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5494In-book reference : Book 72, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 402   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5495,
    "id": 5495,
    "url": "https://sunnah.com/bukhari:5495",
    "bookNumber": 72,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn Abi `Aufa:",
    "english": "We participated with the Prophet (ﷺ) in six or seven Ghazawat, and we used to eat locusts with him.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي يَعْفُورٍ، قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ قَالَ غَزَوْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم سَبْعَ غَزَوَاتٍ أَوْ سِتًّا، كُنَّا نَأْكُلُ مَعَهُ الْجَرَادَ‏.‏ قَالَ سُفْيَانُ وَأَبُو عَوَانَةَ وَإِسْرَائِيلُ عَنْ أَبِي يَعْفُورٍ عَنِ ابْنِ أَبِي أَوْفَى سَبْعَ غَزَوَاتٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5495In-book reference : Book 72, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 403   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5496,
    "id": 5496,
    "url": "https://sunnah.com/bukhari:5496",
    "bookNumber": 72,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Tha`laba Al-Khushani:",
    "english": "I came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are living in the land of the people of the \nScripture, and we take our meals in their utensils, and there is game in that land and I hunt with my \nbow and with my trained hound and with my untrained hound.\" The Prophet (ﷺ) said, \"As for your saying \nthat you are in the land of people of the Scripture, you should not eat in their utensils unless you find \nno alternative, in which case you must wash the utensils and then eat in them As for your saying that \nyou are in the land of game, if you hunt something with your bow, mention Allah's Name (while \nhunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name \non sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it \nand you can eat of it.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ الدِّمَشْقِيُّ، قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، قَالَ حَدَّثَنِي أَبُو ثَعْلَبَةَ الْخُشَنِيُّ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ أَهْلِ الْكِتَابِ، فَنَأْكُلُ فِي آنِيَتِهِمْ، وَبِأَرْضِ صَيْدٍ، أَصِيدُ بِقَوْسِي، وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ، وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَمَّا مَا ذَكَرْتَ أَنَّكَ بِأَرْضِ أَهْلِ كِتَابٍ فَلاَ تَأْكُلُوا فِي آنِيَتِهِمْ، إِلاَّ أَنْ لاَ تَجِدُوا بُدًّا، فَإِنْ لَمْ تَجِدُوا بُدًّا فَاغْسِلُوهَا وَكُلُوا، وَأَمَّا مَا ذَكَرْتَ أَنَّكُمْ بِأَرْضِ صَيْدٍ، فَمَا صِدْتَ بِقَوْسِكَ، فَاذْكُرِ اسْمَ اللَّهِ وَكُلْ، وَمَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ، فَاذْكُرِ اسْمَ اللَّهِ وَكُلْ، وَمَا صِدْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ، فَأَدْرَكْتَ ذَكَاتَهُ، فَكُلْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5496In-book reference : Book 72, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 404   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5497,
    "id": 5497,
    "url": "https://sunnah.com/bukhari:5497",
    "bookNumber": 72,
    "hadithNumber": 23,
    "narrator": "Narrated Salama bin Al-Aqwa':",
    "english": "In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet (ﷺ) \nsaid, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" \nHe said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up \nand said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking \nthem)?\" The Prophet (ﷺ) said, \"Yes, you can do either.'",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ لَمَّا أَمْسَوْا يَوْمَ فَتَحُوا خَيْبَرَ أَوْقَدُوا النِّيرَانَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى مَا أَوْقَدْتُمْ هَذِهِ النِّيرَانَ ‏\"‏‏.‏ قَالُوا لُحُومِ الْحُمُرِ الإِنْسِيَّةِ‏.‏ قَالَ ‏\"‏ أَهْرِيقُوا مَا فِيهَا، وَاكْسِرُوا قُدُورَهَا ‏\"‏‏.‏ فَقَامَ رَجُلٌ مِنَ الْقَوْمِ فَقَالَ نُهَرِيقُ مَا فِيهَا وَنَغْسِلُهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْ ذَاكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5497In-book reference : Book 72, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 405   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5498,
    "id": 5498,
    "url": "https://sunnah.com/bukhari:5498",
    "bookNumber": 72,
    "hadithNumber": 24,
    "narrator": "Narrated Rafi` bin Khadij:",
    "english": "We were with the Prophet (ﷺ) in Dhul-Hulaifa and there the people were struck with severe hunger. Then \nwe got camels and sheep as war booty (and slaughtered them). The Prophet (ﷺ) was behind all the people. \nThe people hurried and fixed the cooking pots (for cooking) but the Prophet (ﷺ) came there and ordered \nthat the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as \nequal to one camel. One of the camels ran away and there were a few horses with the people. They \nchased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. \nThe Prophet (ﷺ) said, \"Among these animals some are as wild as wild beasts, so if one of them runs away \nfrom you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the \nenemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet (ﷺ) said, \"If the \nkilling tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). \nBut do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the \nknife of Ethiopians.\"",
    "arabic": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ، فَأَصَابَ النَّاسَ جُوعٌ، فَأَصَبْنَا إِبِلاً وَغَنَمًا، وَكَانَ النَّبِيُّ صلى الله عليه وسلم فِي أُخْرَيَاتِ النَّاسِ، فَعَجِلُوا فَنَصَبُوا الْقُدُورَ، فَدُفِعَ إِلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم فَأَمَرَ بِالْقُدُورِ فَأُكْفِئَتْ، ثُمَّ قَسَمَ فَعَدَلَ عَشَرَةً مِنَ الْغَنَمِ بِبَعِيرٍ، فَنَدَّ مِنْهَا بَعِيرٌ، وَكَانَ فِي الْقَوْمِ خَيْلٌ يَسِيرَةٌ فَطَلَبُوهُ فَأَعْيَاهُمْ، فَأَهْوَى إِلَيْهِ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، فَمَا نَدَّ عَلَيْكُمْ فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ قَالَ وَقَالَ جَدِّي إِنَّا لَنَرْجُو ـ أَوْ نَخَافُ ـ أَنْ نَلْقَى الْعَدُوَّ غَدًا، وَلَيْسَ مَعَنَا مُدًى، أَفَنَذْبَحُ بِالْقَصَبِ فَقَالَ ‏\"‏ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلْ، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُخْبِرُكُمْ عَنْهُ، أَمَّا السِّنُّ عَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5498In-book reference : Book 72, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 406   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5499,
    "id": 5499,
    "url": "https://sunnah.com/bukhari:5499",
    "bookNumber": 72,
    "hadithNumber": 25,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said that he met Zaid bin `Amr Nufail at a place near Baldah and this had happened \nbefore Allah's Messenger (ﷺ) received the Divine Inspiration. Allah's Messenger (ﷺ) presented a dish of meat (that \nhad been offered to him by the pagans) to Zaid bin `Amr, but Zaid refused to eat of it and then said (to \nthe pagans), \"I do not eat of what you slaughter on your stonealtars (Ansabs) nor do I eat except that \non which Allah's Name has been mentioned on slaughtering.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ ـ يَعْنِي ابْنَ الْمُخْتَارِ ـ أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ، يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ لَقِيَ زَيْدَ بْنَ عَمْرِو بْنِ نُفَيْلٍ بِأَسْفَلِ بَلْدَحٍ، وَذَاكَ قَبْلَ أَنْ يُنْزَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الْوَحْىُ، فَقَدَّمَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم سُفْرَةً فِيهَا لَحْمٌ، فَأَبَى أَنْ يَأْكُلَ مِنْهَا، ثُمَّ قَالَ إِنِّي لاَ آكُلُ مِمَّا تَذْبَحُونَ عَلَى أَنْصَابِكُمْ، وَلاَ آكُلُ إِلاَّ مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5499In-book reference : Book 72, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 407   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5500,
    "id": 5500,
    "url": "https://sunnah.com/bukhari:5500",
    "bookNumber": 72,
    "hadithNumber": 26,
    "narrator": "Narrated Jundub bin Sufyan Al-Bajali:",
    "english": "Once during the lifetime of Allah's Messenger (ﷺ) we offered some animals as sacrifices. Some people \nslaughtered their sacrifices before the (Id) prayer, so when the Prophet (ﷺ) finished his prayer, he saw that \nthey had slaughtered their sacrifices before the prayer. He said, \"Whoever has slaughtered (his \nsacrifice) before the prayer, should slaughter (another sacrifice) in lieu of it; and whoever has not yet \nslaughtered it till we have prayed; should slaughter (it) by mentioning Allah's Name.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ جُنْدَبِ بْنِ سُفْيَانَ الْبَجَلِيِّ، قَالَ ضَحَّيْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أُضْحِيَّةً ذَاتَ يَوْمٍ فَإِذَا أُنَاسٌ قَدْ ذَبَحُوا ضَحَايَاهُمْ قَبْلَ الصَّلاَةِ فَلَمَّا انْصَرَفَ رَآهُمُ النَّبِيُّ صلى الله عليه وسلم أَنَّهُمْ قَدْ ذَبَحُوا قَبْلَ الصَّلاَةِ فَقَالَ ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيَذْبَحْ مَكَانَهَا أُخْرَى، وَمَنْ كَانَ لَمْ يَذْبَحْ حَتَّى صَلَّيْنَا فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5500In-book reference : Book 72, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 67, Hadith 408   (deprecated numbering scheme)"
  }
]