[
  {
    "hadithGlobalNumber": 5301,
    "id": 5301,
    "url": "https://sunnah.com/bukhari:5301",
    "bookNumber": 68,
    "hadithNumber": 50,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
    "english": "(a companion of Allah's Messenger (ﷺ)) Allah's Messenger (ﷺ), holding out his middle and index fingers, said, \"My \nadvent and the Hour's are like this (or like these),\" namely, the period between his era and the Hour is \nlike the distance between those two fingers, i.e., very short.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ أَبُو حَازِمٍ سَمِعْتُهُ مِنْ، سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَذِهِ مِنْ هَذِهِ أَوْ كَهَاتَيْنِ ‏\"‏‏.‏ وَقَرَنَ بَيْنَ السَّبَّابَةِ وَالْوُسْطَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5301In-book reference : Book 68, Hadith 50USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5302,
    "id": 5302,
    "url": "https://sunnah.com/bukhari:5302",
    "bookNumber": 68,
    "hadithNumber": 51,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (holding out his ten fingers thrice), said, \"The month is thus and thus and thus,\" namely \nthirty days. Then (holding out his ten fingers twice and then nine fingers), he said, \"It may be thus and \nthus and thus,\" namely twenty nine days. He meant once thirty days and once twenty nine days.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي ثَلاَثِينَ، ثُمَّ قَالَ ‏\"‏ وَهَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي تِسْعًا وَعِشْرِينَ يَقُولُ، مَرَّةً ثَلاَثِينَ وَمَرَّةً تِسْعًا وَعِشْرِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5302In-book reference : Book 68, Hadith 51USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5303,
    "id": 5303,
    "url": "https://sunnah.com/bukhari:5303",
    "bookNumber": 68,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Masud:",
    "english": "The Prophet (ﷺ) pointed with his hand towards Yemen and said twice, \"Faith is there,\" and then pointed \ntowards the East, and said, \"Verily, sternness and mercilessness are the qualities of those who are busy \nwith their camels and pay no attention to their religion, where the two sides of the head of Satan will \nappear,\" namely, the tribes of Rabl'a and Muqar.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ وَأَشَارَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ نَحْوَ الْيَمَنِ ‏\n\"‏ الإِيمَانُ هَا هُنَا ـ مَرَّتَيْنِ ـ أَلاَ وَإِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5303In-book reference : Book 68, Hadith 52USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5304,
    "id": 5304,
    "url": "https://sunnah.com/bukhari:5304",
    "bookNumber": 68,
    "hadithNumber": 53,
    "narrator": "Narrated Sahl:",
    "english": "Allah's Messenger (ﷺ) said, \"I and the one who looks after an orphan will be like this in Paradise,\" showing \nhis middle and index fingers and separating them.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ هَكَذَا ‏\"‏‏.‏ وَأَشَارَ بِالسَّبَّابَةِ وَالْوُسْطَى، وَفَرَّجَ بَيْنَهُمَا شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5304In-book reference : Book 68, Hadith 53USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5305,
    "id": 5305,
    "url": "https://sunnah.com/bukhari:5305",
    "bookNumber": 68,
    "hadithNumber": 54,
    "narrator": "Narrated Abu Huraira:",
    "english": "A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! A black child has been born for me.\" The \nProphet asked him, \"Have you got camels?\" The man said, \"Yes.\" The Prophet (ﷺ) asked him, \"What \ncolor are they?\" The man replied, \"Red.\" The Prophet (ﷺ) said, \"Is there a grey one among them?' The \nman replied, \"Yes.\" The Prophet (ﷺ) said, \"Whence comes that?\" He said, \"May be it is because of \nheredity.\" The Prophet (ﷺ) said, \"May be your latest son has this color because of heredity.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ وُلِدَ لِي غُلاَمٌ أَسْوَدُ‏.‏ فَقَالَ ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ مَا أَلْوَانُهَا ‏\"‏‏.‏ قَالَ حُمْرٌ‏.‏ قَالَ ‏\"‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَأَنَّى ذَلِكَ ‏\"‏‏.‏ قَالَ لَعَلَّهُ نَزَعَهُ عِرْقٌ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ ابْنَكَ هَذَا نَزَعَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5305In-book reference : Book 68, Hadith 54USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5306,
    "id": 5306,
    "url": "https://sunnah.com/bukhari:5306",
    "bookNumber": 68,
    "hadithNumber": 55,
    "narrator": "Narrated `Abdullah:",
    "english": "An Ansari man accused his wife (of committing illegal sexual intercourse). The Prophet (ﷺ) made both of \nthem takes the oath of Lian, and separated them from each other (by divorce).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلُ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَجُلاً مِنَ الأَنْصَارِ قَذَفَ امْرَأَتَهُ فَأَحْلَفَهُمَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ فَرَّقَ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5306In-book reference : Book 68, Hadith 55USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5307,
    "id": 5307,
    "url": "https://sunnah.com/bukhari:5307",
    "bookNumber": 68,
    "hadithNumber": 56,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Hilal bin Umaiyya accused his wife of illegal sexual intercourse and came to the Prophet (ﷺ) to bear \nwitness (against her), (taking the oath of Lian). The Prophet (ﷺ) was saying, \"Allah knows that either of \nyou is a liar. Will anyone of you repent (to Allah)?\" Then the lady got up and gave her witness.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامِ بْنِ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ، فَجَاءَ فَشَهِدَ وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثُمَّ قَامَتْ فَشَهِدَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5307In-book reference : Book 68, Hadith 56USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5308,
    "id": 5308,
    "url": "https://sunnah.com/bukhari:5308",
    "bookNumber": 68,
    "hadithNumber": 57,
    "narrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
    "english": "'Uwaimir Al-Ajlani came to `Asim bin Ad Al-Ansari and said to him, \"O `Asim! Suppose a man saw \nanother man with his wife, would he kill him whereupon you would kill him; or what should he do? \nPlease, O `Asim, ask about this on my behalf.\" `Asim asked Allah's Messenger (ﷺ) about it. Allah's Messenger (ﷺ), \ndisliked that question and considered it disgraceful. What `Asim heard from Allah's Messenger (ﷺ) was hard \non him. When `Asim returned to his family, 'Uwaimir came to him and said, \"O `Asim! What did \nAllah's Messenger (ﷺ). say to you?\" `Asim said to 'Uwaimir, \"You never bring me any good. Allah's Messenger (ﷺ) \ndisliked the problem which I asked him about.\" 'Uwaimir said, \"By Allah, I will not give up this \nmatter until I ask the Prophet (ﷺ) about it.\" So 'Uwaimir proceeded till he came to Allah's Messenger (ﷺ) in the \nmidst of people, and said, \"O Allah's Messenger (ﷺ)! If a man sees another man with his wife, would he kill \nhim, whereupon you would kill him, or what should he do?\" Allah's Messenger (ﷺ) said, \"Allah has revealed \nsome decree as regards you and your wives case. Go and bring her.\" So they carried out the process of \nLian while I was present among the people with Allah's Messenger (ﷺ). When they had finished their Lian, \n'Uwaimir said, \"O Allah's Messenger (ﷺ)! If I should now keep her with me as a wife, then I have told a lie.\" \nSo he divorced her thrice before Allah's Messenger (ﷺ) ordered him. (Ibn Shihab said: So divorce was the \ntradition for all those who were involved in a case of Lian.)",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ يَا عَاصِمُ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ، أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ عَنْ ذَلِكَ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا، حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ، قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا‏.‏ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ أُنْزِلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏\"‏‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا مِنْ تَلاَعُنِهِمَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5308In-book reference : Book 68, Hadith 57USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5309,
    "id": 5309,
    "url": "https://sunnah.com/bukhari:5309",
    "bookNumber": 68,
    "hadithNumber": 58,
    "narrator": "Narrated Ibn Juraij:",
    "english": "Ibn Shihab informed me of Lian and the tradition related to it, referring to the narration of Sahl bin \nSa`d, the brother of Bani Sa`idi He said, \"An Ansari man came to Allah's Messenger (ﷺ) and said, 'O Allah's \nApostle! If a man saw another man with his wife, should he kill him, or what should he do?' So Allah \nrevealed concerning his affair what is mentioned in the Holy Qur'an about the affair of those involved \nin a case of Lian. The Prophet (ﷺ) said, 'Allah has given His verdict regarding you and your wife.' So they \ncarried out Lian in the mosque while I was present there. When they had finished, the man said, \"O \nAllah's Messenger (ﷺ)! If I should now keep her with me as a wife then I have told a lie about her. Then he \ndivorced her thrice before Allah's Messenger (ﷺ) ordered him, when they had finished the Lian process. So \nhe divorced her in front of the Prophet (ﷺ) .\" Ibn Shihab added, \"After their case, it became a tradition that \na couple involved in a case of Lian should be separated by divorce. That lady was pregnant then, and \nlater on her son was called by his mother's name. The tradition concerning their inheritance was that \nshe would be his heir and he would inherit of her property the share Allah had prescribed for him.\" \nIbn Shihab said that Sahl bin Sa`d As'Saidi said that the Prophet (ﷺ) said (in the above narration), \"If that \nlady delivers a small red child like a lizard, then the lady has spoken the truth and the man was a liar, \nbut if she delivers a child with black eyes and huge lips, then her husband has spoken the truth.\" Then \nshe delivered it in the shape one would dislike (as it proved her guilty).",
    "arabic": "حَدَّثَنَا يَحْيَى، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُلاَعَنَةِ، وَعَنِ السُّنَّةِ، فِيهَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ أَمْ كَيْفَ يَفْعَلُ فَأَنْزَلَ اللَّهُ فِي شَأْنِهِ مَا ذَكَرَ فِي الْقُرْآنِ مِنْ أَمْرِ الْمُتَلاَعِنَيْنِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ قَضَى اللَّهُ فِيكَ وَفِي امْرَأَتِكَ ‏\"‏‏.‏ قَالَ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ، فَلَمَّا فَرَغَا قَالَ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ فَرَغَا مِنَ التَّلاَعُنِ، فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ذَاكَ تَفْرِيقٌ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ قَالَ ابْنُ شِهَابٍ فَكَانَتِ السُّنَّةُ بَعْدَهُمَا أَنْ يُفَرَّقَ بَيْنَ الْمُتَلاَعِنَيْنِ، وَكَانَتْ حَامِلاً، وَكَانَ ابْنُهَا يُدْعَى لأُمِّهِ، قَالَ ثُمَّ جَرَتِ السُّنَّةُ فِي مِيرَاثِهَا أَنَّهَا تَرِثُهُ وَيَرِثُ مِنْهَا مَا فَرَضَ اللَّهُ لَهُ‏.‏ قَالَ ابْنُ جُرَيْجٍ عَنِ ابْنِ شِهَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ فِي هَذَا الْحَدِيثِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ جَاءَتْ بِهِ أَحْمَرَ قَصِيرًا كَأَنَّهُ وَحَرَةٌ، فَلاَ أُرَاهَا إِلاَّ قَدْ صَدَقَتْ وَكَذَبَ عَلَيْهَا، وَإِنْ جَاءَتْ بِهِ أَسْوَدَ أَعْيَنَ ذَا أَلْيَتَيْنِ، فَلاَ أُرَاهُ إِلاَّ قَدْ صَدَقَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى الْمَكْرُوهِ مِنْ ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5309In-book reference : Book 68, Hadith 58USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5310,
    "id": 5310,
    "url": "https://sunnah.com/bukhari:5310",
    "bookNumber": 68,
    "hadithNumber": 59,
    "narrator": "Narrated Al-Qasim bin Muhammad:",
    "english": "Ibn `Abbas; said, \"Once Lian was mentioned before the Prophet (ﷺ) whereupon `Asim bin Adi said \nsomething and went away. Then a man from his tribe came to him, complaining that he had found a \nman with his wife. `Asim said, 'I have not been put to task except for my statement (about Lian).' \n`Asim took the man to the Prophet (ﷺ) and the man told him of the state in which he had found his wife. \nThe man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his \nwife, was brown, fat and had much flesh on his calves. The Prophet (ﷺ) invoked, saying, 'O Allah! Reveal \nthe truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had \nfound her with. The Prophet (ﷺ) then made them carry out Lian.\" Then a man from that gathering asked \nIbn `Abbas, \"Was she the same lady regarding which the Prophet (ﷺ) had said, 'If I were to stone to death \nsomeone without witness, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another \nlady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ ذُكِرَ التَّلاَعُنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ، فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي، فَذَهَبَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَهُ عِنْدَ أَهْلِهِ خَدْلاً آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَجَاءَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ، فَلاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا‏.‏ قَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ قَالَ أَبُو صَالِحٍ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ خَدِلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5310In-book reference : Book 68, Hadith 59USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5311,
    "id": 5311,
    "url": "https://sunnah.com/bukhari:5311",
    "bookNumber": 68,
    "hadithNumber": 60,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "I asked Ibn `Umar, \"(What is the verdict if) a man accuses his wife of illegal sexual intercourse?\" Ibn \n`Umar said, \"The Prophet (ﷺ) separated (by divorce) the couple of Bani Al-Ajlan, and said, (to them), \n'Allah knows that one of you two is a liar; so will one of you repent?' But both of them refused. He \nagain said, 'Allah knows that one of you two is a liar; so will one of you repent?' But both of them \nrefused. So he separated them by divorce.\" (Aiyub, a sub-narrator said: `Amr bin Dinar said to me, \n\"There is something else in this Hadith which you have not mentioned. It goes thus: The man said, \n'What about my money (i.e. the Mahr that I have given to my wife)?' It was said, 'You have no right to \nrestore any money, for if you have spoken the truth (as regards the accusation), you have also \nconsummated your marriage with her; and if you have told a lie, you are less rightful to have your \nmoney back.' \")",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ فَقَالَ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا‏.‏ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبُ ‏\"‏‏.‏ فَأَبَيَا‏.‏ فَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏ فَأَبَيَا فَفَرَّقَ بَيْنَهُمَا‏.‏ قَالَ أَيُّوبُ فَقَالَ لِي عَمْرُو بْنُ دِينَارٍ إِنَّ فِي الْحَدِيثِ شَيْئًا لاَ أَرَاكَ تُحَدِّثُهُ قَالَ قَالَ الرَّجُلُ مَالِي قَالَ قِيلَ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا، وَإِنْ كُنْتَ كَاذِبًا فَهْوَ أَبْعَدُ مِنْكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5311In-book reference : Book 68, Hadith 60USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5312,
    "id": 5312,
    "url": "https://sunnah.com/bukhari:5312",
    "bookNumber": 68,
    "hadithNumber": 61,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "I asked Ibn `Umar about those who were involved in a case of Lien. He said, \"The Prophet (ﷺ) said to \nthose who were involved in a case of Lien, 'Your accounts are with Allah. One of you two is a liar, \nand you (the husband) have no right over her (she is divorced).\" The man said, 'What about my \nproperty (Mahr) ?' The Prophet (ﷺ) said, 'You have no right to get back your property. If you have told the \ntruth about her then your property was for the consummation of your marriage with her; and if you \ntold a lie about her, then you are less rightful to get your property back.' \" Sufyan, a sub-narrator said: \nI learned the Hadith from `Amr. Narrated Aiyub: I heard Sa`id bin Jubair saying, \"I asked Ibn `Umar, \n'If a man (accuses his wife for an illegal sexual intercourse and) carries out the process of Lian (what \nwill happen)?' Ibn `Umar set two of his fingers apart. (Sufyan set his index finger and middle finger \napart.) Ibn `Umar said, 'The Prophet (ﷺ) separated the couple of Bani Al-Ajlan by divorce and said thrice, \n\"Allah knows that one of you two is a liar; so will one of you repent (to Allah)?' \"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ الْمُتَلاَعِنَيْنِ،، فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ، لاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏‏.‏ قَالَ مَالِي قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا، فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا، وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا، فَذَاكَ أَبْعَدُ لَكَ ‏\"‏‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو‏.‏ وَقَالَ أَيُّوبُ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ لاَعَنَ امْرَأَتَهُ فَقَالَ بِإِصْبَعَيْهِ ـ وَفَرَّقَ سُفْيَانُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى ـ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ إِنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو وَأَيُّوبَ كَمَا أَخْبَرْتُكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5312In-book reference : Book 68, Hadith 61USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5313,
    "id": 5313,
    "url": "https://sunnah.com/bukhari:5313",
    "bookNumber": 68,
    "hadithNumber": 62,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) separated (divorced) the wife from her husband who accused her for an illegal sexual \nintercourse, and made them take the oath of Lian .",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَّقَ بَيْنَ رَجُلٍ وَامْرَأَةٍ قَذَفَهَا، وَأَحْلَفَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5313In-book reference : Book 68, Hadith 62USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 233   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5314,
    "id": 5314,
    "url": "https://sunnah.com/bukhari:5314",
    "bookNumber": 68,
    "hadithNumber": 63,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) made an Ansari man and his wife carry out Lian, and then separated them by divorce.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ رَجُلٍ وَامْرَأَةٍ مِنَ الأَنْصَارِ، وَفَرَّقَ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5314In-book reference : Book 68, Hadith 63USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5315,
    "id": 5315,
    "url": "https://sunnah.com/bukhari:5315",
    "bookNumber": 68,
    "hadithNumber": 64,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) made a man and his wife carry out Lian, and the husband repudiated her child. So the \nProphet got them separated (by divorce) and decided that the child belonged to the mother only.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لاَعَنَ بَيْنَ رَجُلٍ وَامْرَأَتِهِ، فَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5315In-book reference : Book 68, Hadith 64USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5316,
    "id": 5316,
    "url": "https://sunnah.com/bukhari:5316",
    "bookNumber": 68,
    "hadithNumber": 65,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Those involved in a case of Lian were mentioned before Allah's Messenger (ﷺ) `Asim bin Adi said \nsomething about that and then left. Later on a man from his tribe came to him and told him that he had \nfound another man with his wife. On that `Asim said, \"I have not been put to task except for what I \nhave said (about Lian).\" `Asim took the man to Allah's Messenger (ﷺ) and he told him of the state in which \nhe found his wife. The man was pale, thin and lank-haired, while the other man whom he had found \nwith his wife was brown, fat with thick calves and curly hair. Allah's Messenger (ﷺ) said, \"O Allah! Reveal \nthe truth.\" Then the lady delivered a child resembling the man whom her husband had mentioned he \nhad found with her. So Allah's Messenger (ﷺ) ordered them to carry out Lien. A man from that gathering said \nto Ibn `Abbas, \"Was she the same lady regarding whom Allah's Messenger (ﷺ) said, 'If I were to stone to \ndeath someone without witnesses, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was \nanother lady who, though being a Muslim, used to arouse suspicion because of her outright \nmisbehavior.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ، فَذَكَرَ لَهُ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا الأَمْرِ إِلاَّ لِقَوْلِي‏.‏ فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ، وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي وَجَدَ عِنْدَ أَهْلِهِ آدَمَ خَدْلاً كَثِيرَ اللَّحْمِ جَعْدًا قَطَطًا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَ عِنْدَهَا، فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا، فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ لَرَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ السُّوءَ فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5316In-book reference : Book 68, Hadith 65USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5317,
    "id": 5317,
    "url": "https://sunnah.com/bukhari:5317",
    "bookNumber": 68,
    "hadithNumber": 66,
    "narrator": "Narrated `Aisha:",
    "english": "Rifa`a Al-Qurazi married a lady and then divorced her whereupon she married another man. She came \nto the Prophet (ﷺ) and said that her new husband did not approach her, and that he was completely \nimpotent. The Prophet (ﷺ) said (to her), \"No (you cannot remarry your first husband) till you taste the \nsecond husband and he tastes you (i.e. till he consummates his marriage with you).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رِفَاعَةَ، الْقُرَظِيَّ تَزَوَّجَ امْرَأَةً، ثُمَّ طَلَّقَهَا فَتَزَوَّجَتْ آخَرَ فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَتْ لَهُ أَنَّهُ لاَ يَأْتِيهَا، وَإِنَّهُ لَيْسَ مَعَهُ إِلاَّ مِثْلُ هُدْبَةٍ فَقَالَ ‏\n\"‏ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5317In-book reference : Book 68, Hadith 66USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5318,
    "id": 5318,
    "url": "https://sunnah.com/bukhari:5318",
    "bookNumber": 68,
    "hadithNumber": 67,
    "narrator": "Narrated Um Salama:",
    "english": "(the wife of the Prophet) A lady from Bani Aslam, called Subai'a, become a widow while she was \npregnant. Abu As-Sanabil bin Ba'kak demanded her hand in marriage, but she refused to marry him \nand said, \"By Allah, I cannot marry him unless I have completed one of the two prescribed periods.\" \nAbout ten days later (after having delivered her child), she went to the Prophet (ﷺ) and he said (to her), \n\"You can marry now.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الأَعْرَجِ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً مِنْ أَسْلَمَ يُقَالُ لَهَا سُبَيْعَةُ كَانَتْ تَحْتَ زَوْجِهَا، تُوُفِّيَ عَنْهَا وَهْىَ حُبْلَى، فَخَطَبَهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ، فَأَبَتْ أَنْ تَنْكِحَهُ، فَقَالَ وَاللَّهِ مَا يَصْلُحُ أَنْ تَنْكِحِيهِ حَتَّى تَعْتَدِّي آخِرَ الأَجَلَيْنِ‏.‏ فَمَكُثَتْ قَرِيبًا مِنْ عَشْرِ لَيَالٍ ثُمَّ جَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ انْكِحِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5318In-book reference : Book 68, Hadith 67USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5319,
    "id": 5319,
    "url": "https://sunnah.com/bukhari:5319",
    "bookNumber": 68,
    "hadithNumber": 68,
    "narrator": "Narrated `Abdullah bin `Abdullah:",
    "english": "that his father had written to Ibn Al-Arqam a letter asking him to ask Subai'a Al-Aslamiya how the \nProphet had given her the verdict. She said, \"The Prophet, gave me his verdict that after I gave birth, I \ncould marry.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، كَتَبَ إِلَيْهِ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَتَبَ إِلَى ابْنِ الأَرْقَمِ أَنْ يَسْأَلَ، سُبَيْعَةَ الأَسْلَمِيَّةَ كَيْفَ أَفْتَاهَا النَّبِيُّ صلى الله عليه وسلم فَقَالَتْ أَفْتَانِي إِذَا وَضَعْتُ أَنْ أَنْكِحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5319In-book reference : Book 68, Hadith 68USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5320,
    "id": 5320,
    "url": "https://sunnah.com/bukhari:5320",
    "bookNumber": 68,
    "hadithNumber": 69,
    "narrator": "Narrated Al-Miswer bin Makhrama:",
    "english": "Subai'a Al-Aslamiya gave birth to a child a few days after the death of her husband. She came to the \nProphet and asked permission to remarry, and the Prophet (ﷺ) gave her permission, and she got married.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ، نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا، بِلَيَالٍ فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَاسْتَأْذَنَتْهُ أَنْ تَنْكِحَ، فَأَذِنَ لَهَا، فَنَكَحَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5320In-book reference : Book 68, Hadith 69USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5321,
    "id": 5321,
    "url": "https://sunnah.com/bukhari:5321",
    "bookNumber": 68,
    "hadithNumber": 70,
    "narrator": "Narrated Qasim bin Muhammad and Sulaiman bin Yasar:",
    "english": "that Yahya bin Sa`id bin Al-`As divorced the daughter of `Abdur-Rahman bin Al-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to Marwan bin Al-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-Rahman bin Al-Hakam did not obey me (or had a convincing \nargument).\" (In Al-Qasim's versions Marwan said, \"Have you not heard of the case of Fatima bint \nQais?\" Aisha said, \"The case of Fatima bint Qais is not in your favor.' Marwan bin Al-Hakam said to \n`Aisha, \"The reason that made Fatima bint Qais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّ يَحْيَى بْنَ سَعِيدِ بْنِ الْعَاصِ، طَلَّقَ بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ، فَانْتَقَلَهَا عَبْدُ الرَّحْمَنِ، فَأَرْسَلَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ إِلَى مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ اتَّقِ اللَّهَ وَارْدُدْهَا إِلَى بَيْتِهَا‏.‏ قَالَ مَرْوَانُ فِي حَدِيثِ سُلَيْمَانَ إِنَّ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ غَلَبَنِي‏.‏ وَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ أَوَمَا بَلَغَكِ شَأْنُ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ لاَ يَضُرُّكَ أَنْ لاَ تَذْكُرَ حَدِيثَ فَاطِمَةَ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ إِنْ كَانَ بِكِ شَرٌّ فَحَسْبُكِ مَا بَيْنَ هَذَيْنِ مِنَ الشَّرِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5321, 5322In-book reference : Book 68, Hadith 70USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5322,
    "id": 5322,
    "url": "https://sunnah.com/bukhari:5322",
    "bookNumber": 68,
    "hadithNumber": 70,
    "narrator": "Narrated Qasim bin Muhammad and Sulaiman bin Yasar:",
    "english": "that Yahya bin Sa`id bin Al-`As divorced the daughter of `Abdur-Rahman bin Al-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to Marwan bin Al-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-Rahman bin Al-Hakam did not obey me (or had a convincing \nargument).\" (In Al-Qasim's versions Marwan said, \"Have you not heard of the case of Fatima bint \nQais?\" Aisha said, \"The case of Fatima bint Qais is not in your favor.' Marwan bin Al-Hakam said to \n`Aisha, \"The reason that made Fatima bint Qais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّ يَحْيَى بْنَ سَعِيدِ بْنِ الْعَاصِ، طَلَّقَ بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ، فَانْتَقَلَهَا عَبْدُ الرَّحْمَنِ، فَأَرْسَلَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ إِلَى مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ اتَّقِ اللَّهَ وَارْدُدْهَا إِلَى بَيْتِهَا‏.‏ قَالَ مَرْوَانُ فِي حَدِيثِ سُلَيْمَانَ إِنَّ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ غَلَبَنِي‏.‏ وَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ أَوَمَا بَلَغَكِ شَأْنُ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ لاَ يَضُرُّكَ أَنْ لاَ تَذْكُرَ حَدِيثَ فَاطِمَةَ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ إِنْ كَانَ بِكِ شَرٌّ فَحَسْبُكِ مَا بَيْنَ هَذَيْنِ مِنَ الشَّرِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5321, 5322In-book reference : Book 68, Hadith 70USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5323,
    "id": 5323,
    "url": "https://sunnah.com/bukhari:5323",
    "bookNumber": 68,
    "hadithNumber": 71,
    "narrator": "Narrated Al-Qasim:",
    "english": "Aisha said, \"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady \nis not entitled to be provided with residence and sustenance (by her husband).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا لِفَاطِمَةَ أَلاَ تَتَّقِي اللَّهَ، يَعْنِي فِي قَوْلِهَا لاَ سُكْنَى وَلاَ نَفَقَةَ",
    "reference": "Reference : Sahih al-Bukhari 5323, 5324In-book reference : Book 68, Hadith 71USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5324,
    "id": 5324,
    "url": "https://sunnah.com/bukhari:5324",
    "bookNumber": 68,
    "hadithNumber": 71,
    "narrator": "Narrated Al-Qasim:",
    "english": "Aisha said, \"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady \nis not entitled to be provided with residence and sustenance (by her husband).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا لِفَاطِمَةَ أَلاَ تَتَّقِي اللَّهَ، يَعْنِي فِي قَوْلِهَا لاَ سُكْنَى وَلاَ نَفَقَةَ",
    "reference": "Reference : Sahih al-Bukhari 5323, 5324In-book reference : Book 68, Hadith 71USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5325,
    "id": 5325,
    "url": "https://sunnah.com/bukhari:5325",
    "bookNumber": 68,
    "hadithNumber": 72,
    "narrator": "Narrated Qasim:",
    "english": "Urwa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her \nirrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Urwa \nsaid (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to \nmention.\" 'Urwa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, \nand she was prone to danger, so the Prophet (ﷺ) \nallowed her (to go out of her husband's house).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ أَلَمْ تَرَيْنَ إِلَى فُلاَنَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَرَجَتْ‏.‏ فَقَالَتْ بِئْسَ مَا صَنَعَتْ‏.‏ قَالَ أَلَمْ تَسْمَعِي فِي قَوْلِ فَاطِمَةَ قَالَتْ أَمَا إِنَّهُ لَيْسَ لَهَا خَيْرٌ فِي ذِكْرِ هَذَا الْحَدِيثِ‏.‏   \nوَزَادَ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَابَتْ عَائِشَةُ أَشَدَّ الْعَيْبِ وَقَالَتْ إِنَّ فَاطِمَةَ كَانَتْ فِي مَكَانٍ وَحِشٍ فَخِيفَ عَلَى نَاحِيَتِهَا، فَلِذَلِكَ أَرْخَصَ لَهَا النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5325, 5326In-book reference : Book 68, Hadith 72USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5326,
    "id": 5326,
    "url": "https://sunnah.com/bukhari:5326",
    "bookNumber": 68,
    "hadithNumber": 72,
    "narrator": "Narrated Qasim:",
    "english": "Urwa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her \nirrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Urwa \nsaid (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to \nmention.\" 'Urwa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, \nand she was prone to danger, so the Prophet (ﷺ) \nallowed her (to go out of her husband's house).",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ أَلَمْ تَرَيْنَ إِلَى فُلاَنَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَرَجَتْ‏.‏ فَقَالَتْ بِئْسَ مَا صَنَعَتْ‏.‏ قَالَ أَلَمْ تَسْمَعِي فِي قَوْلِ فَاطِمَةَ قَالَتْ أَمَا إِنَّهُ لَيْسَ لَهَا خَيْرٌ فِي ذِكْرِ هَذَا الْحَدِيثِ‏.‏   \nوَزَادَ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَابَتْ عَائِشَةُ أَشَدَّ الْعَيْبِ وَقَالَتْ إِنَّ فَاطِمَةَ كَانَتْ فِي مَكَانٍ وَحِشٍ فَخِيفَ عَلَى نَاحِيَتِهَا، فَلِذَلِكَ أَرْخَصَ لَهَا النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5325, 5326In-book reference : Book 68, Hadith 72USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5327,
    "id": 5327,
    "url": "https://sunnah.com/bukhari:5327",
    "bookNumber": 68,
    "hadithNumber": 73,
    "narrator": "Narrated 'Urwa:",
    "english": "Aisha disapproved of what Fatima used to say.'",
    "arabic": "وَحَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5327, 5328In-book reference : Book 68, Hadith 73USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5328,
    "id": 5328,
    "url": "https://sunnah.com/bukhari:5328",
    "bookNumber": 68,
    "hadithNumber": 73,
    "narrator": "Narrated 'Urwa:",
    "english": "Aisha disapproved of what Fatima used to say.'",
    "arabic": "وَحَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5327, 5328In-book reference : Book 68, Hadith 73USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5329,
    "id": 5329,
    "url": "https://sunnah.com/bukhari:5329",
    "bookNumber": 68,
    "hadithNumber": 74,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) decided to leave Mecca after the Hajj, he saw Safiyya, sad and standing at the \nentrance of her tent. He said to her, \"Aqr (or) Halq! You will detain us. Did you perform Tawaf-al- \nIfada on the day of Nahr? She said, \"Yes.\" He said, \"Then you can depart.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا أَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْفِرَ إِذَا صَفِيَّةُ عَلَى باب خِبَائِهَا كَئِيبَةً، فَقَالَ لَهَا ‏\"‏ عَقْرَى ـ أَوْ حَلْقَى ـ إِنَّكِ لَحَابِسَتُنَا أَكُنْتِ أَفَضْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5329In-book reference : Book 68, Hadith 74USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5330,
    "id": 5330,
    "url": "https://sunnah.com/bukhari:5330",
    "bookNumber": 68,
    "hadithNumber": 75,
    "narrator": "Narrated Al-Hasan:",
    "english": "Ma'qil gave his sister in marriage and later her husband divorced her once.",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، قَالَ زَوَّجَ مَعْقِلٌ أُخْتَهُ فَطَلَّقَهَا تَطْلِيقَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5330In-book reference : Book 68, Hadith 75USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5331,
    "id": 5331,
    "url": "https://sunnah.com/bukhari:5331",
    "bookNumber": 68,
    "hadithNumber": 76,
    "narrator": "Narrated Al-Hasan:",
    "english": "The sister of Ma'qil bin Yasar was married to a man and then that man divorced her and remained \naway from her till her period of the 'Iddah expired. Then he demanded for her hand in marriage, but \nMa'qil got angry out of pride and haughtiness and said, \"He kept away from her when he could still \nretain her, and now he demands her hand again?\" So Ma'qil disagreed to remarry her to him. Then \nAllah revealed: 'When you have divorced women and they have fulfilled the term of their prescribed \nperiod, do not prevent them from marrying their (former) husbands.' (2.232) So the Prophet (ﷺ) sent for \nMa'qil and recited to him (Allah's order) and consequently Ma'qil gave up his pride and haughtiness \nand yielded to Allah's order.",
    "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا الْحَسَنُ، أَنَّ مَعْقِلَ بْنَ يَسَارٍ، كَانَتْ أُخْتُهُ تَحْتَ رَجُلٍ فَطَلَّقَهَا، ثُمَّ خَلَّى عَنْهَا حَتَّى انْقَضَتْ عِدَّتُهَا، ثُمَّ خَطَبَهَا فَحَمِيَ مَعْقِلٌ مِنَ ذَلِكَ أَنَفًا فَقَالَ خَلَّى عَنْهَا وَهْوَ يَقْدِرُ عَلَيْهَا، ثُمَّ يَخْطُبُهَا فَحَالَ بَيْنَهُ وَبَيْنَهَا، فَأَنْزَلَ اللَّهُ ‏{‏وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلاَ تَعْضُلُوهُنَّ‏}‏ إِلَى آخِرِ الآيَةِ، فَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَ عَلَيْهِ، فَتَرَكَ الْحَمِيَّةَ وَاسْتَقَادَ لأَمْرِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5331In-book reference : Book 68, Hadith 76USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5332,
    "id": 5332,
    "url": "https://sunnah.com/bukhari:5332",
    "bookNumber": 68,
    "hadithNumber": 77,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar bin Al-Khattab divorced his wife during her menses. Allah's Messenger (ﷺ) ordered him to take \nher back till she became clean, and when she got another period while she was with him, she should \nwait till she became clean again and only then, if he wanted to divorce her, he could do so before \nhaving sexual relations with her. And that is the period Allah has fixed for divorcing women. \nWhenever `Abdullah (bin `Umar) was asked about that, he would say to the questioner, \"If you \ndivorced her thrice, she is no longer lawful for you unless she marries another man (and the other man \ndivorces her in his turn).' Ibn `Umar further said, 'Would that you (people) only give one or two \ndivorces, because the Prophet (ﷺ) has ordered me so.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ طَلَّقَ امْرَأَةً لَهُ وَهْىَ حَائِضٌ تَطْلِيقَةً وَاحِدَةً، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُرَاجِعَهَا، ثُمَّ يُمْسِكَهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ عِنْدَهُ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ مِنْ حَيْضِهَا، فَإِنْ أَرَادَ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا حِينَ تَطْهُرُ مِنْ قَبْلِ أَنْ يُجَامِعَهَا، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ‏.‏ وَكَانَ عَبْدُ اللَّهِ إِذَا سُئِلَ عَنْ ذَلِكَ قَالَ لأَحَدِهِمْ إِنْ كُنْتَ طَلَّقْتَهَا ثَلاَثًا فَقَدْ حَرُمَتْ عَلَيْكَ، حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ‏.‏ وَزَادَ فِيهِ غَيْرُهُ عَنِ اللَّيْثِ حَدَّثَنِي نَافِعٌ قَالَ ابْنُ عُمَرَ لَوْ طَلَّقْتَ مَرَّةً أَوْ مَرَّتَيْنِ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَنِي بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5332In-book reference : Book 68, Hadith 77USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5333,
    "id": 5333,
    "url": "https://sunnah.com/bukhari:5333",
    "bookNumber": 68,
    "hadithNumber": 78,
    "narrator": "Narrated Yunus Ibn Jubair:",
    "english": "Ibn `Umar divorced his wife while she was having her menses. `Umar asked the Prophet (ﷺ) who said, \n\"Order him (your son) to take her back, and then divorced her before her period of the 'Iddah has \nelapsed.\" I asked Ibn `Umar, \"Will that divorce (during the menses) be counted?\" He replied, \"If \nsomebody behaves foolishly (will his foolishness be an excuse for his misbehavior)?\"",
    "arabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، حَدَّثَنِي يُونُسُ بْنُ جُبَيْرٍ، سَأَلْتُ ابْنَ عُمَرَ فَقَالَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَسَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُرَاجِعَهَا، ثُمَّ يُطَلِّقَ مِنْ قُبُلِ عِدَّتِهَا، قُلْتُ فَتَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5333In-book reference : Book 68, Hadith 78USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5334,
    "id": 5334,
    "url": "https://sunnah.com/bukhari:5334",
    "bookNumber": 68,
    "hadithNumber": 79,
    "narrator": "Narrated Humaid bin Nafi`:",
    "english": "Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of \nthe Prophet (ﷺ) when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which \ncontained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it \nand then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard \nAllah's Messenger (ﷺ) saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for \na dead person for more than three days unless he is her husband for whom she should mourn for four \nmonths and ten days.'\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ هَذِهِ الأَحَادِيثَ الثَّلاَثَةَ، قَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ بْنُ حَرْبٍ، فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ أَوْ غَيْرُهُ فَدَهَنَتْ مِنْهُ جَارِيَةً، ثُمَّ مَسَّتْ بِعَارِضَيْهَا، ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5334In-book reference : Book 68, Hadith 79USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5335,
    "id": 5335,
    "url": "https://sunnah.com/bukhari:5335",
    "bookNumber": 68,
    "hadithNumber": 80,
    "narrator": "Zainab further said:",
    "english": "I want to Zainab bint Jahsh when her brother died. She \nasked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have \nheard Allah's Messenger (ﷺ) saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the \nlast day to mourn for more than three days except for her husband for whom she should mourn for \nfour months and ten days.'\"",
    "arabic": "قَالَتْ زَيْنَبُ فَدَخَلْتُ عَلَى زَيْنَبَ ابْنَةِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ مِنْهُ، ثُمَّ قَالَتْ أَمَا وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى الْمِنْبَرِ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5335In-book reference : Book 68, Hadith 80USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5336,
    "id": 5336,
    "url": "https://sunnah.com/bukhari:5336",
    "bookNumber": 68,
    "hadithNumber": 81,
    "narrator": "Zainab further said:",
    "english": "\"I heard my mother, Um Salama saying that a woman came to Allah's Messenger (ﷺ) \nand said, \"O Allah's Messenger (ﷺ)! The husband of my daughter has died and she is suffering from an eye \ndisease, can she apply kohl to her eye?\" Allah's Messenger (ﷺ) replied, \"No,\" twice or thrice. (Every time she \nrepeated her question) he said, \"No.\" Then Allah's Messenger (ﷺ) added, \"It is just a matter of four months \nand ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of \ndung when one year has elapsed.\"",
    "arabic": "قَالَتْ زَيْنَبُ وَسَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنَهَا أَفَتَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا كُلَّ ذَلِكَ يَقُولُ لاَ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5336In-book reference : Book 68, Hadith 81USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5337,
    "id": 5337,
    "url": "https://sunnah.com/bukhari:5337",
    "bookNumber": 68,
    "hadithNumber": 82,
    "narrator": "",
    "english": "I (Humaid) said to Zainab, \"What does 'throwing a globe of dung when one \nyear had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a \nwretched small room and put on the worst clothes she had and would not touch any scent till one year \nhad elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body \nagainst it. The animal against which she would rub her body would scarcely survive. Only then she \nwould come out of her room, whereupon she would be given a globe of dung which she would throw \naway and then she would use the scent she liked or the like.\"",
    "arabic": "قَالَ حُمَيْدٌ فَقُلْتُ لِزَيْنَبَ وَمَا تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ فَقَالَتْ زَيْنَبُ كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا، وَلَبِسَتْ شَرَّ ثِيَابِهَا، وَلَمْ تَمَسَّ طِيبًا حَتَّى تَمُرَّ بِهَا سَنَةٌ، ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَائِرٍ فَتَفْتَضُّ بِهِ، فَقَلَّمَا تَفْتَضُّ بِشَىْءٍ إِلاَّ مَاتَ، ثُمَّ تَخْرُجُ فَتُعْطَى بَعَرَةً فَتَرْمِي، ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ‏.‏ سُئِلَ مَالِكٌ مَا تَفْتَضُّ بِهِ قَالَ تَمْسَحُ بِهِ جِلْدَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5337In-book reference : Book 68, Hadith 82USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5338,
    "id": 5338,
    "url": "https://sunnah.com/bukhari:5338",
    "bookNumber": 68,
    "hadithNumber": 83,
    "narrator": "Narrated Um Salama:",
    "english": "A woman was bereaved of her husband and her relatives worried about \n     her eyes (which were diseased). They came to Allah's Messenger (ﷺ), and \n     asked him to allow them to treat her eyes with kohl, but he said, \"She\n     should not apply kohl to her eyes. (In the Pre-Islamic period of \n     Ignorance) a widowed woman among you would stay in the worst of her \n     clothes (or the worst part of her house) and when a year had elapsed, \n     if a dog passed by her, she would throw a globe of dung, Nay, (she \n     cannot use kohl) till four months and ten days have elapsed.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّهَا، أَنَّ امْرَأَةً، تُوُفِّيَ زَوْجُهَا فَخَشُوا عَلَى عَيْنَيْهَا فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنُوهُ فِي الْكُحْلِ فَقَالَ ‏\n\"‏ لاَ تَكَحَّلْ قَدْ كَانَتْ إِحْدَاكُنَّ تَمْكُثُ فِي شَرِّ أَحْلاَسِهَا أَوْ شَرِّ بَيْتِهَا، فَإِذَا كَانَ حَوْلٌ فَمَرَّ كَلْبٌ رَمَتْ بِبَعَرَةٍ، فَلاَ حَتَّى تَمْضِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5338In-book reference : Book 68, Hadith 83USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5339,
    "id": 5339,
    "url": "https://sunnah.com/bukhari:5339",
    "bookNumber": 68,
    "hadithNumber": 84,
    "narrator": "Narrated Um Habiba:",
    "english": "The Prophet (ﷺ) said, \"It is not lawful for a Muslim \n     woman who believes in Allah and the Last Day to mourn for more than \n     three days, except for her husband, for whom she should mourn for four\n     months and ten days.\"",
    "arabic": "وَسَمِعْتُ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، تُحَدِّثُ عَنْ أُمِّ حَبِيبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ مُسْلِمَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلاَثَةِ أَيَّامٍ، إِلاَّ عَلَى زَوْجِهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5339In-book reference : Book 68, Hadith 84USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5340,
    "id": 5340,
    "url": "https://sunnah.com/bukhari:5340",
    "bookNumber": 68,
    "hadithNumber": 85,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "We were forbidden to mourn for more than three days except for a husband.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَتْ أُمُّ عَطِيَّةَ نُهِينَا أَنْ نُحِدَّ أَكْثَرَ مِنْ ثَلاَثٍ إِلاَّ بِزَوْجٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5340In-book reference : Book 68, Hadith 85USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5341,
    "id": 5341,
    "url": "https://sunnah.com/bukhari:5341",
    "bookNumber": 68,
    "hadithNumber": 86,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "We were forbidden to mourn for more than three days for a dead person, except for a husband, for \nwhom a wife should mourn for four months and ten days (while in the mourning period) we were not \nallowed to put kohl in our eyes, nor perfume our-selves, nor wear dyed clothes, except a garment of \n'Asb (special clothes made in Yemen). But it was permissible for us that when one of us became clean \nfrom her menses and took a bath, she could use a piece of a certain kind of incense. And it was \nforbidden for us to follow funeral processions.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلاَ نَكْتَحِلَ، وَلاَ نَطَّيَّبَ، وَلاَ نَلْبَسَ ثَوْبًا مَصْبُوغًا، إِلاَّ ثَوْبَ عَصْبٍ، وَقَدْ رُخِّصَ لَنَا عِنْدَ الطُّهْرِ إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا فِي نُبْذَةٍ مِنْ كُسْتِ أَظْفَارٍ، وَكُنَّا نُنْهَى عَنِ اتِّبَاعِ الْجَنَائِزِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5341In-book reference : Book 68, Hadith 86USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5342,
    "id": 5342,
    "url": "https://sunnah.com/bukhari:5342",
    "bookNumber": 68,
    "hadithNumber": 87,
    "narrator": "Narrated Um 'Atiyya:",
    "english": "The Prophet (ﷺ) said, \"It is not lawful for a lady who believes in Allah and the Last Day, to mourn for \nmore than three days for a dead person, except for her husband, in which case she should neither put \nkohl in her eyes, nor perfume herself, nor wear dyed clothes, except a garment of 'Asb\"",
    "arabic": "حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ، فَإِنَّهَا لاَ تَكْتَحِلُ وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلاَّ ثَوْبَ عَصْبٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5342In-book reference : Book 68, Hadith 87USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5343,
    "id": 5343,
    "url": "https://sunnah.com/bukhari:5343",
    "bookNumber": 68,
    "hadithNumber": 88,
    "narrator": "Um 'Atiyya \nadded:",
    "english": "The Prophet (ﷺ) said, \"She should not use perfume except when she becomes clean from her \nmenses whereupon she can use Qust, and Azfar (two kinds of incense).",
    "arabic": "وَقَالَ الأَنْصَارِيُّ حَدَّثَنَا هِشَامٌ، حَدَّثَتْنَا حَفْصَةُ، حَدَّثَتْنِي أُمُّ عَطِيَّةَ، نَهَى النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَلاَ تَمَسَّ طِيبًا إِلاَّ أَدْنَى طُهْرِهَا إِذَا طَهُرَتْ، نُبْذَةً مِنْ قُسْطٍ وَأَظْفَارٍ ‏\"‏‏.‏\nقَالَ أَبُو عَبْد اللَّهِ الْقُسْطُ وَالْكُسْتُ مِثْلُ الْكَافُورِ وَالْقَافُورِ",
    "reference": "Reference : Sahih al-Bukhari 5343In-book reference : Book 68, Hadith 88USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5344,
    "id": 5344,
    "url": "https://sunnah.com/bukhari:5344",
    "bookNumber": 68,
    "hadithNumber": 89,
    "narrator": "Narrated Mujahid:",
    "english": "(regarding the Verse): 'If any of you dies and leaves wives behind,' That was the period of the 'Iddah \nwhich the widow was obliged to spend in the house of the late husband. Then Allah revealed: And \nthose of you who die and leave wives should bequeath for their wives a year's maintenance and \nresidence without turning them out, but if they leave, there is no blame on you for what they do of \nthemselves, provided it is honorable (i.e. lawful marriage) (2.240) Mujahid said: Allah has ordered \nthat a widow has the right to stay for seven months and twenty days with her husband's relatives \nthrough her husband's will and testament so that she will complete the period of one year (of 'Iddah). \nBut the widow has the right to stay that extra period or go out of her husband's house as is indicated \nby the statement of Allah: 'But if they leave there is no blame on you,... ' (2.240) Ibn `Abbas said: The \nabove Verse has cancelled the order of spending the period of the 'Iddah at her late husband's house, \nand so she could spend her period of the 'Iddah wherever she likes. And Allah says: 'Without turning \nthem out.' 'Ata said: If she would, she could spend her period of the 'Iddah at her husband's house, and \nlive there according to her (husband's) will and testament, and if she would, she could go out (of her \nhusband's house) as Allah says: 'There is no blame on you for what they do of themselves.' (2.240) \n'Ata added: Then the Verses of inheritance were revealed and the order of residence (for the widow) \nwas cancelled, and she could spend her period of the 'Iddah wherever she would like, and she was no \nlonger entitled to be accommodated by her husband's family.",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ قَالَ كَانَتْ هَذِهِ الْعِدَّةُ تَعْتَدُّ عِنْدَ أَهْلِ زَوْجِهَا وَاجِبًا، فَأَنْزَلَ اللَّهُ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ مِنْ مَعْرُوفٍ‏}‏ قَالَ جَعَلَ اللَّهُ لَهَا تَمَامَ السَّنَةِ سَبْعَةَ أَشْهُرٍ وَعِشْرِينَ لَيْلَةً وَصِيَّةً إِنْ شَاءَتْ سَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ، وَهْوَ قَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ‏}‏ فَالْعِدَّةُ كَمَا هِيَ، وَاجِبٌ عَلَيْهَا، زَعَمَ ذَلِكَ عَنْ مُجَاهِدٍ‏.‏ وَقَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ نَسَخَتْ هَذِهِ الآيَةُ عِدَّتَهَا عِنْدَ أَهْلِهَا، فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَقَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ‏}‏‏.‏ وَقَالَ عَطَاءٌ إِنْ شَاءَتِ اعْتَدَّتْ عِنْدَ أَهْلِهَا، وَسَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ لِقَوْلِ اللَّهِ ‏{‏فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ‏}‏‏.‏ قَالَ عَطَاءٌ ثُمَّ جَاءَ الْمِيرَاثُ فَنَسَخَ السُّكْنَى، فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَلاَ سُكْنَى لَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5344In-book reference : Book 68, Hadith 89USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5345,
    "id": 5345,
    "url": "https://sunnah.com/bukhari:5345",
    "bookNumber": 68,
    "hadithNumber": 90,
    "narrator": "Narrated Zainab bint Um Salama:",
    "english": "When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet (ﷺ) saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، حَدَّثَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ حَبِيبَةَ ابْنَةِ أَبِي سُفْيَانَ، لَمَّا جَاءَهَا نَعِيُّ أَبِيهَا دَعَتْ بِطِيبٍ، فَمَسَحَتْ ذِرَاعَيْهَا وَقَالَتْ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ‏.‏ لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5345In-book reference : Book 68, Hadith 90USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5346,
    "id": 5346,
    "url": "https://sunnah.com/bukhari:5346",
    "bookNumber": 68,
    "hadithNumber": 91,
    "narrator": "Narrated Abu Mas`ud:",
    "english": "The Prophet (ﷺ) prohibited taking the price of a dog, the earnings of a soothsayer and the money earned \nby prostitution.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ، وَحُلْوَانِ الْكَاهِنِ، وَمَهْرِ الْبَغِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5346In-book reference : Book 68, Hadith 91USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5347,
    "id": 5347,
    "url": "https://sunnah.com/bukhari:5347",
    "bookNumber": 68,
    "hadithNumber": 92,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "The Prophet (ﷺ) cursed the lady who practices tattooing and the one who gets herself tattooed, and one \nwho eats (takes) Riba' (usury) and the one who gives it. And he prohibited taking the price of a dog, \nand the money earned by prostitution, and cursed the makers of pictures.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاشِمَةَ، وَالْمُسْتَوْشِمَةَ، وَآكِلَ الرِّبَا وَمُوكِلَهُ، وَنَهَى عَنْ ثَمَنِ الْكَلْبِ، وَكَسْبِ الْبَغِيِّ، وَلَعَنَ الْمُصَوِّرِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5347In-book reference : Book 68, Hadith 92USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5348,
    "id": 5348,
    "url": "https://sunnah.com/bukhari:5348",
    "bookNumber": 68,
    "hadithNumber": 93,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) forbade taking the earnings of a slave girl by prostitution.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَسْبِ الإِمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5348In-book reference : Book 68, Hadith 93USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5349,
    "id": 5349,
    "url": "https://sunnah.com/bukhari:5349",
    "bookNumber": 68,
    "hadithNumber": 94,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "I said to Ibn `Umar, \"If a man accuses his wife of illegal sexual intercourse (what is the judgment)?\" \nHe said, \"Allah's Prophet separated the couple of Bani 'Ajlan (when the husband accused his wife for \nan illegal sexual intercourse). The Prophet (ﷺ) said, 'Allah knows that one of you two IS a liar; so will one \nof you repent?' But they refused. He then again said, 'Allah knows that one of you two is a liar; so will \none of you repent?' But they refused, whereupon he separated them by divorce.\" Aiyub (a subnarrator) \nsaid: `Amr bin Dinar said to me, \"In the narration there is something which I do not see you \nmentioning, i.e. the husband said, \"What about my money (Mahr)?' The Prophet (ﷺ) said, \"You are not \nentitled to take back money, for if you told the truth you have already entered upon her (and \nconsummated your marriage with her) and if you are a liar then you are less entitled to take it back.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ فَقَالَ فَرَّقَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا، فَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا، فَفَرَّقَ بَيْنَهُمَا‏.‏ قَالَ أَيُّوبُ فَقَالَ لِي عَمْرُو بْنُ دِينَارٍ فِي الْحَدِيثِ شَىْءٌ لاَ أَرَاكَ تُحَدِّثُهُ قَالَ قَالَ الرَّجُلُ مَالِي‏.‏ قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا، وَإِنْ كُنْتَ كَاذِبًا فَهْوَ أَبْعَدُ مِنْكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5349In-book reference : Book 68, Hadith 94USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5350,
    "id": 5350,
    "url": "https://sunnah.com/bukhari:5350",
    "bookNumber": 68,
    "hadithNumber": 95,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said to those who were involved in a case of Lian, \"Your accounts are with Allah. One of \nyou two is a liar. You (husband) have right on her (wife).\" The husband said, \"My money, O Allah's \nApostle!\" The Prophet (ﷺ) \nsaid, \"You are not entitled to take back any money. If you have told the truth, the Mahr that you paid, \nwas for having sexual relations with her lawfully; and if you are a liar, then you are less entitled to get \nit back.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ، أَحَدُكُمَا كَاذِبٌ، لاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي‏.‏ قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا، فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا، وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا، فَذَاكَ أَبْعَدُ وَأَبْعَدُ لَكَ مِنْهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5350In-book reference : Book 68, Hadith 95USC-MSA web (English) reference : Vol. 7, Book 63, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5351,
    "id": 5351,
    "url": "https://sunnah.com/bukhari:5351",
    "bookNumber": 69,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's \nreward it is regarded as Sadaqa for him.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الأَنْصَارِيَّ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، فَقُلْتُ عَنِ النَّبِيِّ فَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهْوَ يَحْتَسِبُهَا، كَانَتْ لَهُ صَدَقَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5351In-book reference : Book 69, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5352,
    "id": 5352,
    "url": "https://sunnah.com/bukhari:5352",
    "bookNumber": 69,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ أَنْفِقْ يَا ابْنَ آدَمَ أُنْفِقْ عَلَيْكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5352In-book reference : Book 69, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5353,
    "id": 5353,
    "url": "https://sunnah.com/bukhari:5353",
    "bookNumber": 69,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who \nfights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ، أَوِ الْقَائِمِ اللَّيْلَ الصَّائِمِ النَّهَارَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5353In-book reference : Book 69, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5354,
    "id": 5354,
    "url": "https://sunnah.com/bukhari:5354",
    "bookNumber": 69,
    "hadithNumber": 4,
    "narrator": "Narrated Sa`d:",
    "english": "The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all \nmy property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of \nit?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors \nwealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for \nyou, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, \nso that some people may benefit by you and others be harmed by you.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْد ٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَنَا مَرِيضٌ بِمَكَّةَ، فَقُلْتُ لِي مَالٌ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً، يَتَكَفَّفُونَ النَّاسَ فِي أَيْدِيهِمْ، وَمَهْمَا أَنْفَقْتَ فَهُوَ لَكَ صَدَقَةٌ حَتَّى اللُّقْمَةَ تَرْفَعُهَا فِي فِي امْرَأَتِكَ، وَلَعَلَّ اللَّهَ يَرْفَعُكَ، يَنْتَفِعُ بِكَ نَاسٌ وَيُضَرُّ بِكَ آخَرُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5354In-book reference : Book 69, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5355,
    "id": 5355,
    "url": "https://sunnah.com/bukhari:5355",
    "bookNumber": 69,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better \nthan a taking one, and you should start first to support your dependents.' A wife says, 'You should \neither provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son \nsays, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that \nfrom Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَفْضَلُ الصَّدَقَةِ مَا تَرَكَ غِنًى، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى، وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏‏.‏ تَقُولُ الْمَرْأَةُ إِمَّا أَنْ تُطْعِمَنِي وَإِمَّا أَنْ تُطَلِّقَنِي‏.‏ وَيَقُولُ الْعَبْدُ أَطْعِمْنِي وَاسْتَعْمِلْنِي‏.‏ وَيَقُولُ الاِبْنُ أَطْعِمْنِي، إِلَى مَنْ تَدَعُنِي فَقَالُوا يَا أَبَا هُرَيْرَةَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ لاَ هَذَا مِنْ كِيسِ أَبِي هُرَيْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5355In-book reference : Book 69, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5356,
    "id": 5356,
    "url": "https://sunnah.com/bukhari:5356",
    "bookNumber": 69,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start \nfirst to support your dependants.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدِ بْنِ مُسَافِرٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى، وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5356In-book reference : Book 69, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5357,
    "id": 5357,
    "url": "https://sunnah.com/bukhari:5357",
    "bookNumber": 69,
    "hadithNumber": 7,
    "narrator": "Narrated `Umar:",
    "english": "The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much \nfood as would cover their needs for a whole year.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنِ ابْنِ عُيَيْنَةَ، قَالَ قَالَ لِي مَعْمَرٌ قَالَ لِي الثَّوْرِيُّ هَلْ سَمِعْتَ فِي الرَّجُلِ يَجْمَعُ لأَهْلِهِ قُوتَ سَنَتِهِمْ أَوْ بَعْضِ السَّنَةِ قَالَ مَعْمَرٌ فَلَمْ يَحْضُرْنِي، ثُمَّ ذَكَرْتُ حَدِيثًا حَدَّثَنَاهُ ابْنُ شِهَابٍ الزُّهْرِيُّ عَنْ مَالِكِ بْنِ أَوْسٍ عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَبِيعُ نَخْلَ بَنِي النَّضِيرِ، وَيَحْبِسُ لأَهْلِهِ قُوتَ سَنَتِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5357In-book reference : Book 69, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5358,
    "id": 5358,
    "url": "https://sunnah.com/bukhari:5358",
    "bookNumber": 69,
    "hadithNumber": 8,
    "narrator": "Narrated Malik bin Aus bin Al-Hadathan:",
    "english": "Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, \nYarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are \nseeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, \nand sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and \n`Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. \n`Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and \nhis companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" \n`Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand \nfast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, \nbut whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The \ngroup said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both \nby Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" \n`Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of \nthis property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah \nhas bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either \ncavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to \nAllah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and \ndeprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. \nAnd out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and \nwhatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. \nAllah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you \nknow that?\" \nThey said, \"Yes.\" \nThen `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \n\"Yes.\" \n`Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of \nAllah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used \nto do, and both of you knew all about it then.\" \nThen `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! \nBut Allah knows that he was honest, sincere, pious and right (in that matter). \nThen Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' \nSo I kept this property in my possession for the first two years of my rule, and I used to do the same \nwith it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me \nwith the same claim and the same problem. (O `Abbas!) You came to me demanding your share from \n(the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from \n(the inheritance of) her father. \nSo I said to you, 'If you wish I will hand over this property to you, on condition that you both promise \nme before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as \nI have done since the beginning of my rule; otherwise you should not speak to me about it.' So you \nboth said, 'Hand over this property to us on this condition.' And on this condition I handed it over to \nyou. \nI beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" \n`Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you \nboth on that condition?\" They both said, \"Yes.\" \n`Umar added, \"Do you want me now to give a decision other than that? By Him with Whose \npermission (order) both the Heaven and the Earth stand fast, I will never give any decision other than \nthat till the Hour is established! But if you are unable to manage it (that property), then return it to me \nand I will be sufficient for it on your behalf . \"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي ذِكْرًا مِنْ حَدِيثِهِ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَى مَالِكِ بْنِ أَوْسٍ فَسَأَلْتُهُ فَقَالَ مَالِكٌ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ، إِذْ أَتَاهُ حَاجِبُهُ يَرْفَا فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ يَسْتَأْذِنُونَ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ ـ قَالَ ـ فَدَخَلُوا وَسَلَّمُوا فَجَلَسُوا، ثُمَّ لَبِثَ يَرْفَا قَلِيلاً فَقَالَ لِعُمَرَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمَا، فَلَمَّا دَخَلاَ سَلَّمَا وَجَلَسَا، فَقَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ فَقَالَ الرَّهْطُ عُثْمَانُ وَأَصْحَابُهُ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنَهُمَا، وَأَرِحْ أَحَدَهُمَا مِنَ الآخَرِ‏.‏ فَقَالَ عُمَرُ اتَّئِدُوا أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ قَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عُمَرُ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْمَالِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، قَالَ اللَّهُ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏‏.‏ فَكَانَتْ هَذِهِ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهَا وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ مِنْ هَذَا الْمَالِ، ثُمَّ يَأْخُذُ مَا بَقِيَ، فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ، هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ ثُمَّ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا أَبُو بَكْرٍ يَعْمَلُ فِيهَا بِمَا عَمِلَ بِهِ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمَا حِينَئِذٍ ـ وَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ ـ تَزْعُمَانِ أَنَّ أَبَا بَكْرٍ كَذَا وَكَذَا، وَاللَّهُ يَعْلَمُ أَنَّهُ فِيهَا صَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ، فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا بِمَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَى هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا، فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهُ إِلَيْكُمَا عَلَى أَنَّ عَلَيْكُمَا عَهْدَ اللَّهِ وَمِيثَاقَهُ لَتَعْمَلاَنِ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبِمَا عَمِلَ بِهِ فِيهَا أَبُو بَكْرٍ، وَبِمَا عَمِلْتُ بِهِ فِيهَا، مُنْذُ وُلِّيتُهَا، وَإِلاَّ فَلاَ تُكَلِّمَانِي فِيهَا فَقُلْتُمَا ادْفَعْهَا إِلَيْنَا بِذَلِكَ‏.‏ فَدَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، أَنْشُدُكُمْ بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْهِمَا بِذَلِكَ فَقَالَ الرَّهْطُ نَعَمْ‏.‏ قَالَ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ قَالاَ نَعَمْ‏.‏ قَالَ أَفَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَالَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ، حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا عَنْهَا فَادْفَعَاهَا فَأَنَا أَكْفِيكُمَاهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5358In-book reference : Book 69, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5359,
    "id": 5359,
    "url": "https://sunnah.com/bukhari:5359",
    "bookNumber": 69,
    "hadithNumber": 9,
    "narrator": "Narrated `Aisha:",
    "english": "Hind bint `Utba came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed \nour children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is \njust and reasonable. \"",
    "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ هِنْدُ بِنْتُ عُتْبَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ عِيَالَنَا قَالَ ‏\n\"‏ لاَ إِلاَّ بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5359In-book reference : Book 69, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5360,
    "id": 5360,
    "url": "https://sunnah.com/bukhari:5360",
    "bookNumber": 69,
    "hadithNumber": 10,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his \npermission, he will get half the reward.\"",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا عَنْ غَيْرِ أَمْرِهِ فَلَهُ نِصْفُ أَجْرِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5360In-book reference : Book 69, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5361,
    "id": 5361,
    "url": "https://sunnah.com/bukhari:5361",
    "bookNumber": 69,
    "hadithNumber": 11,
    "narrator": "Narrated `Ali:",
    "english": "Fatima went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She \nheard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, \nso she mentioned her problem to `Aisha. When the Prophet (ﷺ) came, `Aisha informed him about that. \n`Ali added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) \nbut he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of \nhis feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have \nrequested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three \ntimes, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي الْحَكَمُ، عَنِ ابْنِ أَبِي لَيْلَى، حَدَّثَنَا عَلِيٌّ، أَنَّ فَاطِمَةَ ـ عَلَيْهِمَا السَّلاَمُ ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم تَشْكُو إِلَيْهِ مَا تَلْقَى فِي يَدِهَا مِنَ الرَّحَى، وَبَلَغَهَا أَنَّهُ جَاءَهُ رَقِيقٌ فَلَمْ تُصَادِفْهُ، فَذَكَرَتْ ذَلِكَ لِعَائِشَةَ، فَلَمَّا جَاءَ أَخْبَرَتْهُ عَائِشَةُ ـ قَالَ ـ فَجَاءَنَا وَقَدْ أَخَذْنَا مَضَاجِعَنَا، فَذَهَبْنَا نَقُومُ فَقَالَ ‏\"‏ عَلَى مَكَانِكُمَا ‏\"‏‏.‏ فَجَاءَ فَقَعَدَ بَيْنِي وَبَيْنَهَا حَتَّى وَجَدْتُ بَرْدَ قَدَمَيْهِ عَلَى بَطْنِي فَقَالَ ‏\"‏ أَلاَ أَدُلُّكُمَا عَلَى خَيْرٍ مِمَّا سَأَلْتُمَا، إِذَا أَخَذْتُمَا مَضَاجِعَكُمَا ـ أَوْ أَوَيْتُمَا إِلَى فِرَاشِكُمَا ـ فَسَبِّحَا ثَلاَثًا وَثَلاَثِينَ، وَاحْمَدَا ثَلاَثًا وَثَلاَثِينَ، وَكَبِّرَا أَرْبَعًا وَثَلاَثِينَ، فَهْوَ خَيْرٌ لَكُمَا مِنْ خَادِمٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5361In-book reference : Book 69, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5362,
    "id": 5362,
    "url": "https://sunnah.com/bukhari:5362",
    "bookNumber": 69,
    "hadithNumber": 12,
    "narrator": "Narrated `Ali bin Abi Talib:",
    "english": "Fatima came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than \nthat? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three \ntimes, and 'Allahu Akbar' thirty four times. `Ali added, 'I have never failed to recite it ever since.\" \nSomebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ، سَمِعَ مُجَاهِدًا، سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، يُحَدِّثُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ فَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم تَسْأَلُهُ خَادِمًا فَقَالَ ‏\n\"‏ أَلاَ أُخْبِرُكِ مَا هُوَ خَيْرٌ لَكِ مِنْهُ، تُسَبِّحِينَ اللَّهَ عِنْدَ مَنَامِكِ ثَلاَثًا وَثَلاَثِينَ، وَتَحْمَدِينَ اللَّهَ ثَلاَثًا وَثَلاَثِينَ، وَتُكَبِّرِينَ اللَّهَ أَرْبَعًا وَثَلاَثِينَ ‏\"‏‏.‏ ـ ثُمَّ قَالَ سُفْيَانُ إِحْدَاهُنَّ أَرْبَعٌ وَثَلاَثُونَ ـ فَمَا تَرَكْتُهَا بَعْدُ، قِيلَ وَلاَ لَيْلَةَ صِفِّينَ قَالَ وَلاَ لَيْلَةَ صِفِّينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5362In-book reference : Book 69, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5363,
    "id": 5363,
    "url": "https://sunnah.com/bukhari:5363",
    "bookNumber": 69,
    "hadithNumber": 13,
    "narrator": "Narrated Al-Aswad bin Yazid:",
    "english": "I asked `Aisha \"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, \nand when he heard the Adhan (call for the prayer), he would go out.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي الْبَيْتِ قَالَتْ كَانَ فِي مِهْنَةِ أَهْلِهِ، فَإِذَا سَمِعَ الأَذَانَ خَرَجَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5363In-book reference : Book 69, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5364,
    "id": 5364,
    "url": "https://sunnah.com/bukhari:5364",
    "bookNumber": 69,
    "hadithNumber": 14,
    "narrator": "Narrated `Aisha:",
    "english": "Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is \nsufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) \nsaid, \"Take what is sufficient for you and your children, and the amount should be just and reasonable.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ هِنْدَ بِنْتَ عُتْبَةَ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، وَلَيْسَ يُعْطِينِي مَا يَكْفِينِي وَوَلَدِي، إِلاَّ مَا أَخَذْتُ مِنْهُ وَهْوَ لاَ يَعْلَمُ فَقَالَ ‏\n\"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5364In-book reference : Book 69, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5365,
    "id": 5365,
    "url": "https://sunnah.com/bukhari:5365",
    "bookNumber": 69,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another \nnarrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind \nto their young ones and who look after their husband's property . \"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، وَأَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ نِسَاءُ قُرَيْشٍ ـ وَقَالَ الآخَرُ صَالِحُ نِسَاءِ قُرَيْشٍ ـ أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ، وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏ وَيُذْكَرُ عَنْ مُعَاوِيَةَ وَابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5365In-book reference : Book 69, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5366,
    "id": 5366,
    "url": "https://sunnah.com/bukhari:5366",
    "bookNumber": 69,
    "hadithNumber": 16,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and \ndistributed it among my women-folk.",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ آتَى إِلَىَّ النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ فَلَبِسْتُهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ فَشَقَّقْتُهَا بَيْنَ نِسَائِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5366In-book reference : Book 69, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5367,
    "id": 5367,
    "url": "https://sunnah.com/bukhari:5367",
    "bookNumber": 69,
    "hadithNumber": 17,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O \nJabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he \nsaid, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her \nand she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl \nlike them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah \nbless you,\" or \"That is good.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ هَلَكَ أَبِي وَتَرَكَ سَبْعَ بَنَاتٍ أَوْ تِسْعَ بَنَاتٍ فَتَزَوَّجْتُ امْرَأَةً ثَيِّبًا فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ يَا جَابِرُ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ بَلْ ثَيِّبًا‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ، وَتُضَاحِكُهَا وَتُضَاحِكُكَ ‏\"‏‏.‏ قَالَ فَقُلْتُ لَهُ إِنَّ عَبْدَ اللَّهِ هَلَكَ وَتَرَكَ بَنَاتٍ، وَإِنِّي كَرِهْتُ أَنْ أَجِيئَهُنَّ بِمِثْلِهِنَّ، فَتَزَوَّجْتُ امْرَأَةً تَقُومُ عَلَيْهِنَّ وَتُصْلِحُهُنَّ‏.‏ فَقَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ ‏\"‏‏.‏ أَوْ قَالَ خَيْرًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5367In-book reference : Book 69, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5368,
    "id": 5368,
    "url": "https://sunnah.com/bukhari:5368",
    "bookNumber": 69,
    "hadithNumber": 18,
    "narrator": "Narrated Abu Huraira:",
    "english": "A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual \nintercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \n\"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for \ntwo successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He \nsaid, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . \nHe said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this \n(basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer \npeople than us? By Him Who sent you with the Truth, there is no family between Medina's two \nmountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \n\"Then take it.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ هَلَكْتُ‏.‏ قَالَ ‏\"‏ وَلِمَ ‏\"‏‏.‏ قَالَ وَقَعْتُ عَلَى أَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ فَأَعْتِقْ رَقَبَةً ‏\"‏‏.‏ قَالَ لَيْسَ عِنْدِي‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ أَسْتَطِيعُ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏‏.‏ قَالَ هَا أَنَا ذَا‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهَذَا ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنَّا يَا رَسُولَ اللَّهِ فَوَالَّذِي بَعَثَكَ بِالْحَقِّ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ مِنَّا فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ قَالَ ‏\"‏ فَأَنْتُمْ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5368In-book reference : Book 69, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5369,
    "id": 5369,
    "url": "https://sunnah.com/bukhari:5369",
    "bookNumber": 69,
    "hadithNumber": 19,
    "narrator": "Narrated Um Salama:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu \nSalama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The \nProphet said, \"Yes, you will be rewarded for that which you will spend on them.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قُلْتُ يَا رَسُولَ اللَّهِ هَلْ لِي مِنْ أَجْرٍ فِي بَنِي أَبِي سَلَمَةَ أَنْ أُنْفِقَ عَلَيْهِمْ، وَلَسْتُ بِتَارِكَتِهِمْ هَكَذَا وَهَكَذَا، إِنَّمَا هُمْ بَنِيَّ‏.‏ قَالَ ‏\n\"‏ نَعَمْ لَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5369In-book reference : Book 69, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5370,
    "id": 5370,
    "url": "https://sunnah.com/bukhari:5370",
    "bookNumber": 69,
    "hadithNumber": 20,
    "narrator": "Narrated `Aisha:",
    "english": "Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his \nproperty what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your \nneeds) in a reasonable manner.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هِنْدُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ فَهَلْ عَلَىَّ جُنَاحٌ أَنْ آخُذَ مِنْ مَالِهِ مَا يَكْفِينِي وَبَنِيَّ قَالَ ‏\n\"‏ خُذِي بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5370In-book reference : Book 69, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5371,
    "id": 5371,
    "url": "https://sunnah.com/bukhari:5371",
    "bookNumber": 69,
    "hadithNumber": 21,
    "narrator": "Narrated Abu Huraira:",
    "english": "A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re \npay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would \noffer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the \nfuneral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), \nhe said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will \nrepay it, but if he leaves wealth, it will be for his heirs.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدَّيْنُ، فَيَسْأَلُ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ فَضْلاً ‏\"‏‏.‏ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى، وَإِلاَّ قَالَ لِلْمُسْلِمِينَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ تُوُفِّيَ مِنَ الْمُؤْمِنِينَ فَتَرَكَ دَيْنًا فَعَلَىَّ قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5371In-book reference : Book 69, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5372,
    "id": 5372,
    "url": "https://sunnah.com/bukhari:5372",
    "bookNumber": 69,
    "hadithNumber": 22,
    "narrator": "Narrated Um Habiba:",
    "english": "(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu \nSufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the \nperson I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \n\"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He \nsaid, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, \nshe is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. \nSo you should not present to me your daughters and sisters.\" \nNarrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِي ابْنَةَ أَبِي سُفْيَانَ‏.‏ قَالَ ‏\"‏ وَتُحِبِّينَ ذَلِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَارَكَنِي فِي الْخَيْرِ أُخْتِي‏.‏ فَقَالَ ‏\"‏ إِنَّ ذَلِكَ لاَ يَحِلُّ لِي ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ فَوَاللَّهِ إِنَّا نَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ ابْنَةَ أَبِي سَلَمَةَ‏.‏ فَقَالَ ‏\"‏ ابْنَةَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏فَوَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حَجْرِي مَا حَلَّتْ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ، فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ قَالَ عُرْوَةُ ثُوَيْبَةُ أَعْتَقَهَا أَبُو لَهَبٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5372In-book reference : Book 69, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 64, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5373,
    "id": 5373,
    "url": "https://sunnah.com/bukhari:5373",
    "bookNumber": 70,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"Give food to the hungry, pay a visit to the sick and release (set free) the one in \ncaptivity (by paying his ransom).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِي ِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَطْعِمُوا الْجَائِعَ، وَعُودُوا الْمَرِيضَ، وَفُكُّوا الْعَانِيَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَالْعَانِي الأَسِيرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5373In-book reference : Book 70, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5374,
    "id": 5374,
    "url": "https://sunnah.com/bukhari:5374",
    "bookNumber": 70,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "The family of Muhammad did not eat their fill for three successive \n     days till he died.",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ طَعَامٍ ثَلاَثَةَ أَيَّامٍ حَتَّى قُبِضَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5374In-book reference : Book 70, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5375,
    "id": 5375,
    "url": "https://sunnah.com/bukhari:5375",
    "bookNumber": 70,
    "hadithNumber": 3,
    "narrator": "Narrated Abu Huraira:",
    "english": "Once while I was in a state of fatigue (because of severe hunger), I \n     met 'Umar bin Al-Khattab, so I asked him to recite a verse from \n     Allah's Book to me. He entered his house and interpreted it to me. \n     (Then I went out and) after walking for a short distance, I fell on my\n     face because of fatigue and severe hunger. Suddenly I saw Allah's \n     Apostle  standing by my head. He said, \"O Abu Huraira!\" I replied, \n     \"Labbaik, O Allah's Messenger (ﷺ), and Sadaik!\" Then he held me by the hand,\n     and made me get up. Then he came to know what I was suffering from. He\n     took me to his house, and ordered a big bowl of milk for me. I drank \n     thereof and he said, \"Drink more, O Abu Hirr!\" So I drank again, \n     whereupon he again said, \"Drink more.\" So I drank more till my belly \n     became full and looked like a bowl. Afterwards I met 'Umar and \n     mentioned to him what had happened to me, and said to him, \"Somebody, \n     who had more right than you, O 'Umar, took over the case. By Allah, I \n     asked you to recite a Verse to me while I knew it better than you.\" On\n     that Umar said to me, \"By Allah, if I admitted and entertained you, it\n     would have been dearer to me than having nice red camels.",
    "arabic": "وَعَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَصَابَنِي جَهْدٌ شَدِيدٌ فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ، فَاسْتَقْرَأْتُهُ آيَةً مِنْ كِتَابِ اللَّهِ، فَدَخَلَ دَارَهُ وَفَتَحَهَا عَلَىَّ، فَمَشَيْتُ غَيْرَ بَعِيدٍ، فَخَرَرْتُ لِوَجْهِي مِنَ الْجَهْدِ وَالْجُوعِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى رَأْسِي فَقَالَ ‏\"‏ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ فَقُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَأَخَذَ بِيَدِي فَأَقَامَنِي، وَعَرَفَ الَّذِي بِي، فَانْطَلَقَ بِي إِلَى رَحْلِهِ، فَأَمَرَ لِي بِعُسٍّ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ، ثُمَّ قَالَ ‏\"‏ عُدْ يَا أَبَا هِرٍّ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ، ثُمَّ قَالَ ‏\"‏ عُدْ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ حَتَّى اسْتَوَى بَطْنِي فَصَارَ كَالْقِدْحِ ـ قَالَ ـ فَلَقِيتُ عُمَرَ وَذَكَرْتُ لَهُ الَّذِي كَانَ مِنْ أَمْرِي وَقُلْتُ لَهُ تَوَلَّى اللَّهُ ذَلِكَ مَنْ كَانَ أَحَقَّ بِهِ مِنْكَ يَا عُمَرُ، وَاللَّهِ لَقَدِ اسْتَقْرَأْتُكَ الآيَةَ وَلأَنَا أَقْرَأُ لَهَا مِنْكَ‏.‏ قَالَ عُمَرُ وَاللَّهِ لأَنْ أَكُونَ أَدْخَلْتُكَ أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي مِثْلُ حُمْرِ النَّعَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5375In-book reference : Book 70, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5376,
    "id": 5376,
    "url": "https://sunnah.com/bukhari:5376",
    "bookNumber": 70,
    "hadithNumber": 4,
    "narrator": "Narrated `Umar bin Abi Salama:",
    "english": "I was a boy under the care of Allah's Messenger (ﷺ) and my hand used to go around the dish while I was \neating. So Allah's Messenger (ﷺ) said to me, 'O boy! Mention the Name of Allah and eat with your right \nhand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when \neating.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، قَالَ الْوَلِيدُ بْنُ كَثِيرٍ أَخْبَرَنِي أَنَّهُ، سَمِعَ وَهْبَ بْنَ كَيْسَانَ، أَنَّهُ سَمِعَ عُمَرَ بْنَ أَبِي سَلَمَةَ، يَقُولُ كُنْتُ غُلاَمًا فِي حَجْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا غُلاَمُ سَمِّ اللَّهَ، وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏ فَمَا زَالَتْ تِلْكَ طِعْمَتِي بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5376In-book reference : Book 70, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5377,
    "id": 5377,
    "url": "https://sunnah.com/bukhari:5377",
    "bookNumber": 70,
    "hadithNumber": 5,
    "narrator": "Narrated `Umar bin Al Salama:",
    "english": "Who was the son of Um Salama, the wife of the Prophet: \nOnce I ate a meal with Allah's Messenger (ﷺ) and I was eating from all sides of the dish. So Allah's Messenger (ﷺ) \nsaid to me, \"Eat of the dish what is nearer to you.\"",
    "arabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ ـ وَهْوَ ابْنُ أُمِّ سَلَمَةَ ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَكَلْتُ يَوْمًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم طَعَامًا فَجَعَلْتُ آكُلُ مِنْ نَوَاحِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5377In-book reference : Book 70, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5378,
    "id": 5378,
    "url": "https://sunnah.com/bukhari:5378",
    "bookNumber": 70,
    "hadithNumber": 6,
    "narrator": "Narrated Wahb bin Kaisan Abi Nu'aim:",
    "english": "A meal was brought to Allah's Messenger (ﷺ) while his step-son, `Umar bin Abi Salama was with him. \nAllah's Messenger (ﷺ) said to him, \"Mention the Name of Allah and eat of the dish what is nearer to you.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ وَمَعَهُ رَبِيبُهُ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ ‏\n\"‏ سَمِّ اللَّهَ، وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5378In-book reference : Book 70, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 290   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5379,
    "id": 5379,
    "url": "https://sunnah.com/bukhari:5379",
    "bookNumber": 70,
    "hadithNumber": 7,
    "narrator": "Narrated Anas bin Malik:",
    "english": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went along with Allah's Messenger (ﷺ) \nand saw him seeking to eat the pieces of gourd from the various sides of the dish. Since that day I \nhave liked to eat gourd. `Umar bin Abi Salama said: The Prophet, said to me, \"Eat with your right \nhand.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ ـ قَالَ ـ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5379In-book reference : Book 70, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 291   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5380,
    "id": 5380,
    "url": "https://sunnah.com/bukhari:5380",
    "bookNumber": 70,
    "hadithNumber": 8,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to love to start doing things from the right side whenever possible, in performing \nablution, putting on his shoes, and combing his hair. (Al-Ash'ath said: The Prophet (ﷺ) used to do so in all \nhis affairs.)",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ‏.‏ وَكَانَ قَالَ بِوَاسِطٍ قَبْلَ هَذَا فِي شَأْنِهِ كُلِّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5380In-book reference : Book 70, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 292   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5381,
    "id": 5381,
    "url": "https://sunnah.com/bukhari:5381",
    "bookNumber": 70,
    "hadithNumber": 9,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Talha said to Um Sulaim, \"I have heard the voice of Allah's Messenger (ﷺ) which was feeble, and I \nthink that he is hungry. Have you got something (to eat)?\" She took out some loaves of barley bread, \nthen took her face-covering sheet and wrapped the bread in part of it, and pushed it under my garment \nand turned the rest of it around my body and sent me to Allah's Messenger (ﷺ) . I went with that, and found \nAllah's Messenger (ﷺ) in the mosque with some people. I stood up near them, and Allah's Messenger (ﷺ) asked me, \n\"Have you been sent by Abu Talha?\" I said, \"Yes.\" He asked, \"With some food (for us)?\" I said, \n\"Yes.\" Then Allah's Messenger (ﷺ) said to all those who were with him, \"Get up!\" He set out (and all the \npeople accompanied him) and I proceeded ahead of them till I came to Abu Talha. Abu Talha then \nsaid, \"O Um Sulaim! Allah's Messenger (ﷺ) has arrived along with the people, and we do not have food \nenough to feed them all.\" She said, \"Allah and His Apostle know better.\" So Abu Talha went out till \nhe met Allah's Messenger (ﷺ). Then Abu Talha and Allah's Messenger (ﷺ) came and entered the house. Allah's \nApostle said, \"Um Sulaim ! Bring whatever you have.\" She brought that very bread. The Prophet (ﷺ) \nordered that it be crushed into small pieces, and Um Sulaim pressed a skin of butter on it. Then Allah's \nApostle said whatever Allah wished him to say (to bless the food) and then added, \"Admit ten (men).\" \nSo they were admitted, ate their fill and went out. The Prophet (ﷺ) then said, \"Admit ten (more).\" They \nwere admitted, ate their full, and went out. He then again said, \"Admit ten more!\" They were \nadmitted, ate their fill, and went out. He admitted ten more, and so all those people ate their fill, and \nthey were eighty men.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ، فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخْرَجَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ دَسَّتْهُ تَحْتَ ثَوْبِي وَرَدَّتْنِي بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِطَعَامٍ ‏\"‏‏.‏ قَالَ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ، فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ أَبُو طَلْحَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى دَخَلاَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ فَأَمَرَ بِهِ فَفُتَّ وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَأَدَمَتْهُ، ثُمَّ قَالَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا، ثُمَّ أَذِنَ لِعَشَرَةٍ، فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ ثَمَانُونَ رَجُلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5381In-book reference : Book 70, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5382,
    "id": 5382,
    "url": "https://sunnah.com/bukhari:5382",
    "bookNumber": 70,
    "hadithNumber": 10,
    "narrator": "Narrated `Abdur-Rahman bin Abu Bakr:",
    "english": "We were one hundred and thirty men sitting with the Prophet. The Prophet (ﷺ) said, \"Have anyone of you \nany food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned \ninto dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet (ﷺ) asked, 'Will \nyou sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the \nProphet bought from him a sheep which was slaughtered, and then the Prophet (ﷺ) ordered that the liver, \nthe kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and \nthirty men but had his share of those things. The Prophet (ﷺ) gave to those who were present, and also \nkept a share for those who were absent He then served that cooked sheep in two big trays and we all \nate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ وَحَدَّثَ أَبُو عُثْمَانَ، أَيْضًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثَلاَثِينَ وَمِائَةً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَ أَحَدٍ مِنْكُمْ طَعَامٌ ‏\"‏‏.‏ فَإِذَا مَعَ رَجُلٍ صَاعٌ مِنْ طَعَامٍ أَوْ نَحْوُهُ، فَعُجِنَ، ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبَيْعٌ أَمْ عَطِيَّةٌ أَوْ ـ قَالَ ـ هِبَةٌ ‏\"‏‏.‏ قَالَ لاَ بَلْ بَيْعٌ‏.‏ قَالَ فَاشْتَرَى مِنْهُ شَاةً فَصُنِعَتْ، فَأَمَرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِسَوَادِ الْبَطْنِ يُشْوَى، وَايْمُ اللَّهِ مَا مِنَ الثَّلاَثِينَ وَمِائَةٍ إِلاَّ قَدْ حَزَّ لَهُ حُزَّةً مِنْ سَوَادِ بَطْنِهَا، إِنْ كَانَ شَاهِدًا أَعْطَاهَا إِيَّاهُ، وَإِنْ كَانَ غَائِبًا خَبَأَهَا لَهُ، ثُمَّ جَعَلَ فِيهَا قَصْعَتَيْنِ فَأَكَلْنَا أَجْمَعُونَ وَشَبِعْنَا، وَفَضَلَ فِي الْقَصْعَتَيْنِ، فَحَمَلْتُهُ عَلَى الْبَعِيرِ‏.‏ أَوْ كَمَا قَالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5382In-book reference : Book 70, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 294   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5383,
    "id": 5383,
    "url": "https://sunnah.com/bukhari:5383",
    "bookNumber": 70,
    "hadithNumber": 11,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) died when we had satisfied our hunger with the two black things, i.e. dates and water.",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم حِينَ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5383In-book reference : Book 70, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 295   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5384,
    "id": 5384,
    "url": "https://sunnah.com/bukhari:5384",
    "bookNumber": 70,
    "hadithNumber": 12,
    "narrator": "Narrated Suwaid bin An-Nu`man:",
    "english": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator \nsaid, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Messenger (ﷺ) asked the \npeople to bring their food, but there was nothing with the people except Sawiq. So we all chewed and \nate of it. Then the Prophet (ﷺ) asked for some water and he rinsed his mouth, and we too, rinsed our \nmouths. Then he led us in the Maghrib prayer without performing ablution (again).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ يَحْيَى بْنُ سَعِيدٍ سَمِعْتُ بُشَيْرَ بْنَ يَسَارٍ، يَقُولُ حَدَّثَنَا سُوَيْدُ بْنُ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ، فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مِنْهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا، فَصَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ قَالَ سُفْيَانُ سَمِعْتُهُ مِنْهُ عَوْدًا وَبَدْءًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5384In-book reference : Book 70, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 296   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5385,
    "id": 5385,
    "url": "https://sunnah.com/bukhari:5385",
    "bookNumber": 70,
    "hadithNumber": 13,
    "narrator": "Narrated Qatada:",
    "english": "We were in the company of Anas whose baker was with him. Anas said, The Prophet (ﷺ) did not eat thin \nbread, or a roasted sheep till he met Allah (died).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ كُنَّا عِنْدَ أَنَسٍ وَعِنْدَهُ خَبَّازٌ لَهُ فَقَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم خُبْزًا مُرَقَّقًا وَلاَ شَاةً مَسْمُوطَةً حَتَّى لَقِيَ اللَّهَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5385In-book reference : Book 70, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 297   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5386,
    "id": 5386,
    "url": "https://sunnah.com/bukhari:5386",
    "bookNumber": 70,
    "hadithNumber": 14,
    "narrator": "Narrated Anas:",
    "english": "To the best of my knowledge, the Prophet (ﷺ) did not take his meals in a big tray at all, nor did he ever eat \nwell-baked thin bread, nor did he ever eat at a dining table.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ ـ قَالَ عَلِيٌّ هُوَ الإِسْكَافُ ـ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه قَالَ مَا عَلِمْتُ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عَلَى سُكُرُّجَةٍ قَطُّ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ قَطُّ، وَلاَ أَكَلَ عَلَى خِوَانٍ‏.‏ قِيلَ لِقَتَادَةَ فَعَلَى مَا كَانُوا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5386In-book reference : Book 70, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 298   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5387,
    "id": 5387,
    "url": "https://sunnah.com/bukhari:5387",
    "bookNumber": 70,
    "hadithNumber": 15,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) halted to consummate his marriage with Safiyya. I invited the Muslims to his wedding \nbanquet. He ordered that leather dining sheets be spread. Then dates, dried yoghurt and butter were \nput on those sheets. Anas added: The Prophet (ﷺ) consummated his marriage with Safiyya (during a \njourney) whereupon Hais (sweet dish) was served on a leather dining sheet.",
    "arabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم يَبْنِي بِصَفِيَّةَ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ أَمَرَ بِالأَنْطَاعِ فَبُسِطَتْ فَأُلْقِيَ عَلَيْهَا التَّمْرُ وَالأَقِطُ وَالسَّمْنُ‏.‏ وَقَالَ عَمْرٌو عَنْ أَنَسٍ بَنَى بِهَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَنَعَ حَيْسًا فِي نِطَعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5387In-book reference : Book 70, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 299   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5388,
    "id": 5388,
    "url": "https://sunnah.com/bukhari:5388",
    "bookNumber": 70,
    "hadithNumber": 16,
    "narrator": "Narrated Wahb bin Kaisan:",
    "english": "The People of Sham taunted `Abdullah bin Az-Zubair by calling him \"The son of Dhatin-Nataqain\" \n(the woman who has two waist-belts). (His mother) (Asma, said to him, \"O my son! They taunt you \nwith \"Nataqain\". Do you know what the Nataqain were? That was my waist-belt which I divided in \ntwo parts. I tied the water skin of Allah's Messenger (ﷺ) with one part, and with the other part I tied his food \ncontainer.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، وَعَنْ وَهْبِ بْنِ كَيْسَانَ، قَالَ كَانَ أَهْلُ الشَّأْمِ يُعَيِّرُونَ ابْنَ الزُّبَيْرِ يَقُولُونَ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ‏.‏ فَقَالَتْ لَهُ أَسْمَاءُ يَا بُنَىَّ إِنَّهُمْ يُعَيِّرُونَكَ بِالنِّطَاقَيْنِ، هَلْ تَدْرِي مَا كَانَ النِّطَاقَانِ إِنَّمَا كَانَ نِطَاقِي شَقَقْتُهُ نِصْفَيْنِ، فَأَوْكَيْتُ قِرْبَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَحَدِهِمَا، وَجَعَلْتُ فِي سُفْرَتِهِ آخَرَ، قَالَ فَكَانَ أَهْلُ الشَّأْمِ إِذَا عَيَّرُوهُ بِالنِّطَاقَيْنِ يَقُولُ إِيهًا وَالإِلَهْ‏.‏ تِلْكَ شَكَاةٌ ظَاهِرٌ عَنْكَ عَارُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5388In-book reference : Book 70, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 300   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5389,
    "id": 5389,
    "url": "https://sunnah.com/bukhari:5389",
    "bookNumber": 70,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "that his aunt, Um Hufaid bint Al-Harith bin Hazn, presented to the Prophet (ﷺ) butter, dried yoghurt and \nmastigures. The Prophet (ﷺ) invited the people to those mastigures and they were eaten on his dining \nsheet, but the Prophet (ﷺ) did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, \nthe people would not have eaten it on the dining sheet of the Prophet (ﷺ) nor would he have ordered that \nthey be eaten.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْن ٍ ـ خَالَةَ ابْنِ عَبَّاسٍ ـ أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ فَأُكِلْنَ عَلَى مَائِدَتِهِ، وَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُسْتَقْذِرِ لَهُنَّ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَةِ النَّبِيِّ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5389In-book reference : Book 70, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 301   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5390,
    "id": 5390,
    "url": "https://sunnah.com/bukhari:5390",
    "bookNumber": 70,
    "hadithNumber": 18,
    "narrator": "Narrated Suwaid bin An-Nu`man:",
    "english": "that while they were with the Prophet (ﷺ) at As-Sahba' which was at a distance of one day's journey from \nKhaibar the prayer became due, and the Prophet (ﷺ) asked the people for food but there was nothing with \nthe people except Sawiq. He ate of it and we ate along with him, and then he asked for water and \nrinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the \nProphet did not perform ablution (again after eating the Sawiq.).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالصَّهْبَاءِ ـ وَهْىَ عَلَى رَوْحَةٍ مِنْ خَيْبَرَ ـ فَحَضَرَتِ الصَّلاَةُ، فَدَعَا بِطَعَامٍ فَلَمْ يَجِدْهُ إِلاَّ سَوِيقًا، فَلاَكَ مِنْهُ فَلُكْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ، ثُمَّ صَلَّى وَصَلَّيْنَا، وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5390In-book reference : Book 70, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 302   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5391,
    "id": 5391,
    "url": "https://sunnah.com/bukhari:5391",
    "bookNumber": 70,
    "hadithNumber": 19,
    "narrator": "Narrated Khalid bin Al-Walid:",
    "english": "That he went with Allah's Messenger (ﷺ) to the house of Maimuna, who was his and Ibn `Abbas' aunt. He \nfound with her a roasted mastigure which her sister Hufaida bint Al-Harith had brought from Najd. \nMaimuna presented the mastigure before Allah's Messenger (ﷺ) who rarely started eating any (unfamiliar) \nfood before it was described and named for him. (But that time) Allah's Messenger (ﷺ) stretched his hand \ntowards the (meat of the) mastigure whereupon a lady from among those who were present, said, \n\"You should inform Allah's Messenger (ﷺ) of what you have presented to him. O Allah's Messenger (ﷺ)! It is the \nmeat of a mastigure.\" (On learning that) Allah's Messenger (ﷺ) withdrew his hand from the meat of the \nmastigure. Khalid bin Al-Walid said, \"O Allah's Messenger (ﷺ)! Is this unlawful to eat?\" Allah's Messenger (ﷺ) \nreplied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid said, \"Then I \npulled the mastigure (meat) towards me and ate it while Allah's Messenger (ﷺ) was looking at me.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الأَنْصَارِيُّ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ ـ وَهْىَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ ـ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا، قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ إِلَى الضَّبِّ، فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا قَدَّمْتُنَّ لَهُ، هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَنِ الضَّبِّ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ إِلَىَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5391In-book reference : Book 70, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 303   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5392,
    "id": 5392,
    "url": "https://sunnah.com/bukhari:5392",
    "bookNumber": 70,
    "hadithNumber": 20,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The food for two persons is sufficient for three, and the food of three persons is \nsufficient for four persons.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ، وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5392In-book reference : Book 70, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 304   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5393,
    "id": 5393,
    "url": "https://sunnah.com/bukhari:5393",
    "bookNumber": 70,
    "hadithNumber": 21,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar never used to take his meal unless a poor man was called to eat with him. One day I \nbrought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar said, \"O Nafi`! \nDon't let this man enter my house, for I heard the Prophet (ﷺ) saying, \"A believer eats in one intestine (is \nsatisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ حَتَّى يُؤْتَى بِمِسْكِينٍ يَأْكُلُ مَعَهُ، فَأَدْخَلْتُ رَجُلاً يَأْكُلُ مَعَهُ فَأَكَلَ كَثِيرًا فَقَالَ يَا نَافِعُ لاَ تُدْخِلْ هَذَا عَلَىَّ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5393In-book reference : Book 70, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 305   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5394,
    "id": 5394,
    "url": "https://sunnah.com/bukhari:5394",
    "bookNumber": 70,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir \n(unbeliever) or a hypocrite eats in seven intestines (eats too much).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَإِنَّ الْكَافِرَ ـ أَوِ الْمُنَافِقَ فَلاَ أَدْرِي أَيَّهُمَا قَالَ عُبَيْدُ اللَّهِ ـ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ وَقَالَ ابْنُ بُكَيْرٍ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5394In-book reference : Book 70, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 306   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5395,
    "id": 5395,
    "url": "https://sunnah.com/bukhari:5395",
    "bookNumber": 70,
    "hadithNumber": 23,
    "narrator": "Narrated `Amr:",
    "english": "Abu Nahik was avaricious eater. Ibn `Umar said to him, \"Allah's Messenger (ﷺ) said, \"A Kafir (unbeliever) \neats in seven intestines (eats much).\" On that Abu Nahik said, \"But I believe in Allah and His Apostle \n.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ كَانَ أَبُو نَهِيكٍ رَجُلاً أَكُولاً فَقَالَ لَهُ ابْنُ عُمَرَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ فَقَالَ فَأَنَا أُومِنُ بِاللَّهِ وَرَسُولِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5395In-book reference : Book 70, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 307   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5396,
    "id": 5396,
    "url": "https://sunnah.com/bukhari:5396",
    "bookNumber": 70,
    "hadithNumber": 24,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a \nKafir (unbeliever) eats in seven intestines (eats much).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5396In-book reference : Book 70, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 308   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5397,
    "id": 5397,
    "url": "https://sunnah.com/bukhari:5397",
    "bookNumber": 70,
    "hadithNumber": 25,
    "narrator": "Narrated Abu Huraira:",
    "english": "A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to \nthe Prophet (ﷺ) who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir \neats in seven intestines (eats much). \"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، كَانَ يَأْكُلُ أَكْلاً كَثِيرًا، فَأَسْلَمَ فَكَانَ يَأْكُلُ أَكْلاً قَلِيلاً، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5397In-book reference : Book 70, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 309   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5398,
    "id": 5398,
    "url": "https://sunnah.com/bukhari:5398",
    "bookNumber": 70,
    "hadithNumber": 26,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "Allah's Messenger (ﷺ) said, \"I do not take my meals while leaning (against something).",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ آكُلُ مُتَّكِئًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5398In-book reference : Book 70, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 310   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5399,
    "id": 5399,
    "url": "https://sunnah.com/bukhari:5399",
    "bookNumber": 70,
    "hadithNumber": 27,
    "narrator": "Narrated Abu Juhaifa:",
    "english": "While I was with the Prophet (ﷺ) he said to a man who was with him, \"I do not take my meals while \nleaning.\"",
    "arabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي جُحَيْفَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ ‏\n\"‏ لاَ آكُلُ وَأَنَا مُتَّكِئٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5399In-book reference : Book 70, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 311   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5400,
    "id": 5400,
    "url": "https://sunnah.com/bukhari:5400",
    "bookNumber": 70,
    "hadithNumber": 28,
    "narrator": "Narrated Khalid bin Al-Walid:",
    "english": "\"A roasted mastigure was brought to the Prophet (ﷺ) who stretched his hand towards it to eat it. But it was \nsaid to him, \"It is a mastigure.\" So he withdrew his hand. Khalid asked, \"Is it unlawful to eat?\" the \nProphet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" \nSo Khalid started eating (it) while Allah's Messenger (ﷺ) was looking at him. An-Nadr said: 'Al-Khazira' (is \nprepared) from bran while 'Al-Harira' is prepared from milk.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِضَبٍّ مَشْوِيٍّ، فَأَهْوَى إِلَيْهِ لِيَأْكُلَ فَقِيلَ لَهُ إِنَّهُ ضَبٌّ، فَأَمْسَكَ يَدَهُ، فَقَالَ خَالِدٌ أَحَرَامٌ هُوَ قَالَ ‏\n\"‏ لاَ، وَلَكِنَّهُ لاَ يَكُونُ بِأَرْضِ قَوْمِي، فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ فَأَكَلَ خَالِدٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ‏.‏ قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ بِضَبٍّ مَحْنُوذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5400In-book reference : Book 70, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 65, Hadith 312   (deprecated numbering scheme)"
  }
]