[
  {
    "hadithGlobalNumber": 3301,
    "id": 3301,
    "url": "https://sunnah.com/bukhari:3301",
    "bookNumber": 59,
    "hadithNumber": 109,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The main source of disbelief is in the east. Pride and arrogance are \ncharacteristics of the owners of horses and camels, and those bedouins who are busy with their camels \nand pay no attention to Religion; while modesty and gentleness are the characteristics of the owners of \nsheep.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ، وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَهْلِ الْخَيْلِ وَالإِبِلِ، وَالْفَدَّادِينَ أَهْلِ الْوَبَرِ، وَالسَّكِينَةُ فِي أَهْلِ الْغَنَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3301In-book reference : Book 59, Hadith 109USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 520   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3302,
    "id": 3302,
    "url": "https://sunnah.com/bukhari:3302",
    "bookNumber": 59,
    "hadithNumber": 110,
    "narrator": "Narrated `Uqba bin `Umar and Abu Mas`ud:",
    "english": "Allah's Messenger (ﷺ) pointed with his hand towards Yemen and said, \"(True) Belief is Yemenite, towards here (i.e. \nthe Yemenite, had True Belief and embraced Islam readily). Certainly sternness and mercilessness are the \nqualities of those who are loud and at the base of the tails  of camels, where the two \nhorns of Satan will appear. Such qualities belong to the tribes of Rabi`a and Mudar.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍ، قَالَ أَشَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ نَحْوَ الْيَمَنِ فَقَالَ ‏\n\"‏ الإِيمَانُ يَمَانٍ هَا هُنَا، أَلاَ إِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ عِنْدَ أُصُولِ أَذْنَابِ الإِبِلِ، حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ فِي رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3302In-book reference : Book 59, Hadith 110USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 521   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3303,
    "id": 3303,
    "url": "https://sunnah.com/bukhari:3303",
    "bookNumber": 59,
    "hadithNumber": 111,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"When you hear the crowing of roosters, ask for Allah's Blessings for (their crowing \nindicates that) they have seen an angel. And when you hear the braying of donkeys, seek Refuge with \nAllah from Satan for (their braying indicates) that they have seen a Satan.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ، فَإِنَّهَا رَأَتْ مَلَكًا، وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ، فَإِنَّهُ رَأَى شَيْطَانًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3303In-book reference : Book 59, Hadith 111USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 522   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3304,
    "id": 3304,
    "url": "https://sunnah.com/bukhari:3304",
    "bookNumber": 59,
    "hadithNumber": 112,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"When night falls (or it is evening), keep your children close to you for the devils \nspread out at that time. But when an hour of the night elapses, you can let them free. Close the doors \nand mention the Name of Allah, for Satan does not open a closed door.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كَانَ جُنْحُ اللَّيْلِ ـ أَوْ أَمْسَيْتُمْ ـ فَكُفُّوا صِبْيَانَكُمْ، فَإِنَّ الشَّيَاطِينَ تَنْتَشِرُ حِينَئِذٍ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَحُلُّوهُمْ، وَأَغْلِقُوا الأَبْوَابَ، وَاذْكُرُوا اسْمَ اللَّهِ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا مُغْلَقًا ‏\"‏‏.‏ قَالَ وَأَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ نَحْوَ مَا أَخْبَرَنِي عَطَاءٌ وَلَمْ يَذْكُرْ ‏\"‏ وَاذْكُرُوا اسْمَ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3304In-book reference : Book 59, Hadith 112USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 523   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3305,
    "id": 3305,
    "url": "https://sunnah.com/bukhari:3305",
    "bookNumber": 59,
    "hadithNumber": 113,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A group of Israelites were lost. Nobody knows what they did. But I do not see \nthem except that they were cursed and changed into rats, for if you put the milk of a she-camel in front \nof a rat, it will not drink it, but if the milk of a sheep is put in front of it, it will drink it.\" I told this to \nKa`b who asked me, \"Did you hear it from the Prophet (ﷺ) ?\" I said, \"Yes.\" Ka`b asked me the same \nquestion several times.; I said to Ka`b. \"Do I read the Torah? (i.e. I tell you this from the Prophet.)\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، عَنْ خَالِدٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فُقِدَتْ أُمَّةٌ مِنْ بَنِي إِسْرَائِيلَ لاَ يُدْرَى مَا فَعَلَتْ، وَإِنِّي لاَ أُرَاهَا إِلاَّ الْفَارَ إِذَا وُضِعَ لَهَا أَلْبَانُ الإِبِلِ لَمْ تَشْرَبْ، وَإِذَا وُضِعَ لَهَا أَلْبَانُ الشَّاءِ شَرِبَتْ ‏\"‏‏.‏ فَحَدَّثْتُ كَعْبًا فَقَالَ أَنْتَ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُهُ قُلْتُ نَعَمْ‏.‏ قَالَ لِي مِرَارًا‏.‏ فَقُلْتُ أَفَأَقْرَأُ التَّوْرَاةَ",
    "reference": "Reference : Sahih al-Bukhari 3305In-book reference : Book 59, Hadith 113USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 524   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3306,
    "id": 3306,
    "url": "https://sunnah.com/bukhari:3306",
    "bookNumber": 59,
    "hadithNumber": 114,
    "narrator": "Narrated Aisha:",
    "english": "The Prophet (ﷺ) called the Salamander, a mischief-doer. I have not heard him ordering that it should be \nkilled. Sa`d bin Waqqas claims that the Prophet (ﷺ) ordered that it should be killed.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، يُحَدِّثُ عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِلْوَزَغِ الْفُوَيْسِقُ‏.‏ وَلَمْ أَسْمَعْهُ أَمَرَ بِقَتْلِهِ‏.‏ وَزَعَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِقَتْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3306In-book reference : Book 59, Hadith 114USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 525   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3307,
    "id": 3307,
    "url": "https://sunnah.com/bukhari:3307",
    "bookNumber": 59,
    "hadithNumber": 115,
    "narrator": "Narrated Um Sharik:",
    "english": "That the Prophet (ﷺ) ordered her to kill Salamanders.",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أُمَّ شَرِيكٍ، أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهَا بِقَتْلِ الأَوْزَاغِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3307In-book reference : Book 59, Hadith 115USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 526   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3308,
    "id": 3308,
    "url": "https://sunnah.com/bukhari:3308",
    "bookNumber": 59,
    "hadithNumber": 116,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"Kill the snake with two white lines on its back, for it blinds the on-looker and \ncauses abortion.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اقْتُلُوا ذَا الطُّفْيَتَيْنِ، فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ، وَيُصِيبُ الْحَبَلَ ‏\"‏‏.‏ \nتَابَعَهُ حَمَّادُ بْنُ سَلَمَةَ أَبَا أُسَامَةَ",
    "reference": "Reference : Sahih al-Bukhari 3308In-book reference : Book 59, Hadith 116USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 527   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3309,
    "id": 3309,
    "url": "https://sunnah.com/bukhari:3309",
    "bookNumber": 59,
    "hadithNumber": 117,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) ordered that a short-tailed or mutilated-tailed snake (i.e. Abtar) should be killed, for it \nblinds the on-looker and causes abortion.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ،، قَالَتْ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِقَتْلِ الأَبْتَرِ وَقَالَ ‏\n\"‏ إِنَّهُ يُصِيبُ الْبَصَرَ، وَيُذْهِبُ الْحَبَلَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3309In-book reference : Book 59, Hadith 117USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 528   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3310,
    "id": 3310,
    "url": "https://sunnah.com/bukhari:3310",
    "bookNumber": 59,
    "hadithNumber": 118,
    "narrator": "Narrated Abu Mulaika:",
    "english": "Ibn `Umar used to kill snakes, but afterwards he forbade their killing and said, \"Once the Prophet (ﷺ) \npulled down a wall and saw a cast-off skin of a snake in it. He said, 'Look for the snake. 'They found it \nand the Prophet (ﷺ) said, \"Kill it.\" For this reason I used to kill snakes. Later on I met Abu Lubaba who \ntold me the Prophet (ﷺ) said, 'Do not kill snakes except the short-tailed or mutilated-tailed snake with two \nwhite lines on its back, for it causes abortion and makes one blind. So kill it.' \"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ أَبِي يُونُسَ الْقُشَيْرِيِّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقْتُلُ الْحَيَّاتِ ثُمَّ نَهَى قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم هَدَمَ حَائِطًا لَهُ، فَوَجَدَ فِيهِ سِلْخَ حَيَّةٍ فَقَالَ ‏\"‏ انْظُرُوا أَيْنَ هُوَ ‏\"‏‏.‏ فَنَظَرُوا فَقَالَ ‏\"‏ اقْتُلُوهُ ‏\"‏‏.‏ فَكُنْتُ أَقْتُلُهَا لِذَلِكَ‏.‏ فَلَقِيتُ أَبَا لُبَابَةَ فَأَخْبَرَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقْتُلُوا الْجِنَّانَ، إِلاَّ كُلَّ أَبْتَرَ ذِي طُفْيَتَيْنِ، فَإِنَّهُ يُسْقِطُ الْوَلَدَ، وَيُذْهِبُ الْبَصَرَ، فَاقْتُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3310, 3311In-book reference : Book 59, Hadith 118USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 529   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3311,
    "id": 3311,
    "url": "https://sunnah.com/bukhari:3311",
    "bookNumber": 59,
    "hadithNumber": 118,
    "narrator": "Narrated Abu Mulaika:",
    "english": "Ibn `Umar used to kill snakes, but afterwards he forbade their killing and said, \"Once the Prophet (ﷺ) \npulled down a wall and saw a cast-off skin of a snake in it. He said, 'Look for the snake. 'They found it \nand the Prophet (ﷺ) said, \"Kill it.\" For this reason I used to kill snakes. Later on I met Abu Lubaba who \ntold me the Prophet (ﷺ) said, 'Do not kill snakes except the short-tailed or mutilated-tailed snake with two \nwhite lines on its back, for it causes abortion and makes one blind. So kill it.' \"",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ أَبِي يُونُسَ الْقُشَيْرِيِّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقْتُلُ الْحَيَّاتِ ثُمَّ نَهَى قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم هَدَمَ حَائِطًا لَهُ، فَوَجَدَ فِيهِ سِلْخَ حَيَّةٍ فَقَالَ ‏\"‏ انْظُرُوا أَيْنَ هُوَ ‏\"‏‏.‏ فَنَظَرُوا فَقَالَ ‏\"‏ اقْتُلُوهُ ‏\"‏‏.‏ فَكُنْتُ أَقْتُلُهَا لِذَلِكَ‏.‏ فَلَقِيتُ أَبَا لُبَابَةَ فَأَخْبَرَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقْتُلُوا الْجِنَّانَ، إِلاَّ كُلَّ أَبْتَرَ ذِي طُفْيَتَيْنِ، فَإِنَّهُ يُسْقِطُ الْوَلَدَ، وَيُذْهِبُ الْبَصَرَ، فَاقْتُلُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3310, 3311In-book reference : Book 59, Hadith 118USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 529   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3312,
    "id": 3312,
    "url": "https://sunnah.com/bukhari:3312",
    "bookNumber": 59,
    "hadithNumber": 119,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar used to kill snakes but when Abu Lubaba informed him that the Prophet (ﷺ) had forbidden the \nkilling of snakes living in houses, he gave up killing them.",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يَقْتُلُ الْحَيَّاتِ‏.‏ فَحَدَّثَهُ أَبُو لُبَابَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ جِنَّانِ الْبُيُوتِ، فَأَمْسَكَ عَنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3312, 3313In-book reference : Book 59, Hadith 119USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3313,
    "id": 3313,
    "url": "https://sunnah.com/bukhari:3313",
    "bookNumber": 59,
    "hadithNumber": 119,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar used to kill snakes but when Abu Lubaba informed him that the Prophet (ﷺ) had forbidden the \nkilling of snakes living in houses, he gave up killing them.",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يَقْتُلُ الْحَيَّاتِ‏.‏ فَحَدَّثَهُ أَبُو لُبَابَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ جِنَّانِ الْبُيُوتِ، فَأَمْسَكَ عَنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3312, 3313In-book reference : Book 59, Hadith 119USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3314,
    "id": 3314,
    "url": "https://sunnah.com/bukhari:3314",
    "bookNumber": 59,
    "hadithNumber": 120,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"Five kinds of animals are mischief-doers and can be killed even in the Sanctuary: \nThey are the rat the scorpion, the kite (a type of predatory bird), the crow and the rabid dog.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عَنْهَا ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحَرَمِ الْفَأْرَةُ، وَالْعَقْرَبُ، وَالْحُدَيَّا، وَالْغُرَابُ، وَالْكَلْبُ الْعَقُورُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3314In-book reference : Book 59, Hadith 120USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 531   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3315,
    "id": 3315,
    "url": "https://sunnah.com/bukhari:3315",
    "bookNumber": 59,
    "hadithNumber": 121,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"It is not sinful of a person in the state of Ihram to kill any of these five animals: \nThe scorpion, the rat, the rabid dog, the crow and the kite.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ مَنْ قَتَلَهُنَّ وَهْوَ مُحْرِمٌ فَلاَ جُنَاحَ عَلَيْهِ الْعَقْرَبُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ، وَالْغُرَابُ، وَالْحِدَأَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3315In-book reference : Book 59, Hadith 121USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 532   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3316,
    "id": 3316,
    "url": "https://sunnah.com/bukhari:3316",
    "bookNumber": 59,
    "hadithNumber": 122,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"Cover your utensils and tie your water skins, and close your doors and keep your \nchildren close to you at night, as the Jinns spread out at such time and snatch things away. When you \ngo to bed, put out your lights, for the mischief-doer (i.e. the rat) may drag away the wick of the candle \nand burn the dwellers of the house.\" Ata said, \"The devils.\" (instead of the Jinns).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ كَثِيرٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ رَفَعَهُ قَالَ ‏\n\"‏ خَمِّرُوا الآنِيَةَ، وَأَوْكُوا الأَسْقِيَةَ، وَأَجِيفُوا الأَبْوَابَ، وَاكْفِتُوا صِبْيَانَكُمْ عِنْدَ الْعِشَاءِ، فَإِنَّ لِلْجِنِّ انْتِشَارًا وَخَطْفَةً، وَأَطْفِئُوا الْمَصَابِيحَ عِنْدَ الرُّقَادِ، فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا اجْتَرَّتِ الْفَتِيلَةَ فَأَحْرَقَتْ أَهْلَ الْبَيْتِ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ وَحَبِيبٌ عَنْ عَطَاءٍ فَإِنَّ لِلشَّيَاطِينِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3316In-book reference : Book 59, Hadith 122USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 533   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3317,
    "id": 3317,
    "url": "https://sunnah.com/bukhari:3317",
    "bookNumber": 59,
    "hadithNumber": 123,
    "narrator": "Narrated `Abdullah:",
    "english": "Once we were in the company of Allah's Messenger (ﷺ) in a cave. Surat-al-Mursalat (77) was revealed there, \nand we were learning it from Allah's Messenger (ﷺ) . Suddenly a snake came out of its hole and we rushed \ntowards it to kill it, but it hastened and entered its hole before we were able to catch it. Allah's Messenger (ﷺ) \nsaid,\" It has been saved from your evil and you have been saved from its evil.\"",
    "arabic": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَارٍ فَنَزَلَتْ ‏{‏وَالْمُرْسَلاَتِ عُرْفًا‏}‏ فَإِنَّا لَنَتَلَقَّاهَا مِنْ فِيهِ، إِذْ خَرَجَتْ حَيَّةٌ مِنْ جُحْرِهَا فَابْتَدَرْنَاهَا لِنَقْتُلَهَا، فَسَبَقَتْنَا فَدَخَلَتْ جُحْرَهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وُقِيَتْ شَرَّكُمْ، كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏ وَعَنْ إِسْرَائِيلَ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ مِثْلَهُ قَالَ وَإِنَّا لَنَتَلَقَّاهَا مِنْ فِيهِ رَطْبَةً‏.‏ وَتَابَعَهُ أَبُو عَوَانَةَ عَنْ مُغِيرَةَ‏.‏ وَقَالَ حَفْصٌ وَأَبُو مُعَاوِيَةَ وَسُلَيْمَانُ بْنُ قَرْمٍ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنِ الأَسْوَدِ عَنْ عَبْدِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3317In-book reference : Book 59, Hadith 123USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 534   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3318,
    "id": 3318,
    "url": "https://sunnah.com/bukhari:3318",
    "bookNumber": 59,
    "hadithNumber": 124,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"A woman entered the (Hell) Fire because of a cat which she had tied, neither \ngiving it food nor setting it free to eat from the vermin of the earth. \"",
    "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ دَخَلَتِ امْرَأَةٌ النَّارَ فِي هِرَّةٍ رَبَطَتْهَا، فَلَمْ تُطْعِمْهَا، وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خِشَاشِ الأَرْضِ ‏\"‏‏.‏ قَالَ وَحَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3318In-book reference : Book 59, Hadith 124USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 535   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3319,
    "id": 3319,
    "url": "https://sunnah.com/bukhari:3319",
    "bookNumber": 59,
    "hadithNumber": 125,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Once while a prophet amongst the prophets was taking a rest underneath a tree, \nan ant bit him. He, therefore, ordered that his luggage be taken away from underneath that tree and \nthen ordered that the dwelling place of the ants should be set on fire. Allah sent him a revelation:-- \n\"Wouldn't it have been sufficient to burn a single ant? (that bit you): (See Page 162, chapter No. 153).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ نَزَلَ نَبِيٌّ مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ، فَأَمَرَ بِجَهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا، ثُمَّ أَمَرَ بِبَيْتِهَا فَأُحْرِقَ بِالنَّارِ، فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ نَمْلَةً وَاحِدَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3319In-book reference : Book 59, Hadith 125USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 536   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3320,
    "id": 3320,
    "url": "https://sunnah.com/bukhari:3320",
    "bookNumber": 59,
    "hadithNumber": 126,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said \"If a house fly falls in the drink of anyone of you, he should dip it (in the drink) and take it out, for \none of its wings has a disease and the other has the cure for the disease.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي عُتْبَةُ بْنُ مُسْلِمٍ، قَالَ أَخْبَرَنِي عُبَيْدُ بْنُ حُنَيْنٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا وَقَعَ الذُّبَابُ فِي شَرَابِ أَحَدِكُمْ فَلْيَغْمِسْهُ، ثُمَّ لِيَنْزِعْهُ، فَإِنَّ فِي إِحْدَى جَنَاحَيْهِ دَاءً وَالأُخْرَى شِفَاءً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3320In-book reference : Book 59, Hadith 126USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 537   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3321,
    "id": 3321,
    "url": "https://sunnah.com/bukhari:3321",
    "bookNumber": 59,
    "hadithNumber": 127,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"A prostitute was forgiven by Allah, because, passing by a panting dog near a \nwell and seeing that the dog was about to die of thirst, she took off her shoe, and tying it with her \nhead-cover she drew out some water for it. So, Allah forgave her because of that.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، وَابْنِ، سِيرِينَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ غُفِرَ لاِمْرَأَةٍ مُومِسَةٍ مَرَّتْ بِكَلْبٍ عَلَى رَأْسِ رَكِيٍّ يَلْهَثُ، قَالَ كَادَ يَقْتُلُهُ الْعَطَشُ، فَنَزَعَتْ خُفَّهَا، فَأَوْثَقَتْهُ بِخِمَارِهَا، فَنَزَعَتْ لَهُ مِنَ الْمَاءِ، فَغُفِرَ لَهَا بِذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3321In-book reference : Book 59, Hadith 127USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 538   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3322,
    "id": 3322,
    "url": "https://sunnah.com/bukhari:3322",
    "bookNumber": 59,
    "hadithNumber": 128,
    "narrator": "Narrated Abu Talha:",
    "english": "The Prophet (ﷺ) said, \"Angels do not enter a house that has either a dog or a picture in it.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْتُهُ مِنَ الزُّهْرِيِّ كَمَا أَنَّكَ هَا هُنَا أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَ ـ رضى الله عنهم ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3322In-book reference : Book 59, Hadith 128USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 539   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3323,
    "id": 3323,
    "url": "https://sunnah.com/bukhari:3323",
    "bookNumber": 59,
    "hadithNumber": 129,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) ordered that the dogs should be killed.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3323In-book reference : Book 59, Hadith 129USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 540   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3324,
    "id": 3324,
    "url": "https://sunnah.com/bukhari:3324",
    "bookNumber": 59,
    "hadithNumber": 130,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If somebody keeps a dog, he loses one Qirat (of the reward) of his good deeds \neveryday, except if he keeps it for the purpose of agriculture or for the protection of livestock. \"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَمْسَكَ كَلْبًا يَنْقُصْ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ، إِلاَّ كَلْبَ حَرْثٍ أَوْ كَلْبَ مَاشِيَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3324In-book reference : Book 59, Hadith 130USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 541   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3325,
    "id": 3325,
    "url": "https://sunnah.com/bukhari:3325",
    "bookNumber": 59,
    "hadithNumber": 131,
    "narrator": "Narrated Sufyan bin Abi Zuhair Ash-Shani:",
    "english": "That he heard Allah's Messenger (ﷺ) saying, \"If somebody keeps a dog that is neither used for farm work nor \nfor guarding the livestock, he will lose one Qirat (of the reward) of his good deeds everyday.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا سُلَيْمَانُ، قَالَ أَخْبَرَنِي يَزِيدُ بْنُ خُصَيْفَةَ، قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ الشَّنَئِيَّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏‏.‏ فَقَالَ السَّائِبُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِيْ وَرَبِّ هَذِهِ الْقِبْلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3325In-book reference : Book 59, Hadith 131USC-MSA web (English) reference : Vol. 4, Book 54, Hadith 542   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3326,
    "id": 3326,
    "url": "https://sunnah.com/bukhari:3326",
    "bookNumber": 60,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah created Adam, making him 60 cubits tall. When He created him, He said to \nhim, \"Go and greet that group of angels, and listen to their reply, for it will be your greeting \n(salutation) and the greeting (salutations of your offspring.\" So, Adam said (to the angels), As-Salamu \nAlaikum (i.e. Peace be upon you). The angels said, \"As-salamu Alaika wa Rahmatu-l-lahi\" (i.e. Peace \nand Allah's Mercy be upon you). Thus the angels added to Adam's salutation the expression, 'Wa \nRahmatu-l-lahi,' Any person who will enter Paradise will resemble Adam (in appearance and figure). \nPeople have been decreasing in stature since Adam's creation.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَلَقَ اللَّهُ آدَمَ وَطُولُهُ سِتُّونَ ذِرَاعًا، ثُمَّ قَالَ اذْهَبْ فَسَلِّمْ عَلَى أُولَئِكَ مِنَ الْمَلاَئِكَةِ، فَاسْتَمِعْ مَا يُحَيُّونَكَ، تَحِيَّتُكَ وَتَحِيَّةُ ذُرِّيَّتِكَ‏.‏ فَقَالَ السَّلاَمُ عَلَيْكُمْ‏.‏ فَقَالُوا السَّلاَمُ عَلَيْكَ وَرَحْمَةُ اللَّهِ‏.‏ فَزَادُوهُ وَرَحْمَةُ اللَّهِ‏.‏ فَكُلُّ مَنْ يَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ آدَمَ، فَلَمْ يَزَلِ الْخَلْقُ يَنْقُصُ حَتَّى الآنَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3326In-book reference : Book 60, Hadith 1USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 543   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3327,
    "id": 3327,
    "url": "https://sunnah.com/bukhari:3327",
    "bookNumber": 60,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The first group of people who will enter Paradise, will be glittering like the full \nmoon and those who will follow them, will glitter like the most brilliant star in the sky. They will not \nurinate, relieve nature, spit, or have any nasal secretions. Their combs will be of gold, and their sweat \nwill smell like musk. The aloes-wood will be used in their centers. Their wives will be houris. All of \nthem will look alike and will resemble their father Adam (in stature), sixty cubits tall.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، ثُمَّ الَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً، لاَ يَبُولُونَ وَلاَ يَتَغَوَّطُونَ وَلاَ يَتْفِلُونَ وَلاَ يَمْتَخِطُونَ، أَمْشَاطُهُمُ الذَّهَبُ، وَرَشْحُهُمُ الْمِسْكُ، وَمَجَامِرُهُمُ الأَلُوَّةُ الأَنْجُوجُ عُودُ الطِّيبِ، وَأَزْوَاجُهُمُ الْحُورُ الْعِينُ، عَلَى خَلْقِ رَجُلٍ وَاحِدٍ عَلَى صُورَةِ أَبِيهِمْ آدَمَ، سِتُّونَ ذِرَاعًا فِي السَّمَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3327In-book reference : Book 60, Hadith 2USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 544   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3328,
    "id": 3328,
    "url": "https://sunnah.com/bukhari:3328",
    "bookNumber": 60,
    "hadithNumber": 3,
    "narrator": "Narrated Zainab bint Abi Salama:",
    "english": "Um Salama said, \"Um Sulaim said, 'O Allah's Messenger (ﷺ)! Allah does not refrain from saying the truth! Is \nit obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she \nnotices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's \nApostle said. 'Then why does a child resemble (its mother)?\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ الْغُسْلُ إِذَا احْتَلَمَتْ قَالَ ‏\"‏ نَعَمْ، إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَضَحِكَتْ أُمُّ سَلَمَةَ، فَقَالَتْ تَحْتَلِمُ الْمَرْأَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَبِمَا يُشْبِهُ الْوَلَدُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3328In-book reference : Book 60, Hadith 3USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 545   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3329,
    "id": 3329,
    "url": "https://sunnah.com/bukhari:3329",
    "bookNumber": 60,
    "hadithNumber": 4,
    "narrator": "Narrated Anas:",
    "english": "When `Abdullah bin Salam heard the arrival of the Prophet (ﷺ) at Medina, he came to him and said, \"I am \ngoing to ask you about three things which nobody knows except a prophet: What is the first portent of \nthe Hour? What will be the first meal taken by the people of Paradise? Why does a child resemble its \nfather, and why does it resemble its maternal uncle\" Allah's Messenger (ﷺ) said, \"Gabriel has just now told \nme of their answers.\" `Abdullah said, \"He (i.e. Gabriel), from amongst all the angels, is the enemy of \nthe Jews.\" Allah's Messenger (ﷺ) said, \"The first portent of the Hour will be a fire that will bring together the \npeople from the east to the west; the first meal of the people of Paradise will be Extra-lobe (caudate \nlobe) of fish-liver. As for the resemblance of the child to its parents: If a man has sexual intercourse \nwith his wife and gets discharge first, the child will resemble the father, and if the woman gets \ndischarge first, the child will resemble her.\" On that `Abdullah bin Salam said, \"I testify that you are \nthe Messenger of Allah.\" `Abdullah bin Salam further said, \"O Allah's Messenger (ﷺ)! The Jews are liars, and if \nthey should come to know about my conversion to Islam before you ask them (about me), they would \ntell a lie about me.\" The Jews came to Allah's Messenger (ﷺ) and `Abdullah went inside the house. Allah's \nApostle asked (the Jews), \"What kind of man is `Abdullah bin Salam amongst you?\" They replied, \n\"He is the most learned person amongst us, and the best amongst us, and the son of the best amongst \nus.\" Allah's Messenger (ﷺ) said, \"What do you think if he embraces Islam (will you do as he does)?\" The \nJews said, \"May Allah save him from it.\" Then `Abdullah bin Salam came out in front of them saying, \n\"I testify that None has the right to be worshipped but Allah and that Muhammad is the Apostle of \nAllah.\" Thereupon they said, \"He is the evilest among us, and the son of the evilest amongst us,\" and \ncontinued talking badly of him.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بَلَغَ عَبْدَ اللَّهِ بْنَ سَلاَمٍ مَقْدَمُ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، فَأَتَاهُ، فَقَالَ إِنِّي سَائِلُكَ عَنْ ثَلاَثٍ لاَ يَعْلَمُهُنَّ إِلاَّ نَبِيٌّ، ‏{‏قَالَ مَا‏}‏ أَوَّلُ أَشْرَاطِ السَّاعَةِ وَمَا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ وَمِنْ أَىِّ شَىْءٍ يَنْزِعُ الْوَلَدُ إِلَى أَبِيهِ وَمِنْ أَىِّ شَىْءٍ يَنْزِعُ إِلَى أَخْوَالِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَبَّرَنِي بِهِنَّ آنِفًا جِبْرِيلُ ‏\"‏‏.‏ قَالَ فَقَالَ عَبْدُ اللَّهِ ذَاكَ عَدُوُّ الْيَهُودِ مِنَ الْمَلاَئِكَةِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا أَوَّلُ أَشْرَاطِ السَّاعَةِ فَنَارٌ تَحْشُرُ النَّاسَ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ‏.‏ وَأَمَّا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ فَزِيَادَةُ كَبِدِ حُوتٍ‏.‏ وَأَمَّا الشَّبَهُ فِي الْوَلَدِ فَإِنَّ الرَّجُلَ إِذَا غَشِيَ الْمَرْأَةَ فَسَبَقَهَا مَاؤُهُ كَانَ الشَّبَهُ لَهُ، وَإِذَا سَبَقَ مَاؤُهَا كَانَ الشَّبَهُ لَهَا ‏\"‏‏.‏ قَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ‏.‏ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ قَوْمٌ بُهُتٌ، إِنْ عَلِمُوا بِإِسْلاَمِي قَبْلَ أَنْ تَسْأَلَهُمْ بَهَتُونِي عِنْدَكَ، فَجَاءَتِ الْيَهُودُ وَدَخَلَ عَبْدُ اللَّهِ الْبَيْتَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىُّ رَجُلٍ فِيكُمْ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ قَالُوا أَعْلَمُنَا وَابْنُ أَعْلَمِنَا وَأَخْبَرُنَا وَابْنُ أَخْيَرِنَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَرَأَيْتُمْ إِنْ أَسْلَمَ عَبْدُ اللَّهِ ‏\"‏‏.‏ قَالُوا أَعَاذَهُ اللَّهُ مِنْ ذَلِكَ‏.‏ فَخَرَجَ عَبْدُ اللَّهِ إِلَيْهِمْ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالُوا شَرُّنَا وَابْنُ شَرِّنَا‏.‏ وَوَقَعُوا فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3329In-book reference : Book 60, Hadith 4USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 546   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3330,
    "id": 3330,
    "url": "https://sunnah.com/bukhari:3330",
    "bookNumber": 60,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"But for the Israelis, meat would not decay and but for Eve, wives would never \nbetray their husbands.\"",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ يَعْنِي ‏\n\"‏ لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3330In-book reference : Book 60, Hadith 5USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 547   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3331,
    "id": 3331,
    "url": "https://sunnah.com/bukhari:3331",
    "bookNumber": 60,
    "hadithNumber": 6,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved \nportion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you \nleave it as it is, it will remain crooked. So treat women nicely.\"",
    "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَمُوسَى بْنُ حِزَامٍ، قَالاَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ مَيْسَرَةَ الأَشْجَعِيِّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اسْتَوْصُوا بِالنِّسَاءِ، فَإِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ، وَإِنَّ أَعْوَجَ شَىْءٍ فِي الضِّلَعِ أَعْلاَهُ، فَإِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ، فَاسْتَوْصُوا بِالنِّسَاءِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3331In-book reference : Book 60, Hadith 6USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 548   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3332,
    "id": 3332,
    "url": "https://sunnah.com/bukhari:3332",
    "bookNumber": 60,
    "hadithNumber": 7,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ), the true and truly inspired said, \"(as regards your creation), every one of you is \ncollected in the womb of his mother for the first forty days, and then he becomes a clot for another \nforty days, and then a piece of flesh for another forty days. Then Allah sends an angel to write four \nitems: He writes his deeds, time of his death, means of his livelihood, and whether he will be \nwretched or blessed (in religion). Then the soul is breathed into his body. So a man may do deeds \ncharacteristic of the people of the (Hell) Fire, so much so that there is only the distance of a cubit \nbetween him and it, and then what has been written (by the angel) surpasses, and so he starts doing \ndeeds characteristic of the people of Paradise and enters Paradise. Similarly, a person may do deeds \ncharacteristic of the people of Paradise, so much so that there is only the distance of a cubit between \nhim and it, and then what has been written (by the angel) surpasses, and he starts doing deeds of the \npeople of the (Hell) Fire and enters the (Hell) Fire.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ ‏\n\"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ إِلَيْهِ مَلَكًا بِأَرْبَعِ كَلِمَاتٍ، فَيُكْتَبُ عَمَلُهُ وَأَجَلُهُ وَرِزْقُهُ وَشَقِيٌّ أَوْ سَعِيدٌ، ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ، فَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، فَيَدْخُلُ الْجَنَّةَ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُ النَّارَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3332In-book reference : Book 60, Hadith 7USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 549   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3333,
    "id": 3333,
    "url": "https://sunnah.com/bukhari:3333",
    "bookNumber": 60,
    "hadithNumber": 8,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Allah has appointed an angel in the womb, and the angel says, 'O Lord! A drop of \ndischarge (i.e. of semen), O Lord! a clot, O Lord! a piece of flesh.' And then, if Allah wishes to \ncomplete the child's creation, the angel will say. 'O Lord! A male or a female? O Lord! wretched or \nblessed (in religion)? What will his livelihood be? What will his age be?' The angel writes all this \nwhile the child is in the womb of its mother.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ وَكَّلَ فِي الرَّحِمِ مَلَكًا فَيَقُولُ يَا رَبِّ نُطْفَةٌ، يَا رَبِّ عَلَقَةٌ، يَا رَبِّ مُضْغَةٌ، فَإِذَا أَرَادَ أَنْ يَخْلُقَهَا قَالَ يَا رَبِّ، أَذَكَرٌ أَمْ يَا رَبِّ أُنْثَى يَا رَبِّ شَقِيٌّ أَمْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3333In-book reference : Book 60, Hadith 8USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 550   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3334,
    "id": 3334,
    "url": "https://sunnah.com/bukhari:3334",
    "bookNumber": 60,
    "hadithNumber": 9,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"Allah will say to that person of the (Hell) Fire who will receive the least \npunishment, 'If you had everything on the earth, would you give it as a ransom to free yourself (i.e. \nsave yourself from this Fire)?' He will say, 'Yes.' Then Allah will say, 'While you were in the \nbackbone of Adam, I asked you much less than this, i.e. not to worship others besides Me, but you \ninsisted on worshipping others besides me.' \"",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسٍ، يَرْفَعُهُ ‏\n\"‏ أَنَّ اللَّهَ، يَقُولُ لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا لَوْ أَنَّ لَكَ مَا فِي الأَرْضِ مِنْ شَىْءٍ كُنْتَ تَفْتَدِي بِهِ قَالَ نَعَمْ‏.‏ قَالَ فَقَدْ سَأَلْتُكَ مَا هُوَ أَهْوَنُ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ بِي‏.‏ فَأَبَيْتَ إِلاَّ الشِّرْكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3334In-book reference : Book 60, Hadith 9USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 551   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3335,
    "id": 3335,
    "url": "https://sunnah.com/bukhari:3335",
    "bookNumber": 60,
    "hadithNumber": 10,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"Whenever a person is murdered unjustly, there is a share from the burden of the \ncrime on the first son of Adam for he was the first to start the tradition of murdering.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُقْتَلُ نَفْسٌ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا، لأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3335In-book reference : Book 60, Hadith 10USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 552   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3336,
    "id": 3336,
    "url": "https://sunnah.com/bukhari:3336",
    "bookNumber": 60,
    "hadithNumber": 11,
    "narrator": "Narrated Aishah (ra):",
    "english": "I heard the Prophet (ﷺ), \"Souls are like recruited troops: Those who are like qualities are inclined to each other, but those who have dissimilar qualities, differ.\"",
    "arabic": "قَالَ قَالَ اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ، فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ، وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏‏.‏ وَقَالَ يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3336In-book reference : Book 60, Hadith 11USC-MSA web (English) reference : Vol. 1, Book 55, Hadith 552   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3337,
    "id": 3337,
    "url": "https://sunnah.com/bukhari:3337",
    "bookNumber": 60,
    "hadithNumber": 12,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Once Allah's Messenger (ﷺ) stood amongst the people, glorified and praised Allah as He deserved and then \nmentioned the Dajjal saying, \"l warn you against him (i.e. the Dajjal) and there was no prophet but \nwarned his nation against him. No doubt, Noah warned his nation against him but I tell you about him \nsomething of which no prophet told his nation before me. You should know that he is one-eyed, and \nAllah is not one-eyed.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ سَالِمٌ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ ذَكَرَ الدَّجَّالَ، فَقَالَ ‏\n\"‏ إِنِّي لأُنْذِرُكُمُوهُ، وَمَا مِنْ نَبِيٍّ إِلاَّ أَنْذَرَهُ قَوْمَهُ، لَقَدْ أَنْذَرَ نُوحٌ قَوْمَهُ، وَلَكِنِّي أَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ، تَعْلَمُونَ أَنَّهُ أَعْوَرُ، وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3337In-book reference : Book 60, Hadith 12USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 553   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3338,
    "id": 3338,
    "url": "https://sunnah.com/bukhari:3338",
    "bookNumber": 60,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Shall I not tell you about the Dajjal a story of which no prophet told his nation? \nThe Dajjall is one-eyed and will bring with him what will resemble Hell and Paradise, and what he \nwill call Paradise will be actually Hell; so I warn you (against him) as Noah warned his nation against \nhim.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أُحَدِّثُكُمْ حَدِيثًا عَنِ الدَّجَّالِ مَا حَدَّثَ بِهِ نَبِيٌّ قَوْمَهُ، إِنَّهُ أَعْوَرُ، وَإِنَّهُ يَجِيءُ مَعَهُ بِمِثَالِ الْجَنَّةِ وَالنَّارِ، فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ‏.‏ هِيَ النَّارُ، وَإِنِّي أُنْذِرُكُمْ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3338In-book reference : Book 60, Hadith 13USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 554   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3339,
    "id": 3339,
    "url": "https://sunnah.com/bukhari:3339",
    "bookNumber": 60,
    "hadithNumber": 14,
    "narrator": "Narrated Abu Sa`id:",
    "english": "Allah's Messenger (ﷺ) said, \"Noah and his nation will come (on the Day of Resurrection and Allah will ask \n(Noah), \"Did you convey (the Message)?' He will reply, 'Yes, O my Lord!' Then Allah will ask Noah's \nnation, 'Did Noah convey My Message to you?' They will reply, 'No, no prophet came to us.' Then \nAllah will ask Noah, 'Who will stand a witness for you?' He will reply, 'Muhammad and his followers \n(will stand witness for me).' So, I and my followers will stand as witnesses for him (that he conveyed \nAllah's Message).\" That is, (the interpretation) of the Statement of Allah: \"Thus we have made you a \njust and the best nation that you might be witnesses Over mankind ..\" (2.143)",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَجِيءُ نُوحٌ وَأُمَّتُهُ فَيَقُولُ اللَّهُ تَعَالَى هَلْ بَلَّغْتَ فَيَقُولُ نَعَمْ، أَىْ رَبِّ‏.‏ فَيَقُولُ لأُمَّتِهِ هَلْ بَلَّغَكُمْ فَيَقُولُونَ لاَ، مَا جَاءَنَا مِنْ نَبِيٍّ‏.‏ فَيَقُولُ لِنُوحٍ مَنْ يَشْهَدُ لَكَ فَيَقُولُ مُحَمَّدٌ صلى الله عليه وسلم وَأُمَّتُهُ، فَنَشْهَدُ أَنَّهُ قَدْ بَلَّغَ، وَهْوَ قَوْلُهُ جَلَّ ذِكْرُهُ ‏{‏وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ‏}‏ وَالْوَسَطُ الْعَدْلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3339In-book reference : Book 60, Hadith 14USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 555   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3340,
    "id": 3340,
    "url": "https://sunnah.com/bukhari:3340",
    "bookNumber": 60,
    "hadithNumber": 15,
    "narrator": "Narrated Abu Huraira:",
    "english": "We were in the company of the Prophet (ﷺ) at a banquet and a cooked (mutton) forearm was set before \nhim, and he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the \nDay of Resurrection. Do you know how Allah will gather all the first and the last (people) in one level \nplace where an observer will be able to see (all) of them and they will be able to hear the announcer, \nand the sun will come near to them. Some People will say: Don't you see, in what condition you are \nand the state to which you have reached? Why don't you look for a person who can intercede for you \nwith your Lord? Some people will say: Appeal to your father, Adam.' They will go to him and say: 'O \nAdam! You are the father of all mankind, and Allah created you with His Own Hands, and ordered the \nangels to prostrate for you, and made you live in Paradise. Will you not intercede for us with your \nLord? Don't you see in what (miserable) state we are, and to what condition we have reached?' On that \nAdam will reply, 'My Lord is so angry as He has never been before and will never be in the future; \n(besides), He forbade me (to eat from) the tree, but I disobeyed (Him), (I am worried about) myself! \nMyself! Go to somebody else; go to Noah.' They will go to Noah and say; 'O Noah! You are the first \namongst the messengers of Allah to the people of the earth, and Allah named you a thankful slave. \nDon't you see in what a (miserable) state we are and to what condition we have reached? Will you not \nintercede for us with your Lord? Noah will reply: 'Today my Lord has become so angry as he had \nnever been before and will never be in the future Myself! Myself! Go to the Prophet (Muhammad). \nThe people will come to me, and I will prostrate myself underneath Allah's Throne. Then I will be \naddressed: 'O Muhammad! Raise your head; intercede, for your intercession will be accepted, and ask \n(for anything). for you will be given. \"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا أَبُو حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي دَعْوَةٍ، فَرُفِعَ إِلَيْهِ الذِّرَاعُ، وَكَانَتْ تُعْجِبُهُ، فَنَهَسَ مِنْهَا نَهْسَةً وَقَالَ ‏\n\"‏ أَنَا سَيِّدُ الْقَوْمِ يَوْمَ الْقِيَامَةِ، هَلْ تَدْرُونَ بِمَنْ يَجْمَعُ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ فِي صَعِيدٍ وَاحِدٍ فَيُبْصِرُهُمُ النَّاظِرُ وَيُسْمِعُهُمُ الدَّاعِي، وَتَدْنُو مِنْهُمُ الشَّمْسُ، فَيَقُولُ بَعْضُ النَّاسِ أَلاَ تَرَوْنَ إِلَى مَا أَنْتُمْ فِيهِ، إِلَى مَا بَلَغَكُمْ، أَلاَ تَنْظُرُونَ إِلَى مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ فَيَقُولُ بَعْضُ النَّاسِ أَبُوكُمْ آدَمُ، فَيَأْتُونَهُ فَيَقُولُونَ يَا آدَمُ أَنْتَ أَبُو الْبَشَرِ، خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ، وَأَسْكَنَكَ الْجَنَّةَ، أَلاَ تَشْفَعُ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ وَمَا بَلَغَنَا فَيَقُولُ رَبِّي غَضِبَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلاَ يَغْضَبُ بَعْدَهُ مِثْلَهُ، وَنَهَانِي عَنِ الشَّجَرَةِ فَعَصَيْتُهُ، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى نُوحٍ‏.‏ فَيَأْتُونَ نُوحًا فَيَقُولُونَ يَا نُوحُ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الأَرْضِ، وَسَمَّاكَ اللَّهُ عَبْدًا شَكُورًا، أَمَا تَرَى إِلَى مَا نَحْنُ فِيهِ أَلاَ تَرَى إِلَى مَا بَلَغَنَا أَلاَ تَشْفَعُ لَنَا إِلَى رَبِّكَ فَيَقُولُ رَبِّي غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلاَ يَغْضَبُ بَعْدَهُ مِثْلَهُ، نَفْسِي نَفْسِي، ائْتُوا النَّبِيَّ صلى الله عليه وسلم، فَيَأْتُونِي، فَأَسْجُدُ تَحْتَ الْعَرْشِ فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَاشْفَعْ تُشَفَّعْ، وَسَلْ تُعْطَهُ ‏\"‏‏.‏ قَالَ مُحَمَّدُ بْنُ عُبَيْدٍ لاَ أَحْفَظُ سَائِرَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3340In-book reference : Book 60, Hadith 15USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 556   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3341,
    "id": 3341,
    "url": "https://sunnah.com/bukhari:3341",
    "bookNumber": 60,
    "hadithNumber": 16,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) recited the following Verse) in the usual tone: 'Fahal-Min-Muddalkir.' (54.15)",
    "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، أَخْبَرَنَا أَبُو أَحْمَدَ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ ‏{‏فَهَلْ مِنْ مُدَّكِرٍ‏}‏ مِثْلَ قِرَاءَةِ الْعَامَّةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3341In-book reference : Book 60, Hadith 16USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 557   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3342,
    "id": 3342,
    "url": "https://sunnah.com/bukhari:3342",
    "bookNumber": 60,
    "hadithNumber": 17,
    "narrator": "Narrated Anas (ra):",
    "english": "Abu Dhar (ra) used to say that Allah's  Messenger (ﷺ) said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad (ﷺ) is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"\n\nAnas added: Abu Dhar mentioned that Prophet (ﷺ) met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet (ﷺ)) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet (ﷺ) passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet (ﷺ) asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet (ﷺ) added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet (ﷺ) Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"\n\nNarrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet (ﷺ) said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet (ﷺ) said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
    "arabic": "قَالَ عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، ح حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ أَنَسٌ كَانَ أَبُو ذَرٍّ ـ رضى الله عنه ـ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ فُرِجَ سَقْفُ بَيْتِي وَأَنَا بِمَكَّةَ، فَنَزَلَ جِبْرِيلُ، فَفَرَجَ صَدْرِي، ثُمَّ غَسَلَهُ بِمَاءِ زَمْزَمَ، ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا فَأَفْرَغَهَا فِي صَدْرِي، ثُمَّ أَطْبَقَهُ ثُمَّ أَخَذَ بِيَدِي، فَعَرَجَ بِي إِلَى السَّمَاءِ، فَلَمَّا جَاءَ إِلَى السَّمَاءِ الدُّنْيَا، قَالَ جِبْرِيلُ لِخَازِنِ السَّمَاءِ افْتَحْ‏.‏ قَالَ مَنْ هَذَا قَالَ هَذَا جِبْرِيلُ‏.‏ قَالَ مَعَكَ أَحَدٌ قَالَ مَعِيَ مُحَمَّدٌ‏.‏ قَالَ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ، فَافْتَحْ‏.‏ فَلَمَّا عَلَوْنَا السَّمَاءَ إِذَا رَجُلٌ عَنْ يَمِينِهِ أَسْوِدَةٌ، وَعَنْ يَسَارِهِ أَسْوِدَةٌ، فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا يَا جِبْرِيلُ قَالَ هَذَا آدَمُ، وَهَذِهِ الأَسْوِدَةُ عَنْ يَمِينِهِ، وَعَنْ شِمَالِهِ نَسَمُ بَنِيهِ، فَأَهْلُ الْيَمِينِ مِنْهُمْ أَهْلُ الْجَنَّةِ، وَالأَسْوِدَةُ الَّتِي عَنْ شِمَالِهِ أَهْلُ النَّارِ، فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى، ثُمَّ عَرَجَ بِي جِبْرِيلُ، حَتَّى أَتَى السَّمَاءَ الثَّانِيَةَ، فَقَالَ لِخَازِنِهَا افْتَحْ‏.‏ فَقَالَ لَهُ خَازِنُهَا مِثْلَ مَا قَالَ الأَوَّلُ، فَفَتَحَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَذَكَرَ أَنَّهُ وَجَدَ فِي السَّمَوَاتِ إِدْرِيسَ وَمُوسَى وَعِيسَى وَإِبْرَاهِيمَ، وَلَمْ يُثْبِتْ لِي كَيْفَ مَنَازِلُهُمْ، غَيْرَ أَنَّهُ قَدْ ذَكَرَ أَنَّهُ وَجَدَ آدَمَ فِي السَّمَاءِ الدُّنْيَا، وَإِبْرَاهِيمَ فِي السَّادِسَةِ‏.‏ وَقَالَ أَنَسٌ فَلَمَّا مَرَّ جِبْرِيلُ بِإِدْرِيسَ‏.‏ قَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ فَقُلْتُ مَنْ هَذَا قَالَ هَذَا إِدْرِيسُ، ثُمَّ مَرَرْتُ بِمُوسَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا مُوسَى‏.‏ ثُمَّ مَرَرْتُ بِعِيسَى، فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ عِيسَى‏.‏ ثُمَّ مَرَرْتُ بِإِبْرَاهِيمَ، فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا إِبْرَاهِيمُ‏.‏ قَالَ وَأَخْبَرَنِي ابْنُ حَزْمٍ أَنَّ ابْنَ عَبَّاسٍ وَأَبَا حَبَّةَ الأَنْصَارِيَّ كَانَا يَقُولاَنِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ثُمَّ عُرِجَ بِي حَتَّى ظَهَرْتُ لِمُسْتَوًى أَسْمَعُ صَرِيفَ الأَقْلاَمِ ‏\"‏‏.‏ قَالَ ابْنُ حَزْمٍ وَأَنَسُ بْنُ مَالِكٍ ـ رضى الله عنهما ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَفَرَضَ اللَّهُ عَلَىَّ خَمْسِينَ صَلاَةً، فَرَجَعْتُ بِذَلِكَ حَتَّى أَمُرَّ بِمُوسَى، فَقَالَ مُوسَى مَا الَّذِي فُرِضَ عَلَى أُمَّتِكَ قُلْتُ فَرَضَ عَلَيْهِمْ خَمْسِينَ صَلاَةً‏.‏ قَالَ فَرَاجِعْ رَبَّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ‏.‏ فَرَجَعْتُ فَرَاجَعْتُ رَبِّي فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى، فَقَالَ رَاجِعْ رَبَّكَ، فَذَكَرَ مِثْلَهُ، فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى، فَأَخْبَرْتُهُ فَقَالَ رَاجِعْ رَبَّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ، فَرَجَعْتُ فَرَاجَعْتُ رَبِّي فَقَالَ هِيَ خَمْسٌ، وَهْىَ خَمْسُونَ، لاَ يُبَدَّلُ الْقَوْلُ لَدَىَّ‏.‏ فَرَجَعْتُ إِلَى مُوسَى، فَقَالَ رَاجِعْ رَبَّكَ‏.‏ فَقُلْتُ قَدِ اسْتَحْيَيْتُ مِنْ رَبِّي، ثُمَّ انْطَلَقَ، حَتَّى أَتَى السِّدْرَةَ الْمُنْتَهَى، فَغَشِيَهَا أَلْوَانٌ لاَ أَدْرِي مَا هِيَ، ثُمَّ أُدْخِلْتُ ‏{‏الْجَنَّةَ‏}‏ فَإِذَا فِيهَا جَنَابِذُ اللُّؤْلُؤِ وَإِذَا تُرَابُهَا الْمِسْكُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3342In-book reference : Book 60, Hadith 17USC-MSA web (English) reference : Vol. 1, Book 55, Hadith 557   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3343,
    "id": 3343,
    "url": "https://sunnah.com/bukhari:3343",
    "bookNumber": 60,
    "hadithNumber": 18,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"I have been made victorious with As-Saba (i.e. an easterly wind) and the people of 'Ad were destroyed by Ad-Dabur (i.e. a westerly wind).\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نُصِرْتُ بِالصَّبَا، وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3343In-book reference : Book 60, Hadith 18USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3344,
    "id": 3344,
    "url": "https://sunnah.com/bukhari:3344",
    "bookNumber": 60,
    "hadithNumber": 19,
    "narrator": "Narrated Abu Sa`id:",
    "english": "`Ali sent a piece of gold to the Prophet (ﷺ) who distributed it among four persons: Al-Aqra' bin H`Abis Al-Hanzali from the tribe of Mujashi, 'Uyaina bin Badr Al-Fazari, Zaid at-Ta'i who belonged to (the tribe of) Bani Nahban, and 'Alqama bin Ulatha Al-`Amir who belonged to (the tribe of) Bani Kilab. So the Quraish and the Ansar became angry and said, \"He (i.e. the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet (ﷺ) said, \"I give them) so as to attract their hearts (to Islam).\" Then a man with sunken eyes, prominent checks, a raised forehead, a thick beard and a shaven head, came (in front of the Prophet (ﷺ) ) and said, \"Be afraid of Allah, O Muhammad!\" The Prophet (ﷺ) ' said \"Who would obey Allah if I disobeyed Him? (Is it fair that) Allah has trusted all the people of the earth to me while, you do not trust me?\" Somebody who, I think was Khalid bin Al-Walid, requested the Prophet (ﷺ) to let him chop that man's head off, but he prevented him. When the man left, the Prophet (ﷺ) said, \"Among the off-spring of this man will be some who will recite the Qur'an but the Qur'an will not reach beyond their throats (i.e. they will recite like parrots and will not understand it nor act on it), and they will renegade from the religion as an arrow goes through the game's body. They will kill the Muslims but will not disturb the idolaters. If I should live up to their time' I will kill them as the people of 'Ad were killed (i.e. I will kill all of them).\"",
    "arabic": "قَالَ وَقَالَ ابْنُ كَثِيرٍ عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ بَعَثَ عَلِيٌّ ـ رضى الله عنه ـ إِلَى النَّبِيِّ صلى الله عليه وسلم بِذُهَيْبَةٍ فَقَسَمَهَا بَيْنَ الأَرْبَعَةِ الأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ ثُمَّ الْمُجَاشِعِيِّ، وَعُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ، وَزَيْدٍ الطَّائِيِّ ثُمَّ أَحَدِ بَنِي نَبْهَانَ، وَعَلْقَمَةَ بْنِ عُلاَثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلاَبٍ، فَغَضِبَتْ قُرَيْشٌ وَالأَنْصَارُ، قَالُوا يُعْطِي صَنَادِيدَ أَهْلِ نَجْدٍ وَيَدَعُنَا‏.‏ قَالَ ‏\"‏ إِنَّمَا أَتَأَلَّفُهُمْ ‏\"‏‏.‏ فَأَقْبَلَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ مُشْرِفُ الْوَجْنَتَيْنِ، نَاتِئُ الْجَبِينِ، كَثُّ اللِّحْيَةِ، مَحْلُوقٌ فَقَالَ اتَّقِ اللَّهَ يَا مُحَمَّدُ‏.‏ فَقَالَ ‏\"‏ مَنْ يُطِعِ اللَّهَ إِذَا عَصَيْتُ، أَيَأْمَنُنِي اللَّهُ عَلَى أَهْلِ الأَرْضِ فَلاَ تَأْمَنُونِي ‏\"‏‏.‏ فَسَأَلَهُ رَجُلٌ قَتْلَهُ ـ أَحْسِبُهُ خَالِدَ بْنَ الْوَلِيدِ ـ فَمَنَعَهُ، فَلَمَّا وَلَّى قَالَ ‏\"‏ إِنَّ مِنْ ضِئْضِئِ هَذَا ـ أَوْ فِي عَقِبِ هَذَا ـ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ، لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، يَقْتُلُونَ أَهْلَ الإِسْلاَمِ، وَيَدَعُونَ أَهْلَ الأَوْثَانِ، لَئِنْ أَنَا أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ عَادٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3344In-book reference : Book 60, Hadith 19USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3345,
    "id": 3345,
    "url": "https://sunnah.com/bukhari:3345",
    "bookNumber": 60,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah:",
    "english": "I heard the Prophet (ﷺ) reciting: \"Fahal Min Muddakir.\" (See Hadith No. 557)",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ ‏{‏فَهَلْ مِنْ مُدَّكِرٍ ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3345In-book reference : Book 60, Hadith 20USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 559   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3346,
    "id": 3346,
    "url": "https://sunnah.com/bukhari:3346",
    "bookNumber": 60,
    "hadithNumber": 21,
    "narrator": "Narrated Zainab bint Jahsh:",
    "english": "That the Prophet (ﷺ) once came to her in a state of fear and said, \"None has the right to be worshipped but \nAllah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall \nof Gog and Magog like this,\" making a circle with his thumb and index finger. Zainab bint Jahsh said, \n\"O Allah's Messenger (ﷺ)! Shall we be destroyed even though there are pious persons among us?\" He said, \n\"Yes, when the evil person will increase.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، حَدَّثَتْهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ، عَنْ زَيْنَبَ ابْنَةِ جَحْشٍ ـ رضى الله عنهن أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا فَزِعًا يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏‏.‏ وَحَلَّقَ بِإِصْبَعِهِ الإِبْهَامِ وَالَّتِي تَلِيهَا‏.‏ قَالَتْ زَيْنَبُ ابْنَةُ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ ‏\"‏ نَعَمْ، إِذَا كَثُرَ الْخُبْثُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3346In-book reference : Book 60, Hadith 21USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 565   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3347,
    "id": 3347,
    "url": "https://sunnah.com/bukhari:3347",
    "bookNumber": 60,
    "hadithNumber": 22,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, \nand he made with his hand (with the help of his fingers).",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَتَحَ اللَّهُ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلَ هَذَا ‏\"‏‏.‏ وَعَقَدَ بِيَدِهِ تِسْعِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3347In-book reference : Book 60, Hadith 22USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 566   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3348,
    "id": 3348,
    "url": "https://sunnah.com/bukhari:3348",
    "bookNumber": 60,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The Prophet (ﷺ) said, \"Allah will say (on the Day of Resurrection), 'O Adam.' Adam will reply, 'Labbaik \nwa Sa`daik', and all the good is in Your Hand.' Allah will say: 'Bring out the people of the fire.' Adam \nwill say: 'O Allah! How many are the people of the Fire?' Allah will reply: 'From every one thousand, \ntake out nine-hundred-and ninety-nine.' At that time children will become hoary headed, every \npregnant female will have a miscarriage, and one will see mankind as drunken, yet they will not be \ndrunken, but dreadful will be the Wrath of Allah.\" The companions of the Prophet (ﷺ) asked, \"O Allah's \nApostle! Who is that (excepted) one?\" He said, \"Rejoice with glad tidings; one person will be from \nyou and one-thousand will be from Gog and Magog.\" \nThe Prophet (ﷺ) further said, \"By Him in Whose Hands my life is, hope that you will be one-fourth of the \npeople of Paradise.\" We shouted, \"Allahu Akbar!\" He added, \"I hope that you will be one-third of the \npeople of Paradise.\" We shouted, \"Allahu Akbar!\" He said, \"I hope that you will be half of the people \nof Paradise.\" We shouted, \"Allahu Akbar!\" He further said, \"You (Muslims) (compared with non \nMuslims) are like a black hair in the skin of a white ox or like a white hair in the skin of a black ox \n(i.e. your number is very small as compared with theirs).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَقُولُ اللَّهُ تَعَالَى يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ فَيَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏.‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ، فَعِنْدَهُ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا، وَتَرَى النَّاسَ سُكَارَى، وَمَا هُمْ بِسُكَارَى، وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَأَيُّنَا ذَلِكَ الْوَاحِدُ قَالَ ‏\"‏ أَبْشِرُوا فَإِنَّ مِنْكُمْ رَجُلٌ، وَمِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ، إِنِّي أَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ أَرْجُو أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ أَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ مَا أَنْتُمْ فِي النَّاسِ إِلاَّ كَالشَّعَرَةِ السَّوْدَاءِ فِي جِلْدِ ثَوْرٍ أَبْيَضَ، أَوْ كَشَعَرَةٍ بَيْضَاءَ فِي جِلْدِ ثَوْرٍ أَسْوَدَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3348In-book reference : Book 60, Hadith 23USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 567   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3349,
    "id": 3349,
    "url": "https://sunnah.com/bukhari:3349",
    "bookNumber": 60,
    "hadithNumber": 24,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"You will be gathered (on the Day of Judgment), bare-footed, naked and not \ncircumcised.\" He then recited:--'As We began the first creation, We, shall repeat it: A Promise We \nhave undertaken: Truly we shall do it.' (21.104) He added, \"The first to be dressed on the Day of \nResurrection, will be Abraham, and some of my companions will be taken towards the left side (i.e. to \nthe (Hell) Fire), and I will say: 'My companions! My companions!' It will be said: 'They renegade \nfrom Islam after you left them.' Then I will say as the Pious slave of Allah (i.e. Jesus) said. 'And I was \na witness Over them while I dwelt amongst them. When You took me up You were the Watcher over \nthem, And You are a witness to all things. If You punish them. They are Your slaves And if You \nforgive them, Verily you, only You are the All-Mighty, the All-Wise.\" (5.120-121)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً غُرْلاً ـ ثُمَّ قَرَأَ – ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ وَأَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، وَإِنَّ أُنَاسًا مِنْ أَصْحَابِي يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ أَصْحَابِي أَصْحَابِي‏.‏ فَيَقُولُ، إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْحَكِيمُ ‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 3349In-book reference : Book 60, Hadith 24USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 568   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3350,
    "id": 3350,
    "url": "https://sunnah.com/bukhari:3350",
    "bookNumber": 60,
    "hadithNumber": 25,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"On the Day of Resurrection Abraham will meet his father Azar whose face will be \ndark and covered with dust.(The Prophet (ﷺ) Abraham will say to him): 'Didn't I tell you not to disobey \nme?' His father will reply: 'Today I will not disobey you.' 'Abraham will say: 'O Lord! You promised \nme not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than \ncursing and dishonoring my father?' Then Allah will say (to him):' 'I have forbidden Paradise for the \ndisbelievers.\" Then he will be addressed, 'O Abraham! Look! What is underneath your feet?' He will \nlook and there he will see a Dhabh (an animal,) blood-stained, which will be caught by the legs and \nthrown in the (Hell) Fire.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَخِي عَبْدُ الْحَمِيدِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَلْقَى إِبْرَاهِيمُ أَبَاهُ آزَرَ يَوْمَ الْقِيَامَةِ، وَعَلَى وَجْهِ آزَرَ قَتَرَةٌ وَغَبَرَةٌ، فَيَقُولُ لَهُ إِبْرَاهِيمُ أَلَمْ أَقُلْ لَكَ لاَ تَعْصِنِي فَيَقُولُ أَبُوهُ فَالْيَوْمَ لاَ أَعْصِيكَ‏.‏ فَيَقُولُ إِبْرَاهِيمُ يَا رَبِّ، إِنَّكَ وَعَدْتَنِي أَنْ لاَ تُخْزِيَنِي يَوْمَ يُبْعَثُونَ، فَأَىُّ خِزْىٍ أَخْزَى مِنْ أَبِي الأَبْعَدِ فَيَقُولُ اللَّهُ تَعَالَى إِنِّي حَرَّمْتُ الْجَنَّةَ عَلَى الْكَافِرِينَ، ثُمَّ يُقَالُ يَا إِبْرَاهِيمُ مَا تَحْتَ رِجْلَيْكَ فَيَنْظُرُ فَإِذَا هُوَ بِذِيخٍ مُلْتَطِخٍ، فَيُؤْخَذُ بِقَوَائِمِهِ فَيُلْقَى فِي النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3350In-book reference : Book 60, Hadith 25USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 569   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3351,
    "id": 3351,
    "url": "https://sunnah.com/bukhari:3351",
    "bookNumber": 60,
    "hadithNumber": 26,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) entered the Ka`ba and found in it the pictures of (Prophet) Abraham and Mary. On that \nhe said' \"What is the matter with them ( i.e. Quraish)? They have already heard that angels do not \nenter a house in which there are pictures; yet this is the picture of Abraham. And why is he depicted as \npracticing divination by arrows?\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا، حَدَّثَهُ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْبَيْتَ فَوَجَدَ فِيهِ صُورَةَ إِبْرَاهِيمَ وَصُورَةَ مَرْيَمَ فَقَالَ ‏\n\"‏ أَمَا لَهُمْ، فَقَدْ سَمِعُوا أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ، هَذَا إِبْرَاهِيمُ مُصَوَّرٌ فَمَا لَهُ يَسْتَقْسِمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3351In-book reference : Book 60, Hadith 26USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 570   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3352,
    "id": 3352,
    "url": "https://sunnah.com/bukhari:3352",
    "bookNumber": 60,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) saw pictures in the Ka`ba, he did not enter it till he ordered them to be erased. \nWhen he saw (the pictures of Abraham and Ishmael carrying the arrows of divination, he said, \"May \nAllah curse them (i.e. the Quraish)! By Allah, neither Abraham nor Ishmael practiced divination by \narrows.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا رَأَى الصُّوَرَ فِي الْبَيْتِ لَمْ يَدْخُلْ، حَتَّى أَمَرَ بِهَا فَمُحِيَتْ، وَرَأَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ ـ عَلَيْهِمَا السَّلاَمُ ـ بِأَيْدِيهِمَا الأَزْلاَمُ فَقَالَ ‏\n\"‏ قَاتَلَهُمُ اللَّهُ، وَاللَّهِ إِنِ اسْتَقْسَمَا بِالأَزْلاَمِ قَطُّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3352In-book reference : Book 60, Hadith 27USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 571   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3353,
    "id": 3353,
    "url": "https://sunnah.com/bukhari:3353",
    "bookNumber": 60,
    "hadithNumber": 28,
    "narrator": "Narrated Abu Huraira:",
    "english": "The people said, \"O Allah's Messenger (ﷺ)! Who is the most honorable amongst the people (in Allah's \nSight)?\" He said, \"The most righteous amongst them.\" They said, \"We do not ask you, about this. \" He \nsaid, \"Then Joseph, Allah's Prophet, the son of Allah's Prophet, The son of Allah's Prophet the son of \nAllah's Khalil (i.e. Abraham).\" They said, \"We do not want to ask about this,\" He said' \"Then you \nwant to ask about the descent of the Arabs. Those who were the best in the pre-lslamic period of \nignorance will be the best in Islam provided they comprehend the religious knowledge.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه قِيلَ يَا رَسُولَ اللَّهِ، مَنْ أَكْرَمُ النَّاسِ قَالَ ‏\"‏ أَتْقَاهُمْ ‏\"‏‏.‏ فَقَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَيُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونَ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقُهُوا ‏\"‏‏.‏ قَالَ أَبُو أُسَامَةَ وَمُعْتَمِرٌ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3353In-book reference : Book 60, Hadith 28USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 572   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3354,
    "id": 3354,
    "url": "https://sunnah.com/bukhari:3354",
    "bookNumber": 60,
    "hadithNumber": 29,
    "narrator": "Narrated Samura:",
    "english": "Allah's Messenger (ﷺ) said, \"Two persons came to me at night (in dream) (and took me along with them). \nWe passed by a tall man who was so tall that I was not able to see his head and that person was \nAbraham.\"",
    "arabic": "حَدَّثَنَا مُؤَمَّلٌ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا عَوْفٌ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا سَمُرَةُ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَتَانِي اللَّيْلَةَ آتِيَانِ، فَأَتَيْنَا عَلَى رَجُلٍ طَوِيلٍ، لاَ أَكَادُ أَرَى رَأْسَهُ طُولاً، وَإِنَّهُ إِبْرَاهِيمُ صلى الله عليه وسلم ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3354In-book reference : Book 60, Hadith 29USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 573   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3355,
    "id": 3355,
    "url": "https://sunnah.com/bukhari:3355",
    "bookNumber": 60,
    "hadithNumber": 30,
    "narrator": "Narrated Mujahid:",
    "english": "That when the people mentioned before Ibn `Abbas that the Dajjal would have the word Kafir, (i.e. \nunbeliever) or the letters Kafir (the root of the Arabic verb 'disbelieve') written on his forehead, I \nheard Ibn `Abbas saying, \"I did not hear this, but the Prophet (ﷺ) said, 'If you want to see Abraham, then \nlook at your companion (i.e. the Prophet) but Moses was a curly-haired, brown man (who used to \nride) a red camel, the reins of which was made of fires of date-palms. As if I were now looking down \na valley.\"",
    "arabic": "حَدَّثَنِي بَيَانُ بْنُ عَمْرٍو، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ مُجَاهِدٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ وَذَكَرُوا لَهُ الدَّجَّالَ بَيْنَ عَيْنَيْهِ مَكْتُوبٌ كَافِرٌ أَوْ ك ف ر‏.‏ قَالَ لَمْ أَسْمَعْهُ وَلَكِنَّهُ قَالَ ‏\n\"‏ أَمَّا إِبْرَاهِيمُ فَانْظُرُوا إِلَى صَاحِبِكُمْ، وَأَمَّا مُوسَى فَجَعْدٌ آدَمُ عَلَى جَمَلٍ أَحْمَرَ مَخْطُومٍ بِخُلْبَةٍ، كَأَنِّي أَنْظُرُ إِلَيْهِ انْحَدَرَ فِي الْوَادِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3355In-book reference : Book 60, Hadith 30USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 574   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3356,
    "id": 3356,
    "url": "https://sunnah.com/bukhari:3356",
    "bookNumber": 60,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Abraham did his circumcision with an adze* at the age of eighty.\"\n\nNarrated Abu Az-Zinad:\n(as above) With an adze*.\n\n* a type of cured blade axe.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اخْتَتَنَ إِبْرَاهِيمُ ـ عَلَيْهِ السَّلاَمُ ـ وَهْوَ ابْنُ ثَمَانِينَ سَنَةً بِالْقَدُّومِ ‏\"‏‏.‏ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ حَدَّثَنَا أَبُو الزِّنَادِ ‏\"‏ بِالْقَدُومِ ‏\"‏‏.‏ مُخَفَّفَةً‏.‏ تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنْ أَبِي الزِّنَادِ‏.‏ تَابَعَهُ عَجْلاَنُ عَنْ أَبِي هُرَيْرَةَ‏.‏ وَرَوَاهُ مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3356In-book reference : Book 60, Hadith 31USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 575   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3357,
    "id": 3357,
    "url": "https://sunnah.com/bukhari:3357",
    "bookNumber": 60,
    "hadithNumber": 32,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Abraham did not tell a lie except on three occasions.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ الرُّعَيْنِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ إِلاَّ ثَلاَثًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3357In-book reference : Book 60, Hadith 32USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3358,
    "id": 3358,
    "url": "https://sunnah.com/bukhari:3358",
    "bookNumber": 60,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Huraira:",
    "english": "Abraham did not tell a lie except on three occasion. Twice for the Sake of Allah when he said, \"I am \nsick,\" and he said, \"(I have not done this but) the big idol has done it.\" The (third was) that while \nAbraham and Sarah (his wife) were going (on a journey) they passed by (the territory of) a tyrant. \nSomeone said to the tyrant, \"This man (i.e. Abraham) is accompanied by a very charming lady.\" So, \nhe sent for Abraham and asked him about Sarah saying, \"Who is this lady?\" Abraham said, \"She is my \nsister.\" Abraham went to Sarah and said, \"O Sarah! There are no believers on the surface of the earth \nexcept you and I. This man asked me about you and I have told him that you are my sister, so don't \ncontradict my statement.\" The tyrant then called Sarah and when she went to him, he tried to take hold \nof her with his hand, but (his hand got stiff and) he was confounded. He asked Sarah. \"Pray to Allah \nfor me, and I shall not harm you.\" So Sarah asked Allah to cure him and he got cured. He tried to take \nhold of her for the second time, but (his hand got as stiff as or stiffer than before and) was more \nconfounded. He again requested Sarah, \"Pray to Allah for me, and I will not harm you.\" Sarah asked \nAllah again and he became alright. He then called one of his guards (who had brought her) and said, \n\"You have not brought me a human being but have brought me a devil.\" The tyrant then gave Hajar as \na girl-servant to Sarah. Sarah came back (to Abraham) while he was praying. Abraham, gesturing with \nhis hand, asked, \"What has happened?\" She replied, \"Allah has spoiled the evil plot of the infidel (or \nimmoral person) and gave me Hajar for service.\" (Abu Huraira then addressed his listeners saying, \n\"That (Hajar) was your mother, O Bani Ma-is-Sama (i.e. the Arabs, the descendants of Ishmael, \nHajar's son).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لَمْ يَكْذِبْ إِبْرَاهِيمُ ـ عَلَيْهِ السَّلاَمُ ـ إِلاَّ ثَلاَثَ كَذَبَاتٍ ثِنْتَيْنِ مِنْهُنَّ فِي ذَاتِ اللَّهِ عَزَّ وَجَلَّ، قَوْلُهُ ‏{‏إِنِّي سَقِيمٌ ‏}‏ وَقَوْلُهُ ‏{‏بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا‏}‏، وَقَالَ بَيْنَا هُوَ ذَاتَ يَوْمٍ وَسَارَةُ إِذْ أَتَى عَلَى جَبَّارٍ مِنَ الْجَبَابِرَةِ فَقِيلَ لَهُ إِنَّ هَا هُنَا رَجُلاً مَعَهُ امْرَأَةٌ مِنْ أَحْسَنِ النَّاسِ، فَأَرْسَلَ إِلَيْهِ، فَسَأَلَهُ عَنْهَا‏.‏ فَقَالَ مَنْ هَذِهِ قَالَ أُخْتِي، فَأَتَى سَارَةَ قَالَ يَا سَارَةُ، لَيْسَ عَلَى وَجْهِ الأَرْضِ مُؤْمِنٌ غَيْرِي وَغَيْرُكِ، وَإِنَّ هَذَا سَأَلَنِي، فَأَخْبَرْتُهُ أَنَّكِ أُخْتِي فَلاَ تُكَذِّبِينِي‏.‏ فَأَرْسَلَ إِلَيْهَا، فَلَمَّا دَخَلَتْ عَلَيْهِ ذَهَبَ يَتَنَاوَلُهَا بِيَدِهِ، فَأُخِذَ فَقَالَ ادْعِي اللَّهَ لِي وَلاَ أَضُرُّكِ‏.‏ فَدَعَتِ اللَّهَ فَأُطْلِقَ، ثُمَّ تَنَاوَلَهَا الثَّانِيَةَ، فَأُخِذَ مِثْلَهَا أَوْ أَشَدَّ فَقَالَ ادْعِي اللَّهَ لِي وَلاَ أَضُرُّكِ‏.‏ فَدَعَتْ فَأُطْلِقَ‏.‏ فَدَعَا بَعْضَ حَجَبَتِهِ فَقَالَ إِنَّكُمْ لَمْ تَأْتُونِي بِإِنْسَانٍ، إِنَّمَا أَتَيْتُمُونِي بِشَيْطَانٍ‏.‏ فَأَخْدَمَهَا هَاجَرَ فَأَتَتْهُ، وَهُوَ قَائِمٌ يُصَلِّي، فَأَوْمَأَ بِيَدِهِ مَهْيَا قَالَتْ رَدَّ اللَّهُ كَيْدَ الْكَافِرِ ـ أَوِ الْفَاجِرِ ـ فِي نَحْرِهِ، وَأَخْدَمَ هَاجَرَ‏.‏ قَالَ أَبُو هُرَيْرَةَ تِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3358In-book reference : Book 60, Hadith 33USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3359,
    "id": 3359,
    "url": "https://sunnah.com/bukhari:3359",
    "bookNumber": 60,
    "hadithNumber": 34,
    "narrator": "Narrated Um Sharik:",
    "english": "Allah's Messenger (ﷺ) ordered that the salamander should be killed and said, \"It (i.e. the salamander) blew \n(the fire) on Abraham.\"",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَوِ ابْنُ سَلاَمٍ عَنْهُ أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أُمِّ شَرِيكٍ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْوَزَغِ وَقَالَ ‏\n\"‏ كَانَ يَنْفُخُ عَلَى إِبْرَاهِيمَ عَلَيْهِ السَّلاَمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3359In-book reference : Book 60, Hadith 34USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 579   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3360,
    "id": 3360,
    "url": "https://sunnah.com/bukhari:3360",
    "bookNumber": 60,
    "hadithNumber": 35,
    "narrator": "Narrated `Abdullah:",
    "english": "When the Verse:--\"It is those who believe and do not confuse their belief with wrong ( i.e. joining \nothers in worship with Allah\" (6.83) was revealed, we said, \"O Allah's Messenger (ﷺ)! Who is there amongst \nus who has not done wrong to himself?\" He replied, \"It is not as you say, for 'wrong' in the Verse and \n'do not confuse their belief, with wrong means 'SHIRK' (i.e. joining others in worship with Allah). \nHaven't you heard Luqman's saying to his son, 'O my son! Join not others in worship with Allah, \nverily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتِ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قُلْنَا يَا رَسُولَ اللَّهِ أَيُّنَا لاَ يَظْلِمُ نَفْسَهُ قَالَ ‏\"‏ لَيْسَ كَمَا تَقُولُونَ ‏{‏لَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ بِشِرْكٍ، أَوَلَمْ تَسْمَعُوا إِلَى قَوْلِ لُقْمَانَ لاِبْنِهِ ‏{‏يَا بُنَىَّ لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ ‏}‏‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3360In-book reference : Book 60, Hadith 35USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 580   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3361,
    "id": 3361,
    "url": "https://sunnah.com/bukhari:3361",
    "bookNumber": 60,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Huraira:",
    "english": "One day some meat was given to the Prophet (ﷺ) and he said, \"On the Day of Resurrection Allah will \ngather all the first and the last (people) in one plain, and the voice of the announcer will reach all of \nthem, and one will be able to see them all, and the sun will come closer to them.\" (The narrator then \nmentioned the narration of intercession): \"The people will go to Abraham and say: 'You are Allah's \nProphet and His Khalil on the earth. Will you intercede for us with your Lord?' Abraham will then \nremember his lies and say: 'Myself! Myself! Go to Moses.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بِلَحْمٍ فَقَالَ ‏\n\"‏ إِنَّ اللَّهَ يَجْمَعُ يَوْمَ الْقِيَامَةِ الأَوَّلِينَ وَالآخِرِينَ فِي صَعِيدٍ وَاحِدٍ، فَيُسْمِعُهُمُ الدَّاعِي، وَيُنْفِدُهُمُ الْبَصَرُ، وَتَدْنُو الشَّمْسُ مِنْهُمْ ـ فَذَكَرَ حَدِيثَ الشَّفَاعَةِ ـ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُونَ أَنْتَ نَبِيُّ اللَّهِ وَخَلِيلُهُ مِنَ الأَرْضِ، اشْفَعْ لَنَا إِلَى رَبِّكَ‏.‏ فَيَقُولُ ـ فَذَكَرَ كَذَبَاتِهِ ـ نَفْسِي نَفْسِي اذْهَبُوا إِلَى مُوسَى ‏\"‏‏.‏ تَابَعَهُ أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3361In-book reference : Book 60, Hadith 36USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 581   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3362,
    "id": 3362,
    "url": "https://sunnah.com/bukhari:3362",
    "bookNumber": 60,
    "hadithNumber": 37,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to \nfill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on \nthe surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his \nmother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، عَنْ أَبِيهِ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرْحَمُ اللَّهُ أُمَّ إِسْمَاعِيلَ، لَوْلاَ أَنَّهَا عَجِلَتْ لَكَانَ زَمْزَمُ عَيْنًا مَعِينًا ‏\"‏‏.‏   قَالَ الأَنْصَارِيُّ حَدَّثَنَا ابْنُ جُرَيْجٍ، أَمَّا كَثِيرُ بْنُ كَثِيرٍ فَحَدَّثَنِي قَالَ إِنِّي وَعُثْمَانَ بْنَ أَبِي سُلَيْمَانَ جُلُوسٌ مَعَ سَعِيدِ بْنِ جُبَيْرٍ، فَقَالَ مَا هَكَذَا حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ أَقْبَلَ إِبْرَاهِيمُ بِإِسْمَاعِيلَ وَأُمِّهِ عَلَيْهِمُ السَّلاَمُ وَهْىَ تُرْضِعُهُ، مَعَهَا شَنَّةٌ ـ لَمْ يَرْفَعْهُ ـ ثُمَّ جَاءَ بِهَا إِبْرَاهِيمُ وَبِابْنِهَا إِسْمَاعِيلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3362, 3363In-book reference : Book 60, Hadith 37USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3363,
    "id": 3363,
    "url": "https://sunnah.com/bukhari:3363",
    "bookNumber": 60,
    "hadithNumber": 37,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to \nfill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on \nthe surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his \nmother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، عَنْ أَبِيهِ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرْحَمُ اللَّهُ أُمَّ إِسْمَاعِيلَ، لَوْلاَ أَنَّهَا عَجِلَتْ لَكَانَ زَمْزَمُ عَيْنًا مَعِينًا ‏\"‏‏.‏   قَالَ الأَنْصَارِيُّ حَدَّثَنَا ابْنُ جُرَيْجٍ، أَمَّا كَثِيرُ بْنُ كَثِيرٍ فَحَدَّثَنِي قَالَ إِنِّي وَعُثْمَانَ بْنَ أَبِي سُلَيْمَانَ جُلُوسٌ مَعَ سَعِيدِ بْنِ جُبَيْرٍ، فَقَالَ مَا هَكَذَا حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ أَقْبَلَ إِبْرَاهِيمُ بِإِسْمَاعِيلَ وَأُمِّهِ عَلَيْهِمُ السَّلاَمُ وَهْىَ تُرْضِعُهُ، مَعَهَا شَنَّةٌ ـ لَمْ يَرْفَعْهُ ـ ثُمَّ جَاءَ بِهَا إِبْرَاهِيمُ وَبِابْنِهَا إِسْمَاعِيلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3362, 3363In-book reference : Book 60, Hadith 37USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3364,
    "id": 3364,
    "url": "https://sunnah.com/bukhari:3364",
    "bookNumber": 60,
    "hadithNumber": 38,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The first lady to use a girdle was the mother of Ishmael. She used a girdle so that she might hide her \ntracks from Sarah. Abraham brought her and her son Ishmael while she was suckling him, to a place \nnear the Ka`ba under a tree on the spot of Zamzam, at the highest place in the mosque. During those \ndays there was nobody in Mecca, nor was there any water So he made them sit over there and placed \nnear them a leather bag containing some dates, and a small water-skin containing some water, and set \nout homeward. Ishmael's mother followed him saying, \"O Abraham! Where are you going, leaving us \nin this valley where there is no person whose company we may enjoy, nor is there anything (to \nenjoy)?\" She repeated that to him many times, but he did not look back at her Then she asked him, \n\"Has Allah ordered you to do so?\" He said, \"Yes.\" She said, \"Then He will not neglect us,\" and \nreturned while Abraham proceeded onwards, and on reaching the Thaniya where they could not see \nhim, he faced the Ka`ba, and raising both hands, invoked Allah saying the following prayers: \n'O our Lord! I have made some of my offspring dwell in a valley without cultivation, by Your Sacred \nHouse (Ka`ba at Mecca) in order, O our Lord, that they may offer prayer perfectly. So fill some hearts \namong men with love towards them, and (O Allah) provide them with fruits, so that they may give \nthanks.' (14.37) Ishmael's mother went on suckling Ishmael and drinking from the water (she had). \nWhen the water in the water-skin had all been used up, she became thirsty and her child also became \nthirsty. She started looking at him (i.e. Ishmael) tossing in agony; She left him, for she could not \nendure looking at him, and found that the mountain of Safa was the nearest mountain to her on that \nland. She stood on it and started looking at the valley keenly so that she might see somebody, but she \ncould not see anybody. Then she descended from Safa and when she reached the valley, she tucked up \nher robe and ran in the valley like a person in distress and trouble, till she crossed the valley and \nreached the Marwa mountain where she stood and started looking, expecting to see somebody, but she \ncould not see anybody. She repeated that (running between Safa and Marwa) seven times.\" \nThe Prophet (ﷺ) said, \"This is the source of the tradition of the walking of people between them (i.e. Safa \nand Marwa). When she reached the Marwa (for the last time) she heard a voice and she asked herself \nto be quiet and listened attentively. She heard the voice again and said, 'O, (whoever you may be)! \nYou have made me hear your voice; have you got something to help me?\" And behold! She saw an \nangel at the place of Zamzam, digging the earth with his heel (or his wing), till water flowed from that \nplace. She started to make something like a basin around it, using her hand in this way, and started \nfilling her water-skin with water with her hands, and the water was flowing out after she had scooped \nsome of it.\" \nThe Prophet (ﷺ) added, \"May Allah bestow Mercy on Ishmael's mother! Had she let the Zamzam (flow \nwithout trying to control it) (or had she not scooped from that water) (to fill her water-skin), Zamzam \nwould have been a stream flowing on the surface of the earth.\" The Prophet (ﷺ) further added, \"Then she \ndrank (water) and suckled her child. The angel said to her, 'Don't be afraid of being neglected, for this \nis the House of Allah which will be built by this boy and his father, and Allah never neglects His \npeople.' The House (i.e. Ka`ba) at that time was on a high place resembling a hillock, and when \ntorrents came, they flowed to its right and left. She lived in that way till some people from the tribe of \nJurhum or a family from Jurhum passed by her and her child, as they (i.e. the Jurhum people) were \ncoming through the way of Kada'. They landed in the lower part of Mecca where they saw a bird that \nhad the habit of flying around water and not leaving it. They said, 'This bird must be flying around \nwater, though we know that there is no water in this valley.' They sent one or two messengers who \ndiscovered the source of water, and returned to inform them of the water. So, they all came (towards \nthe water).\" The Prophet (ﷺ) added, \"Ishmael's mother was sitting near the water. They asked her, 'Do you \nallow us to stay with you?\" She replied, 'Yes, but you will have no right to possess the water.' They \nagreed to that.\" The Prophet (ﷺ) further said, \"Ishmael's mother was pleased with the whole situation as \nshe used to love to enjoy the company of the people. So, they settled there, and later on they sent for \ntheir families who came and settled with them so that some families became permanent residents \nthere. The child (i.e. Ishmael) grew up and learnt Arabic from them and (his virtues) caused them to \nlove and admire him as he grew up, and when he reached the age of puberty they made him marry a \nwoman from amongst them. \nAfter Ishmael's mother had died, Abraham came after Ishmael's marriage in order to see his family \nthat he had left before, but he did not find Ishmael there. When he asked Ishmael's wife about him, she \nreplied, 'He has gone in search of our livelihood.' Then he asked her about their way of living and their \ncondition, and she replied, 'We are living in misery; we are living in hardship and destitution,' \ncomplaining to him. He said, 'When your husband returns, convey my salutation to him and tell him to \nchange the threshold of the gate (of his house).' When Ishmael came, he seemed to have felt \nsomething unusual, so he asked his wife, 'Has anyone visited you?' She replied, 'Yes, an old man of \nso-and-so description came and asked me about you and I informed him, and he asked about our state \nof living, and I told him that we were living in a hardship and poverty.' On that Ishmael said, 'Did he \nadvise you anything?' She replied, 'Yes, he told me to convey his salutation to you and to tell you to \nchange the threshold of your gate.' Ishmael said, 'It was my father, and he has ordered me to divorce \nyou. Go back to your family.' So, Ishmael divorced her and married another woman from amongst \nthem (i.e. Jurhum). \nThen Abraham stayed away from them for a period as long as Allah wished and called on them again \nbut did not find Ishmael. So he came to Ishmael's wife and asked her about Ishmael. She said, 'He has \ngone in search of our livelihood.' Abraham asked her, 'How are you getting on?' asking her about their \nsustenance and living. She replied, 'We are prosperous and well-off (i.e. we have everything in \nabundance).' Then she thanked Allah' Abraham said, 'What kind of food do you eat?' She said. 'Meat.' \nHe said, 'What do you drink?' She said, 'Water.\" He said, \"O Allah! Bless their meat and water.\" The \nProphet added, \"At that time they did not have grain, and if they had grain, he would have also \ninvoked Allah to bless it.\" The Prophet (ﷺ) added, \"If somebody has only these two things as his \nsustenance, his health and disposition will be badly affected, unless he lives in Mecca.\" The Prophet (ﷺ) \nadded,\" Then Abraham said Ishmael's wife, \"When your husband comes, give my regards to him and \ntell him that he should keep firm the threshold of his gate.' When Ishmael came back, he asked his \nwife, 'Did anyone call on you?' She replied, 'Yes, a good-looking old man came to me,' so she praised \nhim and added. 'He asked about you, and I informed him, and he asked about our livelihood and I told \nhim that we were in a good condition.' Ishmael asked her, 'Did he give you any piece of advice?' She \nsaid, 'Yes, he told me to give his regards to you and ordered that you should keep firm the threshold of \nyour gate.' On that Ishmael said, 'It was my father, and you are the threshold (of the gate). He has \nordered me to keep you with me.' \nThen Abraham stayed away from them for a period as long as Allah wished, and called on them \nafterwards. He saw Ishmael under a tree near Zamzam, sharpening his arrows. When he saw \nAbraham, he rose up to welcome him (and they greeted each other as a father does with his son or a \nson does with his father). Abraham said, 'O Ishmael! Allah has given me an order.' Ishmael said, 'Do \nwhat your Lord has ordered you to do.' Abraham asked, 'Will you help me?' Ishmael said, 'I will help \nyou.' Abraham said, Allah has ordered me to build a house here,' pointing to a hillock higher than the \nland surrounding it.\" The Prophet (ﷺ) added, \"Then they raised the foundations of the House (i.e. the \nKa`ba). Ishmael brought the stones and Abraham was building, and when the walls became high, \nIshmael brought this stone and put it for Abraham who stood over it and carried on building, while \nIshmael was handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) \nfrom us, Verily, You are the All-Hearing, the All-Knowing.' The Prophet (ﷺ) added, \"Then both of them \nwent on building and going round the Ka`ba saying: O our Lord ! Accept (this service) from us, \nVerily, You are the All-Hearing, the All-Knowing.\" (2.127)",
    "arabic": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، وَكَثِيرِ بْنِ كَثِيرِ بْنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ،، يَزِيدُ أَحَدُهُمَا عَلَى الآخَرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ ابْنُ عَبَّاسٍ أَوَّلَ مَا اتَّخَذَ النِّسَاءُ الْمِنْطَقَ مِنْ قِبَلِ أُمِّ إِسْمَاعِيلَ، اتَّخَذَتْ مِنْطَقًا لَتُعَفِّيَ أَثَرَهَا عَلَى سَارَةَ، ثُمَّ جَاءَ بِهَا إِبْرَاهِيمُ، وَبِابْنِهَا إِسْمَاعِيلَ وَهْىَ تُرْضِعُهُ حَتَّى وَضَعَهُمَا عِنْدَ الْبَيْتِ عِنْدَ دَوْحَةٍ، فَوْقَ زَمْزَمَ فِي أَعْلَى الْمَسْجِدِ، وَلَيْسَ بِمَكَّةَ يَوْمَئِذٍ أَحَدٌ، وَلَيْسَ بِهَا مَاءٌ، فَوَضَعَهُمَا هُنَالِكَ، وَوَضَعَ عِنْدَهُمَا جِرَابًا فِيهِ تَمْرٌ وَسِقَاءً فِيهِ مَاءٌ، ثُمَّ قَفَّى إِبْرَاهِيمُ مُنْطَلِقًا فَتَبِعَتْهُ أُمُّ إِسْمَاعِيلَ فَقَالَتْ يَا إِبْرَاهِيمُ أَيْنَ تَذْهَبُ وَتَتْرُكُنَا بِهَذَا الْوَادِي الَّذِي لَيْسَ فِيهِ إِنْسٌ وَلاَ شَىْءٌ فَقَالَتْ لَهُ ذَلِكَ مِرَارًا، وَجَعَلَ لاَ يَلْتَفِتُ إِلَيْهَا فَقَالَتْ لَهُ آللَّهُ الَّذِي أَمَرَكَ بِهَذَا قَالَ نَعَمْ‏.‏ قَالَتْ إِذًا لاَ يُضَيِّعُنَا‏.‏ ثُمَّ رَجَعَتْ، فَانْطَلَقَ إِبْرَاهِيمُ حَتَّى إِذَا كَانَ عِنْدَ الثَّنِيَّةِ حَيْثُ لاَ يَرَوْنَهُ اسْتَقْبَلَ بِوَجْهِهِ الْبَيْتَ، ثُمَّ دَعَا بِهَؤُلاَءِ الْكَلِمَاتِ وَرَفَعَ يَدَيْهِ، فَقَالَ ‏{‏رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ‏}‏ حَتَّى بَلَغَ ‏{‏يَشْكُرُونَ‏}‏‏.‏ وَجَعَلَتْ أُمُّ إِسْمَاعِيلَ تُرْضِعُ إِسْمَاعِيلَ، وَتَشْرَبُ مِنْ ذَلِكَ الْمَاءِ، حَتَّى إِذَا نَفِدَ مَا فِي السِّقَاءِ عَطِشَتْ وَعَطِشَ ابْنُهَا، وَجَعَلَتْ تَنْظُرُ إِلَيْهِ يَتَلَوَّى ـ أَوْ قَالَ يَتَلَبَّطُ ـ فَانْطَلَقَتْ كَرَاهِيَةَ أَنْ تَنْظُرَ إِلَيْهِ، فَوَجَدَتِ الصَّفَا أَقْرَبَ جَبَلٍ فِي الأَرْضِ يَلِيهَا، فَقَامَتْ عَلَيْهِ ثُمَّ اسْتَقْبَلَتِ الْوَادِيَ تَنْظُرُ هَلْ تَرَى أَحَدًا فَلَمْ تَرَ أَحَدًا، فَهَبَطَتْ مِنَ، الصَّفَا حَتَّى إِذَا بَلَغَتِ الْوَادِيَ رَفَعَتْ طَرَفَ دِرْعِهَا، ثُمَّ سَعَتْ سَعْىَ الإِنْسَانِ الْمَجْهُودِ، حَتَّى جَاوَزَتِ الْوَادِيَ، ثُمَّ أَتَتِ الْمَرْوَةَ، فَقَامَتْ عَلَيْهَا وَنَظَرَتْ هَلْ تَرَى أَحَدًا، فَلَمْ تَرَ أَحَدًا، فَفَعَلَتْ ذَلِكَ سَبْعَ مَرَّاتٍ ـ قَالَ ابْنُ عَبَّاسٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَذَلِكَ سَعْىُ النَّاسِ بَيْنَهُمَا ‏\"‏‏.‏ ـ فَلَمَّا أَشْرَفَتْ عَلَى الْمَرْوَةِ سَمِعَتْ صَوْتًا، فَقَالَتْ صَهٍ‏.‏ تُرِيدَ نَفْسَهَا، ثُمَّ تَسَمَّعَتْ، فَسَمِعَتْ أَيْضًا، فَقَالَتْ قَدْ أَسْمَعْتَ، إِنْ كَانَ عِنْدَكَ غِوَاثٌ‏.‏ فَإِذَا هِيَ بِالْمَلَكِ، عِنْدَ مَوْضِعِ زَمْزَمَ، فَبَحَثَ بِعَقِبِهِ ـ أَوْ قَالَ بِجَنَاحِهِ ـ حَتَّى ظَهَرَ الْمَاءُ، فَجَعَلَتْ تُحَوِّضُهُ وَتَقُولُ بِيَدِهَا هَكَذَا، وَجَعَلَتْ تَغْرِفُ مِنَ الْمَاءِ فِي سِقَائِهَا، وَهْوَ يَفُورُ بَعْدَ مَا تَغْرِفُ ـ قَالَ ابْنُ عَبَّاسٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ أُمَّ إِسْمَاعِيلَ لَوْ تَرَكَتْ زَمْزَمَ ـ أَوْ قَالَ لَوْ لَمْ تَغْرِفْ مِنَ الْمَاءِ ـ لَكَانَتْ زَمْزَمُ عَيْنًا مَعِينًا ‏\"‏‏.‏ ـ قَالَ فَشَرِبَتْ وَأَرْضَعَتْ وَلَدَهَا، فَقَالَ لَهَا الْمَلَكُ لاَ تَخَافُوا الضَّيْعَةَ، فَإِنَّ هَا هُنَا بَيْتَ اللَّهِ، يَبْنِي هَذَا الْغُلاَمُ، وَأَبُوهُ، وَإِنَّ اللَّهَ لاَ يُضِيعُ أَهْلَهُ‏.‏ وَكَانَ الْبَيْتُ مُرْتَفِعًا مِنَ الأَرْضِ كَالرَّابِيَةِ، تَأْتِيهِ السُّيُولُ فَتَأْخُذُ عَنْ يَمِينِهِ وَشِمَالِهِ، فَكَانَتْ كَذَلِكَ، حَتَّى مَرَّتْ بِهِمْ رُفْقَةٌ مِنْ جُرْهُمَ ـ أَوْ أَهْلُ بَيْتٍ مِنْ جُرْهُمَ ـ مُقْبِلِينَ مِنْ طَرِيقِ كَدَاءٍ فَنَزَلُوا فِي أَسْفَلِ مَكَّةَ، فَرَأَوْا طَائِرًا عَائِفًا‏.‏ فَقَالُوا إِنَّ هَذَا الطَّائِرَ لَيَدُورُ عَلَى مَاءٍ، لَعَهْدُنَا بِهَذَا الْوَادِي وَمَا فِيهِ مَاءٌ، فَأَرْسَلُوا جَرِيًّا أَوْ جَرِيَّيْنِ، فَإِذَا هُمْ بِالْمَاءِ، فَرَجَعُوا فَأَخْبَرُوهُمْ بِالْمَاءِ، فَأَقْبَلُوا، قَالَ وَأُمُّ إِسْمَاعِيلَ عِنْدَ الْمَاءِ فَقَالُوا أَتَأْذَنِينَ لَنَا أَنْ نَنْزِلَ عِنْدَكِ فَقَالَتْ نَعَمْ، وَلَكِنْ لاَ حَقَّ لَكُمْ فِي الْمَاءِ‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ابْنُ عَبَّاسٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَأَلْفَى ذَلِكَ أُمَّ إِسْمَاعِيلَ، وَهْىَ تُحِبُّ الإِنْسَ ‏\"‏ فَنَزَلُوا وَأَرْسَلُوا إِلَى أَهْلِيهِمْ، فَنَزَلُوا مَعَهُمْ حَتَّى إِذَا كَانَ بِهَا أَهْلُ أَبْيَاتٍ مِنْهُمْ، وَشَبَّ الْغُلاَمُ، وَتَعَلَّمَ الْعَرَبِيَّةَ مِنْهُمْ، وَأَنْفَسَهُمْ وَأَعْجَبَهُمْ حِينَ شَبَّ، فَلَمَّا أَدْرَكَ زَوَّجُوهُ امْرَأَةً مِنْهُمْ، وَمَاتَتْ أُمُّ إِسْمَاعِيلَ، فَجَاءَ إِبْرَاهِيمُ، بَعْدَ مَا تَزَوَّجَ إِسْمَاعِيلُ يُطَالِعُ تَرِكَتَهُ، فَلَمْ يَجِدْ إِسْمَاعِيلَ، فَسَأَلَ امْرَأَتَهُ عَنْهُ فَقَالَتْ خَرَجَ يَبْتَغِي لَنَا‏.‏ ثُمَّ سَأَلَهَا عَنْ عَيْشِهِمْ وَهَيْئَتِهِمْ فَقَالَتْ نَحْنُ بِشَرٍّ، نَحْنُ فِي ضِيقٍ وَشِدَّةٍ‏.‏ فَشَكَتْ إِلَيْهِ‏.‏ قَالَ فَإِذَا جَاءَ زَوْجُكِ فَاقْرَئِي عَلَيْهِ السَّلاَمَ، وَقُولِي لَهُ يُغَيِّرْ عَتَبَةَ بَابِهِ‏.‏ فَلَمَّا جَاءَ إِسْمَاعِيلُ، كَأَنَّهُ آنَسَ شَيْئًا، فَقَالَ هَلْ جَاءَكُمْ مِنْ أَحَدٍ قَالَتْ نَعَمْ، جَاءَنَا شَيْخٌ كَذَا وَكَذَا، فَسَأَلَنَا عَنْكَ فَأَخْبَرْتُهُ، وَسَأَلَنِي كَيْفَ عَيْشُنَا فَأَخْبَرْتُهُ أَنَّا فِي جَهْدٍ وَشِدَّةٍ‏.‏ قَالَ فَهَلْ أَوْصَاكِ بِشَىْءٍ قَالَتْ نَعَمْ، أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ السَّلاَمَ، وَيَقُولُ غَيِّرْ عَتَبَةَ بَابِكَ‏.‏ قَالَ ذَاكِ أَبِي وَقَدْ أَمَرَنِي أَنْ أُفَارِقَكِ الْحَقِي بِأَهْلِكِ‏.‏ فَطَلَّقَهَا، وَتَزَوَّجَ مِنْهُمْ أُخْرَى، فَلَبِثَ عَنْهُمْ إِبْرَاهِيمُ مَا شَاءَ اللَّهُ ثُمَّ أَتَاهُمْ بَعْدُ، فَلَمْ يَجِدْهُ، فَدَخَلَ عَلَى امْرَأَتِهِ، فَسَأَلَهَا عَنْهُ‏.‏ فَقَالَتْ خَرَجَ يَبْتَغِي لَنَا‏.‏ قَالَ كَيْفَ أَنْتُمْ وَسَأَلَهَا عَنْ عَيْشِهِمْ، وَهَيْئَتِهِمْ‏.‏ فَقَالَتْ نَحْنُ بِخَيْرٍ وَسَعَةٍ‏.‏ وَأَثْنَتْ عَلَى اللَّهِ‏.‏ فَقَالَ مَا طَعَامُكُمْ قَالَتِ اللَّحْمُ‏.‏ قَالَ فَمَا شَرَابُكُمْ قَالَتِ الْمَاءُ‏.‏ فَقَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِي اللَّحْمِ وَالْمَاءِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَلَمْ يَكُنْ لَهُمْ يَوْمَئِذٍ حَبٌّ، وَلَوْ كَانَ لَهُمْ دَعَا لَهُمْ فِيهِ ‏\"‏‏.‏ قَالَ فَهُمَا لاَ يَخْلُو عَلَيْهِمَا أَحَدٌ بِغَيْرِ مَكَّةَ إِلاَّ لَمْ يُوَافِقَاهُ‏.‏ قَالَ فَإِذَا جَاءَ زَوْجُكِ فَاقْرَئِي عَلَيْهِ السَّلاَمَ، وَمُرِيهِ يُثْبِتُ عَتَبَةَ بَابِهِ، فَلَمَّا جَاءَ إِسْمَاعِيلُ قَالَ هَلْ أَتَاكُمْ مِنْ أَحَدٍ قَالَتْ نَعَمْ أَتَانَا شَيْخٌ حَسَنُ الْهَيْئَةِ، وَأَثْنَتْ عَلَيْهِ، فَسَأَلَنِي عَنْكَ فَأَخْبَرْتُهُ، فَسَأَلَنِي كَيْفَ عَيْشُنَا فَأَخْبَرْتُهُ أَنَّا بِخَيْرٍ‏.‏ قَالَ فَأَوْصَاكِ بِشَىْءٍ قَالَتْ نَعَمْ، هُوَ يَقْرَأُ عَلَيْكَ السَّلاَمَ، وَيَأْمُرُكَ أَنْ تُثْبِتَ عَتَبَةَ بَابِكَ‏.‏ قَالَ ذَاكِ أَبِي، وَأَنْتِ الْعَتَبَةُ، أَمَرَنِي أَنْ أُمْسِكَكِ‏.‏ ثُمَّ لَبِثَ عَنْهُمْ مَا شَاءَ اللَّهُ، ثُمَّ جَاءَ بَعْدَ ذَلِكَ، وَإِسْمَاعِيلُ يَبْرِي نَبْلاً لَهُ تَحْتَ دَوْحَةٍ قَرِيبًا مِنْ زَمْزَمَ، فَلَمَّا رَآهُ قَامَ إِلَيْهِ، فَصَنَعَا كَمَا يَصْنَعُ الْوَالِدُ بِالْوَلَدِ وَالْوَلَدُ بِالْوَالِدِ، ثُمَّ قَالَ يَا إِسْمَاعِيلُ، إِنَّ اللَّهَ أَمَرَنِي بِأَمْرٍ‏.‏ قَالَ فَاصْنَعْ مَا أَمَرَكَ رَبُّكَ‏.‏ قَالَ وَتُعِينُنِي قَالَ وَأُعِينُكَ‏.‏ قَالَ فَإِنَّ اللَّهَ أَمَرَنِي أَنْ أَبْنِيَ هَا هُنَا بَيْتًا‏.‏ وَأَشَارَ إِلَى أَكَمَةٍ مُرْتَفِعَةٍ عَلَى مَا حَوْلَهَا‏.‏ قَالَ فَعِنْدَ ذَلِكَ رَفَعَا الْقَوَاعِدَ مِنَ الْبَيْتِ، فَجَعَلَ إِسْمَاعِيلُ يَأْتِي بِالْحِجَارَةِ، وَإِبْرَاهِيمُ يَبْنِي، حَتَّى إِذَا ارْتَفَعَ الْبِنَاءُ جَاءَ بِهَذَا الْحَجَرِ فَوَضَعَهُ لَهُ، فَقَامَ عَلَيْهِ وَهْوَ يَبْنِي، وَإِسْمَاعِيلُ يُنَاوِلُهُ الْحِجَارَةَ، وَهُمَا يَقُولاَنِ ‏{‏رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ‏}‏‏.‏ قَالَ فَجَعَلاَ يَبْنِيَانِ حَتَّى يَدُورَا حَوْلَ الْبَيْتِ، وَهُمَا يَقُولاَنِ ‏{‏رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3364In-book reference : Book 60, Hadith 38USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 583   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3365,
    "id": 3365,
    "url": "https://sunnah.com/bukhari:3365",
    "bookNumber": 60,
    "hadithNumber": 39,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), \nhe took Ishmael and his mother and went away. They had a water-skin with them containing some \nwater, Ishmael's mother used to drink water from the water-skin so that her milk would increase for \nher child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. \nIshmael's mother followed him, and when they reached Kada', she called him from behind, 'O \nAbraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' \nShe said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from \nthe water-skin, and her milk increased for her child. When the water had all been used up, she said to \nherself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and \nlooked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she \nreached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she \nsaid to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on \nthe point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may \nfind somebody.' \nShe went and ascended the Safa mountain and looked for a long while but could not find anybody. \nThus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), \n'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that \nstrange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). \nGabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and \nso the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. \nthe Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have \nbeen flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her \nmilk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through \nthe bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be \nfound at a place where there is water.' \nThey sent a messenger who searched the place and found the water, and returned to inform them about \nit. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell \nwith you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a \nlady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to \ncall on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, \n'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, \ntell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael \nsaid to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham \nthought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his \nintentions. \nAbraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has \ngone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' \nAbraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our \ndrink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) \nsaid, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought \nof visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and \nfound Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has \nordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" \nAbraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will \ndo.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing \nhim the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, \nYou are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man \n(i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- \nMaqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! \nAccept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنْ كَثِيرِ بْنِ كَثِيرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا كَانَ بَيْنَ إِبْرَاهِيمَ وَبَيْنَ أَهْلِهِ مَا كَانَ، خَرَجَ بِإِسْمَاعِيلَ وَأُمِّ إِسْمَاعِيلَ، وَمَعَهُمْ شَنَّةٌ فِيهَا مَاءٌ، فَجَعَلَتْ أُمُّ إِسْمَاعِيلَ تَشْرَبُ مِنَ الشَّنَّةِ فَيَدِرُّ لَبَنُهَا عَلَى صَبِيِّهَا حَتَّى قَدِمَ مَكَّةَ، فَوَضَعَهَا تَحْتَ دَوْحَةٍ، ثُمَّ رَجَعَ إِبْرَاهِيمُ إِلَى أَهْلِهِ، فَاتَّبَعَتْهُ أُمُّ إِسْمَاعِيلَ، حَتَّى لَمَّا بَلَغُوا كَدَاءً نَادَتْهُ مِنْ وَرَائِهِ يَا إِبْرَاهِيمُ إِلَى مَنْ تَتْرُكُنَا قَالَ إِلَى اللَّهِ‏.‏ قَالَتْ رَضِيتُ بِاللَّهِ‏.‏ قَالَ فَرَجَعَتْ فَجَعَلَتْ تَشْرَبُ مِنَ الشَّنَّةِ وَيَدِرُّ لَبَنُهَا عَلَى صَبِيِّهَا، حَتَّى لَمَّا فَنِيَ الْمَاءُ قَالَتْ لَوْ ذَهَبْتُ فَنَظَرْتُ لَعَلِّي أُحِسُّ أَحَدًا‏.‏ قَالَ فَذَهَبَتْ فَصَعِدَتِ الصَّفَا فَنَظَرَتْ وَنَظَرَتْ هَلْ تُحِسُّ أَحَدًا فَلَمْ تُحِسَّ أَحَدًا، فَلَمَّا بَلَغَتِ الْوَادِيَ سَعَتْ وَأَتَتِ الْمَرْوَةَ فَفَعَلَتْ ذَلِكَ أَشْوَاطًا، ثُمَّ قَالَتْ لَوْ ذَهَبْتُ فَنَظَرْتُ مَا فَعَلَ ـ تَعْنِي الصَّبِيَّ ـ فَذَهَبَتْ فَنَظَرَتْ، فَإِذَا هُوَ عَلَى حَالِهِ كَأَنَّهُ يَنْشَغُ لِلْمَوْتِ، فَلَمْ تُقِرَّهَا نَفْسُهَا، فَقَالَتْ لَوْ ذَهَبْتُ فَنَظَرْتُ لَعَلِّي أُحِسُّ أَحَدًا، فَذَهَبَتْ فَصَعِدَتِ الصَّفَا فَنَظَرَتْ وَنَظَرَتْ فَلَمْ تُحِسَّ أَحَدًا، حَتَّى أَتَمَّتْ سَبْعًا، ثُمَّ قَالَتْ لَوْ ذَهَبْتُ فَنَظَرْتُ مَا فَعَلَ، فَإِذَا هِيَ بِصَوْتٍ فَقَالَتْ أَغِثْ إِنْ كَانَ عِنْدَكَ خَيْرٌ‏.‏ فَإِذَا جِبْرِيلُ، قَالَ فَقَالَ بِعَقِبِهِ هَكَذَا، وَغَمَزَ عَقِبَهُ عَلَى الأَرْضِ، قَالَ فَانْبَثَقَ الْمَاءُ، فَدَهَشَتْ أُمُّ إِسْمَاعِيلَ فَجَعَلَتْ تَحْفِزُ‏.‏ قَالَ فَقَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏ لَوْ تَرَكَتْهُ كَانَ الْمَاءُ ظَاهِرًا ‏\"‏‏.‏ قَالَ فَجَعَلَتْ تَشْرَبُ مِنَ الْمَاءِ، وَيَدِرُّ لَبَنُهَا عَلَى صَبِيِّهَا ـ قَالَ ـ فَمَرَّ نَاسٌ مِنْ جُرْهُمَ بِبَطْنِ الْوَادِي، فَإِذَا هُمْ بِطَيْرٍ، كَأَنَّهُمْ أَنْكَرُوا ذَاكَ، وَقَالُوا مَا يَكُونُ الطَّيْرُ إِلاَّ عَلَى مَاءٍ‏.‏ فَبَعَثُوا رَسُولَهُمْ، فَنَظَرَ فَإِذَا هُمْ بِالْمَاءِ، فَأَتَاهُمْ فَأَخْبَرَهُمْ فَأَتَوْا إِلَيْهَا، فَقَالُوا يَا أُمَّ إِسْمَاعِيلَ، أَتَأْذَنِينَ لَنَا أَنْ نَكُونَ مَعَكِ أَوْ نَسْكُنَ مَعَكِ فَبَلَغَ ابْنُهَا فَنَكَحَ فِيهِمُ امْرَأَةً، قَالَ ثُمَّ إِنَّهُ بَدَا لإِبْرَاهِيمَ فَقَالَ لأَهْلِهِ إِنِّي مُطَّلِعٌ تَرِكَتِي‏.‏ قَالَ فَجَاءَ فَسَلَّمَ فَقَالَ أَيْنَ إِسْمَاعِيلُ فَقَالَتِ امْرَأَتُهُ ذَهَبَ يَصِيدُ‏.‏ قَالَ قُولِي لَهُ إِذَا جَاءَ غَيِّرْ عَتَبَةَ بَابِكَ‏.‏ فَلَمَّا جَاءَ أَخْبَرَتْهُ قَالَ أَنْتِ ذَاكِ فَاذْهَبِي إِلَى أَهْلِكِ‏.‏ قَالَ ثُمَّ إِنَّهُ بَدَا لإِبْرَاهِيمَ فَقَالَ لأَهْلِهِ إِنِّي مُطَّلِعٌ تَرِكَتِي‏.‏ قَالَ فَجَاءَ فَقَالَ أَيْنَ إِسْمَاعِيلُ فَقَالَتِ امْرَأَتُهُ ذَهَبَ يَصِيدُ، فَقَالَتْ أَلاَ تَنْزِلُ فَتَطْعَمَ وَتَشْرَبَ فَقَالَ وَمَا طَعَامُكُمْ وَمَا شَرَابُكُمْ قَالَتْ طَعَامُنَا اللَّحْمُ، وَشَرَابُنَا الْمَاءُ‏.‏ قَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِي طَعَامِهِمْ وَشَرَابِهِمْ‏.‏ قَالَ فَقَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏ بَرَكَةٌ بِدَعْوَةِ إِبْرَاهِيمَ ‏\"‏‏.‏ قَالَ ثُمَّ إِنَّهُ بَدَا لإِبْرَاهِيمَ فَقَالَ لأَهْلِهِ إِنِّي مُطَّلِعٌ تَرِكَتِي‏.‏ فَجَاءَ فَوَافَقَ إِسْمَاعِيلَ مِنْ وَرَاءِ زَمْزَمَ، يُصْلِحُ نَبْلاً لَهُ، فَقَالَ يَا إِسْمَاعِيلُ، إِنَّ رَبَّكَ أَمَرَنِي أَنْ أَبْنِيَ لَهُ بَيْتًا‏.‏ قَالَ أَطِعْ رَبَّكَ‏.‏ قَالَ إِنَّهُ قَدْ أَمَرَنِي أَنْ تُعِينَنِي عَلَيْهِ‏.‏ قَالَ إِذًا أَفْعَلَ‏.‏ أَوْ كَمَا قَالَ‏.‏ قَالَ فَقَامَا فَجَعَلَ إِبْرَاهِيمُ يَبْنِي، وَإِسْمَاعِيلُ يُنَاوِلُهُ الْحِجَارَةَ، وَيَقُولاَنِ ‏{‏رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ‏}‏ قَالَ حَتَّى ارْتَفَعَ الْبِنَاءُ وَضَعُفَ الشَّيْخُ عَلَى نَقْلِ الْحِجَارَةِ، فَقَامَ عَلَى حَجَرِ الْمَقَامِ، فَجَعَلَ يُنَاوِلُهُ الْحِجَارَةَ، وَيَقُولاَنِ ‏{‏رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3365In-book reference : Book 60, Hadith 39USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 584   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3366,
    "id": 3366,
    "url": "https://sunnah.com/bukhari:3366",
    "bookNumber": 60,
    "hadithNumber": 40,
    "narrator": "Narrated Abu Dhar:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! Which mosque was first built on the surface of the earth?\" He said, \"Al- \nMasjid-ul-,Haram (in Mecca).\" I said, \"Which was built next?\" He replied \"The mosque of Al-Aqsa ( \nin Jerusalem) .\" I said, \"What was the period of construction between the two?\" He said, \"Forty \nyears.\" He added, \"Wherever (you may be, and) the prayer time becomes due, perform the prayer \nthere, for the best thing is to do so (i.e. to offer the prayers in time).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا إِبْرَاهِيمُ التَّيْمِيُّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا ذَرٍّ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ، أَىُّ مَسْجِدٍ وُضِعَ فِي الأَرْضِ أَوَّلُ قَالَ ‏\"‏ الْمَسْجِدُ الْحَرَامُ ‏\"‏‏.‏ قَالَ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ الْمَسْجِدُ الأَقْصَى ‏\"‏‏.‏ قُلْتُ كَمْ كَانَ بَيْنَهُمَا قَالَ ‏\"‏ أَرْبَعُونَ سَنَةً، ثُمَّ أَيْنَمَا أَدْرَكَتْكَ الصَّلاَةُ بَعْدُ فَصَلِّهْ، فَإِنَّ الْفَضْلَ فِيهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3366In-book reference : Book 60, Hadith 40USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3367,
    "id": 3367,
    "url": "https://sunnah.com/bukhari:3367",
    "bookNumber": 60,
    "hadithNumber": 41,
    "narrator": "Narrated Anas bin Malik:",
    "english": "When the mountain of Uhud came in the sight of Allah's Messenger (ﷺ) he said. \"This is a mountain that \nloves us and is loved by us. O Allah! Abraham made Mecca a sanctuary, and I make (the area) in \nbetween these two mountains (of Medina) a sanctuary.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏\n\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ، اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ، وَإِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏‏.‏ رَوَاهُ عَبْدُ اللَّهِ بْنُ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3367In-book reference : Book 60, Hadith 41USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 586   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3368,
    "id": 3368,
    "url": "https://sunnah.com/bukhari:3368",
    "bookNumber": 60,
    "hadithNumber": 42,
    "narrator": "Narrated `Aisha:",
    "english": "(The wife of the Prophet) Allah's Messenger (ﷺ) said (to her). \"Don't you see that when your folk built the \nKa`ba, they did not build it on all the foundations built by Abraham?\" I said, \"O Allah's Messenger (ﷺ)! Why \ndon't we rebuild it on the foundations of Abraham?\" He said. \"But for the fact that your folk have \nrecently given up infidelity (I would have done so). \nNarrated Ibn `Umar: Aisha must have heard this from Allah's Messenger (ﷺ) for I see that Allah's Messenger (ﷺ) \nused not to touch the two corners facing Al-Hijr only because the House had not been built on the \nfoundations of Abraham.''",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ أَبِي بَكْرٍ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ ـ رضى الله عنهم ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلَمْ تَرَىْ أَنَّ قَوْمَكِ بَنَوُا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَلاَ تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏ فَقَالَ ‏\"‏ لَوْلاَ حِدْثَانُ قَوْمِكِ بِالْكُفْرِ ‏\"‏‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَئِنْ كَانَتْ عَائِشَةُ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أُرَى أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ اسْتِلاَمَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ إِلاَّ أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏ وَقَالَ إِسْمَاعِيلُ عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3368In-book reference : Book 60, Hadith 42USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 587   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3369,
    "id": 3369,
    "url": "https://sunnah.com/bukhari:3369",
    "bookNumber": 60,
    "hadithNumber": 43,
    "narrator": "Narrated Abu Humaid As-Sa`idi:",
    "english": "The people asked, \"O Allah's Messenger (ﷺ)! How shall we (ask Allah to) send blessings on you?\" Allah's \nApostle replied, \"Say: O Allah! Send Your Mercy on Muhammad and on his wives and on his off \nspring, as You sent Your Mercy on Abraham's family; and send Your Blessings on Muhammad and \non his offspring, as You sent Your Blessings on Abraham's family, for You are the Most Praiseworthy, \nthe Most Glorious.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ ـ رضى الله عنه ـ أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3369In-book reference : Book 60, Hadith 43USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 588   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3370,
    "id": 3370,
    "url": "https://sunnah.com/bukhari:3370",
    "bookNumber": 60,
    "hadithNumber": 44,
    "narrator": "Narrated `Abdur-Rahman bin Abi Laila:",
    "english": "Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- \nRahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Messenger (ﷺ) saying, 'O Allah's Messenger (ﷺ)! How \nshould one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us \nhow to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on \nthe family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for \nYou are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad \nand the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, \nfor You are the Most Praise-worthy, the Most Glorious.' \"",
    "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا أَبُو قُرَّةَ، مُسْلِمُ بْنُ سَالِمٍ الْهَمْدَانِيُّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عِيسَى، سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، قَالَ لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ فَقَالَ أَلاَ أُهْدِي لَكَ هَدِيَّةً سَمِعْتُهَا مِنَ النَّبِيِّ، صلى الله عليه وسلم فَقُلْتُ بَلَى، فَأَهْدِهَا لِي‏.‏ فَقَالَ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ الصَّلاَةُ عَلَيْكُمْ أَهْلَ الْبَيْتِ فَإِنَّ اللَّهَ قَدْ عَلَّمَنَا كَيْفَ نُسَلِّمُ‏.‏ قَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3370In-book reference : Book 60, Hadith 44USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 589   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3371,
    "id": 3371,
    "url": "https://sunnah.com/bukhari:3371",
    "bookNumber": 60,
    "hadithNumber": 45,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather \n(i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O \nAllah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from \nevery evil, harmful, envious eye.' \"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْمِنْهَالِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ وَيَقُولُ ‏\n\"‏ إِنَّ أَبَاكُمَا كَانَ يُعَوِّذُ بِهَا إِسْمَاعِيلَ وَإِسْحَاقَ، أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3371In-book reference : Book 60, Hadith 45USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 590   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3372,
    "id": 3372,
    "url": "https://sunnah.com/bukhari:3372",
    "bookNumber": 60,
    "hadithNumber": 46,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"We are more liable to be in doubt than Abraham when he said, 'My Lord! Show \nme how You give life to the dead.\" . He (i.e. Allah) slid: 'Don't you believe then?' He (i.e. Abraham) \nsaid: \"Yes, but (I ask) in order to be stronger in Faith.\" (2.260) And may Allah send His Mercy on \nLot! He wished to have a powerful support. If I were to stay in prison for such a long time as Joseph \ndid I would have accepted the offer (of freedom without insisting on having my guiltless less \ndeclared).",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ نَحْنُ أَحَقُّ مِنْ إِبْرَاهِيمَ إِذْ قَالَ ‏{‏رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي‏}‏ وَيَرْحَمُ اللَّهُ لُوطًا، لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ وَلَوْ لَبِثْتُ فِي السِّجْنِ طُولَ مَا لَبِثَ يُوسُفُ لأَجَبْتُ الدَّاعِيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3372In-book reference : Book 60, Hadith 46USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3373,
    "id": 3373,
    "url": "https://sunnah.com/bukhari:3373",
    "bookNumber": 60,
    "hadithNumber": 47,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "The Prophet (ﷺ) passed by some persons of the tribe of Aslam practicing archery (i.e. the throwing of \narrows) Allah's Messenger (ﷺ) said, \"O offspring of Ishmael! Practice archery (i.e. arrow throwing) as your \nfather was a great archer (i.e. arrow-thrower). I am with (on the side of) the son of so-and-so-.\" \nHearing that, one of the two teams stopped throwing. Allah's Messenger (ﷺ) asked them, ' Why are you not \nthrowing?\" They replied, \"O Allah's Messenger (ﷺ)! How shall we throw when you are with the opposite \nteam?\" He said, \"Throw, for I am with you all.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى نَفَرٍ مِنْ أَسْلَمَ يَنْتَضِلُونَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ارْمُوا بَنِي إِسْمَاعِيلَ، فَإِنَّ أَبَاكُمْ كَانَ رَامِيًا، وَأَنَا مَعَ بَنِي فُلاَنٍ ‏\"‏‏.‏ قَالَ فَأَمْسَكَ أَحَدُ الْفَرِيقَيْنِ بِأَيْدِيهِمْ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكُمْ لاَ تَرْمُونَ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، نَرْمِي وَأَنْتَ مَعَهُمْ قَالَ ‏\"‏ ارْمُوا وَأَنَا مَعَكُمْ كُلِّكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3373In-book reference : Book 60, Hadith 47USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 592   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3374,
    "id": 3374,
    "url": "https://sunnah.com/bukhari:3374",
    "bookNumber": 60,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Huraira:",
    "english": "Some people asked the Prophet: \"Who is the most honorable amongst the people?\" He replied, \"The \nmost honorable among them is the one who is the most Allah-fearing.\" They said, \"O Allah's Prophet! \nWe do not ask about this.\" He said, \"Then the most honorable person is Joseph, Allah's Prophet, the \nson of Allah's Prophet, the son of Allah's Prophet, the son of Allah's Khalil.\" They said, \"We do not \nask about this.\" He said, \"Then you want to ask me about the Arabs' descent?\" They said, \"Yes.\" He \nsaid, \"Those who were best in the pre-lslamic period, are the best in Islam, if they comprehend (the \nreligious knowledge).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ الْمُعْتَمِرَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم مَنْ أَكْرَمُ النَّاسِ قَالَ ‏\"‏ أَكْرَمُهُمْ أَتْقَاهُمْ ‏\"‏‏.‏ قَالُوا يَا نَبِيَّ اللَّهِ، لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَأَكْرَمُ النَّاسِ يُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ فَخِيَارُكُمْ فِي الْجَاهِلِيَّةِ خِيَارُكُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3374In-book reference : Book 60, Hadith 48USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 593   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3375,
    "id": 3375,
    "url": "https://sunnah.com/bukhari:3375",
    "bookNumber": 60,
    "hadithNumber": 49,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"May Allah forgive Lot: He wanted to have a powerful support.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏{‏يَغْفِرُ اللَّهُ لِلُوطٍ إِنْ كَانَ لَيَأْوِي إِلَى رُكْنٍ شَدِيدٍ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3375In-book reference : Book 60, Hadith 49USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 594   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3376,
    "id": 3376,
    "url": "https://sunnah.com/bukhari:3376",
    "bookNumber": 60,
    "hadithNumber": 50,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) recited:-- 'Hal-min-Muddakir' (54.15) (Is there any that will remember) (and avoid evil).",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَرَأَ النَّبِيُّ صلى الله عليه وسلم ‏{‏فَهَلْ مِنْ مُدَّكِر ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3376In-book reference : Book 60, Hadith 50USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 595   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3377,
    "id": 3377,
    "url": "https://sunnah.com/bukhari:3377",
    "bookNumber": 60,
    "hadithNumber": 51,
    "narrator": "Narrated `Abdullah bin Zam`a:",
    "english": "I heard the Prophet (ﷺ) while referring to the person who had cut the legs of the she-camel (of the Prophet (ﷺ) \nSalih), saying, \"The man who was appointed for doing this job, was a man of honor and power in his \nnation like Abu Zam`a.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنَ زَمْعَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏ وَذَكَرَ الَّذِي عَقَرَ النَّاقَةَ قَالَ ‏\n\"‏ انْتَدَبَ لَهَا رَجُلٌ ذُو عِزٍّ وَمَنَعَةٍ فِي قُوَّةٍ كَأَبِي زَمْعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3377In-book reference : Book 60, Hadith 51USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 560   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3378,
    "id": 3378,
    "url": "https://sunnah.com/bukhari:3378",
    "bookNumber": 60,
    "hadithNumber": 52,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When Allah's Messenger (ﷺ) landed at Al-Hijr during the Ghazwa of Tabuk, he ordered his companions not \nto drink water from its well or reserve water from it. They said, \"We have already kneaded the dough \nwith its water. and also filled our bags with its water.'' On that, the Prophet (ﷺ) ordered them to throw \naway the dough and pour out the water.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ أَبُو الْحَسَنِ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ بْنِ حَيَّانَ أَبُو زَكَرِيَّاءَ، حَدَّثَنَا سُلَيْمَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا نَزَلَ الْحِجْرَ فِي غَزْوَةِ تَبُوكَ أَمَرَهُمْ أَنْ لاَ يَشْرَبُوا مِنْ بِئْرِهَا، وَلاَ يَسْتَقُوا مِنْهَا فَقَالُوا قَدْ عَجَنَّا مِنْهَا، وَاسْتَقَيْنَا‏.‏ فَأَمَرَهُمْ أَنْ يَطْرَحُوا ذَلِكَ الْعَجِينَ وَيُهَرِيقُوا ذَلِكَ الْمَاءَ‏.‏ وَيُرْوَى عَنْ سَبْرَةَ بْنِ مَعْبَدٍ وَأَبِي الشُّمُوسِ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِإِلْقَاءِ الطَّعَامِ‏.‏ وَقَالَ أَبُو ذَرٍّ عَنِ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ مَنِ اعْتَجَنَ بِمَائِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3378In-book reference : Book 60, Hadith 52USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 561   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3379,
    "id": 3379,
    "url": "https://sunnah.com/bukhari:3379",
    "bookNumber": 60,
    "hadithNumber": 53,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The people landed at the land of Thamud called Al-Hijr along with Allah's Messenger (ﷺ) and they took \nwater from its well for drinking and kneading the dough with it as well. (When Allah's Messenger (ﷺ) heard \nabout it) he ordered them to pour out the water they had taken from its wells and feed the camels with \nthe dough, and ordered them to take water from the well whence the she-camel (of Prophet Salih) used \nto drink.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّاسَ نَزَلُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَرْضَ ثَمُودَ الْحِجْرَ، فَاسْتَقَوْا مِنْ بِئْرِهَا، وَاعْتَجَنُوا بِهِ، فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُهَرِيقُوا مَا اسْتَقَوْا مِنْ بِئْرِهَا، وَأَنْ يَعْلِفُوا الإِبِلَ الْعَجِينَ، وَأَمَرَهُمْ أَنْ يَسْتَقُوا مِنَ الْبِئْرِ الَّتِي كَانَ تَرِدُهَا النَّاقَةُ‏.‏ تَابَعَهُ أُسَامَةُ عَنْ نَافِعٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3379In-book reference : Book 60, Hadith 53USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 562   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3380,
    "id": 3380,
    "url": "https://sunnah.com/bukhari:3380",
    "bookNumber": 60,
    "hadithNumber": 54,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "When the Prophet (ﷺ) passed by (a place called) Al Hijr, he said, \"Do not enter the house of those who \nwere unjust to themselves, unless (you enter) weeping, lest you should suffer the same punishment as \nwas inflicted upon them.\" After that he covered his face with his sheet cloth while he was on the \ncamel-saddle.",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنهم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا مَرَّ بِالْحِجْرِ قَالَ ‏\n\"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مَا أَصَابَهُمْ ‏\"‏‏.‏ ثُمَّ تَقَنَّعَ بِرِدَائِهِ، وَهْوَ عَلَى الرَّحْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3380In-book reference : Book 60, Hadith 54USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 563   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3381,
    "id": 3381,
    "url": "https://sunnah.com/bukhari:3381",
    "bookNumber": 60,
    "hadithNumber": 55,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Do not enter the ruined dwellings of those who were unjust to themselves \nunless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا أَبِي، سَمِعْتُ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، أَنَّ ابْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3381In-book reference : Book 60, Hadith 55USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 564   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3382,
    "id": 3382,
    "url": "https://sunnah.com/bukhari:3382",
    "bookNumber": 60,
    "hadithNumber": 56,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the \nson of Jacob, the son of Isaac, the son of Abraham.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ ابْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ ـ عَلَيْهِمُ السَّلاَمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3382In-book reference : Book 60, Hadith 56USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3383,
    "id": 3383,
    "url": "https://sunnah.com/bukhari:3383",
    "bookNumber": 60,
    "hadithNumber": 57,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) was asked, \"Who is the most honorable amongst the people?\" He replied, \"The most \nAllah fearing.\" The people said, \"We do not want to ask you about this.\" He said, \"The most \nhonorable person is Joseph, Allah's Prophet, the son of Allah's Prophet, the son of Allah's Prophet, the \nson of Allah's Khalil\" The people said, 'We do not want to ask you about this.\" He said,\" Then you \nwant to ask me about the origins of the Arabs? People are of various origins. The best in the prelslamic \nperiod are the best in Islam, provided they comprehend (the religious knowledge).",
    "arabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ أَكْرَمُ النَّاسِ قَالَ ‏\"‏ أَتْقَاهُمْ لِلَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَأَكْرَمُ النَّاسِ يُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي، النَّاسُ مَعَادِنُ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا ‏\"‏‏.‏   حَدَّثَنِي مُحَمَّدُ بْنُ سَلَامٍ أَخْبَرَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا",
    "reference": "Reference : Sahih al-Bukhari 3383In-book reference : Book 60, Hadith 57USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3384,
    "id": 3384,
    "url": "https://sunnah.com/bukhari:3384",
    "bookNumber": 60,
    "hadithNumber": 58,
    "narrator": "Narrated `Aisha:",
    "english": "That the Prophet (ﷺ) said (to her). \"Order Abu Bakr to lead the people in prayer.\" She replied,\" Abu Bakr \nis a soft-hearted person and when he stands at your place, he will weep (so he will not be able to lead \nthe prayer).\" The Prophet (ﷺ) repeated the same order and she gave the same reply. The narrator, Shuba \nsaid that the Prophet (ﷺ) said on the third or fourth time. \"You are (like) the female companions of Joseph. \nOrder Abu Bakr to lead the prayer. \"",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏\"‏ مُرِي أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ إِنَّهُ رَجُلٌ أَسِيفٌ، مَتَى يَقُمْ مَقَامَكَ رَقَّ‏.‏ فَعَادَ فَعَادَتْ، قَالَ شُعْبَةُ فَقَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ إِنَّكُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3384In-book reference : Book 60, Hadith 58USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3385,
    "id": 3385,
    "url": "https://sunnah.com/bukhari:3385",
    "bookNumber": 60,
    "hadithNumber": 59,
    "narrator": "Narrated Abu Musa:",
    "english": "When the Prophet (ﷺ) fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu \nBakr is a soft-hearted person. The Prophet (ﷺ) gave the same order again and she again gave the same \nreply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of \nJoseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.",
    "arabic": "حَدَّثَنَا الرَّبِيعُ بْنُ يَحْيَى الْبَصْرِيُّ، حَدَّثَنَا زَائِدَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، قَالَ مَرِضَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَقَالَتْ إِنَّ أَبَا بَكْرٍ رَجُلٌ‏.‏ فَقَالَ مِثْلَهُ فَقَالَتْ مِثْلَهُ‏.‏ فَقَالَ ‏\"‏ مُرُوهُ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ ‏\"‏‏.‏ فَأَمَّ أَبُو بَكْرٍ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ حُسَيْنٌ عَنْ زَائِدَةَ رَجُلٌ رَقِيقٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3385In-book reference : Book 60, Hadith 59USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 599   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3386,
    "id": 3386,
    "url": "https://sunnah.com/bukhari:3386",
    "bookNumber": 60,
    "hadithNumber": 60,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"O Allah! Save `Aiyyash bin Abi Rabi`a (from the unjust treatment of the \ninfidels). O Allah! Save Salama bin Hisham. O Allah! Send your Punishment on (the tribe of) Mudar. \nO Allah! Let them suffer from years (of drought) similar to that inflicted during the life-time of \nJoseph.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3386In-book reference : Book 60, Hadith 60USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 600   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3387,
    "id": 3387,
    "url": "https://sunnah.com/bukhari:3387",
    "bookNumber": 60,
    "hadithNumber": 61,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"May Allah bestow His Mercy on Lot. He wanted to have a powerful support. If \nI were to stay in prison (for a period equal to) the stay of Joseph (prison) and then the offer of freedom \ncame to me, then I would have accepted it.\" (See Hadith No. 591)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ ابْنِ أَخِي جُوَيْرِيَةَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَرْحَمُ اللَّهُ لُوطًا، لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ، وَلَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ ثُمَّ أَتَانِي الدَّاعِي لأَجَبْتُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3387In-book reference : Book 60, Hadith 61USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 601   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3388,
    "id": 3388,
    "url": "https://sunnah.com/bukhari:3388",
    "bookNumber": 60,
    "hadithNumber": 62,
    "narrator": "Narrated Masruq:",
    "english": "I asked Um Ruman, `Aisha's mother about the accusation forged against `Aisha. She said, \"While I \nwas sitting with `Aisha, an Ansari woman came to us and said, 'Let Allah condemn such-and-such \nperson.' I asked her, 'Why do you say so?' She replied, 'For he has spread the (slanderous) story.' \n`Aisha said, 'What story?' The woman then told her the story. `Aisha asked, 'Have Abu Bakr and \nAllah's Messenger (ﷺ) heard about it ?' She said, 'Yes.' `Aisha fell down senseless (on hearing that), and \nwhen she came to her senses, she got fever and shaking of the body. The Prophet (ﷺ) came and asked, \n'What is wrong with her?' I said, 'She has got fever because of a story which has been rumored.' \n`Aisha got up and said, 'By Allah! Even if I took an oath, you would not believe me, and if I put \nforward an excuse, You would not excuse me. My example and your example is just like that example \nof Jacob and his sons. Against that which you assert, it is Allah (Alone) Whose Help can be sought.' \n(12.18) The Prophet (ﷺ) left and then Allah revealed the Verses (concerning the matter), and on that \n`Aisha said, 'Thanks to Allah (only) and not to anybody else.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ أُمَّ رُومَانَ، وَهْىَ أُمُّ عَائِشَةَ، عَمَّا قِيلَ فِيهَا مَا قِيلَ قَالَتْ بَيْنَمَا أَنَا مَعَ عَائِشَةَ جَالِسَتَانِ، إِذْ وَلَجَتْ عَلَيْنَا امْرَأَةٌ مِنَ الأَنْصَارِ، وَهْىَ تَقُولُ فَعَلَ اللَّهُ بِفُلاَنٍ وَفَعَلَ‏.‏ قَالَتْ فَقُلْتُ لِمَ قَالَتْ إِنَّهُ نَمَا ذِكْرَ الْحَدِيثِ‏.‏ فَقَالَتْ عَائِشَةُ أَىُّ حَدِيثٍ فَأَخْبَرَتْهَا‏.‏ قَالَتْ فَسَمِعَهُ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ نَعَمْ‏.‏ فَخَرَّتْ مَغْشِيًّا عَلَيْهَا، فَمَا أَفَاقَتْ إِلاَّ وَعَلَيْهَا حُمَّى بِنَافِضٍ، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَا لِهَذِهِ ‏\"‏‏.‏ قُلْتُ حُمَّى أَخَذَتْهَا مِنْ أَجْلِ حَدِيثٍ تُحُدِّثَ بِهِ، فَقَعَدَتْ فَقَالَتْ وَاللَّهِ لَئِنْ حَلَفْتُ لاَ تُصَدِّقُونِي، وَلَئِنِ اعْتَذَرْتُ لاَ تَعْذِرُونِي، فَمَثَلِي وَمَثَلُكُمْ كَمَثَلِ يَعْقُوبَ وَبَنِيهِ، فَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏.‏ فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ مَا أَنْزَلَ، فَأَخْبَرَهَا فَقَالَتْ بِحَمْدِ اللَّهِ لاَ بِحَمْدِ أَحَدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3388In-book reference : Book 60, Hadith 62USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 602   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3389,
    "id": 3389,
    "url": "https://sunnah.com/bukhari:3389",
    "bookNumber": 60,
    "hadithNumber": 63,
    "narrator": "Narrated `Urwa:",
    "english": "I asked `Aisha the wife of the Prophet (ﷺ) about the meaning of the following Verse: -- \"(Respite will be granted) 'Until when the apostles give up hope (of their people) and thought that they were denied (by their people)...............\"(12.110) `Aisha replied, \"Really, their nations did not believe them.\" I said, \"By Allah! They were definite that their nations treated them as liars and it was not a matter of suspecting.\" `Aisha said, \"O 'Uraiya (i.e. `Urwa)! No doubt, they were quite sure about it.\" I said, \"May the Verse be read in such a way as to mean that the apostles thought that Allah did not help them?\" Aisha said, \"Allah forbid! (Impossible) The Apostles did not suspect their Lord of such a thing. But this Verse is concerned with the Apostles' followers who had faith in their Lord and believed in their apostles and their period of trials was long and Allah's Help was delayed till the apostles gave up hope for the conversion of the disbelievers amongst their nation and suspected that even their followers were shaken in their belief, Allah's Help then came to them.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَرَأَيْتِ قَوْلَهُ ‏{‏حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِّبُوا‏}‏ أَوْ كُذِبُوا‏.‏ قَالَتْ بَلْ كَذَّبَهُمْ قَوْمُهُمْ‏.‏ فَقُلْتُ وَاللَّهِ لَقَدِ اسْتَيْقَنُوا أَنَّ قَوْمَهُمْ كَذَّبُوهُمْ وَمَا هُوَ بِالظَّنِّ‏.‏ فَقَالَتْ يَا عُرَيَّةُ، لَقَدِ اسْتَيْقَنُوا بِذَلِكَ‏.‏ قُلْتُ فَلَعَلَّهَا أَوْ كُذِبُوا‏.‏ قَالَتْ مَعَاذَ اللَّهِ، لَمْ تَكُنِ الرُّسُلُ تَظُنُّ ذَلِكَ بِرَبِّهَا وَأَمَّا هَذِهِ الآيَةُ قَالَتْ هُمْ أَتْبَاعُ الرُّسُلِ الَّذِينَ آمَنُوا بِرَبِّهِمْ وَصَدَّقُوهُمْ، وَطَالَ عَلَيْهِمُ الْبَلاَءُ، وَاسْتَأْخَرَ عَنْهُمُ النَّصْرُ حَتَّى إِذَا اسْتَيْأَسَتْ مِمَّنْ كَذَّبَهُمْ مِنْ قَوْمِهِمْ، وَظَنُّوا أَنَّ أَتْبَاعَهُمْ كَذَّبُوهُمْ جَاءَهُمْ نَصْرُ اللَّهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏اسْتَيْأَسُوا‏}‏ افْتَعَلُوا مِنْ يَئِسْتُ‏.‏ ‏{‏مِنْهُ‏}‏ مِنْ يُوسُفَ‏.‏ ‏{‏لاَ تَيْأَسُوا مِنْ رَوْحِ اللَّهِ‏}‏ مَعْنَاهُ الرَّجَاءُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3389In-book reference : Book 60, Hadith 63USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 603   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3390,
    "id": 3390,
    "url": "https://sunnah.com/bukhari:3390",
    "bookNumber": 60,
    "hadithNumber": 64,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph, the son of Jacob! the son of Isaac, the son of Abraham.\"",
    "arabic": "أَخْبَرَنِي عَبْدَةُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ عَلَيْهِمِ السَّلاَمُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3390In-book reference : Book 60, Hadith 64USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 603   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3391,
    "id": 3391,
    "url": "https://sunnah.com/bukhari:3391",
    "bookNumber": 60,
    "hadithNumber": 65,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"While Job was naked, taking a bath, a swarm of gold locusts fell on him and he \nstarted collecting them in his garment. His Lord called him, 'O Job! Have I not made you rich enough \nto need what you see? He said, 'Yes, O Lord! But I cannot dispense with your Blessing.\"'",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَمَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا خَرَّ عَلَيْهِ رِجْلُ جَرَادٍ مِنْ ذَهَبٍ، فَجَعَلَ يَحْثِي فِي ثَوْبِهِ، فَنَادَى رَبُّهُ يَا أَيُّوبُ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى قَالَ بَلَى يَا رَبِّ، وَلَكِنْ لاَ غِنَى لِي عَنْ بَرَكَتِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3391In-book reference : Book 60, Hadith 65USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 604   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3392,
    "id": 3392,
    "url": "https://sunnah.com/bukhari:3392",
    "bookNumber": 60,
    "hadithNumber": 66,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) returned to Khadija while his heart was beating rapidly. She took him to Waraqa bin \nNaufal who was a Christian convert and used to read the Gospels in Arabic Waraqa asked (the \nProphet), \"What do you see?\" When he told him, Waraqa said, \"That is the same angel whom Allah \nsent to the Prophet) Moses. Should I live till you receive the Divine Message, I will support you \nstrongly.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، سَمِعْتُ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ ـ رضى الله عنها فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم إِلَى خَدِيجَةَ يَرْجُفُ فُؤَادُهُ، فَانْطَلَقَتْ بِهِ إِلَى وَرَقَةَ بْنِ نَوْفَلٍ، وَكَانَ رَجُلاً تَنَصَّرَ يَقْرَأُ الإِنْجِيلَ بِالْعَرَبِيَّةِ‏.‏ فَقَالَ وَرَقَةُ مَاذَا تَرَى فَأَخْبَرَهُ‏.‏ فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أَنْزَلَ اللَّهُ عَلَى مُوسَى، وَإِنْ أَدْرَكَنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ النَّامُوسُ صَاحِبُ السِّرِّ الَّذِي يُطْلِعُهُ بِمَا يَسْتُرُهُ عَنْ غَيْرِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3392In-book reference : Book 60, Hadith 66USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 605   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3393,
    "id": 3393,
    "url": "https://sunnah.com/bukhari:3393",
    "bookNumber": 60,
    "hadithNumber": 67,
    "narrator": "Narrated Malik bin Sasaa:",
    "english": "Allah's Messenger (ﷺ) talked to his companions about his Night Journey to the Heavens. When he reached \nthe fifth Heaven, he met Aaron. (Gabriel said to the Prophet), \"This is Aaron.\" The Prophet (ﷺ) said, \n\"Gabriel greeted and so did I, and he returned the greeting saying, 'Welcome, O Pious Brother and \nPious Prophet.\"",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ مَالِكِ بْنِ صَعْصَعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَهُمْ عَنْ لَيْلَةِ أُسْرِيَ بِهِ حَتَّى أَتَى السَّمَاءَ الْخَامِسَةَ، فَإِذَا هَارُونُ قَالَ هَذَا هَارُونُ فَسَلِّمْ عَلَيْهِ‏.‏ فَسَلَّمْتُ عَلَيْهِ، فَرَدَّ ثُمَّ قَالَ مَرْحَبًا بِالأَخِ الصَّالِحِ وَالنَّبِيِّ الصَّالِحِ‏.‏ تَابَعَهُ ثَابِتٌ وَعَبَّادُ بْنُ أَبِي عَلِيٍّ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3393In-book reference : Book 60, Hadith 67USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 606   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3394,
    "id": 3394,
    "url": "https://sunnah.com/bukhari:3394",
    "bookNumber": 60,
    "hadithNumber": 68,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"On the night of my Ascension to Heaven, I saw (the prophet) Moses who was a \nthin person with lank hair, looking like one of the men of the tribe of Shanua; and I saw Jesus who \nwas of average height with red face as if he had just come out of a bathroom. And I resemble prophet \nAbraham more than any of his offspring does. Then I was given two cups, one containing milk and the \nother wine. Gabriel said, 'Drink whichever you like.' I took the milk and drank it. Gabriel said, 'You \nhave accepted what is natural, (True Religion i.e. Islam) and if you had taken the wine, your followers \nwould have gone astray.' \"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ ‏\n\"‏ رَأَيْتُ مُوسَى وَإِذَا رَجُلٌ ضَرْبٌ رَجِلٌ، كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ، وَرَأَيْتُ عِيسَى، فَإِذَا هُوَ رَجُلٌ رَبْعَةٌ أَحْمَرُ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ، وَأَنَا أَشْبَهُ وَلَدِ إِبْرَاهِيمَ صلى الله عليه وسلم بِهِ، ثُمَّ أُتِيتُ بِإِنَاءَيْنِ، فِي أَحَدِهِمَا لَبَنٌ، وَفِي الآخَرِ خَمْرٌ فَقَالَ اشْرَبْ أَيَّهُمَا شِئْتَ‏.‏ فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ فَقِيلَ أَخَذْتَ الْفِطْرَةَ، أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3394In-book reference : Book 60, Hadith 68USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 607   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3395,
    "id": 3395,
    "url": "https://sunnah.com/bukhari:3395",
    "bookNumber": 60,
    "hadithNumber": 69,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"One should not say that I am better than Jonah (i.e. Yunus) bin Matta.\" So, he \nmentioned his father Matta. The Prophet (ﷺ) mentioned the night of his Ascension and said, \"The prophet \nMoses was brown, a tall person as if from the people of the tribe of Shanu'a. Jesus was a curly-haired \nman of moderate height.\" He also mentioned Malik, the gate-keeper of the (Hell) Fire, and Ad-Dajjal.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، حَدَّثَنَا ابْنُ عَمِّ، نَبِيِّكُمْ ـ يَعْنِي ابْنَ عَبَّاسٍ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ‏.‏   وَذَكَرَ النَّبِيُّ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ فَقَالَ ‏\"‏ مُوسَى آدَمُ طُوَالٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ ‏\"‏‏.‏ وَقَالَ ‏\"‏ عِيسَى جَعْدٌ مَرْبُوعٌ ‏\"‏‏.‏ وَذَكَرَ مَالِكًا خَازِنَ النَّارِ، وَذَكَرَ الدَّجَّالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3395, 3396In-book reference : Book 60, Hadith 69USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 608   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3396,
    "id": 3396,
    "url": "https://sunnah.com/bukhari:3396",
    "bookNumber": 60,
    "hadithNumber": 69,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"One should not say that I am better than Jonah (i.e. Yunus) bin Matta.\" So, he \nmentioned his father Matta. The Prophet (ﷺ) mentioned the night of his Ascension and said, \"The prophet \nMoses was brown, a tall person as if from the people of the tribe of Shanu'a. Jesus was a curly-haired \nman of moderate height.\" He also mentioned Malik, the gate-keeper of the (Hell) Fire, and Ad-Dajjal.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، حَدَّثَنَا ابْنُ عَمِّ، نَبِيِّكُمْ ـ يَعْنِي ابْنَ عَبَّاسٍ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ‏.‏   وَذَكَرَ النَّبِيُّ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ فَقَالَ ‏\"‏ مُوسَى آدَمُ طُوَالٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ ‏\"‏‏.‏ وَقَالَ ‏\"‏ عِيسَى جَعْدٌ مَرْبُوعٌ ‏\"‏‏.‏ وَذَكَرَ مَالِكًا خَازِنَ النَّارِ، وَذَكَرَ الدَّجَّالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3395, 3396In-book reference : Book 60, Hadith 69USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 608   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3397,
    "id": 3397,
    "url": "https://sunnah.com/bukhari:3397",
    "bookNumber": 60,
    "hadithNumber": 70,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When the Prophet (ﷺ) came to Medina, he found (the Jews) fasting on the day of 'Ashura' (i.e. 10th of \nMuharram). They used to say: \"This is a great day on which Allah saved Moses and drowned the folk \nof Pharaoh. Moses observed the fast on this day, as a sign of gratitude to Allah.\" The Prophet (ﷺ) said, \"I \nam closer to Moses than they.\" So, he observed the fast (on that day) and ordered the Muslims to fast \non it.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ السَّخْتِيَانِيُّ، عَنِ ابْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا قَدِمَ الْمَدِينَةَ وَجَدَهُمْ يَصُومُونَ يَوْمًا، يَعْنِي عَاشُورَاءَ، فَقَالُوا هَذَا يَوْمٌ عَظِيمٌ، وَهْوَ يَوْمٌ نَجَّى اللَّهُ فِيهِ مُوسَى، وَأَغْرَقَ آلَ فِرْعَوْنَ، فَصَامَ مُوسَى شُكْرًا لِلَّهِ‏.‏ فَقَالَ ‏\n\"‏ أَنَا أَوْلَى بِمُوسَى مِنْهُمْ ‏\"‏‏.‏ فَصَامَهُ وَأَمَرَ بِصِيَامِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3397In-book reference : Book 60, Hadith 70USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 609   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3398,
    "id": 3398,
    "url": "https://sunnah.com/bukhari:3398",
    "bookNumber": 60,
    "hadithNumber": 71,
    "narrator": "Narrated Abu Sa`id:",
    "english": "The Prophet (ﷺ) said, 'People will be struck unconscious on the Day of Resurrection and I will be the first \nto regain consciousness, and behold! There I will see Moses holding one of the pillars of Allah's \nThrone. I will wonder whether he has become conscious before me of he has been exempted, because \nof his unconsciousness at the Tur (mountain) which he received (on the earth).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ النَّاسُ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَفَاقَ قَبْلِي، أَمْ جُوزِيَ بِصَعْقَةِ الطُّورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3398In-book reference : Book 60, Hadith 71USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 610   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3399,
    "id": 3399,
    "url": "https://sunnah.com/bukhari:3399",
    "bookNumber": 60,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"Were it not for Bani Israel, meat would not decay; and were it not for Eve, no \nwoman would ever betray her husband.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3399In-book reference : Book 60, Hadith 72USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 611   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3400,
    "id": 3400,
    "url": "https://sunnah.com/bukhari:3400",
    "bookNumber": 60,
    "hadithNumber": 73,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "That he differed with Al-Hur bin Qais Al-Fazari regarding the companion of Moses. Ibn `Abbas said \nthat he was Al-Khadir. Meanwhile Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \n\"My friend and I have differed regarding Moses' companion whom Moses asked the way to meet. \nHave you heard Allah's Messenger (ﷺ) mentioning something about him?\" He said, \"Yes, I heard Allah's \nApostle saying, 'While Moses was sitting in the company of some Israelites, a man came and asked \n(him), 'Do you know anyone who is more learned than you?' Moses replied, 'No.' So, Allah sent the \nDivine Inspiration to Moses: 'Yes, Our slave, Khadir (is more learned than you).' Moses asked how to \nmeet him (i.e. Khadir). So, the fish, was made, as a sign for him, and he was told that when the fish \nwas lost, he should return and there he would meet him. So, Moses went on looking for the sign of the \nfish in the sea. The servant boy of Moses said to him, 'Do you know that when we were sitting by the \nside of the rock, I forgot the fish, and t was only Satan who made me forget to tell (you) about it.' \nMoses said, That was what we were seeking after,' and both of them returned, following their \nfootmarks and found Khadir; and what happened further to them, is mentioned in Allah's Book.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى، قَالَ ابْنُ عَبَّاسٍ هُوَ خَضِرٌ، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ، فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي، هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ جَاءَهُ رَجُلٌ، فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ لاَ‏.‏ فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلَى عَبْدُنَا خَضِرٌ‏.‏ فَسَأَلَ مُوسَى السَّبِيلَ إِلَيْهِ، فَجُعِلَ لَهُ الْحُوتُ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ‏.‏ فَكَانَ يَتْبَعُ الْحُوتَ فِي الْبَحْرِ، فَقَالَ لِمُوسَى فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ، فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ فَقَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِ‏.‏ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا فَوَجَدَا خَضِرًا، فَكَانَ مِنْ شَأْنِهِمَا الَّذِي قَصَّ اللَّهُ فِي كِتَابِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3400In-book reference : Book 60, Hadith 73USC-MSA web (English) reference : Vol. 4, Book 55, Hadith 612   (deprecated numbering scheme)"
  }
]