[
  {
    "hadithGlobalNumber": 4501,
    "id": 4501,
    "url": "https://sunnah.com/bukhari:4501",
    "bookNumber": 65,
    "hadithNumber": 28,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Fasting was observed on the day of 'Ashura' (i.e. 10th of Muharram) by the people of the Pre-lslamic \nPeriod. But when (the order of compulsory fasting) in the month of Ramadan was revealed, the \nProphet said, \"It is up to one to fast on it (i.e. day of 'Ashura') or not.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ عَاشُورَاءُ يَصُومُهُ أَهْلُ الْجَاهِلِيَّةِ، فَلَمَّا نَزَلَ رَمَضَانُ قَالَ ‏\n\"‏ مَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ لَمْ يَصُمْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4501In-book reference : Book 65, Hadith 28USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 28   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4502,
    "id": 4502,
    "url": "https://sunnah.com/bukhari:4502",
    "bookNumber": 65,
    "hadithNumber": 29,
    "narrator": "Narrated `Aisha:",
    "english": "The people used to fast on the day of 'Ashura' before fasting in Ramadan was prescribed but when (the \norder of compulsory fasting in) Ramadan was revealed, it was up to one to fast on it (i.e. 'Ashura') or \nnot.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَ عَاشُورَاءُ يُصَامُ قَبْلَ رَمَضَانَ، فَلَمَّا نَزَلَ رَمَضَانُ قَالَ ‏\n\"‏ مَنْ شَاءَ صَامَ، وَمَنْ شَاءَ أَفْطَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4502In-book reference : Book 65, Hadith 29USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 29   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4503,
    "id": 4503,
    "url": "https://sunnah.com/bukhari:4503",
    "bookNumber": 65,
    "hadithNumber": 30,
    "narrator": "Narrated `Abdullah:",
    "english": "That Al-Ash'ath entered upon him while he was eating. Al-Ash'ath said, \"Today is 'Ashura.\" I said (to \nhim), \"Fasting had been observed (on such a day) before (the order of compulsory fasting in) \nRamadan was revealed. But when (the order of fasting in) Ramadan was revealed, fasting (on \n'Ashura') was given up, so come and eat.\"",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلَ عَلَيْهِ الأَشْعَثُ وَهْوَ يَطْعَمُ فَقَالَ الْيَوْمُ عَاشُورَاءُ‏.‏ فَقَالَ كَانَ يُصَامُ قَبْلَ أَنْ يَنْزِلَ رَمَضَانُ، فَلَمَّا نَزَلَ رَمَضَانُ تُرِكَ، فَادْنُ فَكُلْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4503In-book reference : Book 65, Hadith 30USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 30   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4504,
    "id": 4504,
    "url": "https://sunnah.com/bukhari:4504",
    "bookNumber": 65,
    "hadithNumber": 31,
    "narrator": "Narrated Aisha:",
    "english": "During the Pre-lslamic Period of ignorance the Quraish used to observe fasting on the day of 'Ashura', \nand the Prophet (ﷺ) himself used to observe fasting on it too. But when he came to Medina, he fasted on \nthat day and ordered the Muslims to fast on it. When (the order of compulsory fasting in ) Ramadan \nwas revealed, fasting in Ramadan became an obligation, and fasting on 'Ashura' was given up, and \nwho ever wished to fast (on it) did so, and whoever did not wish to fast on it, did not fast.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُهُ، فَلَمَّا قَدِمَ الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ، فَلَمَّا نَزَلَ رَمَضَانُ كَانَ رَمَضَانُ الْفَرِيضَةَ، وَتُرِكَ عَاشُورَاءُ، فَكَانَ مَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ لَمْ يَصُمْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4504In-book reference : Book 65, Hadith 31USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 31   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4505,
    "id": 4505,
    "url": "https://sunnah.com/bukhari:4505",
    "bookNumber": 65,
    "hadithNumber": 32,
    "narrator": "Narrated 'Ata:",
    "english": "That he heard Ibn `Abbas reciting the Divine Verse:-- \n\"And for those who can fast they had a choice either fast, or feed a poor for every day..\" (2.184) Ibn \n`Abbas said, \"This Verse is not abrogated, but it is meant for old men and old women who have no \nstrength to fast, so they should feed one poor person for each day of fasting (instead of fasting).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ عَطَاءٍ، سَمِعَ ابْنَ عَبَّاسٍ، يَقْرَأُ ‏{‏وَعَلَى الَّذِينَ يُطَوَّقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ لَيْسَتْ بِمَنْسُوخَةٍ، هُوَ الشَّيْخُ الْكَبِيرُ وَالْمَرْأَةُ الْكَبِيرَةُ لاَ يَسْتَطِيعَانِ أَنْ يَصُومَا، فَلْيُطْعِمَانِ مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4505In-book reference : Book 65, Hadith 32USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 32   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4506,
    "id": 4506,
    "url": "https://sunnah.com/bukhari:4506",
    "bookNumber": 65,
    "hadithNumber": 33,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar recited: \n\"They had a choice, either fast or feed a poor for every day..\" and added, \"This Verse is abrogated.\"",
    "arabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَرَأَ ‏{‏فِدْيَةٌ طَعَامُ مَسَاكِينَ‏}‏ قَالَ هِيَ مَنْسُوخَةٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4506In-book reference : Book 65, Hadith 33USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 33   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4507,
    "id": 4507,
    "url": "https://sunnah.com/bukhari:4507",
    "bookNumber": 65,
    "hadithNumber": 34,
    "narrator": "Narrated Salama:",
    "english": "When the Divine Revelation: \n\"For those who can fast, they had a choice either fast, or feed a poor for every day,\" (2.184) was \nrevealed, it was permissible for one to give a ransom and give up fasting, till the Verse succeeding it \nwas revealed and abrogated it.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ بْنِ الأَكْوَعِ عَنْ سَلَمَةَ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ‏}‏ كَانَ مَنْ أَرَادَ أَنْ يُفْطِرَ وَيَفْتَدِيَ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا‏.‏ مَاتَ بُكَيْرٌ قَبْلَ يَزِيدَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4507In-book reference : Book 65, Hadith 34USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 34   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4508,
    "id": 4508,
    "url": "https://sunnah.com/bukhari:4508",
    "bookNumber": 65,
    "hadithNumber": 35,
    "narrator": "Narrated Al-Bara':",
    "english": "When the order of compulsory fasting of Ramadan was revealed, the people did not have sexual \nrelations with their wives for the whole month of Ramadan, but some men cheated themselves (by \nviolating that restriction). So Allah revealed: \"Allah is aware that you were deceiving yourselves but \nHe accepted your repentance and forgave you..\" (3.187)",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ‏.‏ لَمَّا نَزَلَ صَوْمُ رَمَضَانَ كَانُوا لاَ يَقْرَبُونَ النِّسَاءَ رَمَضَانَ كُلَّهُ، وَكَانَ رِجَالٌ يَخُونُونَ أَنْفُسَهُمْ، فَأَنْزَلَ اللَّهُ ‏{‏عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4508In-book reference : Book 65, Hadith 35USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 35   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4509,
    "id": 4509,
    "url": "https://sunnah.com/bukhari:4509",
    "bookNumber": 65,
    "hadithNumber": 36,
    "narrator": "Narrated Ash-Shu`bi:",
    "english": "`Adi took a white rope (or thread) and a black one, and when some part of the night had passed, he \nlooked at them but he could not distinguish one from the other. The next morning he said, \"O Allah's \nApostle! I put (a white thread and a black thread) underneath my pillow.\" The Prophet (ﷺ) said, \"Then \nyour pillow is too wide if the white thread (of dawn) and the black thread (of the night) are underneath \nyour pillow! \"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيٍّ، قَالَ أَخَذَ عَدِيٌّ عِقَالاً أَبْيَضَ وَعِقَالاً أَسْوَدَ حَتَّى كَانَ بَعْضُ اللَّيْلِ نَظَرَ فَلَمْ يَسْتَبِينَا، فَلَمَّا أَصْبَحَ قَالَ يَا رَسُولَ اللَّهِ، جَعَلْتُ تَحْتَ وِسَادَتِي‏.‏ قَالَ ‏\n\"‏ إِنَّ وِسَادَكَ إِذًا لَعَرِيضٌ أَنْ كَانَ الْخَيْطُ الأَبْيَضُ وَالأَسْوَدُ تَحْتَ وِسَادَتِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4509In-book reference : Book 65, Hadith 36USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 36   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4510,
    "id": 4510,
    "url": "https://sunnah.com/bukhari:4510",
    "bookNumber": 65,
    "hadithNumber": 37,
    "narrator": "Narrated `Adi bin Hatim:",
    "english": "I said, \"O Allah's Messenger (ﷺ)! What is the meaning of the white thread distinct from the black thread? Are \nthese two threads?\" He said, \"You are not intelligent if you watch the two threads.\" He then added, \n\"No, it is the darkness of the night and the whiteness of the day.''",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ أَهُمَا الْخَيْطَانِ قَالَ ‏\"‏ إِنَّكَ لَعَرِيضُ الْقَفَا إِنْ أَبْصَرْتَ الْخَيْطَيْنِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ لاَ بَلْ هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4510In-book reference : Book 65, Hadith 37USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 37   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4511,
    "id": 4511,
    "url": "https://sunnah.com/bukhari:4511",
    "bookNumber": 65,
    "hadithNumber": 38,
    "narrator": "Narrated Sahl bin Sa`d The Verse \"And eat and drink until the white thread appears to you distinct:",
    "english": "from the black thread.\" was revealed, but: '... of dawn' was not revealed (along with it) so some men, \nwhen intending to fast, used to tie their legs, one with white thread and the other with black thread and \nwould keep on eating till they could distinguish one thread from the other. Then Allah revealed' ... of \ndawn,' whereupon they understood that meant the night and the day.",
    "arabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ مُطَرِّفٍ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ وَأُنْزِلَتْ ‏{‏وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ‏}‏ وَلَمْ يُنْزَلْ ‏{‏مِنَ الْفَجْرِ‏}‏ وَكَانَ رِجَالٌ إِذَا أَرَادُوا الصَّوْمَ رَبَطَ أَحَدُهُمْ فِي رِجْلَيْهِ الْخَيْطَ الأَبْيَضَ وَالْخَيْطَ الأَسْوَدَ، وَلاَ يَزَالُ يَأْكُلُ حَتَّى يَتَبَيَّنَ لَهُ رُؤْيَتُهُمَا، فَأَنْزَلَ اللَّهُ بَعْدَهُ ‏{‏مِنَ الْفَجْرِ‏}‏ فَعَلِمُوا أَنَّمَا يَعْنِي اللَّيْلَ مِنَ النَّهَارِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4511In-book reference : Book 65, Hadith 38USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 38   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4512,
    "id": 4512,
    "url": "https://sunnah.com/bukhari:4512",
    "bookNumber": 65,
    "hadithNumber": 39,
    "narrator": "Narrated Al-Bara:",
    "english": "In the Pre-lslamic Period when the people assumed Ihram, they would enter their houses from the \nback. So Allah revealed:-- \n\"And it is not righteousness that you enter houses from the back, but the righteous man is he who fears \nAllah, obeys His Orders and keeps away from what He has forbidden. So enter houses through their \ndoors.\" (2.189)",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانُوا إِذَا أَحْرَمُوا فِي الْجَاهِلِيَّةِ أَتَوُا الْبَيْتَ مِنْ ظَهْرِهِ، فَأَنْزَلَ اللَّهُ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4512In-book reference : Book 65, Hadith 39USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 39   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4513,
    "id": 4513,
    "url": "https://sunnah.com/bukhari:4513",
    "bookNumber": 65,
    "hadithNumber": 40,
    "narrator": "Narrated Nafi`:",
    "english": "During the affliction of Ibn Az-Zubair, two men came to Ibn `Umar and said, \"The people are lost, \nand you are the son of `Umar, and the companion of the Prophet, so what forbids you from coming \nout?\" He said, \"What forbids me is that Allah has prohibited the shedding of my brother's blood.\" \nThey both said, \"Didn't Allah say, 'And fight then until there is no more affliction?\" He said \"We \nfought until there was no more affliction and the worship is for Allah (Alone while you want to fight \nuntil there is affliction and until the worship become for other than Allah.\" \nNarrated Nafi` (through another group of sub-narrators): A man came to Ibn `Umar and said, \"O Abu \n`Abdur Rahman! What made you perform Hajj in one year and Umra in another year and leave the \nJihad for Allah' Cause though you know how much Allah recommends it?\" Ibn `Umar replied, \"O son \nof my brother! Islam is founded on five principles, i.e. believe in Allah and His Apostle, the five \ncompulsory prayers, the fasting of the month of Ramadan, the payment of Zakat, and the Hajj to the \nHouse (of Allah).\" The man said, \"O Abu `Abdur Rahman! Won't you listen to why Allah has \nmentioned in His Book: 'If two groups of believers fight each other, then make peace between them, \nbut if one of then transgresses beyond bounds against the other, then you all fight against the one that \ntransgresses. (49.9) and:--\"And fight them till there is no more affliction (i.e. no more worshiping of \nothers along with Allah).\" Ibn `Umar said, \"We did it, during the lifetime of Allah's Messenger (ﷺ) when \nIslam had only a few followers. A man would be put to trial because of his religion; he would either \nbe killed or tortured. But when the Muslims increased, there was no more afflictions or oppressions.\" \nThe man said, \"What is your opinion about `Uthman and `Ali?\" Ibn `Umar said, \"As for `Uthman, it \nseems that Allah has forgiven him, but you people dislike that he should be forgiven. And as for `Ali, \nhe is the cousin of Allah's Messenger (ﷺ) and his son-in-law.\" Then he pointed with his hand and said, \"That \nis his house which you see.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَتَاهُ رَجُلاَنِ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالاَ إِنَّ النَّاسَ قَدْ ضُيِّعُوا، وَأَنْتَ ابْنُ عُمَرَ وَصَاحِبُ النَّبِيِّ صلى الله عليه وسلم فَمَا يَمْنَعُكَ أَنْ تَخْرُجَ فَقَالَ يَمْنَعُنِي أَنَّ اللَّهَ حَرَّمَ دَمَ أَخِي‏.‏ فَقَالاَ أَلَمْ يَقُلِ اللَّهُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ ‏}‏ فَقَالَ قَاتَلْنَا حَتَّى لَمْ تَكُنْ فِتْنَةٌ، وَكَانَ الدِّينُ لِلَّهِ، وَأَنْتُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونَ فِتْنَةٌ، وَيَكُونَ الدِّينُ لِغَيْرِ اللَّهِ‏.‏       وَزَادَ عُثْمَانُ بْنُ صَالِحٍ عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي فُلاَنٌ، وَحَيْوَةُ بْنُ شُرَيْحٍ، عَنْ بَكْرِ بْنِ عَمْرٍو الْمَعَافِرِيِّ، أَنَّ بُكَيْرَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَتَى ابْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا حَمَلَكَ عَلَى أَنْ تَحُجَّ عَامًا وَتَعْتَمِرَ عَامًا، وَتَتْرُكَ الْجِهَادَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ، وَقَدْ عَلِمْتَ مَا رَغَّبَ اللَّهُ فِيهِ قَالَ يَا ابْنَ أَخِي بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ إِيمَانٍ بِاللَّهِ وَرَسُولِهِ، وَالصَّلاَةِ الْخَمْسِ، وَصِيَامِ رَمَضَانَ، وَأَدَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ‏.‏ قَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا‏}‏ ‏{‏إِلَى أَمْرِ اللَّهِ‏}‏ ‏{‏قَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏ قَالَ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ، وَإِمَّا يُعَذِّبُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏.‏       قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ قَالَ أَمَّا عُثْمَانُ فَكَأَنَّ اللَّهَ عَفَا عَنْهُ، وَأَمَّا أَنْتُمْ فَكَرِهْتُمْ أَنْ تَعْفُوا عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ فَقَالَ هَذَا بَيْتُهُ حَيْثُ تَرَوْنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4513, 4514, 4515In-book reference : Book 65, Hadith 40USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4514,
    "id": 4514,
    "url": "https://sunnah.com/bukhari:4514",
    "bookNumber": 65,
    "hadithNumber": 40,
    "narrator": "Narrated Nafi`:",
    "english": "During the affliction of Ibn Az-Zubair, two men came to Ibn `Umar and said, \"The people are lost, \nand you are the son of `Umar, and the companion of the Prophet, so what forbids you from coming \nout?\" He said, \"What forbids me is that Allah has prohibited the shedding of my brother's blood.\" \nThey both said, \"Didn't Allah say, 'And fight then until there is no more affliction?\" He said \"We \nfought until there was no more affliction and the worship is for Allah (Alone while you want to fight \nuntil there is affliction and until the worship become for other than Allah.\" \nNarrated Nafi` (through another group of sub-narrators): A man came to Ibn `Umar and said, \"O Abu \n`Abdur Rahman! What made you perform Hajj in one year and Umra in another year and leave the \nJihad for Allah' Cause though you know how much Allah recommends it?\" Ibn `Umar replied, \"O son \nof my brother! Islam is founded on five principles, i.e. believe in Allah and His Apostle, the five \ncompulsory prayers, the fasting of the month of Ramadan, the payment of Zakat, and the Hajj to the \nHouse (of Allah).\" The man said, \"O Abu `Abdur Rahman! Won't you listen to why Allah has \nmentioned in His Book: 'If two groups of believers fight each other, then make peace between them, \nbut if one of then transgresses beyond bounds against the other, then you all fight against the one that \ntransgresses. (49.9) and:--\"And fight them till there is no more affliction (i.e. no more worshiping of \nothers along with Allah).\" Ibn `Umar said, \"We did it, during the lifetime of Allah's Messenger (ﷺ) when \nIslam had only a few followers. A man would be put to trial because of his religion; he would either \nbe killed or tortured. But when the Muslims increased, there was no more afflictions or oppressions.\" \nThe man said, \"What is your opinion about `Uthman and `Ali?\" Ibn `Umar said, \"As for `Uthman, it \nseems that Allah has forgiven him, but you people dislike that he should be forgiven. And as for `Ali, \nhe is the cousin of Allah's Messenger (ﷺ) and his son-in-law.\" Then he pointed with his hand and said, \"That \nis his house which you see.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَتَاهُ رَجُلاَنِ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالاَ إِنَّ النَّاسَ قَدْ ضُيِّعُوا، وَأَنْتَ ابْنُ عُمَرَ وَصَاحِبُ النَّبِيِّ صلى الله عليه وسلم فَمَا يَمْنَعُكَ أَنْ تَخْرُجَ فَقَالَ يَمْنَعُنِي أَنَّ اللَّهَ حَرَّمَ دَمَ أَخِي‏.‏ فَقَالاَ أَلَمْ يَقُلِ اللَّهُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ ‏}‏ فَقَالَ قَاتَلْنَا حَتَّى لَمْ تَكُنْ فِتْنَةٌ، وَكَانَ الدِّينُ لِلَّهِ، وَأَنْتُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونَ فِتْنَةٌ، وَيَكُونَ الدِّينُ لِغَيْرِ اللَّهِ‏.‏       وَزَادَ عُثْمَانُ بْنُ صَالِحٍ عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي فُلاَنٌ، وَحَيْوَةُ بْنُ شُرَيْحٍ، عَنْ بَكْرِ بْنِ عَمْرٍو الْمَعَافِرِيِّ، أَنَّ بُكَيْرَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَتَى ابْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا حَمَلَكَ عَلَى أَنْ تَحُجَّ عَامًا وَتَعْتَمِرَ عَامًا، وَتَتْرُكَ الْجِهَادَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ، وَقَدْ عَلِمْتَ مَا رَغَّبَ اللَّهُ فِيهِ قَالَ يَا ابْنَ أَخِي بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ إِيمَانٍ بِاللَّهِ وَرَسُولِهِ، وَالصَّلاَةِ الْخَمْسِ، وَصِيَامِ رَمَضَانَ، وَأَدَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ‏.‏ قَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا‏}‏ ‏{‏إِلَى أَمْرِ اللَّهِ‏}‏ ‏{‏قَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏ قَالَ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ، وَإِمَّا يُعَذِّبُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏.‏       قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ قَالَ أَمَّا عُثْمَانُ فَكَأَنَّ اللَّهَ عَفَا عَنْهُ، وَأَمَّا أَنْتُمْ فَكَرِهْتُمْ أَنْ تَعْفُوا عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ فَقَالَ هَذَا بَيْتُهُ حَيْثُ تَرَوْنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4513, 4514, 4515In-book reference : Book 65, Hadith 40USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4515,
    "id": 4515,
    "url": "https://sunnah.com/bukhari:4515",
    "bookNumber": 65,
    "hadithNumber": 40,
    "narrator": "Narrated Nafi`:",
    "english": "During the affliction of Ibn Az-Zubair, two men came to Ibn `Umar and said, \"The people are lost, \nand you are the son of `Umar, and the companion of the Prophet, so what forbids you from coming \nout?\" He said, \"What forbids me is that Allah has prohibited the shedding of my brother's blood.\" \nThey both said, \"Didn't Allah say, 'And fight then until there is no more affliction?\" He said \"We \nfought until there was no more affliction and the worship is for Allah (Alone while you want to fight \nuntil there is affliction and until the worship become for other than Allah.\" \nNarrated Nafi` (through another group of sub-narrators): A man came to Ibn `Umar and said, \"O Abu \n`Abdur Rahman! What made you perform Hajj in one year and Umra in another year and leave the \nJihad for Allah' Cause though you know how much Allah recommends it?\" Ibn `Umar replied, \"O son \nof my brother! Islam is founded on five principles, i.e. believe in Allah and His Apostle, the five \ncompulsory prayers, the fasting of the month of Ramadan, the payment of Zakat, and the Hajj to the \nHouse (of Allah).\" The man said, \"O Abu `Abdur Rahman! Won't you listen to why Allah has \nmentioned in His Book: 'If two groups of believers fight each other, then make peace between them, \nbut if one of then transgresses beyond bounds against the other, then you all fight against the one that \ntransgresses. (49.9) and:--\"And fight them till there is no more affliction (i.e. no more worshiping of \nothers along with Allah).\" Ibn `Umar said, \"We did it, during the lifetime of Allah's Messenger (ﷺ) when \nIslam had only a few followers. A man would be put to trial because of his religion; he would either \nbe killed or tortured. But when the Muslims increased, there was no more afflictions or oppressions.\" \nThe man said, \"What is your opinion about `Uthman and `Ali?\" Ibn `Umar said, \"As for `Uthman, it \nseems that Allah has forgiven him, but you people dislike that he should be forgiven. And as for `Ali, \nhe is the cousin of Allah's Messenger (ﷺ) and his son-in-law.\" Then he pointed with his hand and said, \"That \nis his house which you see.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَتَاهُ رَجُلاَنِ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالاَ إِنَّ النَّاسَ قَدْ ضُيِّعُوا، وَأَنْتَ ابْنُ عُمَرَ وَصَاحِبُ النَّبِيِّ صلى الله عليه وسلم فَمَا يَمْنَعُكَ أَنْ تَخْرُجَ فَقَالَ يَمْنَعُنِي أَنَّ اللَّهَ حَرَّمَ دَمَ أَخِي‏.‏ فَقَالاَ أَلَمْ يَقُلِ اللَّهُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ ‏}‏ فَقَالَ قَاتَلْنَا حَتَّى لَمْ تَكُنْ فِتْنَةٌ، وَكَانَ الدِّينُ لِلَّهِ، وَأَنْتُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونَ فِتْنَةٌ، وَيَكُونَ الدِّينُ لِغَيْرِ اللَّهِ‏.‏       وَزَادَ عُثْمَانُ بْنُ صَالِحٍ عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي فُلاَنٌ، وَحَيْوَةُ بْنُ شُرَيْحٍ، عَنْ بَكْرِ بْنِ عَمْرٍو الْمَعَافِرِيِّ، أَنَّ بُكَيْرَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَتَى ابْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا حَمَلَكَ عَلَى أَنْ تَحُجَّ عَامًا وَتَعْتَمِرَ عَامًا، وَتَتْرُكَ الْجِهَادَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ، وَقَدْ عَلِمْتَ مَا رَغَّبَ اللَّهُ فِيهِ قَالَ يَا ابْنَ أَخِي بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ إِيمَانٍ بِاللَّهِ وَرَسُولِهِ، وَالصَّلاَةِ الْخَمْسِ، وَصِيَامِ رَمَضَانَ، وَأَدَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ‏.‏ قَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا‏}‏ ‏{‏إِلَى أَمْرِ اللَّهِ‏}‏ ‏{‏قَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏ قَالَ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ، وَإِمَّا يُعَذِّبُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏.‏       قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ قَالَ أَمَّا عُثْمَانُ فَكَأَنَّ اللَّهَ عَفَا عَنْهُ، وَأَمَّا أَنْتُمْ فَكَرِهْتُمْ أَنْ تَعْفُوا عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ فَقَالَ هَذَا بَيْتُهُ حَيْثُ تَرَوْنَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4513, 4514, 4515In-book reference : Book 65, Hadith 40USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 40   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4516,
    "id": 4516,
    "url": "https://sunnah.com/bukhari:4516",
    "bookNumber": 65,
    "hadithNumber": 41,
    "narrator": "Narrated Abu Wail:",
    "english": "Hudhaifa said, \"The Verse:-- \n\"And spend (of your wealth) in the Cause of Allah and do not throw yourselves in destruction,\" \n(2.195) was revealed concerning spending in Allah's Cause (i.e. Jihad).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، عَنْ حُذَيْفَةَ، ‏{‏وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلاَ تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ‏}‏ قَالَ نَزَلَتْ فِي النَّفَقَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4516In-book reference : Book 65, Hadith 41USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 41   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4517,
    "id": 4517,
    "url": "https://sunnah.com/bukhari:4517",
    "bookNumber": 65,
    "hadithNumber": 42,
    "narrator": "Narrated `Abdullah bin Maqal:",
    "english": "I sat with Ka`b bin Ujra in this mosque, i.e. Kufa Mosque, and asked him about the meaning of: \"Pay \na ransom (i.e. Fidya) of either fasting or . . . . (2.196)\" He said, \"I was taken to the Prophet (ﷺ) while lice \nwere falling on my face. The Prophet (ﷺ) said, 'I did not think that your trouble reached to such an extent. \nCan you afford to slaughter a sheep (as a ransom for shaving your head)?' I said, 'No.' He said, 'Then \nfast for three days, or feed six poor persons by giving half a Sa of food for each and shave your head.' \nSo the above Verse was revealed especially for me and generally for all of you.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ، قَالَ قَعَدْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ فِي هَذَا الْمَسْجِدِ ـ يَعْنِي مَسْجِدَ الْكُوفَةِ ـ فَسَأَلْتُهُ عَنْ فِدْيَةٌ مِنْ صِيَامٍ فَقَالَ حُمِلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ مَا كُنْتُ أُرَى أَنَّ الْجَهْدَ قَدْ بَلَغَ بِكَ هَذَا، أَمَا تَجِدُ شَاةً ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ مِنْ طَعَامٍ، وَاحْلِقْ رَأْسَكَ ‏\"‏‏.‏ فَنَزَلَتْ فِيَّ خَاصَّةً وَهْىَ لَكُمْ عَامَّةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4517In-book reference : Book 65, Hadith 42USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 42   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4518,
    "id": 4518,
    "url": "https://sunnah.com/bukhari:4518",
    "bookNumber": 65,
    "hadithNumber": 43,
    "narrator": "Narrated `Imran bin Husain:",
    "english": "The Verse of Hajj-at-Tamatu was revealed in Allah's Book, so we performed it with Allah's Messenger (ﷺ), \nand nothing was revealed in Qur'an to make it illegal, nor did the Prophet (ﷺ) prohibit it till he died. But \nthe man (who regarded it illegal) just expressed what his own mind suggested.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عِمْرَانَ أَبِي بَكْرٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ قَالَ أُنْزِلَتْ آيَةُ الْمُتْعَةِ فِي كِتَابِ اللَّهِ فَفَعَلْنَاهَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلَمْ يُنْزَلْ قُرْآنٌ يُحَرِّمُهُ، وَلَمْ يَنْهَ عَنْهَا حَتَّى مَاتَ قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4518In-book reference : Book 65, Hadith 43USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 43   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4519,
    "id": 4519,
    "url": "https://sunnah.com/bukhari:4519",
    "bookNumber": 65,
    "hadithNumber": 44,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "`Ukaz, Mijanna and Dhul-Majaz were markets during the Pre-islamic Period. They (i.e. Muslims) \nconsidered it a sin to trade there during the Hajj time (i.e. season), so this Verse was revealed:-- \n\"There is no harm for you if you seek of the Bounty of your Lord during the Hajj season.\" (2.198)",
    "arabic": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَتْ عُكَاظٌ وَمَجَنَّةُ وَذُو الْمَجَازِ أَسْوَاقًا فِي الْجَاهِلِيَّةِ فَتَأَثَّمُوا أَنْ يَتَّجِرُوا فِي الْمَوَاسِمِ فَنَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ‏}‏ فِي مَوَاسِمِ الْحَجِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4519In-book reference : Book 65, Hadith 44USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 44   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4520,
    "id": 4520,
    "url": "https://sunnah.com/bukhari:4520",
    "bookNumber": 65,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "The Quraish people and those who embraced their religion, used to stay at Muzdalifa and used to call \nthemselves Al-Hums, while the rest of the Arabs used to stay at `Arafat. When Islam came, Allah \nordered His Prophet to go to `Arafat and stay at it, and then pass on from there, and that is what is \nmeant by the Statement of Allah:--\"Then depart from the place whence all the people depart......\" \n(2.199)",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَتْ قُرَيْشٌ وَمَنْ دَانَ دِينَهَا يَقِفُونَ بِالْمُزْدَلِفَةِ، وَكَانُوا يُسَمَّوْنَ الْحُمْسَ، وَكَانَ سَائِرُ الْعَرَبِ يَقِفُونَ بِعَرَفَاتٍ، فَلَمَّا جَاءَ الإِسْلاَمُ أَمَرَ اللَّهُ نَبِيَّهُ صلى الله عليه وسلم أَنْ يَأْتِيَ عَرَفَاتٍ، ثُمَّ يَقِفَ بِهَا ثُمَّ يُفِيضَ مِنْهَا، فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4520In-book reference : Book 65, Hadith 45USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 45   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4521,
    "id": 4521,
    "url": "https://sunnah.com/bukhari:4521",
    "bookNumber": 65,
    "hadithNumber": 46,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "A man who wants to perform the Hajj (from Mecca) can perform the Tawaf around the Ka`ba as long \nas he is not in the state of Ihram till he assumes the Ihram for Hajj. Then, if he rides and proceeds to \n`Arafat, he should take a Hadi (i.e. animal for sacrifice), either a camel or a cow or a sheep, whatever \nhe can afford; but if he cannot afford it, he should fast for three days during the Hajj before the day of \n`Arafat, but if the third day of his fasting happens to be the day of `Arafat (i.e. 9th of Dhul-Hijja) then \nit is no sin for him (to fast on it). Then he should proceed to `Arafat and stay there from the time of the \n`Asr prayer till darkness falls. Then the pilgrims should proceed from `Arafat, and when they have \ndeparted from it, they reach Jam' (i.e. Al-Muzdalifa) where they ask Allah to help them to be \nrighteous and dutiful to Him, and there they remember Allah greatly or say Takbir (i.e. Allah is \nGreater) and Tahlil (i.e. None has the right to be worshipped but Allah) repeatedly before dawn \nbreaks. Then, after offering the morning (Fajr) prayer you should pass on (to Mina) for the people \nused to do so and Allah said:-- \n\"Then depart from the place whence all the people depart. And ask for Allah's Forgiveness. Truly! \nAllah is Oft-Forgiving, Most Merciful.\" (2.199) Then you should go on doing so till you throw \npebbles over the Jamra.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي كُرَيْبٌ، عَنِ ابْنِ عَبَّاسٍ، قَالَ يَطَوَّفُ الرَّجُلُ بِالْبَيْتِ مَا كَانَ حَلاَلاً حَتَّى يُهِلَّ بِالْحَجِّ، فَإِذَا رَكِبَ إِلَى عَرَفَةَ فَمَنْ تَيَسَّرَ لَهُ هَدِيَّةٌ مِنَ الإِبِلِ أَوِ الْبَقَرِ أَوِ الْغَنَمِ، مَا تَيَسَّرَ لَهُ مِنْ ذَلِكَ أَىَّ ذَلِكَ شَاءَ، غَيْرَ إِنْ لَمْ يَتَيَسَّرْ لَهُ فَعَلَيْهِ ثَلاَثَةُ أَيَّامٍ فِي الْحَجِّ، وَذَلِكَ قَبْلَ يَوْمِ عَرَفَةَ، فَإِنْ كَانَ آخِرُ يَوْمٍ مِنَ الأَيَّامِ الثَّلاَثَةِ يَوْمَ عَرَفَةَ فَلاَ جُنَاحَ عَلَيْهِ، ثُمَّ لِيَنْطَلِقْ حَتَّى يَقِفَ بِعَرَفَاتٍ مِنْ صَلاَةِ الْعَصْرِ إِلَى أَنْ يَكُونَ الظَّلاَمُ، ثُمَّ لِيَدْفَعُوا مِنْ عَرَفَاتٍ إِذَا أَفَاضُوا مِنْهَا حَتَّى يَبْلُغُوا جَمْعًا الَّذِي يُتَبَرَّرُ فِيهِ، ثُمَّ لِيَذْكُرُوا اللَّهَ كَثِيرًا، أَوْ أَكْثِرُوا التَّكْبِيرَ وَالتَّهْلِيلَ قَبْلَ أَنْ تُصْبِحُوا ثُمَّ أَفِيضُوا، فَإِنَّ النَّاسَ كَانُوا يُفِيضُونَ، وَقَالَ اللَّهُ تَعَالَى ‏{‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ‏}‏ حَتَّى تَرْمُوا الْجَمْرَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4521In-book reference : Book 65, Hadith 46USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 46   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4522,
    "id": 4522,
    "url": "https://sunnah.com/bukhari:4522",
    "bookNumber": 65,
    "hadithNumber": 47,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) used to say, \"O Allah! Our Lord! Give us in this world that, which is good and in the \nHereafter that, which is good and save us from the torment of the Fire.\" (2.201)",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4522In-book reference : Book 65, Hadith 47USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 47   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4523,
    "id": 4523,
    "url": "https://sunnah.com/bukhari:4523",
    "bookNumber": 65,
    "hadithNumber": 48,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) said, \"The most hated man in the Sight of Allah is the one who is the most quarrelsome.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، تَرْفَعُهُ قَالَ ‏\n\"‏ أَبْغَضُ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ ‏\"‏‏.‏       \nوَقَالَ عَبْدُ اللَّهِ حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي ابْنُ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4523In-book reference : Book 65, Hadith 48USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 48   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4524,
    "id": 4524,
    "url": "https://sunnah.com/bukhari:4524",
    "bookNumber": 65,
    "hadithNumber": 49,
    "narrator": "Narrated Ibn Abu Mulaika:",
    "english": "Ibn `Abbas recited: \"(Respite will be granted) until when the Apostles gave up hope (of their people) \nand thought that they were denied (by their people). There came to them Our Help ....\" (12.110) \nreading Kudhibu without doubling the sound 'dh', and that was what he understood of the Verse. Then \nhe went on reciting: \"..even the Apostle and those who believed along with him said: When (will \ncome) Allah's Help? Yes, verily, Allah's Help is near.\" (2.214) \nThen I met `Urwa bin Az-Zubair and I mentioned that to him. He said, \"Aisha said, 'Allah forbid! By \nAllah, Allah never promised His Apostle anything but he knew that it would certainly happen before \nhe died. But trials were continuously presented before the Apostles till they were afraid that their \nfollowers would accuse them of telling lies. So I used to recite:-- \n\"Till they (come to) think that they were treated as liars.\" reading 'Kudh-dhibu with double 'dh.'",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِبُوا‏}‏ خَفِيفَةً، ذَهَبَ بِهَا هُنَاكَ، وَتَلاَ ‏{‏حَتَّى يَقُولَ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ مَتَى نَصْرُ اللَّهِ أَلاَ إِنَّ نَصْرَ اللَّهِ قَرِيبٌ‏}‏      فَلَقِيتُ عُرْوَةَ بْنَ الزُّبَيْرِ فَذَكَرْتُ لَهُ ذَلِكَ فَقَالَ قَالَتْ عَائِشَةُ مَعَاذَ اللَّهِ، وَاللَّهِ مَا وَعَدَ اللَّهُ رَسُولَهُ مِنْ شَىْءٍ قَطُّ إِلاَّ عَلِمَ أَنَّهُ كَائِنٌ قَبْلَ أَنْ يَمُوتَ، وَلَكِنْ لَمْ يَزَلِ الْبَلاَءُ بِالرُّسُلِ حَتَّى خَافُوا أَنْ يَكُونَ مَنْ مَعَهُمْ يُكَذِّبُونَهُمْ، فَكَانَتْ تَقْرَؤُهَا ‏{‏وَظَنُّوا أَنَّهُمْ قَدْ كُذِّبُوا‏}‏ مُثَقَّلَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4524, 4525In-book reference : Book 65, Hadith 49USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4525,
    "id": 4525,
    "url": "https://sunnah.com/bukhari:4525",
    "bookNumber": 65,
    "hadithNumber": 49,
    "narrator": "Narrated Ibn Abu Mulaika:",
    "english": "Ibn `Abbas recited: \"(Respite will be granted) until when the Apostles gave up hope (of their people) \nand thought that they were denied (by their people). There came to them Our Help ....\" (12.110) \nreading Kudhibu without doubling the sound 'dh', and that was what he understood of the Verse. Then \nhe went on reciting: \"..even the Apostle and those who believed along with him said: When (will \ncome) Allah's Help? Yes, verily, Allah's Help is near.\" (2.214) \nThen I met `Urwa bin Az-Zubair and I mentioned that to him. He said, \"Aisha said, 'Allah forbid! By \nAllah, Allah never promised His Apostle anything but he knew that it would certainly happen before \nhe died. But trials were continuously presented before the Apostles till they were afraid that their \nfollowers would accuse them of telling lies. So I used to recite:-- \n\"Till they (come to) think that they were treated as liars.\" reading 'Kudh-dhibu with double 'dh.'",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِبُوا‏}‏ خَفِيفَةً، ذَهَبَ بِهَا هُنَاكَ، وَتَلاَ ‏{‏حَتَّى يَقُولَ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ مَتَى نَصْرُ اللَّهِ أَلاَ إِنَّ نَصْرَ اللَّهِ قَرِيبٌ‏}‏      فَلَقِيتُ عُرْوَةَ بْنَ الزُّبَيْرِ فَذَكَرْتُ لَهُ ذَلِكَ فَقَالَ قَالَتْ عَائِشَةُ مَعَاذَ اللَّهِ، وَاللَّهِ مَا وَعَدَ اللَّهُ رَسُولَهُ مِنْ شَىْءٍ قَطُّ إِلاَّ عَلِمَ أَنَّهُ كَائِنٌ قَبْلَ أَنْ يَمُوتَ، وَلَكِنْ لَمْ يَزَلِ الْبَلاَءُ بِالرُّسُلِ حَتَّى خَافُوا أَنْ يَكُونَ مَنْ مَعَهُمْ يُكَذِّبُونَهُمْ، فَكَانَتْ تَقْرَؤُهَا ‏{‏وَظَنُّوا أَنَّهُمْ قَدْ كُذِّبُوا‏}‏ مُثَقَّلَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4524, 4525In-book reference : Book 65, Hadith 49USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 49   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4526,
    "id": 4526,
    "url": "https://sunnah.com/bukhari:4526",
    "bookNumber": 65,
    "hadithNumber": 50,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever Ibn `Umar recited the Qur'an, he would not speak to anyone till he had finished his \nrecitation. Once I held the Qur'an and he recited Surat-al-Baqara from his memory and then stopped at \na certain Verse and said, \"Do you know in what connection this Verse was revealed? \" I replied, \"No.\" \nHe said, \"It was revealed in such-and-such connection.\" Ibn `Umar then resumed his recitation. Nafi` \nadded regarding the Verse:--\"So go to your tilth when or how you will\" Ibn `Umar said, \"It means one \nshould approach his wife in ..\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا قَرَأَ الْقُرْآنَ لَمْ يَتَكَلَّمْ حَتَّى يَفْرُغَ مِنْهُ، فَأَخَذْتُ عَلَيْهِ يَوْمًا، فَقَرَأَ سُورَةَ الْبَقَرَةِ حَتَّى انْتَهَى إِلَى مَكَانٍ قَالَ تَدْرِي فِيمَا أُنْزِلَتْ‏.‏ قُلْتُ لاَ‏.‏ قَالَ أُنْزِلَتْ فِي كَذَا وَكَذَا‏.‏ ثُمَّ مَضَى‏.‏       وَعَنْ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنِي أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ‏{‏فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏ قَالَ يَأْتِيهَا فِي‏.‏ رَوَاهُ مُحَمَّدُ بْنُ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4526, 4527In-book reference : Book 65, Hadith 50USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4527,
    "id": 4527,
    "url": "https://sunnah.com/bukhari:4527",
    "bookNumber": 65,
    "hadithNumber": 50,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever Ibn `Umar recited the Qur'an, he would not speak to anyone till he had finished his \nrecitation. Once I held the Qur'an and he recited Surat-al-Baqara from his memory and then stopped at \na certain Verse and said, \"Do you know in what connection this Verse was revealed? \" I replied, \"No.\" \nHe said, \"It was revealed in such-and-such connection.\" Ibn `Umar then resumed his recitation. Nafi` \nadded regarding the Verse:--\"So go to your tilth when or how you will\" Ibn `Umar said, \"It means one \nshould approach his wife in ..\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا قَرَأَ الْقُرْآنَ لَمْ يَتَكَلَّمْ حَتَّى يَفْرُغَ مِنْهُ، فَأَخَذْتُ عَلَيْهِ يَوْمًا، فَقَرَأَ سُورَةَ الْبَقَرَةِ حَتَّى انْتَهَى إِلَى مَكَانٍ قَالَ تَدْرِي فِيمَا أُنْزِلَتْ‏.‏ قُلْتُ لاَ‏.‏ قَالَ أُنْزِلَتْ فِي كَذَا وَكَذَا‏.‏ ثُمَّ مَضَى‏.‏       وَعَنْ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنِي أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ‏{‏فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏ قَالَ يَأْتِيهَا فِي‏.‏ رَوَاهُ مُحَمَّدُ بْنُ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4526, 4527In-book reference : Book 65, Hadith 50USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 50   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4528,
    "id": 4528,
    "url": "https://sunnah.com/bukhari:4528",
    "bookNumber": 65,
    "hadithNumber": 51,
    "narrator": "Narrated Jabir:",
    "english": "Jews used to say: \"If one has sexual intercourse with his wife from the back, then she will deliver a \nsquint-eyed child.\" So this Verse was revealed:-- \n\"Your wives are a tilth unto you; so go to your tilth when or how you will.\" (2.223)",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ كَانَتِ الْيَهُودُ تَقُولُ إِذَا جَامَعَهَا مِنْ وَرَائِهَا جَاءَ الْوَلَدُ أَحْوَلَ‏.‏ فَنَزَلَتْ ‏{‏نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4528In-book reference : Book 65, Hadith 51USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 51   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4529,
    "id": 4529,
    "url": "https://sunnah.com/bukhari:4529",
    "bookNumber": 65,
    "hadithNumber": 52,
    "narrator": "Narrated Al-Hasan:",
    "english": "The sister of Ma'qal bin Yasar was divorced by her husband who left her till she had fulfilled her term \nof 'Iddat (i.e. the period which should elapse before she can Remarry) and then he wanted to remarry \nher but Maqal refused, so this Verse was revealed:-- \n\"Do not prevent them from marrying their (former) husbands.\" (2.232)",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ، حَدَّثَنَا الْحَسَنُ، قَالَ حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ، قَالَ كَانَتْ لِي أُخْتٌ تُخْطَبُ إِلَىَّ‏.‏ وَقَالَ إِبْرَاهِيمُ عَنْ يُونُسَ، عَنِ الْحَسَنِ، حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ،‏.‏ حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، أَنَّ أُخْتَ، مَعْقِلِ بْنِ يَسَارٍ طَلَّقَهَا زَوْجُهَا، فَتَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا، فَخَطَبَهَا فَأَبَى مَعْقِلٌ، فَنَزَلَتْ ‏{‏فَلاَ تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ‏}‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4529In-book reference : Book 65, Hadith 52USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 52   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4530,
    "id": 4530,
    "url": "https://sunnah.com/bukhari:4530",
    "bookNumber": 65,
    "hadithNumber": 53,
    "narrator": "Narrated Ibn Az-Zubair:",
    "english": "I said to `Uthman bin `Affan (while he was collecting the Qur'an) regarding the Verse:-- \"Those of \nyou who die and leave wives ...\" (2.240) \"This Verse was abrogated by an other Verse. So why \nshould you write it? (Or leave it in the Qur'an)?\" `Uthman said. \"O son of my brother! I will not shift \nanything of it from its place.\"",
    "arabic": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ حَبِيبٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ ابْنُ الزُّبَيْرِ قُلْتُ لِعُثْمَانَ بْنِ عَفَّانَ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ قَالَ قَدْ نَسَخَتْهَا الآيَةُ الأُخْرَى فَلِمَ تَكْتُبُهَا أَوْ تَدَعُهَا قَالَ يَا ابْنَ أَخِي، لاَ أُغَيِّرُ شَيْئًا مِنْهُ مِنْ مَكَانِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4530In-book reference : Book 65, Hadith 53USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 53   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4531,
    "id": 4531,
    "url": "https://sunnah.com/bukhari:4531",
    "bookNumber": 65,
    "hadithNumber": 54,
    "narrator": "Narrated Mujahi:",
    "english": "(regarding the Verse):-- \"Those of you who die and leave wives behind. They - (their wives) -- shall \nwait (as regards their marriage ) for four months and ten days).\" (2.234) \nThe widow, according to this Verse, was to spend this period of waiting with her husband's family, so \nAllah revealed: \"Those of you who die and leave wives (i.e. widows) should bequeath for their wives, \na year's maintenance and residences without turning them out, but if they leave (their residence), there \nis no blame on you for what they do with themselves provided it is honorable.' (i.e. lawful marriage) \n(2.240). \nSo Allah entitled the widow to be bequeathed extra maintenance for seven months and twenty nights, \nand that is the completion of one year. If she wished she could stay (in her husband's home) according \nto the will, and she could leave it if she wished, as Allah says: \n\"..without turning them out, but if they leave (the residence), there is no blame on you.\" So the 'Idda \n(i.e. four months and ten days as it) is obligatory for her. \n'Ata said: Ibn `Abbas said, \"This Verse, i.e. the Statement of Allah: \"..without turning them out..\" \ncancelled the obligation of staying for the waiting period in her dead husband's house, and she can \ncomplete this period wherever she likes.\" 'Ata's aid: If she wished, she could complete her 'Idda by \nstaying in her dead husband's residence according to the will or leave it according to Allah's \nStatement:-- \n\"There is no blame on you for what they do with themselves.\" `Ata' added: Later the regulations of \ninheritance came and abrogated the order of the dwelling of the widow (in her dead husband's house), \nso she could complete the 'Idda wherever she likes. And it was no longer necessary to provide her \nwith a residence. Ibn `Abbas said, \"This Verse abrogated her (i.e. widow's) dwelling in her dead \nhusband's house and she could complete the 'Idda (i.e. four months and ten days) wherever she liked, \nas Allah's Statement says:--\"...without turning them out...\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ قَالَ كَانَتْ هَذِهِ الْعِدَّةُ تَعْتَدُّ عِنْدَ أَهْلِ زَوْجِهَا وَاجِبٌ، فَأَنْزَلَ اللَّهُ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ مِنْ مَعْرُوفٍ‏}‏ قَالَ جَعَلَ اللَّهُ لَهَا تَمَامَ السَّنَةِ سَبْعَةَ أَشْهُرٍ وَعِشْرِينَ لَيْلَةً وَصِيَّةً، إِنْ شَاءَتْ سَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ، وَهْوَ قَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ‏}‏ فَالْعِدَّةُ كَمَا هِيَ وَاجِبٌ عَلَيْهَا‏.‏ زَعَمَ ذَلِكَ عَنْ مُجَاهِدٍ‏.‏ وَقَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ نَسَخَتْ هَذِهِ الآيَةُ عِدَّتَهَا عِنْدَ أَهْلِهَا، فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَهْوَ قَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ‏}‏‏.‏ قَالَ عَطَاءٌ إِنْ شَاءَتِ اعْتَدَّتْ عِنْدَ أَهْلِهِ وَسَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ لِقَوْلِ اللَّهِ تَعَالَى ‏{‏فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ‏}‏‏.‏ قَالَ عَطَاءٌ ثُمَّ جَاءَ الْمِيرَاثُ فَنَسَخَ السُّكْنَى فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَلاَ سُكْنَى لَهَا‏.‏ وَعَنْ مُحَمَّدِ بْنِ يُوسُفَ حَدَّثَنَا وَرْقَاءُ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ بِهَذَا‏.‏ وَعَنِ ابْنِ أَبِي نَجِيحٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ قَالَ نَسَخَتْ هَذِهِ الآيَةُ عِدَّتَهَا فِي أَهْلِهَا، فَتَعْتَدُّ حَيْثُ شَاءَتْ لِقَوْلِ اللَّهِ ‏{‏غَيْرَ إِخْرَاجٍ‏}‏ نَحْوَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4531In-book reference : Book 65, Hadith 54USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 54   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4532,
    "id": 4532,
    "url": "https://sunnah.com/bukhari:4532",
    "bookNumber": 65,
    "hadithNumber": 55,
    "narrator": "Narrated Muhammad bin Seereen:",
    "english": "I sat in a gathering in which the chiefs of the Ansar were present, and `Abdur-Rahman bin Abu Laila \nwas amongst them. I mentioned the narration of `Abdullah bin `Utba regarding the question of Subai'a \nbint Al-Harith. `Abdur-Rahman said, \"But `Abdullah's uncle used not to say so.\" I said, \"I am too \nbrave if I tell a lie concerning a person who is now in Al-Kufa,\" and I raised my voice. Then I went \nout and met Malik bin 'Amir or Malik bin `Auf, and said, \"What was the verdict of Ibn Mas`ud about \nthe pregnant widow whose husband had died?\" He replied, \"Ibn Mas`ud said, 'Why do you impose on \nher the hard order and don't let her make use of the leave? The shorter Sura of women (i.e. Surat-at- \nTalaq) was revealed after the longer Sura (i.e. Surat-al-Baqara).\" (i.e. Her 'Idda is up till she delivers.)",
    "arabic": "حَدَّثَنَا حِبَّانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ جَلَسْتُ إِلَى مَجْلِسٍ فِيهِ عُظْمٌ مِنَ الأَنْصَارِ وَفِيهِمْ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، فَذَكَرْتُ حَدِيثَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ فِي شَأْنِ سُبَيْعَةَ بِنْتِ الْحَارِثِ، فَقَالَ عَبْدُ الرَّحْمَنِ وَلَكِنَّ عَمَّهُ كَانَ لاَ يَقُولُ ذَلِكَ‏.‏ فَقُلْتُ إِنِّي لَجَرِيءٌ إِنْ كَذَبْتُ عَلَى رَجُلٍ فِي جَانِبِ الْكُوفَةِ‏.‏ وَرَفَعَ صَوْتَهُ، قَالَ ثُمَّ خَرَجْتُ فَلَقِيتُ مَالِكَ بْنَ عَامِرٍ أَوْ مَالِكَ بْنَ عَوْفٍ قُلْتُ كَيْفَ كَانَ قَوْلُ ابْنِ مَسْعُودٍ فِي الْمُتَوَفَّى عَنْهَا زَوْجُهَا وَهْىَ حَامِلٌ فَقَالَ قَالَ ابْنُ مَسْعُودٍ أَتَجْعَلُونَ عَلَيْهَا التَّغْلِيظَ، وَلاَ تَجْعَلُونَ لَهَا الرُّخْصَةَ لَنَزَلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ الطُّولَى‏.‏ وَقَالَ أَيُّوبُ عَنْ مُحَمَّدٍ لَقِيتُ أَبَا عَطِيَّةَ مَالِكَ بْنَ عَامِرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4532In-book reference : Book 65, Hadith 55USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 55   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4533,
    "id": 4533,
    "url": "https://sunnah.com/bukhari:4533",
    "bookNumber": 65,
    "hadithNumber": 56,
    "narrator": "Narrated `Ali (through two chains):",
    "english": "On the day of Al-Khandaq (the battle of the Trench). the Prophet (ﷺ) said, \"They (i.e. pagans prevented us \nfrom offering the middle (the Best) Prayer till the sun had set. May Allah fill their graves, their houses \n(or their bodies) with fire.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ، أَخْبَرَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ هِشَامٌ حَدَّثَنَا قَالَ حَدَّثَنَا مُحَمَّدٌ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ يَوْمَ الْخَنْدَقِ ‏\n\"‏ حَبَسُونَا عَنْ صَلاَةِ الْوُسْطَى حَتَّى غَابَتِ الشَّمْسُ مَلأَ اللَّهُ قُبُورَهُمْ وَبُيُوتَهُمْ أَوْ أَجْوَافَهُمْ ـ شَكَّ يَحْيَى ـ نَارًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4533In-book reference : Book 65, Hadith 56USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 57   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4534,
    "id": 4534,
    "url": "https://sunnah.com/bukhari:4534",
    "bookNumber": 65,
    "hadithNumber": 57,
    "narrator": "Narrated Zaid bin Arqam:",
    "english": "We used to speak while in prayer. One of us used to speak to his brother (while in prayer) about his \nneed, till the Verse was revealed:-- \n\"Guard strictly the (five obligatory) prayers, especially the middle (the Best) (`Asr) Prayer and stand \nbefore Allah with obedience (and not to speak to others during the prayers).\" Then we were ordered \nnot to speak in the prayers.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الْحَارِثِ بْنِ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كُنَّا نَتَكَلَّمُ فِي الصَّلاَةِ يُكَلِّمُ أَحَدُنَا أَخَاهُ فِي حَاجَتِهِ حَتَّى نَزَلَتْ هَذِهِ الآيَةُ ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ‏}‏ فَأُمِرْنَا بِالسُّكُوتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4534In-book reference : Book 65, Hadith 57USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 58   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4535,
    "id": 4535,
    "url": "https://sunnah.com/bukhari:4535",
    "bookNumber": 65,
    "hadithNumber": 58,
    "narrator": "Narrated Nafi`:",
    "english": "Whenever `Abdullah bin `Umar was asked about Salat-al-Khauf (i.e. prayer of fear) he said, \"The \nImam comes forward with a group of people and leads them in a one rak`a prayer while another group \nfrom them who has not prayed yet, stay between the praying group and the enemy. When those who \nare with the Imam have finished their one rak`a, they retreat and take the positions of those who have \nnot prayed but they will not finish their prayers with Taslim. Those who have not prayed, come \nforward to offer a rak`a with the Imam (while the first group covers them from the enemy). Then the \nImam, having offered two rak`at, finishes his prayer. Then each member of the two groups offer the \nsecond rak`a alone after the Imam has finished his prayer. Thus each one of the two groups will have \noffered two rak`at. But if the fear is too great, they can pray standing on their feet or riding on their \nmounts, facing the Qibla or not.\" Nafi` added: I do not think that `Abdullah bin `Umar narrated this \nexcept from Allah's Messenger (ﷺ) (See Hadith No. 451, Vol 5 to know exactly \"The Fear Prayer.\")",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ إِذَا سُئِلَ عَنْ صَلاَةِ الْخَوْفِ قَالَ يَتَقَدَّمُ الإِمَامُ وَطَائِفَةٌ مِنَ النَّاسِ فَيُصَلِّي بِهِمِ الإِمَامُ رَكْعَةً، وَتَكُونُ طَائِفَةٌ مِنْهُمْ بَيْنَهُمْ وَبَيْنَ الْعَدُوِّ لَمْ يُصَلُّوا، فَإِذَا صَلَّوُا الَّذِينَ مَعَهُ رَكْعَةً اسْتَأْخَرُوا مَكَانَ الَّذِينَ لَمْ يُصَلُّوا وَلاَ يُسَلِّمُونَ، وَيَتَقَدَّمُ الَّذِينَ لَمْ يُصَلُّوا فَيُصَلُّونَ مَعَهُ رَكْعَةً، ثُمَّ يَنْصَرِفُ الإِمَامُ وَقَدْ صَلَّى رَكْعَتَيْنِ، فَيَقُومُ كُلُّ وَاحِدٍ مِنَ الطَّائِفَتَيْنِ فَيُصَلُّونَ لأَنْفُسِهِمْ رَكْعَةً بَعْدَ أَنْ يَنْصَرِفَ الإِمَامُ، فَيَكُونُ كُلُّ وَاحِدٍ مِنَ الطَّائِفَتَيْنِ قَدْ صَلَّى رَكْعَتَيْنِ، فَإِنْ كَانَ خَوْفٌ هُوَ أَشَدَّ مِنْ ذَلِكَ صَلَّوْا رِجَالاً، قِيَامًا عَلَى أَقْدَامِهِمْ، أَوْ رُكْبَانًا مُسْتَقْبِلِي الْقِبْلَةِ أَوْ غَيْرَ مُسْتَقْبِلِيهَا‏.‏ قَالَ مَالِكٌ قَالَ نَافِعٌ لاَ أُرَى عَبْدَ اللَّهِ بْنَ عُمَرَ ذَكَرَ ذَلِكَ إِلاَّ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4535In-book reference : Book 65, Hadith 58USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 59   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4536,
    "id": 4536,
    "url": "https://sunnah.com/bukhari:4536",
    "bookNumber": 65,
    "hadithNumber": 59,
    "narrator": "Narrated Ibn Az-Zubair:",
    "english": "I said to `Uthman, \"This Verse which is in Surat-al-Baqara: \n\"Those of you who die and leave widows behind...without turning them out.\" has been abrogated by \nanother Verse. Why then do you write it (in the Qur'an)?\" `Uthman said. \"Leave it (where it is), O the \nson of my brother, for I will not shift anything of it (i.e. the Qur'an) from its original position.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا حُمَيْدُ بْنُ الأَسْوَدِ، وَيَزِيدُ بْنُ زُرَيْعٍ، قَالاَ حَدَّثَنَا حَبِيبُ بْنُ الشَّهِيدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قَالَ ابْنُ الزُّبَيْرِ قُلْتُ لِعُثْمَانَ هَذِهِ الآيَةُ الَّتِي فِي الْبَقَرَةِ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ إِلَى قَوْلِهِ ‏{‏غَيْرَ إِخْرَاجٍ‏}‏ قَدْ نَسَخَتْهَا الأُخْرَى، فَلِمَ تَكْتُبُهَا قَالَ تَدَعُهَا‏.‏ يَا ابْنَ أَخِي لاَ أُغَيِّرُ شَيْئًا مِنْهُ مِنْ مَكَانِهِ‏.‏ قَالَ حُمَيْدٌ أَوْ نَحْوَ هَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4536In-book reference : Book 65, Hadith 59USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 60   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4537,
    "id": 4537,
    "url": "https://sunnah.com/bukhari:4537",
    "bookNumber": 65,
    "hadithNumber": 60,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"We have more right to be in doubt than Abraham when he said, 'My Lord! \nShow me how You give life to the dead.' He said, 'Do you not believe?' He said, 'Yes (I believe) but to \nbe stronger in Faith.' \"(2.260)",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَحْنُ أَحَقُّ بِالشَّكِّ مِنْ إِبْرَاهِيمَ إِذْ قَالَ ‏{‏رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4537In-book reference : Book 65, Hadith 60USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 61   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4538,
    "id": 4538,
    "url": "https://sunnah.com/bukhari:4538",
    "bookNumber": 65,
    "hadithNumber": 61,
    "narrator": "Narrated Ubaid bin Umair:",
    "english": "Once `Umar (bin Al-Khattab) said to the companions of the Prophet (ﷺ) \"What do you think about this \nVerse:--\"Does any of you wish that he should have a garden?\" They replied, \"Allah knows best.\" \n`Umar became angry and said, \"Either say that you know or say that you do not know!\" On that Ibn \n`Abbas said, \"O chief of the believers! I have something in my mind to say about it.\" `Umar said, \"O \nson of my brother! Say, and do not under estimate yourself.\" Ibn `Abbas said, \"This Verse has been \nset up as an example for deeds.\" `Umar said, \"What kind of deeds?\" Ibn `Abbas said, \"For deeds.\" \n`Umar said, \"This is an example for a rich man who does goods out of obedience of Allah and then \nAllah sends him Satan whereupon he commits sins till all his good deeds are lost.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي مُلَيْكَةَ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ،‏.‏ قَالَ وَسَمِعْتُ أَخَاهُ أَبَا بَكْرِ بْنَ أَبِي مُلَيْكَةَ، يُحَدِّثُ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ يَوْمًا لأَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِيمَ تَرَوْنَ هَذِهِ الآيَةَ نَزَلَتْ ‏{‏أَيَوَدُّ أَحَدُكُمْ أَنْ تَكُونَ لَهُ جَنَّةٌ‏}‏ قَالُوا اللَّهُ أَعْلَمُ‏.‏ فَغَضِبَ عُمَرُ فَقَالَ قُولُوا نَعْلَمُ أَوْ لاَ نَعْلَمُ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ فِي نَفْسِي مِنْهَا شَىْءٌ يَا أَمِيرَ الْمُؤْمِنِينَ‏.‏ قَالَ عُمَرُ يَا ابْنَ أَخِي قُلْ وَلاَ تَحْقِرْ نَفْسَكَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ضُرِبَتْ مَثَلاً لِعَمَلٍ‏.‏ قَالَ عُمَرُ أَىُّ عَمَلٍ قَالَ ابْنُ عَبَّاسٍ لِعَمَلٍ‏.‏ قَالَ عُمَرُ لِرَجُلٍ غَنِيٍّ يَعْمَلُ بِطَاعَةِ اللَّهِ عَزَّ وَجَلَّ، ثُمَّ بَعَثَ اللَّهُ لَهُ الشَّيْطَانَ فَعَمِلَ بِالْمَعَاصِي حَتَّى أَغْرَقَ أَعْمَالَهُ‏.‏ ‏{‏فَصُرْهُنَّ‏}‏ قَطِّعْهُنَّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4538In-book reference : Book 65, Hadith 61USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 62   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4539,
    "id": 4539,
    "url": "https://sunnah.com/bukhari:4539",
    "bookNumber": 65,
    "hadithNumber": 62,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The poor person is not the one for whom a date or two or a morsel or two (of food \nis sufficient but the poor person is he who does not (beg or) ask the people (for something) or show \nhis poverty at all. Recite if you wish, (Allah's Statement): \n\"They do not beg of people at all.\" (2.273)",
    "arabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي شَرِيكُ بْنُ أَبِي نَمِرٍ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، وَعَبْدَ الرَّحْمَنِ بْنَ أَبِي عَمْرَةَ الأَنْصَارِيَّ، قَالاَ سَمِعْنَا أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ التَّمْرَةُ وَالتَّمْرَتَانِ وَلاَ اللُّقْمَةُ وَلاَ اللُّقْمَتَانِ‏.‏ إِنَّمَا الْمِسْكِينُ الَّذِي يَتَعَفَّفُ وَاقْرَءُوا إِنْ شِئْتُمْ يَعْنِي قَوْلَهُ ‏{‏لاَ يَسْأَلُونَ النَّاسَ إِلْحَافًا‏}‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4539In-book reference : Book 65, Hadith 62USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 63   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4540,
    "id": 4540,
    "url": "https://sunnah.com/bukhari:4540",
    "bookNumber": 65,
    "hadithNumber": 63,
    "narrator": "Narrated `Aisha:",
    "english": "When the Verses of Surat-al-Baqara regarding usury (i.e. Riba) were revealed, Allah's Messenger (ﷺ) recited \nthem before the people and then he prohibited the trade of alcoholic liquors.",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا نَزَلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا قَرَأَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّاسِ، ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4540In-book reference : Book 65, Hadith 63USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 64   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4541,
    "id": 4541,
    "url": "https://sunnah.com/bukhari:4541",
    "bookNumber": 65,
    "hadithNumber": 64,
    "narrator": "Narrated `Aisha:",
    "english": "When the last Verses of Surat-al-Baqara were revealed. Allah's Messenger (ﷺ) went out and recited them in \nthe Mosque and prohibited the trade of alcoholic liquors.",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ أَبَا الضُّحَى، يُحَدِّثُ عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لَمَّا أُنْزِلَتِ الآيَاتُ الأَوَاخِرُ مِنْ سُورَةِ الْبَقَرَةِ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَلاَهُنَّ فِي الْمَسْجِدِ، فَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4541In-book reference : Book 65, Hadith 64USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 65   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4542,
    "id": 4542,
    "url": "https://sunnah.com/bukhari:4542",
    "bookNumber": 65,
    "hadithNumber": 65,
    "narrator": "Narrated `Aisha:",
    "english": "When the last Verses of Surat-al-Baqara were revealed, the Prophet (ﷺ) read them in the Mosque and \nprohibited the trade of alcoholic liquors.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أُنْزِلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ قَرَأَهُنَّ النَّبِيُّ صلى الله عليه وسلم فِي الْمَسْجِدِ، وَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4542In-book reference : Book 65, Hadith 65USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4543,
    "id": 4543,
    "url": "https://sunnah.com/bukhari:4543",
    "bookNumber": 65,
    "hadithNumber": 66,
    "narrator": "Narrated `Aisha:",
    "english": "When the last Verses of Surat-al-Baqara were revealed, Allah's Messenger (ﷺ) stood up and \nrecited them before us and then prohibited the trade of alcoholic liquors.",
    "arabic": "وَقَالَ لَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أُنْزِلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَهُنَّ عَلَيْنَا، ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4543In-book reference : Book 65, Hadith 66USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 66   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4544,
    "id": 4544,
    "url": "https://sunnah.com/bukhari:4544",
    "bookNumber": 65,
    "hadithNumber": 67,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The last Verse (in the Qur'an) revealed to the Prophet (ﷺ) was the Verse dealing with usury (i.e. Riba).",
    "arabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ آخِرُ آيَةٍ نَزَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم آيَةُ الرِّبَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4544In-book reference : Book 65, Hadith 67USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 67   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4545,
    "id": 4545,
    "url": "https://sunnah.com/bukhari:4545",
    "bookNumber": 65,
    "hadithNumber": 68,
    "narrator": "Narrated Ibn `Umar:",
    "english": "This Verse:--\"Whether you show what is in your minds or conceal it..\" (2.284) was abrogated.",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مِسْكِينٌ، عَنْ شُعْبَةَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ مَرْوَانَ الأَصْفَرِ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَهْوَ ابْنُ عُمَرَ أَنَّهَا قَدْ نُسِخَتْ ‏{‏وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4545In-book reference : Book 65, Hadith 68USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 68   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4546,
    "id": 4546,
    "url": "https://sunnah.com/bukhari:4546",
    "bookNumber": 65,
    "hadithNumber": 69,
    "narrator": "Narrated Marwan Al-Asghar:",
    "english": "A man from the companions of Allah's Messenger (ﷺ) who I think, was Ibn `Umar said, \"The Verse:-- \n\"Whether you show what is in your minds or conceal it....\" was abrogated by the Verse following it.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، أَخْبَرَنَا شُعْبَةُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ مَرْوَانَ الأَصْفَرِ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم ـ قَالَ أَحْسِبُهُ ابْنَ عُمَرَ ـ ‏{‏إِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ‏}‏ قَالَ نَسَخَتْهَا الآيَةُ الَّتِي بَعْدَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4546In-book reference : Book 65, Hadith 69USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 69   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4547,
    "id": 4547,
    "url": "https://sunnah.com/bukhari:4547",
    "bookNumber": 65,
    "hadithNumber": 70,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) recited the Verse:-- \n\"It is He who has sent down to you the Book. In it are Verses that are entirely clear, they are the \nfoundation of the Book, others not entirely clear. So as for those in whose hearts there is a deviation \n(from the Truth ). follow thereof that is not entirely clear seeking affliction and searching for its \nhidden meanings; but no one knows its hidden meanings but Allah. And those who are firmly \ngrounded in knowledge say: \"We believe in it (i.e. in the Qur'an) the whole of it (i.e. its clear and \nunclear Verses) are from our Lord. And none receive admonition except men of understanding.\" (3.7) \nThen Allah's Messenger (ﷺ) said, \"If you see those who follow thereof that is not entirely clear, then they are \nthose whom Allah has named [as having deviation (from the Truth)] 'So beware of them.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التُّسْتَرِيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تَلاَ رَسُولُ اللَّهِ صلى الله عليه وسلم هَذِهِ الآيَةَ ‏{‏هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ‏}‏ إِلَى قَوْلِهِ ‏{‏أُولُو الأَلْبَابِ‏}‏ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِذَا رَأَيْتَ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ، فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ، فَاحْذَرُوهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4547In-book reference : Book 65, Hadith 70USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 70   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4548,
    "id": 4548,
    "url": "https://sunnah.com/bukhari:4548",
    "bookNumber": 65,
    "hadithNumber": 71,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "Abu Huraira said, \"The Prophet (ﷺ) said, 'No child is born but that, Satan touches it when it is born whereupon it starts crying loudly because of being touched by Satan, except Mary and her son.\" Abu Huraira then said, \"Recite, if you wish: \"And I seek Refuge with You (Allah) for her and her offspring from Satan, the outcast.\" (3.36)",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مَوْلُودٍ يُولَدُ إِلاَّ وَالشَّيْطَانُ يَمَسُّهُ حِينَ يُولَدُ، فَيَسْتَهِلُّ صَارِخًا مِنْ مَسِّ الشَّيْطَانِ إِيَّاهُ، إِلاَّ مَرْيَمَ وَابْنَهَا ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ وَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏وَإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطَانِ الرَّجِيمِ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4548In-book reference : Book 65, Hadith 71USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 71   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4549,
    "id": 4549,
    "url": "https://sunnah.com/bukhari:4549",
    "bookNumber": 65,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Wail:",
    "english": "`Abdullah bin Masud said, \"Allah's Messenger (ﷺ) said, 'Whoever takes an oath when asked to do so, in \nwhich he may deprive a Muslim of his property unlawfully, will meet Allah Who will be angry with \nhim.' So Allah revealed in confirmation of this statement:--\"Verily! Those who Purchase a small gain \nat the cost of Allah's Covenant and oaths, they shall have no portion in the Hereafter...\" (3.77) Then \nentered Al-Ash'ath bin Qais and said, \"What is Abu `Abdur-Rahman narrating to you?\" We replied, \n'So-and-so.\" Al-Ash'ath said, \"This Verse was revealed in my connection. I had a well in the land of \nmy cousin (and he denied my, possessing it). On that the Prophet (ﷺ) said to me, 'Either you bring forward \na proof or he (i.e. your cousin) takes an oath (to confirm his claim)' I said, 'I am sure he would take a \n(false) oath, O Allah's Messenger (ﷺ).' He said, 'If somebody takes an oath when asked to do so through \nwhich he may deprive a Muslim of his property (unlawfully) and he is a liar in his oath, he will meet \nAllah Who will be angry with him.' \"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ يَمِينَ صَبْرٍ لِيَقْتَطِعَ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً أُولَئِكَ لاَ خَلاَقَ لَهُمْ فِي الآخِرَةِ‏}‏ إِلَى آخِرِ الآيَةِ‏.‏       قَالَ فَدَخَلَ الأَشْعَثُ بْنُ قَيْسٍ وَقَالَ مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ قُلْنَا كَذَا وَكَذَا‏.‏ قَالَ فِيَّ أُنْزِلَتْ كَانَتْ لِي بِئْرٌ فِي أَرْضِ ابْنِ عَمٍّ لِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَيِّنَتُكَ أَوْ يَمِينُهُ ‏\"‏ فَقُلْتُ إِذًا يَحْلِفَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ وَهْوَ فِيهَا فَاجِرٌ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4549, 4550In-book reference : Book 65, Hadith 72USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4550,
    "id": 4550,
    "url": "https://sunnah.com/bukhari:4550",
    "bookNumber": 65,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Wail:",
    "english": "`Abdullah bin Masud said, \"Allah's Messenger (ﷺ) said, 'Whoever takes an oath when asked to do so, in \nwhich he may deprive a Muslim of his property unlawfully, will meet Allah Who will be angry with \nhim.' So Allah revealed in confirmation of this statement:--\"Verily! Those who Purchase a small gain \nat the cost of Allah's Covenant and oaths, they shall have no portion in the Hereafter...\" (3.77) Then \nentered Al-Ash'ath bin Qais and said, \"What is Abu `Abdur-Rahman narrating to you?\" We replied, \n'So-and-so.\" Al-Ash'ath said, \"This Verse was revealed in my connection. I had a well in the land of \nmy cousin (and he denied my, possessing it). On that the Prophet (ﷺ) said to me, 'Either you bring forward \na proof or he (i.e. your cousin) takes an oath (to confirm his claim)' I said, 'I am sure he would take a \n(false) oath, O Allah's Messenger (ﷺ).' He said, 'If somebody takes an oath when asked to do so through \nwhich he may deprive a Muslim of his property (unlawfully) and he is a liar in his oath, he will meet \nAllah Who will be angry with him.' \"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ يَمِينَ صَبْرٍ لِيَقْتَطِعَ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً أُولَئِكَ لاَ خَلاَقَ لَهُمْ فِي الآخِرَةِ‏}‏ إِلَى آخِرِ الآيَةِ‏.‏       قَالَ فَدَخَلَ الأَشْعَثُ بْنُ قَيْسٍ وَقَالَ مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ قُلْنَا كَذَا وَكَذَا‏.‏ قَالَ فِيَّ أُنْزِلَتْ كَانَتْ لِي بِئْرٌ فِي أَرْضِ ابْنِ عَمٍّ لِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَيِّنَتُكَ أَوْ يَمِينُهُ ‏\"‏ فَقُلْتُ إِذًا يَحْلِفَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ وَهْوَ فِيهَا فَاجِرٌ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4549, 4550In-book reference : Book 65, Hadith 72USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 72   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4551,
    "id": 4551,
    "url": "https://sunnah.com/bukhari:4551",
    "bookNumber": 65,
    "hadithNumber": 73,
    "narrator": "Narrated `Abdullah bin Abu `Aufa:",
    "english": "A man displayed some merchandise in the market and took an oath that he had been offered a certain \nprice for it while in fact he had not, in order to cheat a man from the Muslims. So then was revealed:-- \n\"Verily! Those who purchase a small gain at the cost of Allah's Covenant and their oaths...\"(3.77)",
    "arabic": "حَدَّثَنَا عَلِيٌّ ـ هُوَ ابْنُ أَبِي هَاشِمٍ ـ سَمِعَ هُشَيْمًا، أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ـ رضى الله عنهما ـ أَنَّ رَجُلاً، أَقَامَ سِلْعَةً فِي السُّوقِ فَحَلَفَ فِيهَا لَقَدْ أَعْطَى بِهَا مَا لَمْ يُعْطَهُ‏.‏ لِيُوقِعَ فِيهَا رَجُلاً مِنَ الْمُسْلِمِينَ، فَنَزَلَتْ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى آخِرِ الآيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4551In-book reference : Book 65, Hadith 73USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 73   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4552,
    "id": 4552,
    "url": "https://sunnah.com/bukhari:4552",
    "bookNumber": 65,
    "hadithNumber": 74,
    "narrator": "Narrated Ibn Abu Mulaika:",
    "english": "Two women were stitching shoes in a house or a room. Then one of them came out with an awl driven \ninto her hand, and she sued the other for it. The case was brought before Ibn `Abbas, Ibn `Abbas said, \n\"Allah's Messenger (ﷺ) said, 'If people were to be given what they claim (without proving their claim) the \nlife and property of the nation would be lost.' Will you remind her (i.e. the defendant), of Allah and \nrecite before her:--\"Verily! Those who purchase a small gain at the cost of Allah's Covenant and their \noaths...\"(3.77) \nSo they reminded her and she confessed. Ibn `Abbas then said, \"The Prophet (ﷺ) said, 'The oath is to be \ntaken by the defendant (in the absence of any proof against him).",
    "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ امْرَأَتَيْنِ، كَانَتَا تَخْرِزَانِ فِي بَيْتٍ ـ أَوْ فِي الْحُجْرَةِ ـ فَخَرَجَتْ إِحْدَاهُمَا وَقَدْ أُنْفِذَ بِإِشْفًى فِي كَفِّهَا، فَادَّعَتْ عَلَى الأُخْرَى، فَرُفِعَ إِلَى ابْنِ عَبَّاسٍ، فَقَالَ ابْنُ عَبَّاسٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَذَهَبَ دِمَاءُ قَوْمٍ وَأَمْوَالُهُمْ ‏\"‏‏.‏ ذَكِّرُوهَا بِاللَّهِ وَاقْرَءُوا عَلَيْهَا ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏‏.‏ فَذَكَّرُوهَا فَاعْتَرَفَتْ، فَقَالَ ابْنُ عَبَّاسٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4552In-book reference : Book 65, Hadith 74USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 74   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4553,
    "id": 4553,
    "url": "https://sunnah.com/bukhari:4553",
    "bookNumber": 65,
    "hadithNumber": 75,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Abu Sufyan narrated to me personally, saying, \"I set out during the Truce that had been concluded \nbetween me and Allah's Messenger (ﷺ). While I was in Sham, a letter sent by the Prophet (ﷺ) was brought to \nHeraclius. Dihya Al-Kalbi had brought and given it to the governor of Busra, and the latter forwarded \nit to Heraclius. Heraclius said, 'Is there anyone from the people of this man who claims to be a \nprophet?' The people replied, 'Yes.' So I along with some of Quraishi men were called and we entered \nupon Heraclius, and we were seated in front of him. Then he said, 'Who amongst you is the nearest \nrelative to the man who claims to be a prophet?' So they made me sit in front of him and made my \ncompanions sit behind me. \nThen he called upon his translator and said (to him). 'Tell them ( i.e. Abu Sufyan's companions) that I \nam going to ask him (i.e. Abu Sufyan) regarding that man who claims to be a prophet. So, if he tell me \na lie, they should contradict him (instantly).' By Allah, had I not been afraid that my companions \nwould consider me a liar, I would have told lies. \nHeraclius then said to his translator, 'Ask him: What is his (i.e. the Prophet's) family status amongst \nyou? I said, 'He belongs to a noble family amongst us.\" \nHeraclius said, 'Was any of his ancestors a king?' I said, 'No.' \nHe said, 'Did you ever accuse him of telling lies before his saying what he has said?' I said, 'No.' \nHe said, 'Do the nobles follow him or the poor people?' I said, 'It is the poor who followed him.' \nHe said, 'Is the number of his follower increasing or decreasing?' I said, 'The are increasing.' \nHe said, 'Does anyone renounce his religion (i.e. Islam) after embracing it, being displeased with it?' I \nsaid, 'No.' \nHe said, 'Did you fight with him?' I replied, 'Yes.' \nHe said, 'How was your fighting with him?' I said, 'The fighting between us was undecided and \nvictory was shared by him and us by turns. He inflicts casualties upon us and we inflict casualties \nupon him.' \nHe said, 'Did he ever betray?' I said, 'No, but now we are away from him in this truce and we do not \nknow what he will do in it\" Abu Sufyan added, \"By Allah, I was not able to insert in my speech a \nword (against him) except that. \nHeraclius said, 'Did anybody else (amongst you) ever claimed the same (i.e. Islam) before him? I said, \n'No.' \nThen Heraclius told his translator to tell me (i.e. Abu Sufyan), \n'I asked you about his family status amongst you, and you told me that he comes from a noble family \namongst you Verily, all Apostles come from the noblest family among their people. \nThen I asked you whether any of his ancestors was a king, and you denied that. Thereupon I thought \nthat had one of his fore-fathers been a king, I would have said that he (i.e. Muhammad) was seeking to \nrule the kingdom of his fore-fathers. \nThen I asked you regarding his followers, whether they were the noble or the poor among the people, \nand you said that they were only the poor (who follow him). In fact, such are the followers of the \nApostles. \nThen I asked you whether you have ever accused him of telling lies before saying what he said, and \nyour reply was in the negative. Therefore, I took for granted that a man who did not tell a lie about \nothers, could ever tell a lie about Allah. \nThen I asked you whether anyone of his followers had renounced his religion (i.e. Islam) after \nembracing it, being displeased with it, and you denied that. And such is Faith when it mixes with the \ncheerfulness of the hearts. \nThen I asked you whether his followers were increasing or decreasing. You claimed that they were \nincreasing. That is the way of true faith till it is complete. \nThen I asked you whether you had ever fought with him, and you claimed that you had fought with \nhim and the battle between you and him was undecided and the victory was shared by you and him in \nturns; he inflicted casual ties upon you and you inflicted casualties upon them. Such is the case with \nthe Apostles; they are out to test and the final victory is for them. \nThen I asked you whether he had ever betrayed; you claimed that he had never betrayed. I need, \nApostles never betray. \nThen I asked you whether anyone had said this statement before him; and you denied that. Thereupon \nI thought if somebody had said that statement before him, then I would have said that he was but a \nman copying some sayings said before him.\" \nAbu Safyan said, \"Heraclius then asked me, 'What does he order you to do?' I said, 'He orders us (to \noffer) prayers and (to pay) Zakat and to keep good relationship with the Kith and kin and to be chaste.' \nThen Heraclius said, 'If whatever you have said, is true, he is really a prophet, and I knew that he ( i.e. \nthe Prophet (ﷺ) ) was going to appear, but I never thought that he would be from amongst you. If I were \ncertain that I can reach him, I would like to meet him and if I were with him, I would wash his feet; \nand his kingdom will expand (surely to what is under my feet.' Then Heraclius asked for the letter of \nAllah's Messenger (ﷺ) and read it wherein was written: \n\"In the Name of Allah, the Most Beneficent, the Most Merciful. This letter is) from Muhammad, \nApostle of Allah, to Heraclius, the sovereign of Byzantine........ Peace be upon him who follows the \nRight Path. Now then, I call you to embrace Islam. Embrace Islam and you will be saved (from \nAllah's Punishment); embrace Islam, and Allah will give you a double reward, but if you reject this, \nyou will be responsible for the sins of the tillers (i.e. the people of your kingdom) and (Allah's Statement):--\"O the \npeople of the Scripture (Jews and Christians)! Come to a word common to you and us that we worship \nNone but Allah....bear witness that we are Muslims.' (3.64) \nWhen he finished reading the letter, voices grew louder near him and there was a great hue and cry, \nand we were ordered to go out.\" Abu Sufyan added, \"While coming out, I said to my companions, \n'The situation of Ibn Abu Kabsha (i.e. Muhammad) has become strong; even the king of Banu Al14 \nAsfar is afraid of him.' So I continued to believe that Allah's Messenger (ﷺ) would be victorious, till Allah \nmade me embrace Islam.\" Az-Zuhri said, \"Heraclius then invited all the chiefs of the Byzantines and \nhad them assembled in his house and said, 'O group of Byzantines! Do you wish to have a permanent \nsuccess and guidance and that your kingdom should remain with you?' (Immediately after hearing \nthat), they rushed towards the gate like onagers, but they found them closed. Heraclius then said, \n'Bring them back to me.' So he called them and said, 'I just wanted to test the strength of your \nadherence to your religion. Now I have observed of you that which I like.' Then the people fell in \nprostration before him and became pleased with him.\" (See Hadith No. 6,Vol 1)",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، عَنْ هِشَامٍ، عَنْ مَعْمَرٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ حَدَّثَنِي أَبُو سُفْيَانَ، مِنْ فِيهِ إِلَى فِيَّ قَالَ انْطَلَقْتُ فِي الْمُدَّةِ الَّتِي كَانَتْ بَيْنِي وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم ـ قَالَ ـ فَبَيْنَا أَنَا بِالشَّأْمِ إِذْ جِيءَ بِكِتَابٍ مِنَ النَّبِيِّ صلى الله عليه وسلم إِلَى هِرَقْلَ قَالَ وَكَانَ دِحْيَةُ الْكَلْبِيُّ جَاءَ بِهِ فَدَفَعَهُ إِلَى عَظِيمِ بُصْرَى، فَدَفَعَهُ عَظِيمُ بُصْرَى إِلَى ـ هِرَقْلَ ـ قَالَ فَقَالَ هِرَقْلُ هَلْ هَا هُنَا أَحَدٌ مِنْ قَوْمِ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ فَقَالُوا نَعَمْ‏.‏ قَالَ فَدُعِيتُ فِي نَفَرٍ مِنْ قُرَيْشٍ فَدَخَلْنَا عَلَى هِرَقْلَ، فَأُجْلِسْنَا بَيْنَ يَدَيْهِ فَقَالَ أَيُّكُمْ أَقْرَبُ نَسَبًا مِنْ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ فَقَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا‏.‏ فَأَجْلَسُونِي بَيْنَ يَدَيْهِ، وَأَجْلَسُوا أَصْحَابِي خَلْفِي، ثُمَّ دَعَا بِتُرْجُمَانِهِ فَقَالَ قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا عَنْ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ، فَإِنْ كَذَبَنِي فَكَذِّبُوهُ‏.‏ قَالَ أَبُو سُفْيَانَ وَايْمُ اللَّهِ، لَوْلاَ أَنْ يُؤْثِرُوا عَلَىَّ الْكَذِبَ لَكَذَبْتُ‏.‏ ثُمَّ قَالَ لِتُرْجُمَانِهِ سَلْهُ كَيْفَ حَسَبُهُ فِيكُمْ قَالَ قُلْتُ هُوَ فِينَا ذُو حَسَبٍ‏.‏ قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مَلِكٌ قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لاَ‏.‏ قَالَ أَيَتَّبِعُهُ أَشْرَافُ النَّاسِ أَمْ ضُعَفَاؤُهُمْ قَالَ قُلْتُ بَلْ ضُعَفَاؤُهُمْ‏.‏ قَالَ يَزِيدُونَ أَوْ يَنْقُصُونَ قَالَ قُلْتُ لاَ بَلْ يَزِيدُونَ‏.‏ قَالَ هَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ عَنْ دِينِهِ، بَعْدَ أَنْ يَدْخُلَ فِيهِ، سَخْطَةً لَهُ قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ قَاتَلْتُمُوهُ قَالَ قُلْتُ نَعَمْ‏.‏ قَالَ فَكَيْفَ كَانَ قِتَالُكُمْ إِيَّاهُ قَالَ قُلْتُ تَكُونُ الْحَرْبُ بَيْنَنَا وَبَيْنَهُ سِجَالاً، يُصِيبُ مِنَّا وَنُصِيبُ مِنْهُ‏.‏ قَالَ فَهَلْ يَغْدِرُ قَالَ قُلْتُ لاَ وَنَحْنُ مِنْهُ فِي هَذِهِ الْمُدَّةِ لاَ نَدْرِي مَا هُوَ صَانِعٌ فِيهَا‏.‏ قَالَ وَاللَّهِ مَا أَمْكَنَنِي مِنْ كَلِمَةٍ أُدْخِلُ فِيهَا شَيْئًا غَيْرَ هَذِهِ‏.‏ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ أَحَدٌ قَبْلَهُ قُلْتُ لاَ‏.‏ ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لَهُ إِنِّي سَأَلْتُكَ عَنْ حَسَبِهِ فِيكُمْ، فَزَعَمْتَ أَنَّهُ فِيكُمْ ذُو حَسَبٍ، وَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي أَحْسَابِ قَوْمِهَا، وَسَأَلْتُكَ هَلْ كَانَ فِي آبَائِهِ مَلِكٌ فَزَعَمْتَ أَنْ لاَ فَقُلْتُ لَوْ كَانَ مِنْ آبَائِهِ مَلِكٌ قُلْتُ رَجُلٌ يَطْلُبُ مُلْكَ آبَائِهِ، وَسَأَلْتُكَ عَنْ أَتْبَاعِهِ أَضُعَفَاؤُهُمْ أَمْ أَشْرَافُهُمْ فَقُلْتَ بَلْ ضُعَفَاؤُهُمْ، وَهُمْ أَتْبَاعُ الرُّسُلِ، وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَزَعَمْتَ أَنْ لاَ، فَعَرَفْتُ أَنَّهُ لَمْ يَكُنْ لِيَدَعَ الْكَذِبَ عَلَى النَّاسِ ثُمَّ يَذْهَبَ فَيَكْذِبَ عَلَى اللَّهِ، وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ عَنْ دِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ سَخْطَةً لَهُ فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الإِيمَانُ إِذَا خَالَطَ بَشَاشَةَ الْقُلُوبِ، وَسَأَلْتُكَ هَلْ يَزِيدُونَ أَمْ يَنْقُصُونَ فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ، وَسَأَلْتُكَ هَلْ قَاتَلْتُمُوهُ فَزَعَمْتَ أَنَّكُمْ قَاتَلْتُمُوهُ فَتَكُونُ الْحَرْبُ بَيْنَكُمْ وَبَيْنَهُ سِجَالاً، يَنَالُ مِنْكُمْ وَتَنَالُونَ مِنْهُ، وَكَذَلِكَ الرُّسُلُ تُبْتَلَى، ثُمَّ تَكُونُ لَهُمُ الْعَاقِبَةُ، وَسَأَلْتُكَ هَلْ يَغْدِرُ فَزَعَمْتَ أَنَّهُ لاَ يَغْدِرُ، وَكَذَلِكَ الرُّسُلُ لاَ تَغْدِرُ، وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ هَذَا الْقَوْلَ قَبْلَهُ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ قَالَ هَذَا الْقَوْلَ أَحَدٌ قَبْلَهُ قُلْتُ رَجُلٌ ائْتَمَّ بِقَوْلٍ قِيلَ قَبْلَهُ‏.‏ قَالَ ثُمَّ قَالَ بِمَ يَأْمُرُكُمْ قَالَ قُلْتُ يَأْمُرُنَا بِالصَّلاَةِ وَالزَّكَاةِ وَالصِّلَةِ وَالْعَفَافِ‏.‏ قَالَ إِنْ يَكُ مَا تَقُولُ فِيهِ حَقًّا فَإِنَّهُ نَبِيٌّ، وَقَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، وَلَمْ أَكُ أَظُنُّهُ مِنْكُمْ، وَلَوْ أَنِّي أَعْلَمُ أَنِّي أَخْلُصُ إِلَيْهِ لأَحْبَبْتُ لِقَاءَهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ عَنْ قَدَمَيْهِ، وَلَيَبْلُغَنَّ مُلْكُهُ مَا تَحْتَ قَدَمَىَّ‏.‏ قَالَ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَرَأَهُ، فَإِذَا فِيهِ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ رَسُولِ اللَّهِ، إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، سَلاَمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ، فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، وَأَسْلِمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ، وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلاَّ اللَّهَ‏}‏ إِلَى قَوْلِهِ ‏{‏اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏‏\"‏‏.‏ فَلَمَّا فَرَغَ مِنْ قِرَاءَةِ الْكِتَابِ ارْتَفَعَتِ الأَصْوَاتُ عِنْدَهُ، وَكَثُرَ اللَّغَطُ، وَأُمِرَ بِنَا فَأُخْرِجْنَا قَالَ فَقُلْتُ لأَصْحَابِي حِينَ خَرَجْنَا لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، أَنَّهُ لَيَخَافُهُ مَلِكُ بَنِي الأَصْفَرِ فَمَا زِلْتُ مُوقِنًا بِأَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَيَظْهَرُ حَتَّى أَدْخَلَ اللَّهُ عَلَىَّ الإِسْلاَمَ‏.‏ قَالَ الزُّهْرِيُّ فَدَعَا هِرَقْلُ عُظَمَاءَ الرُّومِ فَجَمَعَهُمْ فِي دَارٍ لَهُ فَقَالَ يَا مَعْشَرَ الرُّومِ، هَلْ لَكُمْ فِي الْفَلاَحِ وَالرَّشَدِ آخِرَ الأَبَدِ، وَأَنْ يَثْبُتَ لَكُمْ مُلْكُكُمْ قَالَ فَحَاصُوا حَيْصَةَ حُمُرِ الْوَحْشِ إِلَى الأَبْوَابِ، فَوَجَدُوهَا قَدْ غُلِقَتْ، فَقَالَ عَلَىَّ بِهِمْ‏.‏ فَدَعَا بِهِمْ فَقَالَ إِنِّي إِنَّمَا اخْتَبَرْتُ شِدَّتَكُمْ عَلَى دِينِكُمْ، فَقَدْ رَأَيْتُ مِنْكُمُ الَّذِي أَحْبَبْتُ‏.‏ فَسَجَدُوا لَهُ وَرَضُوا عَنْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4553In-book reference : Book 65, Hadith 75USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 75   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4554,
    "id": 4554,
    "url": "https://sunnah.com/bukhari:4554",
    "bookNumber": 65,
    "hadithNumber": 76,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Out of all the Ansar, living in Medina, Abu Talha had the largest number of (date palm trees) gardens, \nand the most beloved of his property to him was Bairuha garden which was standing opposite the \nMosque (of the Prophet). Allah's Messenger (ﷺ) used to enter it and drink of its good water. When the \nVerse:--\"By no means shall you attain righteousness unless you spend (in charity) of that which you \nlove.\" (3.92) Abu Talha got up and said, \"O Allah's Messenger (ﷺ), Allah says:--\"By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.\" (3.92) and the most beloved \nof my property to me is the Bairuha garden, so I give it (as a charitable gift) in Allah's Cause and hope \nto receive good out of it, and to have it stored for me with Allah. So, O Allah's Messenger (ﷺ)! Dispose it of \n(i.e. utilize it) in the way Allah orders you (to dispose it of).\" Allah's Messenger (ﷺ) said, \"Bravo! That is a \nfruitful property! That is a fruitful property! I have heard what you have said and I think that you \nshould distribute that (garden) amongst your relatives.\" The Abu Talha distributed that garden \namongst his relatives and his cousins.\n\nNarrated Yahya bin Yahya:\n\nI learnt from Malik, \"..a fruitful property.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ نَخْلاً، وَكَانَ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بَيْرُحَاءٍ، وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ، فَلَمَّا أُنْزِلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ فَقَالَ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ يَقُولُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بَيْرُحَاءٍ وَإِنَّهَا صَدَقَةٌ لِلَّهِ، أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخْ، ذَلِكَ مَالٌ رَايِحٌ، ذَلِكَ مَالٌ رَايِحٌ، وَقَدْ سَمِعْتُ مَا قُلْتَ، وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ يُوسُفَ وَرَوْحُ بْنُ عُبَادَةَ ‏\"‏ ذَلِكَ مَالٌ رَابِحٌ ‏\"‏‏.‏ حَدَّثَنِي يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ ‏\"‏ مَالٌ رَايِحٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4554In-book reference : Book 65, Hadith 76USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 76   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4555,
    "id": 4555,
    "url": "https://sunnah.com/bukhari:4555",
    "bookNumber": 65,
    "hadithNumber": 77,
    "narrator": "Narrated Anas:",
    "english": "Abu Talha distributed the garden between Hassan and Ubai, but he did not give me anything thereof \nalthough I was a nearer relative to him.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ فَجَعَلَهَا لِحَسَّانَ وَأُبِيٍّ، وَأَنَا أَقْرَبُ إِلَيْهِ، وَلَمْ يَجْعَلْ لِي مِنْهَا شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4555In-book reference : Book 65, Hadith 77USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 78   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4556,
    "id": 4556,
    "url": "https://sunnah.com/bukhari:4556",
    "bookNumber": 65,
    "hadithNumber": 78,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "The Jews brought to the Prophet (ﷺ) a man and a woman from among them who had committed illegal \nsexual intercourse. The Prophet (ﷺ) said to them, \"How do you usually punish the one amongst you who \nhas committed illegal sexual intercourse?\" They replied, \"We blacken their faces with coal and beat \nthem,\" He said, \"Don't you find the order of Ar-Rajm (i.e. stoning to death) in the Torah?\" They \nreplied, \"We do not find anything in it.\" `Abdullah bin Salam (after hearing this conversation) said to \nthem. \"You have told a lie! Bring here the Torah and recite it if you are truthful.\" (So the Jews brought \nthe Torah). And the religious teacher who was teaching it to them, put his hand over the Verse of Ar- \nRajm and started reading what was written above and below the place hidden with his hand, but he did \nnot read the Verse of Ar-Rajm. `Abdullah bin Salam removed his (i.e. the teacher's) hand from the \nVerse of Ar-Rajm and said, \"What is this?\" So when the Jews saw that Verse, they said, \"This is the \nVerse of Ar-Rajm.\" So the Prophet (ﷺ) ordered the two adulterers to be stoned to death, and they were \nstoned to death near the place where biers used to be placed near the Mosque. I saw her companion \n(i.e. the adulterer) bowing over her so as to protect her from the stones.",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْيَهُودَ، جَاءُوا إِلَى النَّبِيِّ صلى الله عليه وسلم بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا، فَقَالَ لَهُمْ ‏\"‏ كَيْفَ تَفْعَلُونَ بِمَنْ زَنَى مِنْكُمْ ‏\"‏‏.‏ قَالُوا نُحَمِّمُهُمَا وَنَضْرِبُهُمَا‏.‏ فَقَالَ ‏\"‏ لاَ تَجِدُونَ فِي التَّوْرَاةِ الرَّجْمَ ‏\"‏‏.‏ فَقَالُوا لاَ نَجِدُ فِيهَا شَيْئًا‏.‏ فَقَالَ لَهُمْ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبْتُمْ ‏{‏فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ‏}‏ فَوَضَعَ مِدْرَاسُهَا الَّذِي يُدَرِّسُهَا مِنْهُمْ كَفَّهُ عَلَى آيَةِ الرَّجْمِ، فَطَفِقَ يَقْرَأُ مَا دُونَ يَدِهِ وَمَا وَرَاءَهَا، وَلاَ يَقْرَأُ آيَةَ الرَّجْمِ، فَنَزَعَ يَدَهُ عَنْ آيَةِ الرَّجْمِ فَقَالَ مَا هَذِهِ فَلَمَّا رَأَوْا ذَلِكَ قَالُوا هِيَ آيَةُ الرَّجْمِ‏.‏ فَأَمَرَ بِهِمَا فَرُجِمَا قَرِيبًا مِنْ حَيْثُ مَوْضِعُ الْجَنَائِزِ عِنْدَ الْمَسْجِدِ، فَرَأَيْتُ صَاحِبَهَا يَجْنَأُ عَلَيْهَا يَقِيهَا الْحِجَارَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4556In-book reference : Book 65, Hadith 78USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 79   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4557,
    "id": 4557,
    "url": "https://sunnah.com/bukhari:4557",
    "bookNumber": 65,
    "hadithNumber": 79,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Verse:--\"You (true Muslims) are the best of peoples ever raised up for mankind.\" means, the best \nof peoples for the people, as you bring them with chains on their necks till they embrace Islam.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ سُفْيَانَ، عَنْ مَيْسَرَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَة َ ـ رضى الله عنه ـ ‏{‏كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ‏}‏ قَالَ خَيْرَ النَّاسِ لِلنَّاسِ، تَأْتُونَ بِهِمْ فِي السَّلاَسِلِ فِي أَعْنَاقِهِمْ حَتَّى يَدْخُلُوا فِي الإِسْلاَمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4557In-book reference : Book 65, Hadith 79USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 80   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4558,
    "id": 4558,
    "url": "https://sunnah.com/bukhari:4558",
    "bookNumber": 65,
    "hadithNumber": 80,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Verse:--\"When two parties from among you were about to lose heart, but Allah was their \nProtector,\" (3.122) was revealed concerning us, and we were the two parties, i.e. Banu Haritha and \nBanu Salama, and we do not wish (that it had not been revealed) or I would not have been pleased (if \nit had not been revealed), for Allah says:--\"...Allah was their Protector.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّه ِ ـ رضى الله عنهما ـ يَقُولُ فِينَا نَزَلَتْ ‏{‏إِذْ هَمَّتْ طَائِفَتَانِ مِنْكُمْ أَنْ تَفْشَلاَ وَاللَّهُ وَلِيُّهُمَا‏}‏ قَالَ نَحْنُ الطَّائِفَتَانِ بَنُو حَارِثَةَ وَبَنُو سَلِمَةَ، وَمَا نُحِبُّ ـ وَقَالَ سُفْيَانُ مَرَّةً وَمَا يَسُرُّنِي ـ أَنَّهَا لَمْ تُنْزَلْ لِقَوْلِ اللَّهِ ‏{‏وَاللَّهُ وَلِيُّهُمَا‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4558In-book reference : Book 65, Hadith 80USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 81   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4559,
    "id": 4559,
    "url": "https://sunnah.com/bukhari:4559",
    "bookNumber": 65,
    "hadithNumber": 81,
    "narrator": "Narrated Salim's father:",
    "english": "That he heard Allah's Messenger (ﷺ) on raising his head from the bowing in the last rak`a in the Fajr prayer, \nsaying, \"O Allah, curse such-and-such person and such-and-such person, and such-and-such person,\" \nafter saying, \"Allah hears him who sends his praises to Him, O our Lord, all praise is for you.\" So \nAllah revealed:--\"Not for you (O Muhammad) (but for Allah) is the decision, verily they are indeed \nwrongdoers.\" (3.128)",
    "arabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمٌ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ فِي الرَّكْعَةِ الآخِرَةِ مِنَ الْفَجْرِ يَقُولُ ‏\"‏ اللَّهُمَّ الْعَنْ فُلاَنًا وَفُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ بَعْدَ مَا يَقُولُ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ‏}‏ إِلَى قَوْلِهِ ‏{‏فَإِنَّهُمْ ظَالِمُونَ‏}‏‏.‏ رَوَاهُ إِسْحَاقُ بْنُ رَاشِدٍ عَنِ الزُّهْرِيِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4559In-book reference : Book 65, Hadith 81USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 82   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4560,
    "id": 4560,
    "url": "https://sunnah.com/bukhari:4560",
    "bookNumber": 65,
    "hadithNumber": 82,
    "narrator": "Narrated Abu Huraira:",
    "english": "Whenever Allah's Messenger (ﷺ) intended to invoke evil upon somebody or invoke good upon somebody, he \nused to invoke (Allah after bowing (in the prayer). Sometimes after saying, \"Allah hears him who \nsends his praises to Him, all praise is for You, O our Lord,\" he would say, \"O Allah. Save Al-Walid \nbin Al-Walid and Salama bin Hisham, and `Aiyash bin Abu Rabi`a. O Allah! Inflict Your Severe \nTorture on Mudar (tribe) and strike them with (famine) years like the years of Joseph.\" The Prophet (ﷺ) \nused to say in a loud voice, and he also used to say in some of his Fajr prayers, \"O Allah! Curse soand- \nso and so-and-so.\" naming some of the Arab tribes till Allah revealed:--\"Not for you (O \nMuhammad) (but for Allah) is the decision.\" (3.128)",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يَدْعُوَ عَلَى أَحَدٍ أَوْ يَدْعُوَ لأَحَدٍ قَنَتَ بَعْدَ الرُّكُوعِ، فَرُبَّمَا قَالَ إِذَا قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، وَسَلَمَةَ بْنَ هِشَامٍ، وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏ يَجْهَرُ بِذَلِكَ وَكَانَ يَقُولُ فِي بَعْضِ صَلاَتِهِ فِي صَلاَةِ الْفَجْرِ ‏\"‏ اللَّهُمَّ الْعَنْ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ لأَحْيَاءٍ مِنَ الْعَرَبِ، حَتَّى أَنْزَلَ اللَّهُ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4560In-book reference : Book 65, Hadith 82USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 83   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4561,
    "id": 4561,
    "url": "https://sunnah.com/bukhari:4561",
    "bookNumber": 65,
    "hadithNumber": 83,
    "narrator": "Narrated Al-Bara bin Azib:",
    "english": "The Prophet (ﷺ) appointed `Abdullah bin Jubair as the commander of the infantry during the battle of \nUhud. They returned defeated, and that is what is meant by:-- \n\"And the Apostle was calling them back in the rear. None remained with the Prophet (ﷺ) then, but twelve \nmen.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ جَعَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى الرَّجَّالَةِ يَوْمَ أُحُدٍ عَبْدَ اللَّهِ بْنَ جُبَيْرٍ، وَأَقْبَلُوا مُنْهَزِمِينَ، فَذَاكَ إِذْ يَدْعُوهُمُ الرَّسُولُ فِي أُخْرَاهُمْ، وَلَمْ يَبْقَ مَعَ النَّبِيِّ صلى الله عليه وسلم غَيْرُ اثْنَىْ عَشَرَ رَجُلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4561In-book reference : Book 65, Hadith 83USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 84   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4562,
    "id": 4562,
    "url": "https://sunnah.com/bukhari:4562",
    "bookNumber": 65,
    "hadithNumber": 84,
    "narrator": "Narrated Abu Talha:",
    "english": "Slumber overtook us during the battle of Uhud while we were in the front files. My sword would fall \nfrom my hand and I would pick it up, and again it would fall down and I would pick it up again.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ أَبُو يَعْقُوبَ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ، أَنَّ أَبَا طَلْحَةَ، قَالَ غَشِيَنَا النُّعَاسُ وَنَحْنُ فِي مَصَافِّنَا يَوْمَ أُحُدٍ ـ قَالَ ـ فَجَعَلَ سَيْفِي يَسْقُطُ مِنْ يَدِي وَآخُذُهُ، وَيَسْقُطُ وَآخُذُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4562In-book reference : Book 65, Hadith 84USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 85   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4563,
    "id": 4563,
    "url": "https://sunnah.com/bukhari:4563",
    "bookNumber": 65,
    "hadithNumber": 85,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was \nthrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is \ngathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is \nSufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ ـ أُرَاهُ قَالَ ـ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي الضُّحَى، عَنِ ابْنِ عَبَّاسٍ، ‏{‏حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ‏}‏ قَالَهَا إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ حِينَ أُلْقِيَ فِي النَّارِ، وَقَالَهَا مُحَمَّدٌ صلى الله عليه وسلم حِينَ قَالُوا ‏{‏إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4563In-book reference : Book 65, Hadith 85USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 86   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4564,
    "id": 4564,
    "url": "https://sunnah.com/bukhari:4564",
    "bookNumber": 65,
    "hadithNumber": 86,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The last statement of Abraham when he was thrown into the fire was:--\"Allah is Sufficient for us and \nHe is the Best Disposer (of affairs for us).\" (3.173)",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي الضُّحَى، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ آخِرَ قَوْلِ إِبْرَاهِيمَ حِينَ أُلْقِيَ فِي النَّارِ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4564In-book reference : Book 65, Hadith 86USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 87   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4565,
    "id": 4565,
    "url": "https://sunnah.com/bukhari:4565",
    "bookNumber": 65,
    "hadithNumber": 87,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Anyone whom Allah has given wealth but he does not pay its Zakat, then, on \nthe Day of Resurrection, his wealth will be presented to him in the shape of a bald-headed poisonous \nmale snake with two poisonous glands in its mouth and it will encircle itself round his neck and bite \nhim over his cheeks and say, \"I am your wealth; I am your treasure.\" Then the Prophet (ﷺ) recited this \nDivine Verse:-- \n\"And let not those who covetously withhold of that which Allah has bestowed upon them of His \nBounty.\" (3.180)",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا النَّضْرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ ـ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ ـ عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ آتَاهُ اللَّهُ مَالاً فَلَمْ يُؤَدِّ زَكَاتَهُ، مُثِّلَ لَهُ مَالُهُ شُجَاعًا أَقْرَعَ، لَهُ زَبِيبَتَانِ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ، يَأْخُذُ بِلِهْزِمَتَيْهِ ـ يَعْنِي بِشِدْقَيْهِ ـ يَقُولُ أَنَا مَالُكَ أَنَا كَنْزُكَ ‏\"‏‏.‏ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏{‏وَلاَ يَحْسِبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ‏}‏ إِلَى آخِرِ الآيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4565In-book reference : Book 65, Hadith 87USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 88   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4566,
    "id": 4566,
    "url": "https://sunnah.com/bukhari:4566",
    "bookNumber": 65,
    "hadithNumber": 88,
    "narrator": "Narrated Usama bin Zaid:",
    "english": "Allah's Messenger (ﷺ) rode a donkey, equipped with a thick cloth-covering made in Fadak and was riding \nbehind him. He was going to pay visit to Sa`d bin Ubada in Banu Al-Harith bin Al-Khazraj; and this \nincident happened before the battle of Badr. The Prophet (ﷺ) passed by a gathering in which `Abdullah \nbin Ubai bin Salul was present, and that was before `Abdullah bin Ubai embraced Islam. Behold in \nthat gathering there were people of different religions: there were Muslims, pagans, idol-worshippers \nand Jews, and in that gathering `Abdullah bin Rawaha was also present. When a cloud of dust raised \nby the donkey reached that gathering, `Abdullah bin Ubai covered his nose with his garment and then \nsaid, \"Do not cover us with dust.\" Then Allah's Messenger (ﷺ) greeted them and stopped and dismounted and \ninvited them to Allah (i.e. to embrace Islam) and recited to them the Holy Qur'an. On that, `Abdullah \nbin Ubai bin Saluil said, \"O man ! There is nothing better than that what you say. If it is the truth, then \ndo not trouble us with it in our gatherings. Return to your mount (or residence) and if somebody \ncomes to you, relate (your tales) to him.\" On that `Abdullah bin Rawaha said, \"Yes, O Allah's \nApostle! Bring it (i.e. what you want to say) to us in our gathering, for we love that.\" \nSo the Muslims, the pagans and the Jews started abusing one another till they were on the point of \nfighting with one another. The Prophet (ﷺ) kept on quietening them till they became quiet, whereupon the \nProphet rode his animal (mount) and proceeded till he entered upon Sa`d bin Ubada. The Prophet (ﷺ) said \nto Sa`d, \"Did you not hear what 'Abu Hub-b said?\" He meant `Abdullah bin Ubai. \"He said so-andso.\" \nOn that Sa`d bin Ubada said, \"O Allah's Messenger (ﷺ)! Excuse and forgive him, for by Him Who \nrevealed the Book to you, Allah brought the Truth which was sent to you at the time when the people \nof this town (i.e. Medina) had decided unanimously to crown him and tie a turban on his head \n(electing him as chief). But when Allah opposed that (decision) through the Truth which Allah gave to \nyou, he (i.e. `Abdullah bin Ubai) was grieved with jealously. and that caused him to do what you have \nseen.\" So Allah's Messenger (ﷺ) excused him, for the Prophet (ﷺ) and his companions used to forgive the pagans \nand the people of Scripture as Allah had ordered them, and they used to put up with their mischief \nwith patience. Allah said: \"And you shall certainly hear much that will grieve you from those who \nreceived the Scripture before you and from the pagans........'(3.186) And Allah also said:--\"Many of \nthe people of the Scripture wish if they could turn you away as disbelievers after you have believed, \nfrom selfish envy..\" (2.109) \nSo the Prophet (ﷺ) used to stick to the principle of forgiveness for them as long as Allah ordered him to do \nso till Allah permitted fighting them. So when Allah's Messenger (ﷺ) fought the battle of Badr and Allah \nkilled the nobles of Quraish infidels through him, Ibn Ubai bin Salul and the pagans and idolaters who \nwere with him, said, \"This matter (i.e. Islam) has appeared (i.e. became victorious).\" So they gave the \npledge of allegiance (for embracing Islam) to Allah's Messenger (ﷺ) and became Muslims.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ عَلَى قَطِيفَةٍ فَدَكِيَّةٍ، وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ وَرَاءَهُ، يَعُودُ سَعْدَ بْنَ عُبَادَةَ فِي بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ قَبْلَ وَقْعَةِ بَدْرٍ ـ قَالَ ـ حَتَّى مَرَّ بِمَجْلِسٍ فِيهِ عَبْدُ اللَّهِ بْنُ أُبَىٍّ، ابْنُ سَلُولَ، وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَإِذَا فِي الْمَجْلِسِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ عَبَدَةِ الأَوْثَانِ وَالْيَهُودِ وَالْمُسْلِمِينَ، وَفِي الْمَجْلِسِ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ، فَلَمَّا غَشِيَتِ الْمَجْلِسَ عَجَاجَةُ الدَّابَّةِ خَمَّرَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَنْفَهُ بِرِدَائِهِ، ثُمَّ قَالَ لاَ تُغَبِّرُوا عَلَيْنَا‏.‏ فَسَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِمْ ثُمَّ وَقَفَ فَنَزَلَ فَدَعَاهُمْ إِلَى اللَّهِ، وَقَرَأَ عَلَيْهِمُ الْقُرْآنَ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ أَيُّهَا الْمَرْءُ، إِنَّهُ لاَ أَحْسَنَ مِمَّا تَقُولُ، إِنْ كَانَ حَقًّا، فَلاَ تُؤْذِينَا بِهِ فِي مَجْلِسِنَا، ارْجِعْ إِلَى رَحْلِكَ، فَمَنْ جَاءَكَ فَاقْصُصْ عَلَيْهِ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ بَلَى يَا رَسُولَ اللَّهِ، فَاغْشَنَا بِهِ فِي مَجَالِسِنَا، فَإِنَّا نُحِبُّ ذَلِكَ‏.‏ فَاسْتَبَّ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْيَهُودُ حَتَّى كَادُوا يَتَثَاوَرُونَ، فَلَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم يُخَفِّضُهُمْ حَتَّى سَكَنُوا، ثُمَّ رَكِبَ النَّبِيُّ صلى الله عليه وسلم دَابَّتَهُ فَسَارَ حَتَّى دَخَلَ عَلَى سَعْدِ بْنِ عُبَادَةَ، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا سَعْدُ أَلَمْ تَسْمَعْ مَا قَالَ أَبُو حُبَابٍ ‏\"‏‏.‏ يُرِيدُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ‏\"‏ قَالَ كَذَا وَكَذَا ‏\"‏‏.‏ قَالَ سَعْدُ بْنُ عُبَادَةَ يَا رَسُولَ اللَّهِ، اعْفُ عَنْهُ وَاصْفَحْ عَنْهُ، فَوَالَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ، لَقَدْ جَاءَ اللَّهُ بِالْحَقِّ الَّذِي أَنْزَلَ عَلَيْكَ، لَقَدِ اصْطَلَحَ أَهْلُ هَذِهِ الْبُحَيْرَةِ عَلَى أَنْ يُتَوِّجُوهُ فَيُعَصِّبُونَهُ بِالْعِصَابَةِ، فَلَمَّا أَبَى اللَّهُ ذَلِكَ بِالْحَقِّ الَّذِي أَعْطَاكَ اللَّهُ شَرِقَ بِذَلِكَ، فَذَلِكَ فَعَلَ بِهِ ما رَأَيْتَ‏.‏ فَعَفَا عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ يَعْفُونَ عَنِ الْمُشْرِكِينَ وَأَهْلِ الْكِتَابِ كَمَا أَمَرَهُمُ اللَّهُ، وَيَصْبِرُونَ عَلَى الأَذَى قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا ‏}‏ الآيَةَ، وَقَالَ اللَّهُ ‏{‏وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُمْ مِنْ بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِنْ عِنْدِ أَنْفُسِهِمْ‏}‏ إِلَى آخِرِ الآيَةِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَتَأَوَّلُ الْعَفْوَ مَا أَمَرَهُ اللَّهُ بِهِ، حَتَّى أَذِنَ اللَّهُ فِيهِمْ، فَلَمَّا غَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم بَدْرًا، فَقَتَلَ اللَّهُ بِهِ صَنَادِيدَ كُفَّارِ قُرَيْشٍ قَالَ ابْنُ أُبَىٍّ ابْنُ سَلُولَ، وَمَنْ مَعَهُ مِنَ الْمُشْرِكِينَ، وَعَبَدَةِ الأَوْثَانِ هَذَا أَمْرٌ قَدْ تَوَجَّهَ‏.‏ فَبَايَعُوا الرَّسُولَ صلى الله عليه وسلم عَلَى الإِسْلاَمِ فَأَسْلَمُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4566In-book reference : Book 65, Hadith 88USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 89   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4567,
    "id": 4567,
    "url": "https://sunnah.com/bukhari:4567",
    "bookNumber": 65,
    "hadithNumber": 89,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "During the lifetime of Allah's Messenger (ﷺ), some men among the hypocrites used to remain behind him \n(i.e. did not accompany him) when he went out for a Ghazwa and they would be pleased to stay at \nhome behind Allah's Messenger (ﷺ) When Allah's Messenger (ﷺ) returned (from the battle) they would put forward \n(false) excuses and take oaths, wishing to be praised for what they had not done. So there was \nrevealed:-- \n\"Think not that those who rejoice in what they have done, and love to be praised for what they have \nnot done..\" (3.188)",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رِجَالاً مِنَ الْمُنَافِقِينَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْغَزْوِ تَخَلَّفُوا عَنْهُ، وَفَرِحُوا بِمَقْعَدِهِمْ خِلاَفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم اعْتَذَرُوا إِلَيْهِ وَحَلَفُوا، وَأَحَبُّوا أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا، فَنَزَلَتْ ‏{‏لاَ يَحْسِبَنَّ الَّذِينَ يَفْرَحُونَ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4567In-book reference : Book 65, Hadith 89USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 90   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4568,
    "id": 4568,
    "url": "https://sunnah.com/bukhari:4568",
    "bookNumber": 65,
    "hadithNumber": 90,
    "narrator": "Narrated Alqama bin Waqqas:",
    "english": "Marwan said to his gatekeeper, \"Go to Ibn `Abbas, O Rafi`, and say, 'If everybody who rejoices in \nwhat he has done, and likes to be praised for what he has not done, will be punished, then all of us will \nbe punished.\" Ibn `Abbas said, \"What connection have you with this case? It was only that the Prophet (ﷺ) \ncalled the Jews and asked them about something, and they hid the truth and told him something else, \nand showed him that they deserved praise for the favor of telling him the answer to his question, and \nthey became happy with what they had concealed. \nThen Ibn `Abbas recited:-- \n\"(And remember) when Allah took a Covenant from those who were given the Scripture..and those \nwho rejoice in what they have done and love to be praised for what they have not done.' \" (3.187-188)\n\n\nHumaid bin `Abdur-Rahman bin `Auf narrated that Marwan had told him (the above narration).",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ عَلْقَمَةَ بْنَ وَقَّاصٍ، أَخْبَرَهُ أَنَّ مَرْوَانَ قَالَ لِبَوَّابِهِ اذْهَبْ يَا رَافِعُ إِلَى ابْنِ عَبَّاسٍ فَقُلْ لَئِنْ كَانَ كُلُّ امْرِئٍ فَرِحَ بِمَا أُوتِيَ، وَأَحَبَّ أَنْ يُحْمَدَ بِمَا لَمْ يَفْعَلْ، مُعَذَّبًا، لَنُعَذَّبَنَّ أَجْمَعُونَ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ وَمَا لَكُمْ وَلِهَذِهِ إِنَّمَا دَعَا النَّبِيُّ صلى الله عليه وسلم يَهُودَ فَسَأَلَهُمْ عَنْ شَىْءٍ، فَكَتَمُوهُ إِيَّاهُ، وَأَخْبَرُوهُ بِغَيْرِهِ، فَأَرَوْهُ أَنْ قَدِ اسْتَحْمَدُوا إِلَيْهِ بِمَا أَخْبَرُوهُ عَنْهُ فِيمَا سَأَلَهُمْ، وَفَرِحُوا بِمَا أُوتُوا مِنْ كِتْمَانِهِمْ، ثُمَّ قَرَأَ ابْنُ عَبَّاسٍ ‏{‏وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ‏}‏ كَذَلِكَ حَتَّى قَوْلِهِ ‏{‏يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا‏}‏‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ عَنِ ابْنِ جُرَيْجٍ‏.‏       \nحَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا الْحَجَّاجُ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ أَخْبَرَهُ أَنَّ مَرْوَانَ بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4568In-book reference : Book 65, Hadith 90USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 91   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4569,
    "id": 4569,
    "url": "https://sunnah.com/bukhari:4569",
    "bookNumber": 65,
    "hadithNumber": 91,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "I stayed overnight in the house of my aunt Maimuna. Allah's Messenger (ﷺ) talked with his wife for a while \nand then went to bed. When it was the last third of the night, he got up and looked towards the sky and \nsaid: \n\"Verily! In the creation of the Heavens and the Earth and in the alteration of night and day, there are \nindeed signs for men of understanding.\" (3.190) \nThen he stood up, performed ablution, brushed his teeth with a Siwak, and then prayed eleven rak`at. \nThen Bilal pronounced the Adhan (i.e. call for the Fajr prayer). The Prophet (ﷺ) then offered two rak`at \n(Sunna) prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ، فَتَحَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَهْلِهِ سَاعَةً ثُمَّ رَقَدَ، فَلَمَّا كَانَ ثُلُثُ اللَّيْلِ الآخِرُ قَعَدَ فَنَظَرَ إِلَى السَّمَاءِ فَقَالَ ‏{‏إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لأُولِي الأَلْبَابِ‏}‏، ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَنَّ، فَصَلَّى إِحْدَى عَشْرَةَ رَكْعَةً، ثُمَّ أَذَّنَ بِلاَلٌ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4569In-book reference : Book 65, Hadith 91USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 93   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4570,
    "id": 4570,
    "url": "https://sunnah.com/bukhari:4570",
    "bookNumber": 65,
    "hadithNumber": 92,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(One night) I stayed overnight in the house of my aunt Maimuna, and said to myself, \"I will watch the \nprayer of Allah's Messenger (ﷺ) \" My aunt placed a cushion for Allah's Messenger (ﷺ) and he slept on it in its \nlength-wise direction and (woke-up) rubbing the traces of sleep off his face and then he recited the last \nten Verses of Surat-al-`Imran till he finished it. Then he went to a hanging water skin and took it, \nperformed the ablution and then stood up to offer the prayer. I got up and did the same as he had done, \nand stood beside him. He put his hand on my head and held me by the ear and twisted it. He offered \ntwo rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, and \nfinally the witr (i.e. one rak`a) prayer.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقُلْتُ لأَنْظُرَنَّ إِلَى صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَطُرِحَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وِسَادَةٌ، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طُولِهَا، فَجَعَلَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ، ثُمَّ قَرَأَ الآيَاتِ الْعَشْرَ الأَوَاخِرَ مِنْ آلِ عِمْرَانَ حَتَّى خَتَمَ، ثُمَّ أَتَى شَنًّا مُعَلَّقًا، فَأَخَذَهُ فَتَوَضَّأَ، ثُمَّ قَامَ يُصَلِّي، فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ جِئْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ يَدَهُ عَلَى رَأْسِي، ثُمَّ أَخَذَ بِأُذُنِي، فَجَعَلَ يَفْتِلُهَا، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4570In-book reference : Book 65, Hadith 92USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 94   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4571,
    "id": 4571,
    "url": "https://sunnah.com/bukhari:4571",
    "bookNumber": 65,
    "hadithNumber": 93,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "That once he stayed overnight (in the house) of his aunt Maimuna. the wife of the Prophet. He added: \nI lay on the cushion transversely and Allah's Messenger (ﷺ) lay along with his wife in the lengthwise \ndirection of the pillow. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit \nafter it, and then woke up rubbing the traces of sleep off his face with his hands and then he recited the \nlast ten Verses of Surat-al-`Imran, got up and went to a hanging water skin. He then performed the \nablution from it, and it was perfect ablution, and then stood up to offer the prayer. I too did the same \nas he had done, and then went to stand beside him. Allah's Messenger (ﷺ) put his right hand on my head and \nheld and twisted my right ear. He then offered two rak`at, then two rak`at, then two rak`at, then two \nrak`at, then two rak`at. then two rak`at, and finally one rak`a, the witr. Then he lay down again till the \nMuadhdhin (i.e. the call-maker) came to him, whereupon he got up and offered a light two-rak`at \nprayer, and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَهْىَ خَالَتُهُ قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَصَفَ اللَّيْلُ، أَوْ قَبْلَهُ بِقَلِيلٍ، أَوْ بَعْدَهُ بِقَلِيلٍ، ثُمَّ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدَيْهِ، ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي، فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي بِيَدِهِ الْيُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4571In-book reference : Book 65, Hadith 93USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 95   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4572,
    "id": 4572,
    "url": "https://sunnah.com/bukhari:4572",
    "bookNumber": 65,
    "hadithNumber": 94,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "That once he stayed overnight in the house of his aunt, the wife of the Prophet. He added: I lay on the \ncushion transversely while Allah's Messenger (ﷺ) lay along with his wife in the lengthwise direction of \ncushion. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit after it, and then \nwoke up rubbing the traces of sleep off his face with his hands, and then recited the last ten Verses of \nSuratal-`Imran. Then he got up and went to a hanging water skin, performed ablution from it ---- and \nperformed it perfectly. Then he stood up to perform the prayer. I also did the same as he had done and \nthen went to stand beside him. Allah's Messenger (ﷺ) put his right hand on my head and held and twisted my \nright ear. He then offered two rak`at, then two rak`at then two rak`at, then two then two rak`at, then \ntwo rak`at, and finally, one rak`a witr. Then lay down again till the Muadhdhin (i.e. the call-maker) \ncame to him, whereupon he got up and offered a light two rak`at prayer and went out (to the Mosque) \nand offered the (compulsory congregational) Fajr prayer.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَهْىَ خَالَتُهُ قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ، أَوْ قَبْلَهُ بِقَلِيلٍ، أَوْ بَعْدَهُ بِقَلِيلٍ، اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي‏.‏ قَالَ ابْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ ثُمَّ، اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4572In-book reference : Book 65, Hadith 94USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 96   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4573,
    "id": 4573,
    "url": "https://sunnah.com/bukhari:4573",
    "bookNumber": 65,
    "hadithNumber": 95,
    "narrator": "Narrated Aisha:",
    "english": "There was an orphan (girl) under the care of a man. He married her and she owned a date palm \n(garden). He married her just because of that and not because he loved her. So the Divine Verse came \nregarding his case: \"If you fear that you shall not be able to deal justly with the orphan girls...\" (4.3) \nThe sub-narrator added: I think he (i.e. another sub-narrator) said, \"That orphan girl was his partner in \nthat datepalm (garden) and in his property.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَجُلاً، كَانَتْ لَهُ يَتِيمَةٌ فَنَكَحَهَا، وَكَانَ لَهَا عَذْقٌ، وَكَانَ يُمْسِكُهَا عَلَيْهِ، وَلَمْ يَكُنْ لَهَا مِنْ نَفْسِهِ شَىْءٌ فَنَزَلَتْ فِيهِ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ أَحْسِبُهُ قَالَ كَانَتْ شَرِيكَتَهُ فِي ذَلِكَ الْعَذْقِ وَفِي مَالِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4573In-book reference : Book 65, Hadith 95USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 97   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4574,
    "id": 4574,
    "url": "https://sunnah.com/bukhari:4574",
    "bookNumber": 65,
    "hadithNumber": 96,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "That he asked `Aisha regarding the Statement of Allah: \n\"If you fear that you shall not be able to deal justly with the orphan girls...\" (4.3) She said, \"O son of \nmy sister! An Orphan girl used to be under the care of a guardian with whom she shared property. Her \nguardian, being attracted by her wealth and beauty, would intend to marry her without giving her a \njust Mahr, i.e. the same Mahr as any other person might give her (in case he married her). So such \nguardians were forbidden to do that unless they did justice to their female wards and gave them the \nhighest Mahr their peers might get. They were ordered (by Allah, to marry women of their choice \nother than those orphan girls.\" `Aisha added,\" The people asked Allah's Messenger (ﷺ) his instructions after \nthe revelation of this Divine Verse whereupon Allah revealed: \n\"They ask your instruction regarding women \" (4.127) `Aisha further said, \"And the Statement of \nAllah: \"And yet whom you desire to marry.\" (4.127) as anyone of you refrains from marrying an \norphan girl (under his guardianship) when she is lacking in property and beauty.\" `Aisha added, \"So \nthey were forbidden to marry those orphan girls for whose wealth and beauty they had a desire unless \nwith justice, and that was because they would refrain from marrying them if they were lacking in \nproperty and beauty.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِ اللَّهِ، تَعَالَى ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏‏.‏ فَقَالَتْ يَا ابْنَ أُخْتِي، هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، تَشْرَكُهُ فِي مَالِهِ وَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا، فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا، بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا، فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ، فَنُهُوا عَنْ أَنْ يَنْكِحُوهُنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ، وَيَبْلُغُوا لَهُنَّ أَعْلَى سُنَّتِهِنَّ فِي الصَّدَاقِ، فَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ وَإِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ تَعَالَى فِي آيَةٍ أُخْرَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ رَغْبَةُ أَحَدِكُمْ عَنْ يَتِيمَتِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ قَالَتْ فَنُهُوا أَنْ يَنْكِحُوا عَنْ مَنْ رَغِبُوا فِي مَالِهِ وَجَمَالِهِ فِي يَتَامَى النِّسَاءِ، إِلاَّ بِالْقِسْطِ، مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ إِذَا كُنَّ قَلِيلاَتِ الْمَالِ وَالْجَمَالِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4574In-book reference : Book 65, Hadith 96USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 98   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4575,
    "id": 4575,
    "url": "https://sunnah.com/bukhari:4575",
    "bookNumber": 65,
    "hadithNumber": 97,
    "narrator": "Narrated Aisha:",
    "english": "regarding the Statement of Allah: \"And whoever amongst the guardian is rich, he should take no \nwages, but if he is poor, let him have for himself what is just and reasonable (according to his work). \nThis Verse was revealed regarding the orphan's property. If the guardian is poor, he can take from the \nproperty of the orphan, what is just and reasonable according to his work and the time he spends on \nmanaging it.",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ فِي قَوْلِهِ تَعَالَى ‏{‏وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏ أَنَّهَا نَزَلَتْ فِي مَالِ الْيَتِيمِ إِذَا كَانَ فَقِيرًا، أَنَّهُ يَأْكُلُ مِنْهُ مَكَانَ قِيَامِهِ عَلَيْهِ، بِمَعْرُوفٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4575In-book reference : Book 65, Hadith 97USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 99   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4576,
    "id": 4576,
    "url": "https://sunnah.com/bukhari:4576",
    "bookNumber": 65,
    "hadithNumber": 98,
    "narrator": "Narrated Ikrama:",
    "english": "Ibn `Abbas said ( regarding the verse), \"And when the relatives and the orphans and the poor are \npresent at the time of division, \"this verse and its order is valid and not abrogated.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنِ الشَّيْبَانِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينُ‏}‏ قَالَ هِيَ مُحْكَمَةٌ وَلَيْسَتْ بِمَنْسُوخَةٍ‏.‏ تَابَعَهُ سَعِيدٌ عَنِ ابْنِ عَبَّاسٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4576In-book reference : Book 65, Hadith 98USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 100   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4577,
    "id": 4577,
    "url": "https://sunnah.com/bukhari:4577",
    "bookNumber": 65,
    "hadithNumber": 99,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) and Abu Bakr came on foot to pay me a visit (during my illness) at Banu Salama's \n(dwellings). The Prophet (ﷺ) found me unconscious, so he asked for water and performed the ablution \nfrom it and sprinkled some water over it. I came to my senses and said, \"O Allah's Messenger (ﷺ)! What do \nyou order me to do as regards my wealth?\" So there was revealed:-- \n\"Allah commands you as regards your children's (inheritance):\" (4.11)",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي ابْنُ مُنْكَدِرٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ عَادَنِي النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ فِي بَنِي سَلِمَةَ مَاشِيَيْنِ فَوَجَدَنِي النَّبِيُّ صلى الله عليه وسلم لاَ أَعْقِلُ، فَدَعَا بِمَاءٍ فَتَوَضَّأَ مِنْهُ، ثُمَّ رَشَّ عَلَىَّ، فَأَفَقْتُ فَقُلْتُ مَا تَأْمُرُنِي أَنْ أَصْنَعَ فِي مَالِي يَا رَسُولَ اللَّهِ فَنَزَلَتْ ‏{‏يُوصِيكُمُ اللَّهُ فِي أَوْلاَدِكُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4577In-book reference : Book 65, Hadith 99USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 101   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4578,
    "id": 4578,
    "url": "https://sunnah.com/bukhari:4578",
    "bookNumber": 65,
    "hadithNumber": 100,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(In the Pre-Islamic Period ) the children used to inherit all the property but the parents used to inherit \nonly through a will. So Allah cancelled that which He liked to cancel and put decreed that the share of \na son was to be twice the share of a daughter, and for the parents one-sixth for each one of them, or \none third, and for the wife one-eighth or one-fourth, and for the husband one-half, or one-fourth.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسَ وَالثُّلُثَ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4578In-book reference : Book 65, Hadith 100USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 102   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4579,
    "id": 4579,
    "url": "https://sunnah.com/bukhari:4579",
    "bookNumber": 65,
    "hadithNumber": 101,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "regarding the Divine Verse: \"O you who believe! You are forbidden to inherit women against their \nwill, and you should not treat them with harshness that you may take back part of the (Mahr) dower \nyou have given them.\" (4.19) (Before this revelation) if a man died, his relatives used to have the \nright to inherit his wife, and one of them could marry her if he would, or they would give her in \nmarriage if they wished, or, if they wished, they would not give her in marriage at all, and they would \nbe more entitled to dispose her, than her own relatives. So the above Verse was revealed in this \nconnection.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الشَّيْبَانِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،‏.‏ قَالَ الشَّيْبَانِيُّ وَذَكَرَهُ أَبُو الْحَسَنِ السُّوَائِيُّ وَلاَ أَظُنُّهُ ذَكَرَهُ إِلاَّ عَنِ ابْنِ عَبَّاسٍ، ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلاَ تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ‏}‏ قَالَ كَانُوا إِذَا مَاتَ الرَّجُلُ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ، إِنْ شَاءَ بَعْضُهُمْ تَزَوَّجَهَا، وَإِنْ شَاءُوا زَوَّجُوهَا، وَإِنْ شَاءُوا لَمْ يُزَوِّجُوهَا، فَهُمْ أَحَقُّ بِهَا مِنْ أَهْلِهَا، فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4579In-book reference : Book 65, Hadith 101USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 103   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4580,
    "id": 4580,
    "url": "https://sunnah.com/bukhari:4580",
    "bookNumber": 65,
    "hadithNumber": 102,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding the Verse: \"To everyone, We have appointed heirs.\" (4.33) 'Mawali' means heirs. And \nregarding:-- \"And those to whom your right hands have pledged.\" \nWhen the Emigrants came to Medina, an Emigrant used to be the heir of an Ansari with the exclusion \nof the latter's relatives, and that was because of the bond of brotherhood which the Prophet (ﷺ) had \nestablished between them (i.e. the Emigrants and the Ansar). So when the Verses:-- \"To everyone We \nhave appointed heirs.\" was revealed, (the inheritance through bond of brotherhood) was cancelled. Ibn \n`Abbas then said: \"And those to whom your right hands have pledged.\" is concerned with the \ncovenant of helping and advising each other. So allies are no longer to be the heir of each other, but \nthey can bequeath each other some of their property by means of a will.",
    "arabic": "حَدَّثَنِي الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ إِدْرِيسَ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاس ٍ ـ رضى الله عنهما ـ ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ قَالَ وَرَثَةً‏.‏ ‏{‏وَالَّذِينَ عَاقَدَتْ أَيْمَانُكُمْ‏}‏ كَانَ الْمُهَاجِرُونَ لَمَّا قَدِمُوا الْمَدِينَةَ يَرِثُ الْمُهَاجِرُ الأَنْصَارِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ فَلَمَّا نَزَلَتْ ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ نُسِخَتْ، ثُمَّ قَالَ ‏{‏وَالَّذِينَ عَاقَدَتْ أَيْمَانُكُمْ ‏}‏ مِنَ النَّصْرِ، وَالرِّفَادَةِ وَالنَّصِيحَةِ، وَقَدْ ذَهَبَ الْمِيرَاثُ وَيُوصِي لَهُ‏.‏ سَمِعَ أَبُو أُسَامَةَ إِدْرِيسَ، وَسَمِعَ إِدْرِيسُ طَلْحَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4580In-book reference : Book 65, Hadith 102USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 104   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4581,
    "id": 4581,
    "url": "https://sunnah.com/bukhari:4581",
    "bookNumber": 65,
    "hadithNumber": 103,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "During the lifetime of the Prophet (ﷺ) some people said, : O Allah's Messenger (ﷺ)! Shall we see our Lord on the \nDay of Resurrection?\" The Prophet (ﷺ) said, \"Yes; do you have any difficulty in seeing the sun at midday \nwhen it is bright and there is no cloud in the sky?\" They replied, \"No.\" He said, \"Do you have any \ndifficulty in seeing the moon on a full moon night when it is bright and there is no cloud in the sky?\" \nThey replied, \"No.\" The Prophet (ﷺ) said, \"(Similarly) you will have no difficulty in seeing Allah on the \nDay of Resurrection as you have no difficulty in seeing either of them. On the Day of Resurrection, a \ncall-maker will announce, \"Let every nation follow that which they used to worship.\" \nThen none of those who used to worship anything other than Allah like idols and other deities but will \nfall in Hell (Fire), till there will remain none but those who used to worship Allah, both those who \nwere obedient (i.e. good) and those who were disobedient (i.e. bad) and the remaining party of the \npeople of the Scripture. Then the Jews will be called upon and it will be said to them, 'Who do you use \nto worship?' They will say, 'We used to worship Ezra, the son of Allah.' It will be said to them, 'You \nare liars, for Allah has never taken anyone as a wife or a son. What do you want now?' They will say, \n'O our Lord! We are thirsty, so give us something to drink.' \nThey will be directed and addressed thus, 'Will you drink,' whereupon they will be gathered unto Hell \n(Fire) which will look like a mirage whose different sides will be destroying each other. Then they \nwill fall into the Fire. Afterwards the Christians will be called upon and it will be said to them, 'Who \ndo you use to worship?' They will say, 'We used to worship Jesus, the son of Allah.' It will be said to \nthem, 'You are liars, for Allah has never taken anyone as a wife or a son,' Then it will be said to them, \n'What do you want?' They will say what the former people have said. Then, when there remain (in the \ngathering) none but those who used to worship Allah (Alone, the real Lord of the Worlds) whether \nthey were obedient or disobedient. Then (Allah) the Lord of the worlds will come to them in a shape \nnearest to the picture they had in their minds about Him. It will be said, 'What are you waiting for?' \nEvery nation have followed what they used to worship.' They will reply, 'We left the people in the \nworld when we were in great need of them and we did not take them as friends. Now we are waiting \nfor our Lord Whom we used to worship.' Allah will say, 'I am your Lord.' They will say twice or \nthrice, 'We do not worship any besides Allah.' \"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا أَبُو عُمَرَ، حَفْصُ بْنُ مَيْسَرَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ أُنَاسًا فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم قَالُوا يَا رَسُولَ اللَّهِ، هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نَعَمْ، هَلْ تُضَارُّونَ فِي رُؤْيَةِ الشَّمْسِ بِالظَّهِيرَةِ، ضَوْءٌ لَيْسَ فِيهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ وَهَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، ضَوْءٌ لَيْسَ فِيهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا تُضَارُّونَ فِي رُؤْيَةِ اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ، إِلاَّ كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا، إِذَا كَانَ يَوْمُ الْقِيَامَةِ أَذَّنَ مُؤَذِّنٌ تَتْبَعُ كُلُّ أُمَّةٍ مَا كَانَتْ تَعْبُدُ‏.‏ فَلاَ يَبْقَى مَنْ كَانَ يَعْبُدُ غَيْرَ اللَّهِ مِنَ الأَصْنَامِ وَالأَنْصَابِ إِلاَّ يَتَسَاقَطُونَ فِي النَّارِ، حَتَّى إِذَا لَمْ يَبْقَ إِلاَّ مَنْ كَانَ يَعْبُدُ اللَّهَ، بَرٌّ أَوْ فَاجِرٌ وَغُبَّرَاتُ أَهْلِ الْكِتَابِ، فَيُدْعَى الْيَهُودُ فَيُقَالُ لَهُمْ مَنْ كُنْتُمْ تَعْبُدُونَ قَالُوا كُنَّا نَعْبُدُ عُزَيْرَ ابْنَ اللَّهِ‏.‏ فَيُقَالُ لَهُمْ كَذَبْتُمْ، مَا اتَّخَذَ اللَّهُ مِنْ صَاحِبَةٍ وَلاَ وَلَدٍ، فَمَاذَا تَبْغُونَ فَقَالُوا عَطِشْنَا رَبَّنَا فَاسْقِنَا‏.‏ فَيُشَارُ أَلاَ تَرِدُونَ، فَيُحْشَرُونَ إِلَى النَّارِ كَأَنَّهَا سَرَابٌ، يَحْطِمُ بَعْضُهَا بَعْضًا فَيَتَسَاقَطُونَ فِي النَّارِ، ثُمَّ يُدْعَى النَّصَارَى، فَيُقَالُ لَهُمْ مَنْ كُنْتُمْ تَعْبُدُونَ قَالُوا كُنَّا نَعْبُدُ الْمَسِيحَ ابْنَ اللَّهِ‏.‏ فَيُقَالُ لَهُمْ كَذَبْتُمْ، مَا اتَّخَذَ اللَّهُ مِنْ صَاحِبَةٍ وَلاَ وَلَدٍ‏.‏ فَيُقَالُ لَهُمْ مَاذَا تَبْغُونَ فَكَذَلِكَ مِثْلَ الأَوَّلِ، حَتَّى إِذَا لَمْ يَبْقَ إِلاَّ مَنْ كَانَ يَعْبُدُ اللَّهَ مِنْ بَرٍّ أَوْ فَاجِرٍ، أَتَاهُمْ رَبُّ الْعَالَمِينَ فِي أَدْنَى صُورَةٍ مِنَ الَّتِي رَأَوْهُ فِيهَا، فَيُقَالُ مَاذَا تَنْتَظِرُونَ تَتْبَعُ كُلُّ أُمَّةٍ مَا كَانَتْ تَعْبُدُ‏.‏ قَالُوا فَارَقْنَا النَّاسَ فِي الدُّنْيَا عَلَى أَفْقَرِ مَا كُنَّا إِلَيْهِمْ، وَلَمْ نُصَاحِبْهُمْ، وَنَحْنُ نَنْتَظِرُ رَبَّنَا الَّذِي كُنَّا نَعْبُدُ‏.‏ فَيَقُولُ أَنَا رَبُّكُمْ، فَيَقُولُونَ لاَ نُشْرِكُ بِاللَّهِ شَيْئًا‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4581In-book reference : Book 65, Hadith 103USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 105   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4582,
    "id": 4582,
    "url": "https://sunnah.com/bukhari:4582",
    "bookNumber": 65,
    "hadithNumber": 104,
    "narrator": "Narrated `Abdullah bin Masud:",
    "english": "Allah's Messenger (ﷺ) said to me, \"Recite (of the Qur'an) for me,\" I said, \"Shall I recite it to you although it \nhad been revealed to you?\" He said, \"I like to hear (the Qur'an) from others.\" So I recited Surat-an- \nNisa' till I reached: \"How (will it be) then when We bring from each nation a witness, and We bring \nyou (O Muhammad) as a witness against these people?\" (4.41) Then he said, \"Stop!\" And behold, his \neyes were overflowing with tears.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ يَحْيَى بَعْضُ الْحَدِيثِ عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قُلْتُ آقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ فَإِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏ فَقَرَأْتُ عَلَيْهِ سُورَةَ النِّسَاءِ حَتَّى بَلَغْتُ ‏{‏فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاَءِ شَهِيدًا‏}‏ قَالَ ‏\"‏ أَمْسِكْ ‏\"‏‏.‏ فَإِذَا عَيْنَاهُ تَذْرِفَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4582In-book reference : Book 65, Hadith 104USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 106   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4583,
    "id": 4583,
    "url": "https://sunnah.com/bukhari:4583",
    "bookNumber": 65,
    "hadithNumber": 105,
    "narrator": "Narrated `Aisha:",
    "english": "The necklace of Asma' was lost, so the Prophet (ﷺ) sent some men to look for it. The time for the prayer \nbecame due and they had not performed ablution and could not find water, so they offered the prayer \nwithout ablution. Then Allah revealed (the Verse of Tayammum).",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَلَكَتْ قِلاَدَةٌ لأَسْمَاءَ فَبَعَثَ النَّبِيُّ صلى الله عليه وسلم فِي طَلَبِهَا، رِجَالاً فَحَضَرَتِ الصَّلاَةُ وَلَيْسُوا عَلَى وُضُوءٍ‏.‏ وَلَمْ يَجِدُوا مَاءً، فَصَلَّوْا وَهُمْ عَلَى غَيْرِ وُضُوءٍ، فَأَنْزَلَ اللَّهُ‏.‏ يَعْنِي آيَةَ التَّيَمُّمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4583In-book reference : Book 65, Hadith 105USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 107   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4584,
    "id": 4584,
    "url": "https://sunnah.com/bukhari:4584",
    "bookNumber": 65,
    "hadithNumber": 106,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Verse: \"Obey Allah and Obey the Apostle and those of you (Muslims) who are in authority.\" \n(4.59) was revealed in connection with `Abdullah bin Hudhafa bin Qais bin `Adi' when the Prophet (ﷺ) \nappointed him as the commander of a Sariyya (army detachment).",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ يَعْلَى بْنِ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الأَمْرِ مِنْكُمْ‏}‏‏.‏ قَالَ نَزَلَتْ فِي عَبْدِ اللَّهِ بْنِ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ، إِذْ بَعَثَهُ النَّبِيُّ صلى الله عليه وسلم فِي سَرِيَّةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4584In-book reference : Book 65, Hadith 106USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 108   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4585,
    "id": 4585,
    "url": "https://sunnah.com/bukhari:4585",
    "bookNumber": 65,
    "hadithNumber": 107,
    "narrator": "Narrated `Urwa:",
    "english": "Az-Zubair quarrelled with a man from the Ansar because of a natural mountainous stream at Al-Harra. \nThe Prophet (ﷺ) said \"O Zubair! Irrigate (your lands and the let the water flow to your neighbor The \nAnsar said, \"O Allah's Messenger (ﷺ) (This is because) he (Zubair) is your cousin?\" At that, the Prophet's \nface became red (with anger) and he said \"O Zubair! Irrigate (your land) and then withhold the water \ntill it fills the land up to the walls and then let it flow to your neighbor.\" So the Prophet (ﷺ) enabled Az- \nZubair to take his full right after the Ansari provoked his anger. The Prophet (ﷺ) had previously given a \norder that was in favor of both of them Az-Zubair said, \"I don't think but the Verse was revealed in \nthis connection: \"But no, by your Lord, they can have no faith, until they make you judge in all \ndisputes between them.\" (4.65)",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، قَالَ خَاصَمَ الزُّبَيْرُ رَجُلاً مِنَ الأَنْصَارِ فِي شَرِيجٍ مِنَ الْحَرَّةِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ‏\"‏‏.‏ فَقَالَ الأَنْصَارِيُّ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُهُ ثُمَّ قَالَ ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ، ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ‏\"‏‏.‏ وَاسْتَوْعَى النَّبِيُّ صلى الله عليه وسلم لِلزُّبَيْرِ حَقَّهُ فِي صَرِيحِ الْحُكْمِ حِينَ أَحْفَظَهُ الأَنْصَارِيُّ، كَانَ أَشَارَ عَلَيْهِمَا بِأَمْرٍ لَهُمَا فِيهِ سَعَةٌ‏.‏ قَالَ الزُّبَيْرُ فَمَا أَحْسِبُ هَذِهِ الآيَاتِ إِلاَّ نَزَلَتْ فِي ذَلِكَ ‏{‏فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4585In-book reference : Book 65, Hadith 107USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 109   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4586,
    "id": 4586,
    "url": "https://sunnah.com/bukhari:4586",
    "bookNumber": 65,
    "hadithNumber": 108,
    "narrator": "Narrated `Aisha:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"No prophet gets sick but he is given the choice to select either this \nworld or the Hereafter.\" `Aisha added: During his fatal illness, his voice became very husky and I \nheard him saying: \"In the company of those whom is the Grace of Allah, of the prophets, the Siddiqin \n(those followers of the prophets who were first and foremost to believe in them), the martyrs and the \npious.' (4.69) And from this I came to know that he has been given the option.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ نَبِيٍّ يَمْرَضُ إِلاَّ خُيِّرَ بَيْنَ الدُّنْيَا وَالآخِرَةِ ‏\"‏‏.‏ وَكَانَ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ أَخَذَتْهُ بُحَّةٌ شَدِيدَةٌ فَسَمِعْتُهُ يَقُولُ ‏{‏مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ‏}‏ فَعَلِمْتُ أَنَّهُ خُيِّرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4586In-book reference : Book 65, Hadith 108USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 110   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4587,
    "id": 4587,
    "url": "https://sunnah.com/bukhari:4587",
    "bookNumber": 65,
    "hadithNumber": 109,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "My mother and I were among the weak and oppressed (Muslims at Mecca).",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ كُنْتُ أَنَا وَأُمِّي، مِنَ الْمُسْتَضْعَفِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4587In-book reference : Book 65, Hadith 109USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 111   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4588,
    "id": 4588,
    "url": "https://sunnah.com/bukhari:4588",
    "bookNumber": 65,
    "hadithNumber": 110,
    "narrator": "Narrated Ibn Abi Mulaika:",
    "english": "Ibn `Abbas recited:-- \"Except the weak ones among men women and children,\" (4.98) and said, \"My \nmother and I were among those whom Allah had excused.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ ابْنَ عَبَّاسٍ، تَلاَ ‏{‏ِلاَّ الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ‏}‏ قَالَ كُنْتُ أَنَا وَأُمِّي مِمَّنْ عَذَرَ اللَّهُ‏.‏ وَيُذْكَرُ عَنِ ابْنِ عَبَّاسٍ ‏{‏حَصِرَتْ‏}‏ ضَاقَتْ ‏{‏تَلْوُوا‏}‏ أَلْسِنَتَكُمْ بِالشَّهَادَةِ‏.‏ وَقَالَ غَيْرُهُ الْمُرَاغَمُ الْمُهَاجَرُ‏.‏ رَاغَمْتُ هَاجَرْتُ قَوْمِي‏.‏ ‏{‏مَوْقُوتًا‏}‏ مُوَقَّتًا وَقْتَهُ عَلَيْهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4588In-book reference : Book 65, Hadith 110USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 112   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4589,
    "id": 4589,
    "url": "https://sunnah.com/bukhari:4589",
    "bookNumber": 65,
    "hadithNumber": 111,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "Regarding the Verse:-- \"Then what is the matter with you that you are divided into two parties about \nthe hypocrites?\" (4.88) Some of the companions of the Prophet (ﷺ) returned from the battle of Uhud (i.e. \nrefused to fight) whereupon the Muslims got divided into two parties; one of them was in favor of \ntheir execution and the other was not in favour of it. So there ware revealed: \"Then what is the matter \nwith you that you are divided into two parties about the hypocrites?\" (4.88). Then the Prophet (ﷺ) said \n\"It (i.e. Medina) is aTayyaboh (good), it expels impurities as the fire expels the impurities of silver.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، وَعَبْدُ الرَّحْمَنِ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ زَيْدِ بْنِ ثَابِت ٍ ـ رضى الله عنه ـ ‏{‏فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ‏}‏ رَجَعَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْ أُحُدٍ، وَكَانَ النَّاسُ فِيهِمْ فِرْقَتَيْنِ فَرِيقٌ يَقُولُ اقْتُلْهُمْ‏.‏ وَفَرِيقٌ يَقُولُ لاَ فَنَزَلَتْ ‏{‏فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ‏}‏ وَقَالَ ‏\"‏ إِنَّهَا طَيْبَةُ تَنْفِي الْخَبَثَ كَمَا تَنْفِي النَّارُ خَبَثَ الْفِضَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4589In-book reference : Book 65, Hadith 111USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 113   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4590,
    "id": 4590,
    "url": "https://sunnah.com/bukhari:4590",
    "bookNumber": 65,
    "hadithNumber": 112,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "The people of Kufa disagreed (disputed) about the above Verse. So I went to Ibn `Abbas and asked \nhim about it. He said, \"This Verse:-- \"And whoever kills a believer intentionally, his recompense is \nHell.\" was revealed last of all (concerning premeditated murder) and nothing abrogated it.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ ‏{‏آيَةٌ‏}‏ اخْتَلَفَ فِيهَا أَهْلُ الْكُوفَةِ، فَرَحَلْتُ فِيهَا إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ عَنْهَا فَقَالَ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ‏}‏ هِيَ آخِرُ مَا نَزَلَ وَمَا نَسَخَهَا شَىْءٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4590In-book reference : Book 65, Hadith 112USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 114   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4591,
    "id": 4591,
    "url": "https://sunnah.com/bukhari:4591",
    "bookNumber": 65,
    "hadithNumber": 113,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding the Verse: \"And say not to anyone who offers you peace (by accepting Islam), You are not \na believer.\" There was a man amidst his sheep. The Muslims pursued him, and he said (to them) \n\"Peace be on you.\" But they killed him and took over his sheep. Thereupon Allah revealed in that \nconcern, the above Verse up to:-- \"...seeking the perishable good of this life.\" (4.94) i.e. those sheep.",
    "arabic": "حَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏وَلاَ تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلاَمَ لَسْتَ مُؤْمِنًا‏}‏‏.‏ قَالَ قَالَ ابْنُ عَبَّاسٍ كَانَ رَجُلٌ فِي غُنَيْمَةٍ لَهُ فَلَحِقَهُ الْمُسْلِمُونَ فَقَالَ السَّلاَمُ عَلَيْكُمْ، فَقَتَلُوهُ وَأَخَذُوا غُنَيْمَتَهُ، فَأَنْزَلَ اللَّهُ فِي ذَلِكَ إِلَى قَوْلِهِ ‏{‏عَرَضَ الْحَيَاةِ الدُّنْيَا‏}‏ تِلْكَ الْغُنَيْمَةُ‏.‏ قَالَ قَرَأَ ابْنُ عَبَّاسٍ السَّلاَمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4591In-book reference : Book 65, Hadith 113USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 115   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4592,
    "id": 4592,
    "url": "https://sunnah.com/bukhari:4592",
    "bookNumber": 65,
    "hadithNumber": 114,
    "narrator": "Narrated Zaid bin Thabit:",
    "english": "That the Prophet (ﷺ) dictated to him: \"Not equal are those of the believers who sit (at home) and those \nwho strive and fight in the Cause of Allah.\" \nZaid added: Ibn Um Maktum came while the Prophet (ﷺ) was dictating to me and said, \"O Allah's \nApostle! By Allah, if I had the power to fight (in Allah's Cause), I would,\" and he was a blind man. So \nAllah revealed to his Apostle while his thigh was on my thigh, and his thigh became so heavy that I \nwas afraid it might fracture my thigh. Then that state of the Prophet (ﷺ) passed and Allah revealed:-- \n\"Except those who are disabled (by injury or are blind or lame etc).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ، أَنَّهُ رَأَى مَرْوَانَ بْنَ الْحَكَمِ فِي الْمَسْجِدِ، فَأَقْبَلْتُ حَتَّى جَلَسْتُ إِلَى جَنْبِهِ، فَأَخْبَرَنَا أَنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمْلَى عَلَيْهِ لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ فَجَاءَهُ ابْنُ أُمِّ مَكْتُومٍ وَهْوَ يُمِلُّهَا عَلَىَّ قَالَ يَا رَسُولَ اللَّهِ، وَاللَّهِ لَوْ أَسْتَطِيعُ الْجِهَادَ لَجَاهَدْتُ ـ وَكَانَ أَعْمَى ـ فَأَنْزَلَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم وَفَخِذُهُ عَلَى فَخِذِي، فَثَقُلَتْ عَلَىَّ حَتَّى خِفْتُ أَنْ تُرَضَّ فَخِذِي، ثُمَّ سُرِّيَ عَنْهُ، فَأَنْزَلَ اللَّهُ ‏{‏غَيْرَ أُولِي الضَّرَرِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4592In-book reference : Book 65, Hadith 114USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 116   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4593,
    "id": 4593,
    "url": "https://sunnah.com/bukhari:4593",
    "bookNumber": 65,
    "hadithNumber": 115,
    "narrator": "Narrated Al-Bara:",
    "english": "When the Verse:-- \"Not equal are those of the believers who sit (at home)\" (4.95) was revealed, \nAllah Apostle called for Zaid who wrote it. In the meantime Ibn Um Maktum came and complained of \nhis blindness, so Allah revealed: \"Except those who are disabled (by injury or are blind or lame...\" \netc.) (4.95)",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْدًا فَكَتَبَهَا، فَجَاءَ ابْنُ أُمِّ مَكْتُومٍ فَشَكَا ضَرَارَتَهُ، فَأَنْزَلَ اللَّهُ ‏{‏غَيْرَ أُولِي الضَّرَرِ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4593In-book reference : Book 65, Hadith 115USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 117   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4594,
    "id": 4594,
    "url": "https://sunnah.com/bukhari:4594",
    "bookNumber": 65,
    "hadithNumber": 116,
    "narrator": "Narrated Al-Bara:",
    "english": "When the Verse:--\"Not equal are those of the believers who sit (at home),\" (4.95) was revealed, the \nProphet said, \"Call so-and-so.\" That person came to him with an ink-pot and a wooden board or a \nshoulder scapula bone. The Prophet (ﷺ) said (to him), \"Write: 'Not equal are those believers who sit (at \nhome) and those who strive and fight in the Cause of Allah.\" Ibn Um Maktum who was sitting behind \nthe Prophet (ﷺ) then said, \"O Allah's Messenger (ﷺ)! I am a blind man.\" So there was revealed in the place of \nthat Verse, the Verse:--\"Not equal are those of the believers who sit (at home) except those who are \ndisabled (by injury, or are blind or lame etc.) and those who strive and fight in the Cause of Allah.\" \n(4.95)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا نَزَلَتْ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ادْعُوا فُلاَنًا ‏\"‏‏.‏ فَجَاءَهُ وَمَعَهُ الدَّوَاةُ وَاللَّوْحُ أَوِ الْكَتِفُ فَقَالَ ‏\"‏ اكْتُبْ لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ وَخَلْفَ النَّبِيِّ صلى الله عليه وسلم ابْنُ أُمِّ مَكْتُومٍ فَقَالَ يَا رَسُولَ اللَّهِ أَنَا ضَرِيرٌ‏.‏ فَنَزَلَتْ مَكَانَهَا ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4594In-book reference : Book 65, Hadith 116USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 118   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4595,
    "id": 4595,
    "url": "https://sunnah.com/bukhari:4595",
    "bookNumber": 65,
    "hadithNumber": 117,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Not equal are those believers who sat (at home) and did not join the Badr battle and those who joined \nthe Badr battle.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ ح، وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْكَرِيمِ، أَنَّ مِقْسَمًا، مَوْلَى عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ عَنْ بَدْرٍ وَالْخَارِجُونَ إِلَى بَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4595In-book reference : Book 65, Hadith 117USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 119   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4596,
    "id": 4596,
    "url": "https://sunnah.com/bukhari:4596",
    "bookNumber": 65,
    "hadithNumber": 118,
    "narrator": "Narrated Muhammad bin `Abdur-Rahman Abu Al-Aswad:",
    "english": "The people of Medina were forced to prepare an army (to fight against the people of Sham during the \ncaliphate of `Abdullah bin Az-Zubair at Mecca), and I was enlisted in it; Then I met `Ikrima, the freed \nslave of Ibn `Abbas, and informed him (about it), and he forbade me strongly to do so (i.e. to enlist in \nthat army), and then said, \"Ibn `Abbas informed me that some Muslim people were with the pagans, \nincreasing the number of the pagans against Allah's Messenger (ﷺ). An arrow used to be shot which would \nhit one of them (the Muslims in the company of the pagans) and kill him, or he would be struck and \nkilled (with a sword).\" Then Allah revealed:-- \n\"Verily! as for those whom the angels take (in death) while they are wronging themselves (by staying \namong the disbelievers)\" (4.97) Abu AlAswad also narrated it.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، وَغَيْرُهُ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو الأَسْوَدِ، قَالَ قُطِعَ عَلَى أَهْلِ الْمَدِينَةِ بَعْثٌ فَاكْتُتِبْتُ فِيهِ، فَلَقِيتُ عِكْرِمَةَ مَوْلَى ابْنِ عَبَّاسٍ فَأَخْبَرْتُهُ، فَنَهَانِي عَنْ ذَلِكَ أَشَدَّ النَّهْىِ، ثُمَّ قَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ نَاسًا مِنَ الْمُسْلِمِينَ كَانُوا مَعَ الْمُشْرِكِينَ يُكَثِّرُونَ سَوَادَ الْمُشْرِكِينَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِي السَّهْمُ فَيُرْمَى بِهِ، فَيُصِيبُ أَحَدَهُمْ فَيَقْتُلُهُ أَوْ يُضْرَبُ فَيُقْتَلُ، فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلاَئِكَةُ ظَالِمِي أَنْفُسِهِمْ‏}‏ الآيَةَ‏.‏ رَوَاهُ اللَّيْثُ عَنْ أَبِي الأَسْوَدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4596In-book reference : Book 65, Hadith 118USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 120   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4597,
    "id": 4597,
    "url": "https://sunnah.com/bukhari:4597",
    "bookNumber": 65,
    "hadithNumber": 119,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "'\"Except the weak ones\" (4.98) and added: My mother was one of those whom Allah excused.",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏إِلاَّ الْمُسْتَضْعَفِينَ‏}‏ قَالَ كَانَتْ أُمِّي مِمَّنْ عَذَرَ اللَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4597In-book reference : Book 65, Hadith 119USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 121   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4598,
    "id": 4598,
    "url": "https://sunnah.com/bukhari:4598",
    "bookNumber": 65,
    "hadithNumber": 120,
    "narrator": "Narrated Abu Huraira:",
    "english": "While the Prophet (ﷺ) was offering the `Isha' prayer, he said, \"Allah hears him who sends his praises to \nHim,\" and then said before falling in prostration, \"O Allah, save `Aiyash bin Rabi`a. O Allah, save \nSalama bin Hisham. O Allah, save Al-Walid bin Al-Wahd. O Allah, save the weak ones among the \nbelievers. O Allah, let Your punishment be severe on the tribe of Mudar. O Allah, inflict upon them \nyears (of famine) like the years of Joseph.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الْعِشَاءَ إِذْ قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ ثُمَّ قَالَ قَبْلَ أَنْ يَسْجُدَ ‏\"‏ اللَّهُمَّ نَجِّ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ نَجِّ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ نَجِّ الْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ نَجِّ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4598In-book reference : Book 65, Hadith 120USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 122   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4599,
    "id": 4599,
    "url": "https://sunnah.com/bukhari:4599",
    "bookNumber": 65,
    "hadithNumber": 121,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Regarding the Verse: \"Because of the inconvenience of rain or because you are ill.\" (4.102) (It was \nrevealed in connection with) `Abdur-Rahman bin `Auf who was wounded.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى‏}‏ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفِ كَانَ جَرِيحًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4599In-book reference : Book 65, Hadith 121USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 123   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4600,
    "id": 4600,
    "url": "https://sunnah.com/bukhari:4600",
    "bookNumber": 65,
    "hadithNumber": 122,
    "narrator": "Narrated `Aisha:",
    "english": "Regarding the Verse:--\"They ask your instruction concerning the women. Say: Allah instructs you \nabout them and yet whom you desire to marry.\" (4.127) (has been revealed regarding the case of) a \nman who has an orphan girl, and he is her guardian and her heir. The girl shares with him all his \nproperty, even a date-palm (garden), but he dislikes to marry her and dislikes to give her in marriage \nto somebody else who would share with him the property she is sharing with him, and for this reason \nthat guardian prevents that orphan girl from marrying. So, this Verse was revealed: (And Allah's \nstatement:) \"If a woman fears cruelty or desertion on her husband's part.\" (4.128)",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ إِلَى قَوْلِهِ ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏‏.‏ قَالَتْ هُوَ الرَّجُلُ تَكُونُ عِنْدَهُ الْيَتِيمَةُ، هُوَ وَلِيُّهَا وَوَارِثُهَا، فَأَشْرَكَتْهُ فِي مَالِهِ حَتَّى فِي الْعِذْقِ، فَيَرْغَبُ أَنْ يَنْكِحَهَا، وَيَكْرَهُ أَنْ يُزَوِّجَهَا رَجُلاً، فَيَشْرَكُهُ فِي مَالِهِ بِمَا شَرِكَتْهُ فَيَعْضُلَهَا فَنَزَلَتْ هَذِهِ الآيَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4600In-book reference : Book 65, Hadith 122USC-MSA web (English) reference : Vol. 6, Book 60, Hadith 124   (deprecated numbering scheme)"
  }
]