[
  {
    "hadithGlobalNumber": 4101,
    "id": 4101,
    "url": "https://sunnah.com/bukhari:4101",
    "bookNumber": 64,
    "hadithNumber": 145,
    "narrator": "Narrated Jabir:",
    "english": "We were digging (the trench) on the day of (Al-Khandaq ( i.e. Trench )) and we came across a big \nsolid rock. We went to the Prophet (ﷺ) and said, \"Here is a rock appearing across the trench.\" He said, \"I \nam coming down.\" Then he got up, and a stone was tied to his belly for we had not eaten anything for \nthree days. So the Prophet (ﷺ) took the spade and struck the big solid rock and it became like sand. I said, \n\"O Allah's Messenger (ﷺ)! Allow me to go home.\" (When the Prophet (ﷺ) allowed me) I said to my wife, \"I saw \nthe Prophet (ﷺ) in a state that I cannot treat lightly. Have you got something (for him to eat?\" She replied, \n\"I have barley and a she goat.\" So I slaughtered the she-kid and she ground the barley; then we put the \nmeat in the earthenware cooking pot. Then I came to the Prophet (ﷺ) when the dough had become soft and \nfermented and (the meat in) the pot over the stone trivet had nearly been well-cooked, and said, \"I \nhave got a little food prepared, so get up O Allah's Messenger (ﷺ), you and one or two men along with you \n(for the food).\" \nThe Prophet (ﷺ) asked, \"How much is that food?\" I told him about it. He said, \"It is abundant and good. \nTell your wife not to remove the earthenware pot from the fire and not to take out any bread from the \noven till I reach there.\" Then he said (to all his companions), \"Get up.\" So the Muhajirn (i.e. \nEmigrants) and the Ansar got up. When I came to my wife, I said, \"Allah's Mercy be upon you! The \nProphet came along with the Muhajirin and the Ansar and those who were present with them.\" She \nsaid, \"Did the Prophet (ﷺ) ask you (how much food you had)?\" I replied, \"Yes.\" Then the Prophet (ﷺ) said, \n\"Enter and do not throng.\" The Prophet (ﷺ) started cutting the bread (into pieces) and put the cooked meat \nover it. He covered the earthenware pot and the oven whenever he took something out of them. He \nwould give the food to his companions and take the meat out of the pot. He went on cutting the bread \nand scooping the meat (for his companions) till they all ate their fill, and even then, some food \nremained. Then the Prophet (ﷺ) said (to my wife), \"Eat and present to others as the people are struck with \nhunger.\"",
    "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ جَابِرًا ـ رضى الله عنه ـ فَقَالَ إِنَّا يَوْمَ الْخَنْدَقِ نَحْفِرُ فَعَرَضَتْ كُدْيَةٌ شَدِيدَةٌ، فَجَاءُوا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا هَذِهِ كُدْيَةٌ عَرَضَتْ فِي الْخَنْدَقِ، فَقَالَ ‏\"‏ أَنَا نَازِلٌ ‏\"‏‏.‏ ثُمَّ قَامَ وَبَطْنُهُ مَعْصُوبٌ بِحَجَرٍ، وَلَبِثْنَا ثَلاَثَةَ أَيَّامٍ لاَ نَذُوقُ ذَوَاقًا، فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم الْمِعْوَلَ فَضَرَبَ، فَعَادَ كَثِيبًا أَهْيَلَ أَوْ أَهْيَمَ، فَقُلْتُ يَا رَسُولَ اللَّهِ ائْذَنْ لِي إِلَى الْبَيْتِ‏.‏ فَقُلْتُ لاِمْرَأَتِي رَأَيْتُ بِالنَّبِيِّ صلى الله عليه وسلم شَيْئًا، مَا كَانَ فِي ذَلِكَ صَبْرٌ، فَعِنْدَكِ شَىْءٌ قَالَتْ عِنْدِي شَعِيرٌ وَعَنَاقٌ‏.‏ فَذَبَحْتُ الْعَنَاقَ وَطَحَنَتِ الشَّعِيرَ، حَتَّى جَعَلْنَا اللَّحْمَ فِي الْبُرْمَةِ، ثُمَّ جِئْتُ النَّبِيَّ صلى الله عليه وسلم وَالْعَجِينُ قَدِ انْكَسَرَ، وَالْبُرْمَةُ بَيْنَ الأَثَافِيِّ قَدْ كَادَتْ أَنْ تَنْضَجَ فَقُلْتُ طُعَيِّمٌ لِي، فَقُمْ أَنْتَ يَا رَسُولَ اللَّهِ وَرَجُلٌ أَوْ رَجُلاَنِ‏.‏ قَالَ ‏\"‏ كَمْ هُوَ ‏\"‏‏.‏ فَذَكَرْتُ لَهُ، قَالَ ‏\"‏ كَثِيرٌ طَيِّبٌ ‏\"‏‏.‏ قَالَ ‏\"‏ قُلْ لَهَا لاَ تَنْزِعُ الْبُرْمَةَ وَلاَ الْخُبْزَ مِنَ التَّنُّورِ حَتَّى آتِيَ ‏\"‏‏.‏ فَقَالَ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَقَامَ الْمُهَاجِرُونَ وَالأَنْصَارُ، فَلَمَّا دَخَلَ عَلَى امْرَأَتِهِ قَالَ وَيْحَكِ جَاءَ النَّبِيُّ صلى الله عليه وسلم بِالْمُهَاجِرِينَ وَالأَنْصَارِ وَمَنْ مَعَهُمْ‏.‏ قَالَتْ هَلْ سَأَلَكَ قُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ ادْخُلُوا وَلاَ تَضَاغَطُوا ‏\"‏‏.‏ فَجَعَلَ يَكْسِرُ الْخُبْزَ وَيَجْعَلُ عَلَيْهِ اللَّحْمَ، وَيُخَمِّرُ الْبُرْمَةَ وَالتَّنُّورَ إِذَا أَخَذَ مِنْهُ، وَيُقَرِّبُ إِلَى أَصْحَابِهِ ثُمَّ يَنْزِعُ، فَلَمْ يَزَلْ يَكْسِرُ الْخُبْزَ وَيَغْرِفُ حَتَّى شَبِعُوا وَبَقِيَ بَقِيَّةٌ قَالَ ‏\"‏ كُلِي هَذَا وَأَهْدِي، فَإِنَّ النَّاسَ أَصَابَتْهُمْ مَجَاعَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4101In-book reference : Book 64, Hadith 145USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 427   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4102,
    "id": 4102,
    "url": "https://sunnah.com/bukhari:4102",
    "bookNumber": 64,
    "hadithNumber": 146,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "When the Trench was dug, I saw the Prophet (ﷺ) in the state of severe hunger. So I returned to my wife \nand said, \"Have you got anything (to eat), for I have seen Allah's Messenger (ﷺ) in a state of severe hunger.\" \nShe brought out for me, a bag containing one Sa of barley, and we had a domestic she animal (i.e. a \nkid) which I slaughtered then, and my wife ground the barley and she finished at the time I finished \nmy job (i.e. slaughtering the kid). Then I cut the meat into pieces and put it in an earthenware \n(cooking) pot, and returned to Allah's Messenger (ﷺ) . My wife said, \"Do not disgrace me in front of Allah's \nApostle and those who are with him.\" So I went to him and said to him secretly, \"O Allah's Messenger (ﷺ)! I \nhave slaughtered a she-animal (i.e. kid) of ours, and we have ground a Sa of barley which was with us. \nSo please come, you and another person along with you.\" The Prophet (ﷺ) raised his voice and said, \"O \npeople of Trench ! Jabir has prepared a meal so let us go.\" Allah's Messenger (ﷺ) said to me, \"Don't put \ndown your earthenware meat pot (from the fireplace) or bake your dough till I come.\" So I came (to \nmy house) and Allah's Messenger (ﷺ) too, came, proceeding before the people. When I came to my wife, she \nsaid, \"May Allah do so-and-so to you.\" I said, \"I have told the Prophet (ﷺ) of what you said.\" Then she \nbrought out to him (i.e. the Prophet (ﷺ) the dough, and he spat in it and invoked for Allah's Blessings in it. \nThen he proceeded towards our earthenware meat-pot and spat in it and invoked for Allah's Blessings \nin it. Then he said (to my wife). Call a lady-baker to bake along with you and keep on taking out \nscoops from your earthenware meat-pot, and do not put it down from its fireplace.\" They were onethousand \n(who took their meals), and by Allah they all ate, and when they left the food and went \naway, our earthenware pot was still bubbling (full of meat) as if it had not decreased, and our dough \nwas still being baked as if nothing had been taken from it.",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، أَخْبَرَنَا سَعِيدُ بْنُ مِينَاءَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا حُفِرَ الْخَنْدَقُ رَأَيْتُ بِالنَّبِيِّ صلى الله عليه وسلم خَمَصًا شَدِيدًا، فَانْكَفَأْتُ إِلَى امْرَأَتِي فَقُلْتُ هَلْ عِنْدَكِ شَىْءٌ فَإِنِّي رَأَيْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم خَمَصًا شَدِيدًا‏.‏ فَأَخْرَجَتْ إِلَىَّ جِرَابًا فِيهِ صَاعٌ مِنْ شَعِيرٍ، وَلَنَا بُهَيْمَةٌ دَاجِنٌ فَذَبَحْتُهَا، وَطَحَنَتِ الشَّعِيرَ فَفَرَغَتْ إِلَى فَرَاغِي، وَقَطَّعْتُهَا فِي بُرْمَتِهَا، ثُمَّ وَلَّيْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لاَ تَفْضَحْنِي بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِمَنْ مَعَهُ‏.‏ فَجِئْتُهُ فَسَارَرْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ ذَبَحْنَا بُهَيْمَةً لَنَا وَطَحَنَّا صَاعًا مِنْ شَعِيرٍ كَانَ عِنْدَنَا، فَتَعَالَ أَنْتَ وَنَفَرٌ مَعَكَ‏.‏ فَصَاحَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَهْلَ الْخَنْدَقِ، إِنَّ جَابِرًا قَدْ صَنَعَ سُورًا فَحَىَّ هَلاً بِكُمْ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُنْزِلُنَّ بُرْمَتَكُمْ، وَلاَ تَخْبِزُنَّ عَجِينَكُمْ حَتَّى أَجِيءَ ‏\"‏‏.‏ فَجِئْتُ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْدُمُ النَّاسَ حَتَّى جِئْتُ امْرَأَتِي، فَقَالَتْ بِكَ وَبِكَ‏.‏ فَقُلْتُ قَدْ فَعَلْتُ الَّذِي قُلْتِ‏.‏ فَأَخْرَجَتْ لَهُ عَجِينًا، فَبَصَقَ فِيهِ وَبَارَكَ، ثُمَّ عَمَدَ إِلَى بُرْمَتِنَا فَبَصَقَ وَبَارَكَ ثُمَّ قَالَ ‏\"‏ ادْعُ خَابِزَةً فَلْتَخْبِزْ مَعِي وَاقْدَحِي مِنْ بُرْمَتِكُمْ وَلاَ تُنْزِلُوهَا‏\"‏، وَهُمْ أَلْفٌ، فَأُقْسِمُ بِاللَّهِ لَقَدْ أَكَلُوا حَتَّى تَرَكُوهُ وَانْحَرَفُوا، وَإِنَّ بُرْمَتَنَا لَتَغِطُّ كَمَا هِيَ، وَإِنَّ عَجِينَنَا لَيُخْبَزُ كَمَا هُوَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4102In-book reference : Book 64, Hadith 146USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 428   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4103,
    "id": 4103,
    "url": "https://sunnah.com/bukhari:4103",
    "bookNumber": 64,
    "hadithNumber": 147,
    "narrator": "Narrated `Aisha:",
    "english": "As regards the following Qur'anic Verse:-- \"When they came on you from above and from below you \n(from east and west of the valley) and when the eyes grew wild and the hearts reached up to the \nthroats.....\" (33.10) That happened on the day of Al-Khandaq (i.e. Trench).",
    "arabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها ‏{‏إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الأَبْصَارُ‏}‏ قَالَتْ كَانَ ذَاكَ يَوْمَ الْخَنْدَقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4103In-book reference : Book 64, Hadith 147USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 429   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4104,
    "id": 4104,
    "url": "https://sunnah.com/bukhari:4104",
    "bookNumber": 64,
    "hadithNumber": 148,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) was carrying earth on the day of Al-Khandaq till his `Abdomen was fully covered with \ndust, and he was saying, \"By Allah, without Allah we would not have been guided, neither would we \nhave given in charity, nor would we have prayed. So (O Allah), please send Sakina (i.e. calmness) \nupon us, and make our feet firm if we meet the enemy as the enemy have rebelled against us, and if \nthey intended affliction, (i.e. want to frighten us and fight against us then we would not flee but \nwithstand them).\" The Prophet (ﷺ) used to raise his voice saying, \"Abaina! Abaina! (i.e. would not, we \nwould not).",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَنْقُلُ التُّرَابَ يَوْمَ الْخَنْدَقِ حَتَّى أَغْمَرَ بَطْنَهُ أَوِ اغْبَرَّ بَطْنُهُ يَقُولُ وَاللَّهِ لَوْلاَ اللَّهُ مَا اهْتَدَيْنَا وَلاَ تَصَدَّقْنَا وَلاَ صَلَّيْنَا فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا إِنَّ الأُلَى قَدْ بَغَوْا عَلَيْنَا إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا وَرَفَعَ بِهَا صَوْتَهُ أَبَيْنَا أَبَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4104In-book reference : Book 64, Hadith 148USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 430   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4105,
    "id": 4105,
    "url": "https://sunnah.com/bukhari:4105",
    "bookNumber": 64,
    "hadithNumber": 149,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"I have been made victorious by As-Saba (i.e. an easterly wind) and the Ad nation \nwas destroyed by Ad-Dabur (i.e. a westerly wind).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي الْحَكَمُ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رَضِيَ الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4105In-book reference : Book 64, Hadith 149USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 431   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4106,
    "id": 4106,
    "url": "https://sunnah.com/bukhari:4106",
    "bookNumber": 64,
    "hadithNumber": 150,
    "narrator": "Narrated Al-Bara:",
    "english": "When it was the day of Al-Ahzab (i.e. the clans) and Allah's Messenger (ﷺ) dug the trench, I saw him \ncarrying earth out of the trench till dust made the skin of his `Abdomen out of my sight and he was a \nhairy man. I heard him reciting the poetic verses composed by Ibn Rawaha while he was carrying the \nearth, \"O Allah! Without You we would not have been guided, nor would we have given in charity, \nnor would we have prayed. So, (O Allah), please send Sakina (i.e. calmness) upon us and make our \nfeet firm if we meet the enemy, as they have rebelled against us. And if they intend affliction (i.e. \nwant to frighten us, and fight against us) then we would not (flee but withstand them).\" The Prophet (ﷺ) \nwould then prolong his voice at the last words.",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ يُوسُفَ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يُحَدِّثُ قَالَ لَمَّا كَانَ يَوْمُ الأَحْزَابِ، وَخَنْدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأَيْتُهُ يَنْقُلُ مِنْ تُرَابِ الْخَنْدَقِ حَتَّى وَارَى عَنِّي الْغُبَارُ جِلْدَةَ بَطْنِهِ، وَكَانَ كَثِيرَ الشَّعَرِ، فَسَمِعْتُهُ يَرْتَجِزُ بِكَلِمَاتِ ابْنِ رَوَاحَةَ، وَهْوَ يَنْقُلُ مِنَ التُّرَابِ يَقُولُ اللَّهُمَّ لَوْلاَ أَنْتَ مَا اهْتَدَيْنَا وَلاَ تَصَدَّقْنَا وَلاَ صَلَّيْنَا فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا إِنَّ الأُلَى قَدْ بَغَوْا عَلَيْنَا وَإِنْ أَرَادُوا فِتْنَةً أَبَيْنَا قَالَ ثُمَّ يَمُدُّ صَوْتَهُ بِآخِرِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4106In-book reference : Book 64, Hadith 150USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 432   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4107,
    "id": 4107,
    "url": "https://sunnah.com/bukhari:4107",
    "bookNumber": 64,
    "hadithNumber": 151,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The first day (i.e. Ghazwa) I participated in, was the day of Al-Khandaq (i.e. Trench).",
    "arabic": "حَدَّثَنِي عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، عَنْ عَبْدِ الرَّحْمَنِ ـ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ ـ عَنْ أَبِيهِ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَوَّلُ يَوْمٍ شَهِدْتُهُ يَوْمُ الْخَنْدَقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4107In-book reference : Book 64, Hadith 151USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 433   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4108,
    "id": 4108,
    "url": "https://sunnah.com/bukhari:4108",
    "bookNumber": 64,
    "hadithNumber": 152,
    "narrator": "Narrated `Ikrima bin Khalid:",
    "english": "Ibn `Umar said, \"I went to Hafsa while water was dribbling from her twined braids. I said, 'The \ncondition of the people is as you see, and no authority has been given to me.' Hafsa said, (to me), 'Go \nto them, and as they (i.e. the people) are waiting for you, and I am afraid your absence from them will \nproduce division amongst them.' \" So Hafsa did not leave Ibn `Umar till we went to them. When the \npeople differed. Muawiya addressed the people saying, \"'If anybody wants to say anything in this \nmatter of the Caliphate, he should show up and not conceal himself, for we are more rightful to be a \nCaliph than he and his father.\" On that, Habib bin Masalama said (to Ibn `Umar), \"Why don't you \nreply to him (i.e. Muawiya)?\" `Abdullah bin `Umar said, \"I untied my garment that was going round \nmy back and legs while I was sitting and was about to say, 'He who fought against you and against \nyour father for the sake of Islam, is more rightful to be a Caliph,' but I was afraid that my statement \nmight produce differences amongst the people and cause bloodshed, and my statement might be \ninterpreted not as I intended. (So I kept quiet) remembering what Allah has prepared in the Gardens of \nParadise (for those who are patient and prefer the Hereafter to this worldly life).\" Habib said, \"You \ndid what kept you safe and secure (i.e. you were wise in doing so).",
    "arabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ وَأَخْبَرَنِي ابْنُ طَاوُسٍ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ دَخَلْتُ عَلَى حَفْصَةَ وَنَسْوَاتُهَا تَنْطُفُ، قُلْتُ قَدْ كَانَ مِنْ أَمْرِ النَّاسِ مَا تَرَيْنَ، فَلَمْ يُجْعَلْ لِي مِنَ الأَمْرِ شَىْءٌ‏.‏ فَقَالَتِ الْحَقْ فَإِنَّهُمْ يَنْتَظِرُونَكَ، وَأَخْشَى أَنْ يَكُونَ فِي احْتِبَاسِكَ عَنْهُمْ فُرْقَةٌ‏.‏ فَلَمْ تَدَعْهُ حَتَّى ذَهَبَ، فَلَمَّا تَفَرَّقَ النَّاسُ خَطَبَ مُعَاوِيَةُ قَالَ مَنْ كَانَ يُرِيدُ أَنْ يَتَكَلَّمَ فِي هَذَا الأَمْرِ فَلْيُطْلِعْ لَنَا قَرْنَهُ، فَلَنَحْنُ أَحَقُّ بِهِ مِنْهُ وَمِنْ أَبِيهِ‏.‏ قَالَ حَبِيبُ بْنُ مَسْلَمَةَ فَهَلاَّ أَجَبْتَهُ قَالَ عَبْدُ اللَّهِ فَحَلَلْتُ حُبْوَتِي وَهَمَمْتُ أَنْ أَقُولَ أَحَقُّ بِهَذَا الأَمْرِ مِنْكَ مَنْ قَاتَلَكَ وَأَبَاكَ عَلَى الإِسْلاَمِ‏.‏ فَخَشِيتُ أَنْ أَقُولَ كَلِمَةً تُفَرِّقُ بَيْنَ الْجَمْعِ، وَتَسْفِكُ الدَّمَ، وَيُحْمَلُ عَنِّي غَيْرُ ذَلِكَ، فَذَكَرْتُ مَا أَعَدَّ اللَّهُ فِي الْجِنَانِ‏.‏ قَالَ حَبِيبٌ حُفِظْتَ وَعُصِمْتَ‏.‏ قَالَ مَحْمُودٌ عَنْ عَبْدِ الرَّزَّاقِ وَنَوْسَاتُهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4108In-book reference : Book 64, Hadith 152USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 434   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4109,
    "id": 4109,
    "url": "https://sunnah.com/bukhari:4109",
    "bookNumber": 64,
    "hadithNumber": 153,
    "narrator": "Narrated Sulaiman bin Surd:",
    "english": "On the day of Al-Ahzab (i.e. clans) the Prophet (ﷺ) said, (After this battle) we will go to attack them(i.e. \nthe infidels) and they will not come to attack us.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ ‏\n\"‏ نَغْزُوهُمْ وَلاَ يَغْزُونَنَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4109In-book reference : Book 64, Hadith 153USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 435   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4110,
    "id": 4110,
    "url": "https://sunnah.com/bukhari:4110",
    "bookNumber": 64,
    "hadithNumber": 154,
    "narrator": "Narrated Sulaiman bin Surd:",
    "english": "When the clans were driven away, I heard the Prophet (ﷺ) saying, \"From now onwards we will go to \nattack them (i.e. the infidels) and they will not come to attack us, but we will go to them.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، سَمِعْتُ أَبَا إِسْحَاقَ، يَقُولُ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ حِينَ أَجْلَى الأَحْزَابُ عَنْهُ ‏\n\"‏ الآنَ نَغْزُوهُمْ وَلاَ يَغْزُونَنَا، نَحْنُ نَسِيرُ إِلَيْهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4110In-book reference : Book 64, Hadith 154USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 436   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4111,
    "id": 4111,
    "url": "https://sunnah.com/bukhari:4111",
    "bookNumber": 64,
    "hadithNumber": 155,
    "narrator": "Narrated `Ali:",
    "english": "On the day of Al-Khandaq (i.e. Trench), the Prophet (ﷺ) said '(Let) Allah fill their (i.e. the infidels') \nhouses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr \nprayer) till the sun had set.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ يَوْمَ الْخَنْدَقِ ‏\n\"‏ مَلأَ اللَّهُ عَلَيْهِمْ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا كَمَا شَغَلُونَا عَنْ صَلاَةِ الْوُسْطَى حَتَّى غَابَتِ الشَّمْسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4111In-book reference : Book 64, Hadith 155USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 437   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4112,
    "id": 4112,
    "url": "https://sunnah.com/bukhari:4112",
    "bookNumber": 64,
    "hadithNumber": 156,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "`Umar bin Al-Khattab came on the day of Al-Khandaq after the sun had set and he was abusing the \ninfidels of Quraish saying, \"O Allah's Messenger (ﷺ)! I was unable to offer the (`Asr) prayer till the sun was \nabout to set.\" The Prophet (ﷺ) said, \"By Allah, I have not offered this (i.e. `Asr) prayer.\" So we came \ndown along with the Prophet (ﷺ) to Buthan where he performed ablution for the prayer and then we \nperformed the ablution for it. Then he offered the `Asr prayer after the sun had set, and after it he \noffered the Maghrib prayer.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ جَاءَ يَوْمَ الْخَنْدَقِ بَعْدَ مَا غَرَبَتِ الشَّمْسُ جَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ قَالَ يَا رَسُولَ اللَّهِ مَا كِدْتُ أَنْ أُصَلِّيَ حَتَّى كَادَتِ الشَّمْسُ أَنْ تَغْرُبَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَاللَّهِ مَا صَلَّيْتُهَا ‏\"‏ فَنَزَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم بُطْحَانَ، فَتَوَضَّأَ لِلصَّلاَةِ وَتَوَضَّأْنَا لَهَا، فَصَلَّى الْعَصْرَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى بَعْدَهَا الْمَغْرِبَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4112In-book reference : Book 64, Hadith 156USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 438   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4113,
    "id": 4113,
    "url": "https://sunnah.com/bukhari:4113",
    "bookNumber": 64,
    "hadithNumber": 157,
    "narrator": "Narrated Jabir:",
    "english": "On the day of Al-Ahzab (i.e. clans), Allah's Messenger (ﷺ) said, 'Who will bring us the news of the people \n(i.e. the clans of Quraish infidels)?\" Az-Zubair said, \"I.\" The Prophet (ﷺ) again said, \"Who will bring us \nthe news of the people?\" AzZubair said, \"I.\" The Prophet (ﷺ) again said, \"Who will bring us the news of \nthe people?\" Az-Zubair said, \"I.\" The Prophet (ﷺ) then said, \"Every prophet has his Hawari (i.e. disciplespecial \nhelper); my disciple is Az-Zubair.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ ‏\"‏ مَنْ يَأْتِينَا بِخَبَرِ الْقَوْمِ ‏\"‏‏.‏ فَقَالَ الزُّبَيْرُ أَنَا‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَأْتِينَا بِخَبَرِ الْقَوْمِ ‏\"‏‏.‏ فَقَالَ الزُّبَيْرُ أَنَا‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَأْتِينَا بِخَبَرِ الْقَوْمِ ‏\"‏‏.‏ فَقَالَ الزُّبَيْرُ أَنَا‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَإِنَّ حَوَارِيَّ الزُّبَيْرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4113In-book reference : Book 64, Hadith 157USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 439   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4114,
    "id": 4114,
    "url": "https://sunnah.com/bukhari:4114",
    "bookNumber": 64,
    "hadithNumber": 158,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) used to say, \"None has the right to be worshipped except Allah Alone (Who) honored \nHis Warriors and made His Slave victorious, and He (Alone) defeated the (infidel) clans; so there is \nnothing after Him.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَعَزَّ جُنْدَهُ، وَنَصَرَ عَبْدَهُ وَغَلَبَ الأَحْزَابَ وَحْدَهُ، فَلاَ شَىْءَ بَعْدَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4114In-book reference : Book 64, Hadith 158USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 440   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4115,
    "id": 4115,
    "url": "https://sunnah.com/bukhari:4115",
    "bookNumber": 64,
    "hadithNumber": 159,
    "narrator": "Narrated `Abdullah bin Abi `Aufa:",
    "english": "Allah's Messenger (ﷺ) invoked evil upon the clans saying, \"Allah, the Revealer of the Holy Book (i.e. the \nQur'an), the Quick Taker of the accounts! Please defeat the clans. O Allah! Defeat them and shake \nthem.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا الْفَزَارِيُّ، وَعَبْدَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ يَقُولُ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الأَحْزَابِ فَقَالَ ‏\n\"‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4115In-book reference : Book 64, Hadith 159USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 441   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4116,
    "id": 4116,
    "url": "https://sunnah.com/bukhari:4116",
    "bookNumber": 64,
    "hadithNumber": 160,
    "narrator": "Narrated `Abdullah:",
    "english": "Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to start (saying), \"Allahu- \nAkbar,\" thrice and then he would say, \"None has the right to be worshipped except Allah alone Who \nhas no partners. To Him belongs the Kingdom, all praises are for Him, and He is able to do all things \n(i.e. Omnipotent). We are returning with repentance (to Allah) worshipping, prostrating, and praising \nour Lord. Allah has fulfilled His Promise, made His Slave victorious, and He (Alone) defeated the \nclans (of infidels) .\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، وَنَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنَ الْغَزْوِ، أَوِ الْحَجِّ، أَوِ الْعُمْرَةِ، يَبْدَأُ فَيُكَبِّرُ ثَلاَثَ مِرَارٍ ثُمَّ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونُ سَاجِدُونَ، لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4116In-book reference : Book 64, Hadith 160USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 442   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4117,
    "id": 4117,
    "url": "https://sunnah.com/bukhari:4117",
    "bookNumber": 64,
    "hadithNumber": 161,
    "narrator": "Narrated `Aisha:",
    "english": "When the Prophet (ﷺ) returned from Al-Khandaq (i.e. Trench) and laid down his arms and took a bath, \nGabriel came and said (to the Prophet (ﷺ) ), You have laid down your arms? By Allah, we angels have not \nlaid them down yet. So set out for them.\" The Prophet (ﷺ) said, \"Where to go?\" Gabriel said, \"Towards \nthis side,\" pointing towards Banu Quraiza. So the Prophet (ﷺ) went out towards them.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا رَجَعَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْخَنْدَقِ وَوَضَعَ السِّلاَحَ وَاغْتَسَلَ، أَتَاهُ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ فَقَالَ قَدْ وَضَعْتَ السِّلاَحَ وَاللَّهِ مَا وَضَعْنَاهُ، فَاخْرُجْ إِلَيْهِمْ‏.‏ قَالَ ‏\n\"‏ فَإِلَى أَيْنَ ‏\"‏‏.‏ قَالَ هَا هُنَا، وَأَشَارَ إِلَى بَنِي قُرَيْظَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَيْهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4117In-book reference : Book 64, Hadith 161USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 443   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4118,
    "id": 4118,
    "url": "https://sunnah.com/bukhari:4118",
    "bookNumber": 64,
    "hadithNumber": 162,
    "narrator": "Narrated Anas:",
    "english": "As if I am just now looking at the dust rising in the street of Banu Ghanm (in Medina) because of the \nmarching of Gabriel's regiment when Allah's Messenger (ﷺ) set out to Banu Quraiza (to attack them).",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَأَنِّي أَنْظُرُ إِلَى الْغُبَارِ سَاطِعًا فِي زُقَاقِ بَنِي غَنْمٍ مَوْكِبِ جِبْرِيلَ حِينَ سَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى بَنِي قُرَيْظَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4118In-book reference : Book 64, Hadith 162USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 444   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4119,
    "id": 4119,
    "url": "https://sunnah.com/bukhari:4119",
    "bookNumber": 64,
    "hadithNumber": 163,
    "narrator": "Narrated Ibn `Umar:",
    "english": "On the day of Al-Ahzab (i.e. Clans) the Prophet (ﷺ) said, \"None of you Muslims) should offer the `Asr \nprayer but at Banu Quraiza's place.\" The `Asr prayer became due for some of them on the way. Some \nof those said, \"We will not offer it till we reach it, the place of Banu Quraiza,\" while some others said, \n\"No, we will pray at this spot, for the Prophet (ﷺ) did not mean that for us.\" Later on It was mentioned to \nthe Prophet (ﷺ) and he did not berate any of the two groups.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ ‏\n\"‏ لاَ يُصَلِّيَنَّ أَحَدٌ الْعَصْرَ إِلاَّ فِي بَنِي قُرَيْظَةَ ‏\"‏‏.‏ فَأَدْرَكَ بَعْضُهُمُ الْعَصْرَ فِي الطَّرِيقِ، فَقَالَ بَعْضُهُمْ لاَ نُصَلِّي حَتَّى نَأْتِيَهَا‏.‏ وَقَالَ بَعْضُهُمْ بَلْ نُصَلِّي، لَمْ يُرِدْ مِنَّا ذَلِكَ، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَلَمْ يُعَنِّفْ وَاحِدًا مِنْهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4119In-book reference : Book 64, Hadith 163USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 445   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4120,
    "id": 4120,
    "url": "https://sunnah.com/bukhari:4120",
    "bookNumber": 64,
    "hadithNumber": 164,
    "narrator": "Narrated Anas:",
    "english": "Some (of the Ansar) used to present date palm trees to the Prophet (ﷺ) till Banu Quraiza and Banu An- \nNadir were conquered (then he returned to the people their date palms). My people ordered me to ask \nthe Prophet (ﷺ) to return some or all the date palms they had given to him, but the Prophet (ﷺ) had given those \ntrees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by \nHim except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. \nthe Prophet (ﷺ) ) has given them to me.\" The Prophet (ﷺ) go said (to her), \"Return those trees and I will give \nyou so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten \ntimes the number of her date palms.",
    "arabic": "حَدَّثَنَا ابْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعْتَمِرٌ، وَحَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ الرَّجُلُ يَجْعَلُ لِلنَّبِيِّ صلى الله عليه وسلم النَّخَلاَتِ حَتَّى افْتَتَحَ قُرَيْظَةَ وَالنَّضِيرَ، وَإِنَّ أَهْلِي أَمَرُونِي أَنْ آتِيَ النَّبِيَّ صلى الله عليه وسلم فَأَسْأَلَهُ الَّذِينَ كَانُوا أَعْطَوْهُ أَوْ بَعْضَهُ‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَدْ أَعْطَاهُ أُمَّ أَيْمَنَ، فَجَاءَتْ أُمُّ أَيْمَنَ فَجَعَلَتِ الثَّوْبَ فِي عُنُقِي تَقُولُ كَلاَّ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ لاَ يُعْطِيكَهُمْ وَقَدْ أَعْطَانِيهَا، أَوْ كَمَا قَالَتْ، وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَكِ كَذَا ‏\"‏‏.‏ وَتَقُولُ كَلاَّ وَاللَّهِ‏.‏ حَتَّى أَعْطَاهَا، حَسِبْتُ أَنَّهُ قَالَ ‏\"‏ عَشَرَةَ أَمْثَالِهِ ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4120In-book reference : Book 64, Hadith 164USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 446   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4121,
    "id": 4121,
    "url": "https://sunnah.com/bukhari:4121",
    "bookNumber": 64,
    "hadithNumber": 165,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "The people of (Banu) Quraiza agreed to accept the verdict of Sa`d bin Mu`adh. So the Prophet (ﷺ) sent for \nSa`d, and the latter came (riding) a donkey and when he approached the Mosque, the Prophet (ﷺ) said to \nthe Ansar, \"Get up for your chief or for the best among you.\" Then the Prophet (ﷺ) said (to Sa`d).\" These \n(i.e. Banu Quraiza) have agreed to accept your verdict.\" Sa`d said, \"Kill their (men) warriors and take \ntheir offspring as captives, \"On that the Prophet (ﷺ) said, \"You have judged according to Allah's \nJudgment,\" or said, \"according to the King's judgment.\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يَقُولُ نَزَلَ أَهْلُ قُرَيْظَةَ عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ، فَأَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى سَعْدٍ، فَأَتَى عَلَى حِمَارٍ، فَلَمَّا دَنَا مِنَ الْمَسْجِدِ قَالَ لِلأَنْصَارِ ‏\"‏ قُومُوا إِلَى سَيِّدِكُمْ ـ أَوْ ـ خَيْرِكُمْ ‏\"‏‏.‏ فَقَالَ ‏\"‏ هَؤُلاَءِ نَزَلُوا عَلَى حُكْمِكَ ‏\"‏‏.‏ فَقَالَ تَقْتُلُ مُقَاتِلَتَهُمْ وَتَسْبِي ذَرَارِيَّهُمْ‏.‏ قَالَ ‏\"‏ قَضَيْتَ بِحُكْمِ اللَّهِ ‏\"‏‏.‏ وَرُبَّمَا قَالَ ‏\"‏ بِحُكْمِ الْمَلِكِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4121In-book reference : Book 64, Hadith 165USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 447   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4122,
    "id": 4122,
    "url": "https://sunnah.com/bukhari:4122",
    "bookNumber": 64,
    "hadithNumber": 166,
    "narrator": "Narrated `Aisha:",
    "english": "Sa`d was wounded on the day of Khandaq (i.e. Trench) when a man from Quraish, called Hibban bin \nAl-`Araqa hit him (with an arrow). The man was Hibban bin Qais from (the tribe of) Bani Mais bin \n'Amir bin Lu'ai who shot an arrow at Sa`d's medial arm vein (or main artery of the arm). The Prophet (ﷺ) \npitched a tent (for Sa`d) in the Mosque so that he might be near to the Prophet (ﷺ) to visit. When the \nProphet returned from the (battle) of Al-Khandaq (i.e. Trench) and laid down his arms and took a bath \nGabriel came to him while he (i.e. Gabriel) was shaking the dust off his head, and said, \"You have laid \ndown the arms?\" By Allah, I have not laid them down. Go out to them (to attack them).\" The Prophet (ﷺ) \nsaid, \"Where?\" Gabriel pointed towards Bani Quraiza. So Allah's Messenger (ﷺ) went to them (i.e. Banu \nQuraiza) (i.e. besieged them). They then surrendered to the Prophet's judgment but he directed them to \nSa`d to give his verdict concerning them. Sa`d said, \"I give my judgment that their warriors should be \nkilled, their women and children should be taken as captives, and their properties distributed.\" \nNarrated Hisham: My father informed me that `Aisha said, \"Sa`d said, \"O Allah! You know that there \nis nothing more beloved to me than to fight in Your Cause against those who disbelieved Your \nApostle and turned him out (of Mecca). O Allah! I think you have put to an end the fight between us \nand them (i.e. Quraish infidels). And if there still remains any fight with the Quraish (infidels), then \nkeep me alive till I fight against them for Your Sake. But if you have brought the war to an end, then \nlet this wound burst and cause my death thereby.' So blood gushed from the wound. There was a tent \nin the Mosque belonging to Banu Ghifar who were surprised by the blood flowing towards them . \nThey said, 'O people of the tent! What is this thing which is coming to us from your side?' Behold! \nBlood was flowing profusely out of Sa`d's wound. Sa`d then died because of that.\"",
    "arabic": "حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ، رَمَاهُ رَجُلٌ مِنْ قُرَيْشٍ يُقَالُ لَهُ حِبَّانُ ابْنُ الْعَرِقَةِ، رَمَاهُ فِي الأَكْحَلِ، فَضَرَبَ النَّبِيُّ صلى الله عليه وسلم خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ، فَلَمَّا رَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْخَنْدَقِ وَضَعَ السِّلاَحَ وَاغْتَسَلَ، فَأَتَاهُ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ وَهْوَ يَنْفُضُ رَأْسَهُ مِنَ الْغُبَارِ فَقَالَ قَدْ وَضَعْتَ السِّلاَحَ وَاللَّهِ مَا وَضَعْتُهُ، اخْرُجْ إِلَيْهِمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فَأَيْنَ ‏\"‏‏.‏ فَأَشَارَ إِلَى بَنِي قُرَيْظَةَ، فَأَتَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَزَلُوا عَلَى حُكْمِهِ، فَرَدَّ الْحُكْمَ إِلَى سَعْدٍ، قَالَ فَإِنِّي أَحْكُمُ فِيهِمْ أَنْ تُقْتَلَ الْمُقَاتِلَةُ، وَأَنْ تُسْبَى النِّسَاءُ وَالذُّرِّيَّةُ، وَأَنْ تُقْسَمَ أَمْوَالُهُمْ‏.‏ قَالَ هِشَامٌ فَأَخْبَرَنِي أَبِي عَنْ عَائِشَةَ أَنَّ سَعْدًا قَالَ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنَّهُ لَيْسَ أَحَدٌ أَحَبَّ إِلَىَّ أَنْ أُجَاهِدَهُمْ فِيكَ مِنْ قَوْمٍ كَذَّبُوا رَسُولَكَ صلى الله عليه وسلم وَأَخْرَجُوهُ، اللَّهُمَّ فَإِنِّي أَظُنُّ أَنَّكَ قَدْ وَضَعْتَ الْحَرْبَ بَيْنَنَا وَبَيْنَهُمْ، فَإِنْ كَانَ بَقِيَ مِنْ حَرْبِ قُرَيْشٍ شَىْءٌ، فَأَبْقِنِي لَهُ حَتَّى أُجَاهِدَهُمْ فِيكَ، وَإِنْ كُنْتَ وَضَعْتَ الْحَرْبَ فَافْجُرْهَا، وَاجْعَلْ مَوْتَتِي فِيهَا‏.‏ فَانْفَجَرَتْ مِنْ لَبَّتِهِ، فَلَمْ يَرُعْهُمْ وَفِي الْمَسْجِدِ خَيْمَةٌ مِنْ بَنِي غِفَارٍ إِلاَّ الدَّمُ يَسِيلُ إِلَيْهِمْ فَقَالُوا يَا أَهْلَ الْخَيْمَةِ مَا هَذَا الَّذِي يَأْتِينَا مِنْ قِبَلِكُمْ فَإِذَا سَعْدٌ يَغْذُو جُرْحُهُ دَمًا، فَمَاتَ مِنْهَا رضى الله عنه‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4122In-book reference : Book 64, Hadith 166USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 448   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4123,
    "id": 4123,
    "url": "https://sunnah.com/bukhari:4123",
    "bookNumber": 64,
    "hadithNumber": 167,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) said to Hassan, \"Abuse them (with your poems), and Gabriel is with you (i.e, supports \nyou).\" (Through another group of sub narrators) Al-Bara bin Azib said, \"On the day of Quraiza's \n(besiege), Allah's Messenger (ﷺ) said to Hassan bin Thabit, 'Abuse them (with your poems), and Gabriel is \nwith you (i.e. supports you).' \"",
    "arabic": "حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ، أَخْبَرَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، أَنَّهُ سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِحَسَّانَ ‏\n\"‏ اهْجُهُمْ ـ أَوْ هَاجِهِمْ ـ وَجِبْرِيلُ مَعَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4123In-book reference : Book 64, Hadith 167USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4124,
    "id": 4124,
    "url": "https://sunnah.com/bukhari:4124",
    "bookNumber": 64,
    "hadithNumber": 168,
    "narrator": "Al-Bara' bin `Azib said (through another chain of sub-narrators):",
    "english": "\"On the day of Quraiza's (siege), Allah's Messenger (ﷺ) said to Hassan bin Thabit, 'Abuse them (with your poems), and Jibril is with you.'\"",
    "arabic": "وَزَادَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنِ الشَّيْبَانِيِّ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ قُرَيْظَةَ لِحَسَّانَ بْنِ ثَابِتٍ ‏\n\"‏ اهْجُ الْمُشْرِكِينَ، فَإِنَّ جِبْرِيلَ مَعَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4124In-book reference : Book 64, Hadith 168USC-MSA web (English) reference : Vol. 1, Book 59, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4125,
    "id": 4125,
    "url": "https://sunnah.com/bukhari:4125",
    "bookNumber": 64,
    "hadithNumber": 169,
    "narrator": "Narrated Jabir bin Abdullah (ra):",
    "english": "The Prophet (ﷺ) led his Companions in the Fear Prayer in the seventh Ghazwa i.e. the Ghazwa of Dhat-ur-Riqa. Ibn Abbas said, \"The Prophet (ﷺ) offered the Fear Prayer at a place called Dhi-Qarad.\"",
    "arabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ أَخْبَرَنَا عِمْرَانُ الْقَطَّانُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِأَصْحَابِهِ فِي الْخَوْفِ فِي غَزْوَةِ السَّابِعَةِ غَزْوَةِ ذَاتِ الرِّقَاعِ‏.‏ قَالَ ابْنُ عَبَّاسٍ صَلَّى النَّبِيُّ صلى الله عليه وسلم الْخَوْفَ بِذِي قَرَدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4125In-book reference : Book 64, Hadith 169USC-MSA web (English) reference : Vol. 1, Book 59, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4126,
    "id": 4126,
    "url": "https://sunnah.com/bukhari:4126",
    "bookNumber": 64,
    "hadithNumber": 170,
    "narrator": "",
    "english": "Jabir said that the Prophet (ﷺ) led the people in the Fear Prayer on the day of Muharib and Tha'laba (i.e. the day of the battle of Dhat-ur-Riqa').",
    "arabic": "وَقَالَ بَكْرُ بْنُ سَوَادَةَ حَدَّثَنِي زِيَادُ بْنُ نَافِعٍ، عَنْ أَبِي مُوسَى، أَنَّ جَابِرًا، حَدَّثَهُمْ صَلَّى النَّبِيُّ، صلى الله عليه وسلم بِهِمْ يَوْمَ مُحَارِبٍ وَثَعْلَبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4126In-book reference : Book 64, Hadith 170USC-MSA web (English) reference : Vol. 1, Book 59, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4127,
    "id": 4127,
    "url": "https://sunnah.com/bukhari:4127",
    "bookNumber": 64,
    "hadithNumber": 171,
    "narrator": "Jabir added:",
    "english": "\"The Prophet (ﷺ) set out for the battle of Dhat-ur-Riqa' at a place called Nakhl and he met a group of people from Ghatafan, but there was no clash (between them); the people were afraid of each other and the Prophet (ﷺ) offered the two raka'at of the Fear prayer.\"\n\nNarrated Salama: \"I fought in the company of the Prophet (ﷺ) on the day of al-Qarad.\"",
    "arabic": "وَقَالَ ابْنُ إِسْحَاقَ سَمِعْتُ وَهْبَ بْنَ كَيْسَانَ، سَمِعْتُ جَابِرًا، خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى ذَاتِ الرِّقَاعِ مِنْ نَخْلٍ فَلَقِيَ جَمْعًا مِنْ غَطَفَانَ، فَلَمْ يَكُنْ قِتَالٌ، وَأَخَافَ النَّاسُ بَعْضُهُمْ بَعْضًا فَصَلَّى النَّبِيُّ صلى الله عليه وسلم رَكْعَتَىِ الْخَوْفِ‏.‏ وَقَالَ يَزِيدُ عَنْ سَلَمَةَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْقَرَدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4127In-book reference : Book 64, Hadith 171USC-MSA web (English) reference : Vol. 1, Book 59, Hadith 449   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4128,
    "id": 4128,
    "url": "https://sunnah.com/bukhari:4128",
    "bookNumber": 64,
    "hadithNumber": 172,
    "narrator": "Narrated Abu Burda:",
    "english": "Abu Musa said, \"We went out in the company of the Prophet (ﷺ) for a Ghazwa and we were six persons \nhaving one camel which we rode in rotation. So, (due to excessive walking) our feet became thin and \nmy feet became thin and my nail dropped, and we used to wrap our feet with the pieces of cloth, and \nfor this reason, the Ghazwa was named Dhat-ur-Riqa as we wrapped our feet with rags.\" When Abu- \nMusa narrated this (Hadith), he felt regretful to do so and said, as if he disliked to have disclosed a \ngood deed of his.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَزَاةٍ وَنَحْنُ سِتَّةُ نَفَرٍ بَيْنَنَا بَعِيرٌ نَعْتَقِبُهُ، فَنَقِبَتْ أَقْدَامُنَا وَنَقِبَتْ قَدَمَاىَ وَسَقَطَتْ أَظْفَارِي، وَكُنَّا نَلُفُّ عَلَى أَرْجُلِنَا الْخِرَقَ، فَسُمِّيَتْ غَزْوَةَ ذَاتِ الرِّقَاعِ، لِمَا كُنَّا نَعْصِبُ مِنَ الْخِرَقِ عَلَى أَرْجُلِنَا، وَحَدَّثَ أَبُو مُوسَى بِهَذَا، ثُمَّ كَرِهَ ذَاكَ، قَالَ مَا كُنْتُ أَصْنَعُ بِأَنْ أَذْكُرَهُ‏.‏ كَأَنَّهُ كَرِهَ أَنْ يَكُونَ شَىْءٌ مِنْ عَمَلِهِ أَفْشَاهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4128In-book reference : Book 64, Hadith 172USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 450   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4129,
    "id": 4129,
    "url": "https://sunnah.com/bukhari:4129",
    "bookNumber": 64,
    "hadithNumber": 173,
    "narrator": "Narrated Salih bin Khawwat:",
    "english": "Concerning those who witnessed the Fear Prayer that was performed in the battle of Dhat-ur-Riqa' in \nthe company of Allah's Messenger (ﷺ); One batch lined up behind him while another batch (lined up) facing \nthe enemy. The Prophet (ﷺ) led the batch that was with him in one rak`a, and he stayed in the standing \nposture while that batch completed their (two rak`at) prayer by themselves and went away, lining in \nthe face of the enemy, while the other batch came and he (i.e. the Prophet) offered his remaining rak`a \nwith them, and then, kept on sitting till they completed their prayer by themselves, and he then \nfinished his prayer with Taslim along with them.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَمَّنْ شَهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ ذَاتِ الرِّقَاعِ صَلَّى صَلاَةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ، وَطَائِفَةٌ وُجَاهَ الْعَدُوِّ، فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً، ثُمَّ ثَبَتَ قَائِمًا، وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا، فَصَفُّوا وُجَاهَ الْعَدُوِّ، وَجَاءَتِ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمِ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلاَتِهِ، ثُمَّ ثَبَتَ جَالِسًا، وَأَتَمُّوا لأَنْفُسِهِمْ، ثُمَّ سَلَّمَ بِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4129In-book reference : Book 64, Hadith 173USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4130,
    "id": 4130,
    "url": "https://sunnah.com/bukhari:4130",
    "bookNumber": 64,
    "hadithNumber": 174,
    "narrator": "Narrated Ibn Az-Zubair:",
    "english": "Jabir said, \"We were with the Prophet (ﷺ) at Nakhl,\" and then he mentioned the \nFear prayer. \nNarrated Al-Qasim bin Muhammad: The Prophet (ﷺ) offered the Fear prayer in the Ghazwa of Banu \nAnmar.",
    "arabic": "وَقَالَ مُعَاذٌ حَدَّثَنَا هِشَامٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِنَخْلٍ‏.‏ فَذَكَرَ صَلاَةَ الْخَوْفِ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ فِي صَلاَةِ الْخَوْفِ‏.‏ تَابَعَهُ اللَّيْثُ عَنْ هِشَامٍ عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ حَدَّثَهُ صَلَّى النَّبِيُّ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي أَنْمَارٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4130In-book reference : Book 64, Hadith 174USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 451   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4131,
    "id": 4131,
    "url": "https://sunnah.com/bukhari:4131",
    "bookNumber": 64,
    "hadithNumber": 175,
    "narrator": "Narrated Sahl bin Abi Hathma:",
    "english": "(describing the Fear prayer): The Imam stands up facing the Qibla and one batch of them (i.e. the \narmy) (out of the two) prays along with him and the other batch faces the enemy. The Imam offers one \nrak`a with the first batch they themselves stand up alone and offer one bowing and two prostrations \nwhile they are still in their place, and then go away to relieve the second batch, and the second batch \ncomes (and takes the place of the first batch in the prayer behind the Imam) and he offers the second \nrak`a with them. So he completes his two-rak`at and then the second batch bows and prostrates two \nprostrations (i.e. complete their second rak`a and thus all complete their prayer).\n\n(This hadith has also been narrated through two other chain by Sahl b. Abi Hathma)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ يَقُومُ الإِمَامُ مُسْتَقْبِلَ الْقِبْلَةِ، وَطَائِفَةٌ مِنْهُمْ مَعَهُ وَطَائِفَةٌ مِنْ قِبَلِ الْعَدُوِّ، وُجُوهُهُمْ إِلَى الْعَدُوِّ، فَيُصَلِّي بِالَّذِينَ مَعَهُ رَكْعَةً، ثُمَّ يَقُومُونَ، فَيَرْكَعُونَ لأَنْفُسِهِمْ رَكْعَةً وَيَسْجُدُونَ سَجْدَتَيْنِ فِي مَكَانِهِمْ، ثُمَّ يَذْهَبُ هَؤُلاَءِ إِلَى مَقَامِ أُولَئِكَ فَيَرْكَعُ بِهِمْ رَكْعَةً، فَلَهُ ثِنْتَانِ، ثُمَّ يَرْكَعُونَ وَيَسْجُدُونَ سَجْدَتَيْنِ‏.‏   \nحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏\nحَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ يَحْيَى، سَمِعَ الْقَاسِمَ، أَخْبَرَنِي صَالِحُ بْنُ خَوَّاتٍ، عَنْ سَهْلٍ، حَدَّثَهُ قَوْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4131In-book reference : Book 64, Hadith 175USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 452   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4132,
    "id": 4132,
    "url": "https://sunnah.com/bukhari:4132",
    "bookNumber": 64,
    "hadithNumber": 176,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I took part in a Ghazwa towards Najd along with Allah's Messenger (ﷺ) and we clashed with the enemy, and \nwe lined up for them.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَوَازَيْنَا الْعَدُوَّ فَصَافَفْنَا لَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4132In-book reference : Book 64, Hadith 176USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 455   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4133,
    "id": 4133,
    "url": "https://sunnah.com/bukhari:4133",
    "bookNumber": 64,
    "hadithNumber": 177,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) led the Fear-prayer with one of the two batches of the army while the other (batch) \nfaced the enemy. Then the first batch went away and took places of their companions (i.e. second \nbatch) and the second batch came and he led his second rak`a with them. Then he (i.e. the Prophet: \nfinished his prayer with Taslim and then each of the two batches got up and completed their remaining \none rak`a.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى بِإِحْدَى الطَّائِفَتَيْنِ، وَالطَّائِفَةُ الأُخْرَى مُوَاجِهَةُ الْعَدُوِّ، ثُمَّ انْصَرَفُوا، فَقَامُوا فِي مَقَامِ أَصْحَابِهِمْ، فَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً، ثُمَّ سَلَّمَ عَلَيْهِمْ، ثُمَّ قَامَ هَؤُلاَءِ فَقَضَوْا رَكْعَتَهُمْ، وَقَامَ هَؤُلاَءِ فَقَضَوْا رَكْعَتَهُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4133In-book reference : Book 64, Hadith 177USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 456   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4134,
    "id": 4134,
    "url": "https://sunnah.com/bukhari:4134",
    "bookNumber": 64,
    "hadithNumber": 178,
    "narrator": "Narrated Sinan and Abu Salama:",
    "english": "Jabir mentioned that he had participated in a Ghazwa towards Najd in the company of Allah's Messenger (ﷺ) \n.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سِنَانٌ، وَأَبُو سَلَمَةَ أَنَّ جَابِرًا، أَخْبَرَ أَنَّهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4134In-book reference : Book 64, Hadith 178USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 457   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4135,
    "id": 4135,
    "url": "https://sunnah.com/bukhari:4135",
    "bookNumber": 64,
    "hadithNumber": 179,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "That he fought in a Ghazwa towards Najd along with Allah's Messenger (ﷺ) and when Allah's Messenger (ﷺ) \nreturned, he too, returned along with him. The time of the afternoon nap overtook them when they \nwere in a valley full of thorny trees. Allah's Messenger (ﷺ) dismounted and the people dispersed amongst the \nthorny trees, seeking the shade of the trees. Allah's Messenger (ﷺ) took shelter under a Samura tree and hung \nhis sword on it. We slept for a while when Allah's Messenger (ﷺ) suddenly called us, and we went to him, to \nfind a bedouin sitting with him. Allah's Messenger (ﷺ) said, \"This (bedouin) took my sword out of its sheath \nwhile I was asleep. When I woke up, the naked sword was in his hand and he said to me, 'Who can \nsave you from me?, I replied, 'Allah.' Now here he is sitting.\" Allah's Messenger (ﷺ) did not punish him (for \nthat).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سِنَانِ بْنِ أَبِي سِنَانٍ الدُّؤَلِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَلَمَّا قَفَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَفَلَ مَعَهُ، فَأَدْرَكَتْهُمُ الْقَائِلَةُ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَتَفَرَّقَ النَّاسُ فِي الْعِضَاهِ يَسْتَظِلُّونَ بِالشَّجَرِ، وَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَحْتَ سَمُرَةٍ، فَعَلَّقَ بِهَا سَيْفَهُ، قَالَ جَابِرٌ فَنِمْنَا نَوْمَةً، ثُمَّ إِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُونَا، فَجِئْنَاهُ فَإِذَا عِنْدَهُ أَعْرَابِيٌّ جَالِسٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ هَذَا اخْتَرَطَ سَيْفِي، وَأَنَا نَائِمٌ فَاسْتَيْقَظْتُ، وَهْوَ فِي يَدِهِ صَلْتًا، فَقَالَ لِي مَنْ يَمْنَعُكَ مِنِّي قُلْتُ اللَّهُ‏.‏ فَهَا هُوَ ذَا جَالِسٌ ‏\"‏‏.‏ ثُمَّ لَمْ يُعَاقِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4135In-book reference : Book 64, Hadith 179USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4136,
    "id": 4136,
    "url": "https://sunnah.com/bukhari:4136",
    "bookNumber": 64,
    "hadithNumber": 180,
    "narrator": "(through another group of narrators) Jabir said:",
    "english": "\"We were in the company of the Prophet (during the \nbattle of) Dhat-ur-Riqa', and we came across a shady tree and we left it for the Prophet (to take rest \nunder its shade). A man from the pagans came while the Prophet's sword was hanging on the tree. He \ntook it out of its sheath secretly and said (to the Prophet (ﷺ) ), 'Are you afraid of me?' The Prophet (ﷺ) said, \n'No.' He said, 'Who can save you from me?' The Prophet (ﷺ) said, Allah.' The companions of the Prophet (ﷺ) \nthreatened him, then the Iqama for the prayer was announced and the Prophet (ﷺ) offered a two rak`at \nFear prayer with one of the two batches, and that batch went aside and he offered two rak`a-t with the \nother batch. So the Prophet (ﷺ) offered four rak`at but the people offered two rak`at only.\" (The subnarrator) \nAbu Bishr added, \"The man was Ghaurath bin Al-Harith and the battle was waged against \nMuharib Khasafa.\"",
    "arabic": "وَقَالَ أَبَانُ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذَاتِ الرِّقَاعِ، فَإِذَا أَتَيْنَا عَلَى شَجَرَةٍ ظَلِيلَةٍ تَرَكْنَاهَا لِلنَّبِيِّ صلى الله عليه وسلم، فَجَاءَ رَجُلٌ مِنَ الْمُشْرِكِينَ وَسَيْفُ النَّبِيِّ صلى الله عليه وسلم مُعَلَّقٌ بِالشَّجَرَةِ فَاخْتَرَطَهُ فَقَالَ تَخَافُنِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَمَنْ يَمْنَعُكَ مِنِّي قَالَ ‏\"‏ اللَّهُ ‏\"‏‏.‏ فَتَهَدَّدَهُ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم، وَأُقِيمَتِ الصَّلاَةُ فَصَلَّى بِطَائِفَةٍ رَكْعَتَيْنِ، ثُمَّ تَأَخَّرُوا، وَصَلَّى بِالطَّائِفَةِ الأُخْرَى رَكْعَتَيْنِ، وَكَانَ لِلنَّبِيِّ صلى الله عليه وسلم أَرْبَعٌ وَلِلْقَوْمِ رَكْعَتَيْنِ‏.‏ وَقَالَ مُسَدَّدٌ عَنْ أَبِي عَوَانَةَ عَنْ أَبِي بِشْرٍ اسْمُ الرَّجُلِ غَوْرَثُ بْنُ الْحَارِثِ، وَقَاتَلَ فِيهَا مُحَارِبَ خَصَفَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4136In-book reference : Book 64, Hadith 180USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4137,
    "id": 4137,
    "url": "https://sunnah.com/bukhari:4137",
    "bookNumber": 64,
    "hadithNumber": 181,
    "narrator": "",
    "english": "Jabir added, \"We were with the Prophet (ﷺ) at Nakhl and he offered the Fear prayer.\" \nAbu Huraira said, \"I offered the Fear prayer with the Prophet (ﷺ) during the Ghazwa (i.e. the battle) of \nNajd.\" Abu Huraira came to the Prophet (ﷺ) during the day of Khaibar.",
    "arabic": "وَقَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ، كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِنَخْلٍ فَصَلَّى الْخَوْفَ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم غَزْوَةَ نَجْدٍ صَلاَةَ الْخَوْفِ‏.‏ وَإِنَّمَا جَاءَ أَبُو هُرَيْرَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم أَيَّامَ خَيْبَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4137In-book reference : Book 64, Hadith 181USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 458   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4138,
    "id": 4138,
    "url": "https://sunnah.com/bukhari:4138",
    "bookNumber": 64,
    "hadithNumber": 182,
    "narrator": "Narrated Ibn Muhairiz:",
    "english": "I entered the Mosque and saw Abu Sa`id Al-Khudri and sat beside him and asked him about Al-Azl \n(i.e. coitus interruptus). Abu Sa`id said, \"We went out with Allah's Messenger (ﷺ) for the Ghazwa of Banu \nAl-Mustaliq and we received captives from among the Arab captives and we desired women and \ncelibacy became hard on us and we loved to do coitus interruptus. So when we intended to do coitus \ninterrupt us, we said, 'How can we do coitus interruptus before asking Allah's Messenger (ﷺ) who is present \namong us?\" We asked (him) about it and he said, 'It is better for you not to do so, for if any soul (till \nthe Day of Resurrection) is predestined to exist, it will exist.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّهُ قَالَ دَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَجَلَسْتُ إِلَيْهِ فَسَأَلْتُهُ عَنِ الْعَزْلِ،، قَالَ أَبُو سَعِيدٍ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ، فَأَصَبْنَا سَبْيًا مِنْ سَبْىِ الْعَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ وَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ، وَأَحْبَبْنَا الْعَزْلَ، فَأَرَدْنَا أَنْ نَعْزِلَ، وَقُلْنَا نَعْزِلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا، مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ وَهْىَ كَائِنَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4138In-book reference : Book 64, Hadith 182USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 459   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4139,
    "id": 4139,
    "url": "https://sunnah.com/bukhari:4139",
    "bookNumber": 64,
    "hadithNumber": 183,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "We took part in the Ghazwa of Najd along with Allah's Messenger (ﷺ) and when the time for the afternoon \nrest approached while he was in a valley with plenty of thorny trees, he dismounted under a tree and \nrested in its shade and hung his sword (on it). The people dispersed amongst the trees in order to have \nshade. While we were in this state, Allah's Messenger (ﷺ) called us and we came and found a bedouin sitting \nin front of him. The Prophet (ﷺ) said, \"This (Bedouin) came to me while I was asleep, and he took my \nsword stealthily. I woke up while he was standing by my head, holding my sword without its sheath. \nHe said, 'Who will save you from me?' I replied, 'Allah.' So he sheathed it (i.e. the sword) and sat \ndown, and here he is.\" But Allah's Messenger (ﷺ) did not punish him.",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَزْوَةَ نَجْدٍ، فَلَمَّا أَدْرَكَتْهُ الْقَائِلَةُ وَهْوَ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَنَزَلَ تَحْتَ شَجَرَةٍ وَاسْتَظَلَّ بِهَا وَعَلَّقَ سَيْفَهُ، فَتَفَرَّقَ النَّاسُ فِي الشَّجَرِ يَسْتَظِلُّونَ، وَبَيْنَا نَحْنُ كَذَلِكَ إِذْ دَعَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَجِئْنَا، فَإِذَا أَعْرَابِيٌّ قَاعِدٌ بَيْنَ يَدَيْهِ، فَقَالَ ‏\n\"‏ إِنَّ هَذَا أَتَانِي وَأَنَا نَائِمٌ، فَاخْتَرَطَ سَيْفِي فَاسْتَيْقَظْتُ، وَهْوَ قَائِمٌ عَلَى رَأْسِي، مُخْتَرِطٌ صَلْتًا، قَالَ مَنْ يَمْنَعُكَ مِنِّي قُلْتُ اللَّهُ‏.‏ فَشَامَهُ، ثُمَّ قَعَدَ، فَهْوَ هَذَا ‏\"‏‏.‏ قَالَ وَلَمْ يُعَاقِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4139In-book reference : Book 64, Hadith 183USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 460   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4140,
    "id": 4140,
    "url": "https://sunnah.com/bukhari:4140",
    "bookNumber": 64,
    "hadithNumber": 184,
    "narrator": "Narrated Jabir bin `Abdullah Al-Ansari:",
    "english": "I saw the Prophet (ﷺ) offering his Nawafil prayer on his Mount facing the East during the Ghazwa of \nAnmar.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ بْنِ سُرَاقَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي غَزْوَةِ أَنْمَارٍ يُصَلِّي عَلَى رَاحِلَتِهِ، مُتَوَجِّهًا قِبَلَ الْمَشْرِقِ مُتَطَوِّعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4140In-book reference : Book 64, Hadith 184USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 461   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4141,
    "id": 4141,
    "url": "https://sunnah.com/bukhari:4141",
    "bookNumber": 64,
    "hadithNumber": 185,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) intended to go on a journey, he used to draw lots amongst his wives, and \nAllah's Messenger (ﷺ) used to take with him the one on whom lot fell. He drew lots amongst us during one of \nthe Ghazwat which he fought. The lot fell on me and so I proceeded with Allah's Messenger (ﷺ) after Allah's \norder of veiling (the women) had been revealed. I was carried (on the back of a camel) in my howdah \nand carried down while still in it (when we came to a halt). So we went on till Allah's Messenger (ﷺ) had \nfinished from that Ghazwa of his and returned. \nWhen we approached the city of Medina he announced at night that it was time for departure. So \nwhen they announced the news of departure, I got up and went away from the army camps, and after \nfinishing from the call of nature, I came back to my riding animal. I touched my chest to find that my \nnecklace which was made of Zifar beads (i.e. Yemenite beads partly black and partly white) was \nmissing. So I returned to look for my necklace and my search for it detained me. (In the meanwhile) \nthe people who used to carry me on my camel, came and took my howdah and put it on the back of \nmy camel on which I used to ride, as they considered that I was in it. In those days women were light \nin weight for they did not get fat, and flesh did not cover their bodies in abundance as they used to eat \nonly a little food. Those people therefore, disregarded the lightness of the howdah while lifting and \ncarrying it; and at that time I was still a young girl. They made the camel rise and all of them left \n(along with it). I found my necklace after the army had gone. \nThen I came to their camping place to find no call maker of them, nor one who would respond to the \ncall. So I intended to go to the place where I used to stay, thinking that they would miss me and come \nback to me (in my search). While I was sitting in my resting place, I was overwhelmed by sleep and \nslept. Safwan bin Al-Muattal As-Sulami Adh-Dhakwani was behind the army. When he reached my \nplace in the morning, he saw the figure of a sleeping person and he recognized me on seeing me as he \nhad seen me before the order of compulsory veiling (was prescribed). So I woke up when he recited \nIstirja' (i.e. \"Inna li l-lahi wa inna llaihi raji'un\") as soon as he recognized me. I veiled my face with \nmy head cover at once, and by Allah, we did not speak a single word, and I did not hear him saying \nany word besides his Istirja'. He dismounted from his camel and made it kneel down, putting his leg \non its front legs and then I got up and rode on it. Then he set out leading the camel that was carrying \nme till we overtook the army in the extreme heat of midday while they were at a halt (taking a rest). \n(Because of the event) some people brought destruction upon themselves and the one who spread the \nIfk (i.e. slander) more, was `Abdullah bin Ubai Ibn Salul.\" \n(Urwa said, \"The people propagated the slander and talked about it in his (i.e. `Abdullah's) presence \nand he confirmed it and listened to it and asked about it to let it prevail.\" `Urwa also added, \"None \nwas mentioned as members of the slanderous group besides (`Abdullah) except Hassan bin Thabit and \nMistah bin Uthatha and Hamna bint Jahsh along with others about whom I have no knowledge, but \nthey were a group as Allah said. It is said that the one who carried most of the slander was `Abdullah \nbin Ubai bin Salul.\" `Urwa added, \"`Aisha disliked to have Hassan abused in her presence and she \nused to say, 'It was he who said: My father and his (i.e. my father's) father and my honor are all for the \nprotection of Muhammad's honor from you.\"). \n`Aisha added, \"After we returned to Medina, I became ill for a month. The people were propagating \nthe forged statements of the slanderers while I was unaware of anything of all that, but I felt that in my \npresent ailment, I was not receiving the same kindness from Allah's Messenger (ﷺ) as I used to receive when \nI got sick. (But now) Allah's Messenger (ﷺ) would only come, greet me and say,' How is that (lady)?' and \nleave. That roused my doubts, but I did not discover the evil (i.e. slander) till I went out after my \nconvalescence, I went out with Um Mistah to Al-Manasi' where we used to answer the call of nature \nand we used not to go out (to answer the call of nature) except at night, and that was before we had \nlatrines near our houses. And this habit of our concerning evacuating the bowels, was similar to the \nhabits of the old 'Arabs living in the deserts, for it would be troublesome for us to take latrines near \nour houses. So I and Um Mistah who was the daughter of Abu Ruhm bin Al-Muttalib bin `Abd \nManaf, whose mother was the daughter of Sakhr bin 'Amir and the aunt of Abu Bakr As-Siddiq and \nwhose son was Mistah bin Uthatha bin `Abbas bin Al-Muttalib, went out. I and Um Mistah returned to \nmy house after we finished answering the call of nature. Um Mistah stumbled by getting her foot \nentangled in her covering sheet and on that she said, 'Let Mistah be ruined!' I said, 'What a hard word \nyou have said. Do you abuse a man who took part in the battle of Badr?' On that she said, 'O you \nHantah! Didn't you hear what he (i.e. Mistah) said? 'I said, 'What did he say?' \nThen she told me the slander of the people of Ifk. So my ailment was aggravated, and when I reached \nmy home, Allah's Messenger (ﷺ) came to me, and after greeting me, said, 'How is that (lady)?' I said, 'Will \nyou allow me to go to my parents?' as I wanted to be sure about the news through them. Allah's \nApostle allowed me (and I went to my parents) and asked my mother, 'O mother! What are the people \ntalking about?' She said, 'O my daughter! Don't worry, for scarcely is there a charming woman who is \nloved by her husband and whose husband has other wives besides herself that they (i.e. women) would \nfind faults with her.' I said, 'Subhan-Allah! (I testify the uniqueness of Allah). Are the people really \ntalking in this way?' I kept on weeping that night till dawn I could neither stop weeping nor sleep then \nin the morning again, I kept on weeping. When the Divine Inspiration was delayed. \nAllah's Messenger (ﷺ) called `Ali bin Abi Talib and Usama bin Zaid to ask and consult them about divorcing \nme. Usama bin Zaid said what he knew of my innocence, and the respect he preserved in himself for \nme. Usama said, '(O Allah's Messenger (ﷺ)!) She is your wife and we do not know anything except good \nabout her.' `Ali bin Abi Talib said, 'O Allah's Messenger (ﷺ)! Allah does not put you in difficulty and there \nare plenty of women other than she, yet, ask the maid-servant who will tell you the truth.' On that \nAllah's Messenger (ﷺ) called Barira (i.e. the maid-servant) and said, 'O Barira! Did you ever see anything \nwhich aroused your suspicion?' Barira said to him, 'By Him Who has sent you with the Truth. I have \nnever seen anything in her (i.e. Aisha) which I would conceal, except that she is a young girl who \nsleeps leaving the dough of her family exposed so that the domestic goats come and eat it.' \nSo, on that day, Allah's Messenger (ﷺ) got up on the pulpit and complained about `Abdullah bin Ubai (bin \nSalul) before his companions, saying, 'O you Muslims! Who will relieve me from that man who has \nhurt me with his evil statement about my family? By Allah, I know nothing except good about my \nfamily and they have blamed a man about whom I know nothing except good and he used never to \nenter my home except with me.' Sa`d bin Mu`adh the brother of Banu `Abd Al-Ashhal got up and \nsaid, 'O Allah's Messenger (ﷺ)! I will relieve you from him; if he is from the tribe of Al-Aus, then I will chop \nhis head off, and if he is from our brothers, i.e. Al-Khazraj, then order us, and we will fulfill your \norder.' On that, a man from Al-Khazraj got up. Um Hassan, his cousin, was from his branch tribe, and \nhe was Sa`d bin Ubada, chief of Al-Khazraj. Before this incident, he was a pious man, but his love for \nhis tribe goaded him into saying to Sa`d (bin Mu`adh). 'By Allah, you have told a lie; you shall not \nand cannot kill him. If he belonged to your people, you would not wish him to be killed.' \nOn that, Usaid bin Hudair who was the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin \n'Ubada, 'By Allah! You are a liar! We will surely kill him, and you are a hypocrite arguing on the \nbehalf of hypocrites.' On this, the two tribes of Al-Aus and Al Khazraj got so much excited that they \nwere about to fight while Allah's Messenger (ﷺ) was standing on the pulpit. Allah's Messenger (ﷺ) kept on \nquietening them till they became silent and so did he. All that day I kept on weeping with my tears \nnever ceasing, and I could never sleep. \nIn the morning my parents were with me and I wept for two nights and a day with my tears never \nceasing and I could never sleep till I thought that my liver would burst from weeping. So, while my \nparents were sitting with me and I was weeping, an Ansari woman asked me to grant her admittance. I \nallowed her to come in, and when she came in, she sat down and started weeping with me. While we \nwere in this state, Allah's Messenger (ﷺ) came, greeted us and sat down. He had never sat with me since that \nday of the slander. A month had elapsed and no Divine Inspiration came to him about my case. Allah's \nApostle then recited Tashah-hud and then said, 'Amma Badu, O `Aisha! I have been informed so-andso \nabout you; if you are innocent, then soon Allah will reveal your innocence, and if you have \ncommitted a sin, then repent to Allah and ask Him for forgiveness for when a slave confesses his sins \nand asks Allah for forgiveness, Allah accepts his repentance.' \n(continued...) \n(continuing... 1): -5.462:... ... \nWhen Allah's Messenger (ﷺ) finished his speech, my tears ceased flowing completely that I no longer felt a \nsingle drop of tear flowing. I said to my father, 'Reply to Allah's Messenger (ﷺ) on my behalf concerning \nwhat he has said.' My father said, 'By Allah, I do not know what to say to Allah's Messenger (ﷺ) .' Then I \nsaid to my mother, 'Reply to Allah's Messenger (ﷺ) on my behalf concerning what he has said.' She said, 'By \nAllah, I do not know what to say to Allah's Messenger (ﷺ).' In spite of the fact that I was a young girl and had \na little knowledge of Qur'an, I said, 'By Allah, no doubt I know that you heard this (slanderous) speech \nso that it has been planted in your hearts (i.e. minds) and you have taken it as a truth. Now if I tell you \nthat I am innocent, you will not believe me, and if confess to you about it, and Allah knows that I am \ninnocent, you will surely believe me. By Allah, I find no similitude for me and you except that of \nJoseph's father when he said, '(For me) patience in the most fitting against that which you assert; it is \nAllah (Alone) Whose Help can be sought.' Then I turned to the other side and lay on my bed; and \nAllah knew then that I was innocent and hoped that Allah would reveal my innocence. But, by Allah, I \nnever thought that Allah would reveal about my case, Divine Inspiration, that would be recited \n(forever) as I considered myself too unworthy to be talked of by Allah with something of my concern, \nbut I hoped that Allah's Messenger (ﷺ) might have a dream in which Allah would prove my innocence. But, \nby Allah, before Allah's Messenger (ﷺ) left his seat and before any of the household left, the Divine \ninspiration came to Allah's Messenger (ﷺ). \nSo there overtook him the same hard condition which used to overtake him, (when he used to be \ninspired Divinely). The sweat was dropping from his body like pearls though it was a wintry day and \nthat was because of the weighty statement which was being revealed to him. When that state of \nAllah's Messenger (ﷺ) was over, he got up smiling, and the first word he said was, 'O `Aisha! Allah has \ndeclared your innocence!' Then my Mother said to me, 'Get up and go to him (i.e. Allah's Messenger (ﷺ)). I \nreplied, 'By Allah, I will not go to him, and I praise none but Allah. So Allah revealed the ten Verses:- \n- \"Verily! They who spread the slander Are a gang, among you.............\" (24.11-20) \nAllah revealed those Qur'anic Verses to declare my innocence. Abu Bakr As-Siddiq who used to \ndisburse money for Mistah bin Uthatha because of his relationship to him and his poverty, said, 'By \nAllah, I will never give to Mistah bin Uthatha anything after what he has said about Aisha.' Then \nAllah revealed:-- \n\"And let not those among you who are good and wealthy swear not to give (any sort of help) to their \nkinsmen, those in need, and those who have left their homes for Allah's cause, let them pardon and \nforgive. Do you not love that Allah should forgive you? And Allah is oft-Forgiving Most Merciful.\" \n(24.22) \nAbu Bakr As-Siddiq said, 'Yes, by Allah, I would like that Allah forgive me.' and went on giving \nMistah the money he used to give him before. He also added, 'By Allah, I will never deprive him of it \nat all.' \nAisha further said:.\" Allah's Messenger (ﷺ) also asked Zainab bint Jahsh (i.e. his wife) about my case. He \nsaid to Zainab, 'What do you know and what did you see?\" She replied, \"O Allah's Messenger (ﷺ)! I refrain \nfrom claiming falsely that I have heard or seen anything. By Allah, I know nothing except good (about \n`Aisha).' From amongst the wives of the Prophet (ﷺ) Zainab was my peer (in beauty and in the love she \nreceived from the Prophet) but Allah saved her from that evil because of her piety. Her sister Hamna, \nstarted struggling on her behalf and she was destroyed along with those who were destroyed. The man \nwho was blamed said, 'Subhan-Allah! By Him in Whose Hand my soul is, I have never uncovered the \ncover (i.e. veil) of any female.' Later on the man was martyred in Allah's Cause.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، وَعَلْقَمَةُ بْنُ وَقَّاصٍ، وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَائِشَةَ، رضى الله عنها زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، وَكُلُّهُمْ حَدَّثَنِي طَائِفَةً مِنْ حَدِيثِهَا، وَبَعْضُهُمْ كَانَ أَوْعَى لِحَدِيثِهَا مِنْ بَعْضٍ وَأَثْبَتَ لَهُ اقْتِصَاصًا، وَقَدْ وَعَيْتُ عَنْ كُلِّ رَجُلٍ مِنْهُمُ الْحَدِيثَ الَّذِي حَدَّثَنِي عَنْ عَائِشَةَ، وَبَعْضُ حَدِيثِهِمْ يُصَدِّقُ بَعْضًا، وَإِنْ كَانَ بَعْضُهُمْ أَوْعَى لَهُ مِنْ بَعْضٍ، قَالُوا قَالَتْ عَائِشَةُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ أَزْوَاجِهِ، فَأَيُّهُنَّ خَرَجَ سَهْمُهَا، خَرَجَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَهُ، قَالَتْ عَائِشَةُ فَأَقْرَعَ بَيْنَنَا فِي غَزْوَةٍ غَزَاهَا فَخَرَجَ فِيهَا سَهْمِي، فَخَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْدَ مَا أُنْزِلَ الْحِجَابُ، فَكُنْتُ أُحْمَلُ فِي هَوْدَجِي وَأُنْزَلُ فِيهِ، فَسِرْنَا حَتَّى إِذَا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ غَزْوَتِهِ تِلْكَ وَقَفَلَ، دَنَوْنَا مِنَ الْمَدِينَةِ قَافِلِينَ، آذَنَ لَيْلَةً بِالرَّحِيلِ، فَقُمْتُ حِينَ آذَنُوا بِالرَّحِيلِ فَمَشَيْتُ حَتَّى جَاوَزْتُ الْجَيْشَ، فَلَمَّا قَضَيْتُ شَأْنِي أَقْبَلْتُ إِلَى رَحْلِي، فَلَمَسْتُ صَدْرِي، فَإِذَا عِقْدٌ لِي مِنْ جَزْعِ ظَفَارِ قَدِ انْقَطَعَ، فَرَجَعْتُ فَالْتَمَسْتُ عِقْدِي، فَحَبَسَنِي ابْتِغَاؤُهُ، قَالَتْ وَأَقْبَلَ الرَّهْطُ الَّذِينَ كَانُوا يُرَحِّلُونِي فَاحْتَمَلُوا هَوْدَجِي، فَرَحَلُوهُ عَلَى بَعِيرِي الَّذِي كُنْتُ أَرْكَبُ عَلَيْهِ، وَهُمْ يَحْسِبُونَ أَنِّي فِيهِ، وَكَانَ النِّسَاءُ إِذْ ذَاكَ خِفَافًا لَمْ يَهْبُلْنَ وَلَمْ يَغْشَهُنَّ اللَّحْمُ، إِنَّمَا يَأْكُلْنَ الْعُلْقَةَ مِنَ الطَّعَامِ، فَلَمْ يَسْتَنْكِرِ الْقَوْمُ خِفَّةَ الْهَوْدَجِ حِينَ رَفَعُوهُ وَحَمَلُوهُ، وَكُنْتُ جَارِيَةً حَدِيثَةَ السِّنِّ، فَبَعَثُوا الْجَمَلَ فَسَارُوا، وَوَجَدْتُ عِقْدِي بَعْدَ مَا اسْتَمَرَّ الْجَيْشُ، فَجِئْتُ مَنَازِلَهُمْ وَلَيْسَ بِهَا مِنْهُمْ دَاعٍ وَلاَ مُجِيبٌ، فَتَيَمَّمْتُ مَنْزِلِي الَّذِي كُنْتُ بِهِ، وَظَنَنْتُ أَنَّهُمْ سَيَفْقِدُونِي فَيَرْجِعُونَ إِلَىَّ، فَبَيْنَا أَنَا جَالِسَةٌ فِي مَنْزِلِي غَلَبَتْنِي عَيْنِي فَنِمْتُ، وَكَانَ صَفْوَانُ بْنُ الْمُعَطَّلِ السُّلَمِيُّ ثُمَّ الذَّكْوَانِيُّ مِنْ وَرَاءِ الْجَيْشِ، فَأَصْبَحَ عِنْدَ مَنْزِلِي فَرَأَى سَوَادَ إِنْسَانٍ نَائِمٍ، فَعَرَفَنِي حِينَ رَآنِي، وَكَانَ رَآنِي قَبْلَ الْحِجَابِ، فَاسْتَيْقَظْتُ بِاسْتِرْجَاعِهِ حِينَ عَرَفَنِي، فَخَمَّرْتُ وَجْهِي بِجِلْبَابِي، وَاللَّهِ مَا تَكَلَّمْنَا بِكَلِمَةٍ وَلاَ سَمِعْتُ مِنْهُ كَلِمَةً غَيْرَ اسْتِرْجَاعِهِ، وَهَوَى حَتَّى أَنَاخَ رَاحِلَتَهُ، فَوَطِئَ عَلَى يَدِهَا، فَقُمْتُ إِلَيْهَا فَرَكِبْتُهَا، فَانْطَلَقَ يَقُودُ بِي الرَّاحِلَةَ حَتَّى أَتَيْنَا الْجَيْشَ مُوغِرِينَ فِي نَحْرِ الظَّهِيرَةِ، وَهُمْ نُزُولٌ ـ قَالَتْ ـ فَهَلَكَ ‏{‏فِيَّ‏}‏ مَنْ هَلَكَ، وَكَانَ الَّذِي تَوَلَّى كِبْرَ الإِفْكِ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ابْنَ سَلُولَ‏.‏ قَالَ عُرْوَةُ أُخْبِرْتُ أَنَّهُ كَانَ يُشَاعُ وَيُتَحَدَّثُ بِهِ عِنْدَهُ، فَيُقِرُّهُ وَيَسْتَمِعُهُ وَيَسْتَوْشِيهِ‏.‏ وَقَالَ عُرْوَةُ أَيْضًا لَمْ يُسَمَّ مِنْ أَهْلِ الإِفْكِ أَيْضًا إِلاَّ حَسَّانُ بْنُ ثَابِتٍ، وَمِسْطَحُ بْنُ أُثَاثَةَ، وَحَمْنَةُ بِنْتُ جَحْشٍ فِي نَاسٍ آخَرِينَ، لاَ عِلْمَ لِي بِهِمْ، غَيْرَ أَنَّهُمْ عُصْبَةٌ ـ كَمَا قَالَ اللَّهُ تَعَالَى ـ وَإِنَّ كُبْرَ ذَلِكَ يُقَالُ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ‏.‏ قَالَ عُرْوَةُ كَانَتْ عَائِشَةُ تَكْرَهُ أَنْ يُسَبَّ عِنْدَهَا حَسَّانُ، وَتَقُولُ إِنَّهُ الَّذِي قَالَ:\n\n فَإِنَّ أَبِي وَوَالِدَهُ وَعِرْضِي     لِعِرْضِ مُحَمَّدٍ مِنْكُمْ وِقَاءُ قَالَتْ عَائِشَةُ فَقَدِمْنَا الْمَدِينَةَ فَاشْتَكَيْتُ حِينَ قَدِمْتُ شَهْرًا، وَالنَّاسُ يُفِيضُونَ فِي قَوْلِ أَصْحَابِ الإِفْكِ، لاَ أَشْعُرُ بِشَىْءٍ مِنْ ذَلِكَ، وَهْوَ يَرِيبُنِي فِي وَجَعِي أَنِّي لاَ أَعْرِفُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم اللُّطْفَ الَّذِي كُنْتُ أَرَى مِنْهُ حِينَ أَشْتَكِي، إِنَّمَا يَدْخُلُ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَيُسَلِّمُ ثُمَّ يَقُولُ ‏\"‏ كَيْفَ تِيكُمْ ‏\"‏ ثُمَّ يَنْصَرِفُ، فَذَلِكَ يَرِيبُنِي وَلاَ أَشْعُرُ بِالشَّرِّ، حَتَّى خَرَجْتُ حِينَ نَقَهْتُ، فَخَرَجْتُ مَعَ أُمِّ مِسْطَحٍ قِبَلَ الْمَنَاصِعِ، وَكَانَ مُتَبَرَّزَنَا، وَكُنَّا لاَ نَخْرُجُ إِلاَّ لَيْلاً إِلَى لَيْلٍ، وَذَلِكَ قَبْلَ أَنْ نَتَّخِذَ الْكُنُفَ قَرِيبًا مِنْ بُيُوتِنَا‏.‏ قَالَتْ وَأَمْرُنَا أَمْرُ الْعَرَبِ الأُوَلِ فِي الْبَرِّيَّةِ قِبَلَ الْغَائِطِ، وَكُنَّا نَتَأَذَّى بِالْكُنُفِ أَنْ نَتَّخِذَهَا عِنْدَ بُيُوتِنَا، قَالَتْ فَانْطَلَقْتُ أَنَا وَأُمُّ مِسْطَحٍ وَهْىَ ابْنَةُ أَبِي رُهْمِ بْنِ الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ، وَأُمُّهَا بِنْتُ صَخْرِ بْنِ عَامِرٍ خَالَةُ أَبِي بَكْرٍ الصِّدِّيقِ، وَابْنُهَا مِسْطَحُ بْنُ أُثَاثَةَ بْنِ عَبَّادِ بْنِ الْمُطَّلِبِ، فَأَقْبَلْتُ أَنَا وَأُمُّ مِسْطَحٍ قِبَلَ بَيْتِي، حِينَ فَرَغْنَا مِنْ شَأْنِنَا، فَعَثَرَتْ أُمُّ مِسْطَحٍ فِي مِرْطِهَا فَقَالَتْ تَعِسَ مِسْطَحٌ‏.‏ فَقُلْتُ لَهَا بِئْسَ مَا قُلْتِ، أَتَسُبِّينَ رَجُلاً شَهِدَ بَدْرًا فَقَالَتْ أَىْ هَنْتَاهْ وَلَمْ تَسْمَعِي مَا قَالَ قَالَتْ وَقُلْتُ مَا قَالَ فَأَخْبَرَتْنِي بِقَوْلِ أَهْلِ الإِفْكِ ـ قَالَتْ ـ فَازْدَدْتُ مَرَضًا عَلَى مَرَضِي، فَلَمَّا رَجَعْتُ إِلَى بَيْتِي دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَلَّمَ ثُمَّ قَالَ ‏\"‏ كَيْفَ تِيكُمْ ‏\"‏‏.‏ فَقُلْتُ لَهُ أَتَأْذَنُ لِي أَنْ آتِيَ أَبَوَىَّ قَالَتْ وَأُرِيدُ أَنْ أَسْتَيْقِنَ الْخَبَرَ مِنْ قِبَلِهِمَا، قَالَتْ فَأَذِنَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم، فَقُلْتُ لأُمِّي يَا أُمَّتَاهُ مَاذَا يَتَحَدَّثُ النَّاسُ قَالَتْ يَا بُنَيَّةُ هَوِّنِي عَلَيْكِ، فَوَاللَّهِ لَقَلَّمَا كَانَتِ امْرَأَةٌ قَطُّ وَضِيئَةً عِنْدَ رَجُلٍ يُحِبُّهَا لَهَا ضَرَائِرُ إِلاَّ كَثَّرْنَ عَلَيْهَا‏.‏ قَالَتْ فَقُلْتُ سُبْحَانَ اللَّهِ أَوَلَقَدْ تَحَدَّثَ النَّاسُ بِهَذَا قَالَتْ فَبَكَيْتُ تِلْكَ اللَّيْلَةَ، حَتَّى أَصْبَحْتُ لاَ يَرْقَأُ لِي دَمْعٌ، وَلاَ أَكْتَحِلُ بِنَوْمٍ، ثُمَّ أَصْبَحْتُ أَبْكِي ـ قَالَتْ ـ وَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ وَأُسَامَةَ بْنَ زَيْدٍ حِينَ اسْتَلْبَثَ الْوَحْىُ يَسْأَلُهُمَا وَيَسْتَشِيرُهُمَا فِي فِرَاقِ أَهْلِهِ ـ قَالَتْ ـ فَأَمَّا أُسَامَةُ فَأَشَارَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِالَّذِي يَعْلَمُ مِنْ بَرَاءَةِ أَهْلِهِ، وَبِالَّذِي يَعْلَمُ لَهُمْ فِي نَفْسِهِ، فَقَالَ أُسَامَةُ أَهْلَكَ وَلاَ نَعْلَمُ إِلاَّ خَيْرًا‏.‏ وَأَمَّا عَلِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ يُضَيِّقِ اللَّهُ عَلَيْكَ، وَالنِّسَاءُ سِوَاهَا كَثِيرٌ، وَسَلِ الْجَارِيَةَ تَصْدُقْكَ‏.‏ قَالَتْ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بَرِيرَةَ فَقَالَ ‏\"‏ أَىْ بَرِيرَةُ هَلْ رَأَيْتِ مِنْ شَىْءٍ يَرِيبُكِ ‏\"‏‏.‏ قَالَتْ لَهُ بَرِيرَةُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا رَأَيْتُ عَلَيْهَا أَمْرًا قَطُّ أَغْمِصُهُ، غَيْرَ أَنَّهَا جَارِيَةٌ حَدِيثَةُ السِّنِّ تَنَامُ عَنْ عَجِينِ أَهْلِهَا، فَتَأْتِي الدَّاجِنُ فَتَأْكُلُهُ ـ قَالَتْ ـ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَوْمِهِ، فَاسْتَعْذَرَ مِنْ عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَهْوَ عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ يَا مَعْشَرَ الْمُسْلِمِينَ مَنْ يَعْذِرُنِي مِنْ رَجُلٍ قَدْ بَلَغَنِي عَنْهُ أَذَاهُ فِي أَهْلِي، وَاللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي إِلاَّ خَيْرًا، وَلَقَدْ ذَكَرُوا رَجُلاً مَا عَلِمْتُ عَلَيْهِ إِلاَّ خَيْرًا، وَمَا يَدْخُلُ عَلَى أَهْلِي إِلاَّ مَعِي ‏\"‏‏.‏ قَالَتْ فَقَامَ سَعْدُ بْنُ مُعَاذٍ أَخُو بَنِي عَبْدِ الأَشْهَلِ فَقَالَ أَنَا يَا رَسُولَ اللَّهِ أَعْذِرُكَ، فَإِنْ كَانَ مِنَ الأَوْسِ ضَرَبْتُ عُنُقَهُ، وَإِنْ كَانَ مِنْ إِخْوَانِنَا مِنَ الْخَزْرَجِ أَمَرْتَنَا فَفَعَلْنَا أَمْرَكَ‏.‏ قَالَتْ فَقَامَ رَجُلٌ مِنَ الْخَزْرَجِ، وَكَانَتْ أُمُّ حَسَّانَ بِنْتَ عَمِّهِ مِنْ فَخِذِهِ، وَهْوَ سَعْدُ بْنُ عُبَادَةَ، وَهْوَ سَيِّدُ الْخَزْرَجِ ـ قَالَتْ ـ وَكَانَ قَبْلَ ذَلِكَ رَجُلاً صَالِحًا، وَلَكِنِ احْتَمَلَتْهُ الْحَمِيَّةُ فَقَالَ لِسَعْدٍ كَذَبْتَ لَعَمْرُ اللَّهِ لاَ تَقْتُلُهُ، وَلاَ تَقْدِرُ عَلَى قَتْلِهِ، وَلَوْ كَانَ مِنْ رَهْطِكَ مَا أَحْبَبْتَ أَنْ يُقْتَلَ‏.‏ فَقَامَ أُسَيْدُ بْنُ حُضَيْرٍ ـ وَهْوَ ابْنُ عَمِّ سَعْدٍ ـ فَقَالَ لِسَعْدِ بْنِ عُبَادَةَ كَذَبْتَ لَعَمْرُ اللَّهِ لَنَقْتُلَنَّهُ، فَإِنَّكَ مُنَافِقٌ تُجَادِلُ عَنِ الْمُنَافِقِينَ‏.‏ قَالَتْ فَثَارَ الْحَيَّانِ الأَوْسُ وَالْخَزْرَجُ حَتَّى هَمُّوا أَنْ يَقْتَتِلُوا، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى الْمِنْبَرِ ـ قَالَتْ ـ فَلَمْ يَزَلْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُخَفِّضُهُمْ حَتَّى سَكَتُوا وَسَكَتَ ـ قَالَتْ ـ فَبَكَيْتُ يَوْمِي ذَلِكَ كُلَّهُ، لاَ يَرْقَأُ لِي دَمْعٌ، وَلاَ أَكْتَحِلُ بِنَوْمٍ ـ قَالَتْ ـ وَأَصْبَحَ أَبَوَاىَ عِنْدِي، وَقَدْ بَكَيْتُ لَيْلَتَيْنِ وَيَوْمًا، لاَ يَرْقَأُ لِي دَمْعٌ، وَلاَ أَكْتَحِلُ بِنَوْمٍ، حَتَّى إِنِّي لأَظُنُّ أَنَّ الْبُكَاءَ فَالِقٌ كَبِدِي، فَبَيْنَا أَبَوَاىَ جَالِسَانِ عِنْدِي وَأَنَا أَبْكِي فَاسْتَأْذَنَتْ عَلَىَّ امْرَأَةٌ مِنَ الأَنْصَارِ، فَأَذِنْتُ لَهَا، فَجَلَسَتْ تَبْكِي مَعِي ـ قَالَتْ ـ فَبَيْنَا نَحْنُ عَلَى ذَلِكَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْنَا، فَسَلَّمَ ثُمَّ جَلَسَ ـ قَالَتْ ـ وَلَمْ يَجْلِسْ عِنْدِي مُنْذُ قِيلَ مَا قِيلَ قَبْلَهَا، وَقَدْ لَبِثَ شَهْرًا لاَ يُوحَى إِلَيْهِ فِي شَأْنِي بِشَىْءٍ ـ قَالَتْ ـ فَتَشَهَّدَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ جَلَسَ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، يَا عَائِشَةُ إِنَّهُ بَلَغَنِي عَنْكِ كَذَا وَكَذَا، فَإِنْ كُنْتِ بَرِيئَةً، فَسَيُبَرِّئُكِ اللَّهُ، وَإِنْ كُنْتِ أَلْمَمْتِ بِذَنْبٍ، فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ، فَإِنَّ الْعَبْدَ إِذَا اعْتَرَفَ ثُمَّ تَابَ تَابَ اللَّهُ عَلَيْهِ ‏\"‏‏.‏ قَالَتْ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَقَالَتَهُ قَلَصَ دَمْعِي حَتَّى مَا أُحِسُّ مِنْهُ قَطْرَةً، فَقُلْتُ لأَبِي أَجِبْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِّي فِيمَا قَالَ‏.‏ فَقَالَ أَبِي وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ لأُمِّي أَجِيبِي رَسُولَ اللَّهِ صلى الله عليه وسلم فِيمَا قَالَ‏.‏ قَالَتْ أُمِّي وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ لاَ أَقْرَأُ مِنَ الْقُرْآنِ كَثِيرًا إِنِّي وَاللَّهِ لَقَدْ عَلِمْتُ لَقَدْ سَمِعْتُمْ هَذَا الْحَدِيثَ حَتَّى اسْتَقَرَّ فِي أَنْفُسِكُمْ وَصَدَّقْتُمْ بِهِ، فَلَئِنْ قُلْتُ لَكُمْ إِنِّي بَرِيئَةٌ لاَ تُصَدِّقُونِي، وَلَئِنِ اعْتَرَفْتُ لَكُمْ بِأَمْرٍ، وَاللَّهُ يَعْلَمُ أَنِّي مِنْهُ بَرِيئَةٌ لَتُصَدِّقُنِّي، فَوَاللَّهِ لاَ أَجِدُ لِي وَلَكُمْ مَثَلاً إِلاَّ أَبَا يُوسُفَ حِينَ قَالَ ‏{‏فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏}‏ ثُمَّ تَحَوَّلْتُ وَاضْطَجَعْتُ عَلَى فِرَاشِي، وَاللَّهُ يَعْلَمُ أَنِّي حِينَئِذٍ بَرِيئَةٌ، وَأَنَّ اللَّهَ مُبَرِّئِي بِبَرَاءَتِي وَلَكِنْ وَاللَّهِ مَا كُنْتُ أَظُنُّ أَنَّ اللَّهَ مُنْزِلٌ فِي شَأْنِي وَحْيًا يُتْلَى، لَشَأْنِي فِي نَفْسِي كَانَ أَحْقَرَ مِنْ أَنْ يَتَكَلَّمَ اللَّهُ فِيَّ بِأَمْرٍ، وَلَكِنْ كُنْتُ أَرْجُو أَنْ يَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّوْمِ رُؤْيَا يُبَرِّئُنِي اللَّهُ بِهَا، فَوَاللَّهِ مَا رَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَجْلِسَهُ، وَلاَ خَرَجَ أَحَدٌ مِنْ أَهْلِ الْبَيْتِ، حَتَّى أُنْزِلَ عَلَيْهِ، فَأَخَذَهُ مَا كَانَ يَأْخُذُهُ مِنَ الْبُرَحَاءِ، حَتَّى إِنَّهُ لَيَتَحَدَّرُ مِنْهُ مِنَ الْعَرَقِ مِثْلُ الْجُمَانِ وَهْوَ فِي يَوْمٍ شَاتٍ، مِنْ ثِقَلِ الْقَوْلِ الَّذِي أُنْزِلَ عَلَيْهِ ـ قَالَتْ ـ فَسُرِّيَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يَضْحَكُ، فَكَانَتْ أَوَّلَ كَلِمَةٍ تَكَلَّمَ بِهَا أَنْ قَالَ ‏\"‏ يَا عَائِشَةُ أَمَّا اللَّهُ فَقَدْ بَرَّأَكِ ‏\"‏‏.‏ قَالَتْ فَقَالَتْ لِي أُمِّي قُومِي إِلَيْهِ‏.‏ فَقُلْتُ وَاللَّهِ لاَ أَقُومُ إِلَيْهِ، فَإِنِّي لاَ أَحْمَدُ إِلاَّ اللَّهَ عَزَّ وَجَلَّ ـ قَالَتْ ـ وَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ‏}‏ الْعَشْرَ الآيَاتِ، ثُمَّ أَنْزَلَ اللَّهُ هَذَا فِي بَرَاءَتِي‏.‏ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ ـ وَكَانَ يُنْفِقُ عَلَى مِسْطَحِ بْنِ أُثَاثَةَ لِقَرَابَتِهِ مِنْهُ وَفَقْرِهِ ـ وَاللَّهِ لاَ أُنْفِقُ عَلَى مِسْطَحٍ شَيْئًا أَبَدًا بَعْدَ الَّذِي قَالَ لِعَائِشَةَ مَا قَالَ‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏ وَلاَ يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ‏}‏ إِلَى قَوْلِهِ ‏{‏غَفُورٌ رَحِيمٌ‏}‏ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ بَلَى وَاللَّهِ إِنِّي لأُحِبُّ أَنْ يَغْفِرَ اللَّهُ لِي   \nفَرَجَعَ إِلَى مِسْطَحٍ النَّفَقَةَ الَّتِي كَانَ يُنْفِقُ عَلَيْهِ وَقَالَ وَاللَّهِ لَا أَنْزِعُهَا مِنْهُ أَبَدًا قَالَتْ عَائِشَةُ  وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَ زَيْنَبَ بِنْتَ جَحْشٍ عَنْ أَمْرِي فَقَالَ لِزَيْنَبَ مَاذَا عَلِمْتِ أَوْ رَأَيْتِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَحْمِي سَمْعِي وَبَصَرِي وَاللَّهِ مَا عَلِمْتُ إِلَّا خَيْرًا قَالَتْ عَائِشَةُ وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَصَمَهَا اللَّهُ بِالْوَرَعِ قَالَتْ وَطَفِقَتْ أُخْتُهَا حَمْنَةُ تُحَارِبُ لَهَا فَهَلَكَتْ فِيمَنْ هَلَكَ  قَالَ ابْنُ شِهَابٍ فَهَذَا الَّذِي بَلَغَنِي مِنْ حَدِيثِ هَؤُلَاءِ الرَّهْطِ ثُمَّ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ وَاللَّهِ إِنَّ الرَّجُلَ الَّذِي قِيلَ لَهُ مَا قِيلَ لَيَقُولُ سُبْحَانَ اللَّهِ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا كَشَفْتُ مِنْ كَنَفِ أُنْثَى قَطُّ قَالَتْ ثُمَّ قُتِلَ بَعْدَ ذَلِكَ فِي سَبِيلِ اللَّهِ",
    "reference": "Reference : Sahih al-Bukhari 4141In-book reference : Book 64, Hadith 185USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 462   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4142,
    "id": 4142,
    "url": "https://sunnah.com/bukhari:4142",
    "bookNumber": 64,
    "hadithNumber": 186,
    "narrator": "Narrated Az-Zuhri:",
    "english": "Al-Walid bin `Abdul Malik said to me, \"Have you heard that `Ali' was one of those who slandered \n`Aisha?\" I replied, \"No, but two men from your people (named) Abu Salama bin `Abdur-Rahman and \nAbu Bakr bin `Abdur-Rahman bin Al-Harith have informed me that Aisha told them that `Ali \nremained silent about her case.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ أَمْلَى عَلَىَّ هِشَامُ بْنُ يُوسُفَ مِنْ حِفْظِهِ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ قَالَ لِي الْوَلِيدُ بْنُ عَبْدِ الْمَلِكِ أَبَلَغَكَ أَنَّ عَلِيًّا، كَانَ فِيمَنْ قَذَفَ عَائِشَةَ قُلْتُ لاَ‏.‏ وَلَكِنْ قَدْ أَخْبَرَنِي رَجُلاَنِ مِنْ قَوْمِكِ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَهُمَا كَانَ عَلِيٌّ مُسَلِّمًا فِي شَأْنِهَا‏.‏   \nفَرَاجَعُوهُ فَلَمْ يَرْجِعْ وَقَالَ مُسَلِّمًا بِلَا شَكٍّ فِيهِ وَعَلَيْهِ كَانَ فِي أَصْلِ الْعَتِيقِ كَذَلِكَ",
    "reference": "Reference : Sahih al-Bukhari 4142In-book reference : Book 64, Hadith 186USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 463   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4143,
    "id": 4143,
    "url": "https://sunnah.com/bukhari:4143",
    "bookNumber": 64,
    "hadithNumber": 187,
    "narrator": "Narrated Masruq bin Al-Aida:",
    "english": "Um Ruman, the mother of `Aisha said that while `Aisha and she were sitting, an Ansari woman came \nand said, \"May Allah harm such and-such a person!\" Um Ruman said to her, What is the matter?\" She \nreplied, \"My son was amongst those who talked of the story (of the Slander).\" Um Ruman said, \"What \nis that?\" She said, \"So-and-so....\" and narrated the whole story. On that `Aisha said, \"Did Allah's \nApostle hear about that?\" She replies, \"yes.\" `Aisha further said, \"And Abu Bakr too?\" She replied, \n\"Yes.\" On that, `Aisha fell down fainting, and when she came to her senses, she had got fever with \nrigors. I put her clothes over her and covered her. The Prophet (ﷺ) came and asked, \"What is wrong with \nthis (lady)?\" Um Ruman replied, \"O Allah's Messenger (ﷺ)! She (i.e. `Aisha) has got temperature with \nrigors.\" He said, \"Perhaps it is because of the story that has been talked about?\" She said, \"Yes.\" \n`Aisha sat up and said, \"By Allah, if I took an oath (that I am innocent), you would not believe me, \nand if I said (that I am not innocent), you would not excuse me. My and your example is like that of \nJacob and his sons (as Jacob said ): 'It is Allah (Alone) Whose Help can be sought against that you \nassert.' Um Ruman said, \"The Prophet (ﷺ) then went out saying nothing. Then Allah declared her \ninnocence. On that, `Aisha said (to the Prophet), \"I thank Allah only; thank neither anybody else nor \nyou.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، قَالَ حَدَّثَنِي مَسْرُوقُ بْنُ الأَجْدَعِ، قَالَ حَدَّثَتْنِي أُمُّ رُومَانَ ـ وَهْىَ أُمُّ عَائِشَةَ رضى الله عنها ـ قَالَتْ بَيْنَا أَنَا قَاعِدَةٌ أَنَا وَعَائِشَةُ إِذْ وَلَجَتِ امْرَأَةٌ مِنَ الأَنْصَارِ فَقَالَتْ فَعَلَ اللَّهُ بِفُلاَنٍ وَفَعَلَ‏.‏ فَقَالَتْ أُمُّ رُومَانَ وَمَا ذَاكَ قَالَتْ ابْنِي فِيمَنْ حَدَّثَ الْحَدِيثَ‏.‏ قَالَتْ وَمَا ذَاكَ قَالَتْ كَذَا وَكَذَا‏.‏ قَالَتْ عَائِشَةُ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ نَعَمْ‏.‏ قَالَتْ وَأَبُو بَكْرٍ قَالَتْ نَعَمْ‏.‏ فَخَرَّتْ مَغْشِيًّا عَلَيْهَا، فَمَا أَفَاقَتْ إِلاَّ وَعَلَيْهَا حُمَّى بِنَافِضٍ، فَطَرَحْتُ عَلَيْهَا ثِيَابَهَا فَغَطَّيْتُهَا‏.‏ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا شَأْنُ هَذِهِ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَخَذَتْهَا الْحُمَّى بِنَافِضٍ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ فِي حَدِيثٍ تُحُدِّثَ بِهِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ فَقَعَدَتْ عَائِشَةُ فَقَالَتْ وَاللَّهِ لَئِنْ حَلَفْتُ لاَ تُصَدِّقُونِي، وَلَئِنْ قُلْتُ لاَ تَعْذِرُونِي، مَثَلِي وَمَثَلُكُمْ كَيَعْقُوبَ وَبَنِيهِ، وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ، قَالَتْ وَانْصَرَفَ وَلَمْ يَقُلْ شَيْئًا، فَأَنْزَلَ اللَّهُ عُذْرَهَا ـ قَالَتْ ـ بِحَمْدِ اللَّهِ لاَ بِحَمْدِ أَحَدٍ وَلاَ بِحَمْدِكَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4143In-book reference : Book 64, Hadith 187USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 464   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4144,
    "id": 4144,
    "url": "https://sunnah.com/bukhari:4144",
    "bookNumber": 64,
    "hadithNumber": 188,
    "narrator": "Narrated Ibn Abi Malaika:",
    "english": "`Aisha used to recite this Verse:-- 'Ida taliqunahu bi-alsinatikum' (24.15) \"(As you tell lie with your \ntongues.)\" and used to say \"Al-Walaq\" means \"telling of a lie. \"She knew this Verse more than \nanybody else as it was revealed about her.",
    "arabic": "حَدَّثَنِي يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ نَافِعِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَتْ تَقْرَأُ ‏{‏إِذْ تَلِقُونَهُ بِأَلْسِنَتِكُمْ‏}‏ وَتَقُولُ الْوَلْقُ الْكَذِبُ‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَكَانَتْ أَعْلَمَ مِنْ غَيْرِهَا بِذَلِكَ لأَنَّهُ نَزَلَ فِيهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4144In-book reference : Book 64, Hadith 188USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 465   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4145,
    "id": 4145,
    "url": "https://sunnah.com/bukhari:4145",
    "bookNumber": 64,
    "hadithNumber": 189,
    "narrator": "Narrated Hisham's father:",
    "english": "I started abusing Hassan in front of `Aisha. She said, \"Do not abuse him as he used to defend Allah's \nApostle (against the infidels). `Aisha added, \"Once Hassan took the permission from the Prophet (ﷺ) to \nsay poetic verses against the infidels. On that the Prophet (ﷺ) said, 'How will you exclude my forefathers \n(from that)? Hassan replied, 'I will take you out of them as one takes a hair out of the dough.\" \nHisham's father added, \"I abused Hassan as he was one of those who spoke against `Aisha.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ ذَهَبْتُ أَسُبُّ حَسَّانَ عِنْدَ عَائِشَةَ فَقَالَتْ لاَ تَسُبَّهُ، فَإِنَّهُ كَانَ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَتْ عَائِشَةُ اسْتَأْذَنَ النَّبِيَّ صلى الله عليه وسلم فِي هِجَاءِ الْمُشْرِكِينَ قَالَ ‏\n\"‏ كَيْفَ بِنَسَبِي ‏\"‏‏.‏ قَالَ لأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعْرَةُ مِنَ الْعَجِينِ‏.‏   \nوَقَالَ مُحَمَّدٌ حَدَّثَنَا عُثْمَانُ بْنُ فَرْقَدٍ، سَمِعْتُ هِشَامًا، عَنْ أَبِيهِ، قَالَ سَبَبْتُ حَسَّانَ، وَكَانَ مِمَّنْ كَثَّرَ عَلَيْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4145In-book reference : Book 64, Hadith 189USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 466   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4146,
    "id": 4146,
    "url": "https://sunnah.com/bukhari:4146",
    "bookNumber": 64,
    "hadithNumber": 190,
    "narrator": "Narrated Masruq:",
    "english": "We went to `Aisha while Hassan bin Thabit was with her reciting poetry to her from some of his \npoetic verses, saying \"A chaste wise lady about whom nobody can have suspicion. She gets up with an \nempty stomach because she never eats the flesh of indiscreet (ladies).\" `Aisha said to him, \"But you \nare not like that.\" I said to her, \"Why do you grant him admittance, though Allah said:-- \"and as for \nhim among them, who had the greater share therein, his will be a severe torment.\" (24.11) \nOn that, `Aisha said, \"And what punishment is more than blinding?\" She, added, \"Hassan used to \ndefend or say poetry on behalf of Allah's Messenger (ﷺ) (against the infidels).",
    "arabic": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ دَخَلْنَا عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَعِنْدَهَا حَسَّانُ بْنُ ثَابِتٍ يُنْشِدُهَا شِعْرًا، يُشَبِّبُ بِأَبْيَاتٍ لَهُ وَقَالَ:\n حَصَانٌ رَزَانٌ مَا تُزَنُّ بِرِيبَةٍ وَتُصْبِحُ غَرْثَى مِنْ لُحُومِ الْغَوَافِلِ فَقَالَتْ لَهُ عَائِشَةُ لَكِنَّكَ لَسْتَ كَذَلِكَ‏.‏ قَالَ مَسْرُوقٌ فَقُلْتُ لَهَا لِمَ تَأْذَنِينَ لَهُ أَنْ يَدْخُلَ عَلَيْكِ‏.‏ وَقَدْ قَالَ اللَّهُ تَعَالَى ‏{‏وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ‏}‏‏.‏ فَقَالَتْ وَأَىُّ عَذَابٍ أَشَدُّ مِنَ الْعَمَى‏.‏ قَالَتْ لَهُ إِنَّهُ كَانَ يُنَافِحُ ـ أَوْ يُهَاجِي ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4146In-book reference : Book 64, Hadith 190USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 467   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4147,
    "id": 4147,
    "url": "https://sunnah.com/bukhari:4147",
    "bookNumber": 64,
    "hadithNumber": 191,
    "narrator": "Narrated Zaid bin Khalid:",
    "english": "We went out with Allah's Messenger (ﷺ) in the year of Al-Hudaibiya. One night it rained and Allah's Messenger (ﷺ) \nled us in the Fajr prayer and (after finishing it), turned to us and said, \"Do you know what your Lord \nhas said?\" We replied, \"Allah and His Apostle know it better.\" He said, \"Allah said:-- \"(Some of) My \nslaves got up believing in Me, And (some of them) disbelieving in Me. The one who said: We have \nbeen given Rain through Allah's Mercy and Allah's Blessing and Allah's Bounty, then he is a believer \nin Me, and is a disbeliever in the star. And whoever said: We have been given rain because of such and- \nsuch star, then he is a believer in the star, and is a disbeliever in Me.\"",
    "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي صَالِحُ بْنُ كَيْسَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ، فَأَصَابَنَا مَطَرٌ ذَاتَ لَيْلَةٍ، فَصَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الصُّبْحَ، ثُمَّ أَقْبَلَ عَلَيْنَا فَقَالَ ‏\"‏ أَتَدْرُونَ مَاذَا قَالَ رَبُّكُمْ ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَقَالَ ‏\"‏ قَالَ اللَّهُ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ بِي، فَأَمَّا مَنْ قَالَ مُطِرْنَا بِرَحْمَةِ اللَّهِ وَبِرِزْقِ اللَّهِ وَبِفَضْلِ اللَّهِ‏.‏ فَهْوَ مُؤْمِنٌ بِي، كَافِرٌ بِالْكَوْكَبِ‏.‏ وَأَمَّا مَنْ قَالَ مُطِرْنَا بِنَجْمِ كَذَا‏.‏ فَهْوَ مُؤْمِنٌ بِالْكَوْكَبِ، كَافِرٌ بِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4147In-book reference : Book 64, Hadith 191USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 468   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4148,
    "id": 4148,
    "url": "https://sunnah.com/bukhari:4148",
    "bookNumber": 64,
    "hadithNumber": 192,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) performed four `Umras, all in the month of Dhul-Qa'da, except the one which he \nperformed with his Hajj (i.e. in Dhul-Hijja). He performed one `Umra from Al-Hudaibiya in Dhul- \nQa'da, another `Umra in the following year in Dhul Qa'da a third from Al-Jirana where he distributed \nthe war booty of Hunain, in Dhul Qa'da, and the fourth `Umra he performed was with his Hajj.",
    "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ أَخْبَرَهُ قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْبَعَ عُمَرٍ كُلُّهُنَّ فِي ذِي الْقَعْدَةِ، إِلاَّ الَّتِي كَانَتْ مَعَ حَجَّتِهِ‏.‏ عُمْرَةً مِنَ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ، وَعُمْرَةً مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ، وَعُمْرَةً مِنَ الْجِعْرَانَةِ حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ فِي ذِي الْقَعْدَةِ، وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4148In-book reference : Book 64, Hadith 192USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 469   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4149,
    "id": 4149,
    "url": "https://sunnah.com/bukhari:4149",
    "bookNumber": 64,
    "hadithNumber": 193,
    "narrator": "Narrated Abu Qatada:",
    "english": "We set out with the Prophet (ﷺ) in the year of Al-Hudaibiya, and all his companions assumed the state of \nIhram but I did not.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَاهُ، حَدَّثَهُ قَالَ انْطَلَقْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ، وَلَمْ أُحْرِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4149In-book reference : Book 64, Hadith 193USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 470   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4150,
    "id": 4150,
    "url": "https://sunnah.com/bukhari:4150",
    "bookNumber": 64,
    "hadithNumber": 194,
    "narrator": "Narrated Al-Bara:",
    "english": "Do you (people) consider the conquest of Mecca, the Victory (referred to in the Qur'an 48:1). Was the \nconquest of Mecca a victory? We really consider that the actual Victory was the Ar-Ridwan Pledge of \nallegiance which we gave on the day of Al-Hudaibiya (to the Prophet) . On the day of Al-Hudaibiya \nwe were fourteen hundred men along with the Prophet (ﷺ) Al-Hudaibiya was a well, the water of which \nwe used up leaving not a single drop of water in it. When the Prophet (ﷺ) was informed of that, he came \nand sat on its edge. Then he asked for a utensil of water, performed ablution from it, rinsed (his \nmouth), invoked (Allah), and poured the remaining water into the well. We stayed there for a while \nand then the well brought forth what we required of water for ourselves and our riding animals.",
    "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ تَعُدُّونَ أَنْتُمُ الْفَتْحَ فَتْحَ مَكَّةَ، وَقَدْ كَانَ فَتْحُ مَكَّةَ فَتْحًا، وَنَحْنُ نَعُدُّ الْفَتْحَ بَيْعَةَ الرُّضْوَانِ يَوْمَ الْحُدَيْبِيَةِ‏.‏ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم أَرْبَعَ عَشْرَةَ مِائَةً، وَالْحُدَيْبِيَةُ بِئْرٌ فَنَزَحْنَاهَا، فَلَمْ نَتْرُكْ فِيهَا قَطْرَةً، فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَأَتَاهَا، فَجَلَسَ عَلَى شَفِيرِهَا، ثُمَّ دَعَا بِإِنَاءٍ مِنْ مَاءٍ فَتَوَضَّأَ ثُمَّ مَضْمَضَ وَدَعَا، ثُمَّ صَبَّهُ فِيهَا فَتَرَكْنَاهَا غَيْرَ بَعِيدٍ ثُمَّ إِنَّهَا أَصْدَرَتْنَا مَا شِئْنَا نَحْنُ وَرِكَابَنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4150In-book reference : Book 64, Hadith 194USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 471   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4151,
    "id": 4151,
    "url": "https://sunnah.com/bukhari:4151",
    "bookNumber": 64,
    "hadithNumber": 195,
    "narrator": "Narrated Al-Bara bin Azib:",
    "english": "That they were in the company of Allah's Messenger (ﷺ) on the day of Al-Hudaibiya and their number was \n1400 or more. They camped at a well and drew its water till it was dried. When they informed Allah's \nApostle of that, he came and sat over its edge and said, \"Bring me a bucket of its water.\" When it was \nbrought, he spat and invoked (Allah) and said, \"Leave it for a while.\" Then they quenched their thirst \nand watered their riding animals (from that well) till they departed.",
    "arabic": "حَدَّثَنِي فَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ أَبُو عَلِيٍّ الْحَرَّانِيُّ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ أَنْبَأَنَا الْبَرَاءُ بْنُ عَازِبٍ ـ رضى الله عنهما أَنَّهُمْ كَانُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَمِائَةٍ أَوْ أَكْثَرَ، فَنَزَلُوا عَلَى بِئْرٍ فَنَزَحُوهَا، فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَتَى الْبِئْرَ، وَقَعَدَ عَلَى شَفِيرِهَا ثُمَّ قَالَ ‏\"‏ ائْتُونِي بِدَلْوٍ مِنْ مَائِهَا ‏\"‏‏.‏ فَأُتِيَ بِهِ فَبَصَقَ فَدَعَا ثُمَّ قَالَ ‏\"‏ دَعُوهَا سَاعَةً ‏\"‏‏.‏ فَأَرْوَوْا أَنْفُسَهُمْ وَرِكَابَهُمْ حَتَّى ارْتَحَلُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4151In-book reference : Book 64, Hadith 195USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 472   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4152,
    "id": 4152,
    "url": "https://sunnah.com/bukhari:4152",
    "bookNumber": 64,
    "hadithNumber": 196,
    "narrator": "Narrated Salim:",
    "english": "Jabir said \"On the day of Al-Hudaibiya, the people felt thirsty and Allah's Messenger (ﷺ) had a utensil \ncontaining water. He performer ablution from it and then the people came towards him. Allah's \nApostle said, 'What is wrong with you?' The people said, 'O Allah's Messenger (ﷺ)! We haven't got any water \nto perform ablution with or to drink, except what you have in your utensil.' So the Prophet (ﷺ) put his \nhand in the utensil and the water started spouting out between his fingers like springs. So we drank \nand performed ablution.\" I said to Jabir, \"What was your number on that day?\" He replied, \"Even if \nwe had been one hundred thousand, that water would have been sufficient for us. Anyhow, we were \n1500.'",
    "arabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ، عَنْ سَالِمٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ عَطِشَ النَّاسُ يَوْمَ الْحُدَيْبِيَةِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ يَدَيْهِ رَكْوَةٌ، فَتَوَضَّأَ مِنْهَا، ثُمَّ أَقْبَلَ النَّاسُ نَحْوَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا لَكُمْ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ لَيْسَ عِنْدَنَا مَاءٌ نَتَوَضَّأُ بِهِ، وَلاَ نَشْرَبُ إِلاَّ مَا فِي رَكْوَتِكَ‏.‏ قَالَ فَوَضَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ فِي الرَّكْوَةِ، فَجَعَلَ الْمَاءُ يَفُورُ مِنْ بَيْنِ أَصَابِعِهِ كَأَمْثَالِ الْعُيُونِ، قَالَ فَشَرِبْنَا وَتَوَضَّأْنَا‏.‏ فَقُلْتُ لِجَابِرٍ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ لَوْ كُنَّا مِائَةَ أَلْفٍ لَكَفَانَا، كُنَّا خَمْسَ عَشْرَةَ مِائَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4152In-book reference : Book 64, Hadith 196USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 473   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4153,
    "id": 4153,
    "url": "https://sunnah.com/bukhari:4153",
    "bookNumber": 64,
    "hadithNumber": 197,
    "narrator": "Narrated Qatada:",
    "english": "I said to Sa`id bin Al-Musaiyab, \"I have been informed that Jabir bin `Abdullah said that the number \n(of Al-Hudaibiya Muslim warriors) was 1400.\" Sa`id said to me, \"Jabir narrated to me that they were \n1500 who gave the Pledge of allegiance to the Prophet (ﷺ) on the day of Al-Hudaibiya.'",
    "arabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، قُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ بَلَغَنِي أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، كَانَ يَقُولُ كَانُوا أَرْبَعَ عَشْرَةَ مِائَةً‏.‏ فَقَالَ لِي سَعِيدٌ حَدَّثَنِي جَابِرٌ كَانُوا خَمْسَ عَشْرَةَ مِائَةً الَّذِينَ بَايَعُوا النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ‏.‏\nتَابَعَهُ أَبُو دَاوُدَ حَدَّثَنَا قُرَّةُ عَنْ قَتَادَةَ",
    "reference": "Reference : Sahih al-Bukhari 4153In-book reference : Book 64, Hadith 197USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 474   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4154,
    "id": 4154,
    "url": "https://sunnah.com/bukhari:4154",
    "bookNumber": 64,
    "hadithNumber": 198,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the day of Al-Hudaibiya, Allah's Messenger (ﷺ) said to us' \"You are the best people on the earth!\" We \nwere 1400 then. If I could see now, I would have shown you the place of the Tree (beneath which we gave the\nPledge of Allegiance).\" Salim said, \"Our number was 1400.\"",
    "arabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ ‏\n\"‏ أَنْتُمْ خَيْرُ أَهْلِ الأَرْضِ ‏\"‏‏.‏ وَكُنَّا أَلْفًا وَأَرْبَعَمِائَةٍ، وَلَوْ كُنْتُ أُبْصِرُ الْيَوْمَ لأَرَيْتُكُمْ مَكَانَ الشَّجَرَةِ‏.‏ تَابَعَهُ الأَعْمَشُ سَمِعَ سَالِمًا سَمِعَ جَابِرًا أَلْفًا وَأَرْبَعَمِائَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4154In-book reference : Book 64, Hadith 198USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4155,
    "id": 4155,
    "url": "https://sunnah.com/bukhari:4155",
    "bookNumber": 64,
    "hadithNumber": 199,
    "narrator": "",
    "english": "`Abdullah bin Abi `Aufa \nsaid, \"The people (who gave the Pledge of allegiance) under the Tree numbered 1300 and the number of Bani Aslam was 1/8 of the Emigrants.\"",
    "arabic": "وَقَالَ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي أَوْفَى ـ رضى الله عنهما ـ كَانَ أَصْحَابُ الشَّجَرَةِ أَلْفًا وَثَلاَثَمِائَةٍ، وَكَانَتْ أَسْلَمُ ثُمْنَ الْمُهَاجِرِينَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4155In-book reference : Book 64, Hadith 199USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 475   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4156,
    "id": 4156,
    "url": "https://sunnah.com/bukhari:4156",
    "bookNumber": 64,
    "hadithNumber": 200,
    "narrator": "Narrated Mirdas Al-Aslami:",
    "english": "Who was among those (who had given the Pledge of allegiance) under the Tree: Pious people will die \nin succession, and there will remain the dregs of society who will be like the useless residues of dates \nand barley and Allah will pay no attention to them.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، أَنَّهُ سَمِعَ مِرْدَاسًا الأَسْلَمِيَّ، يَقُولُ ـ وَكَانَ مِنْ أَصْحَابِ الشَّجَرَةِ ـ يُقْبَضُ الصَّالِحُونَ الأَوَّلُ فَالأَوَّلُ، وَتَبْقَى حُفَالَةٌ كَحُفَالَةِ التَّمْرِ وَالشَّعِيرِ، لاَ يَعْبَأُ اللَّهُ بِهِمْ شَيْئًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4156In-book reference : Book 64, Hadith 200USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 476   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4157,
    "id": 4157,
    "url": "https://sunnah.com/bukhari:4157",
    "bookNumber": 64,
    "hadithNumber": 201,
    "narrator": "Narrated Marwan and Al-Miswar bin Makhrama:",
    "english": "The Prophet (ﷺ) went out in the company of 1300 to 1500 of his companions in the year of Al-Hudaibiya, \nand when they reached Dhul-Hulaifa, he garlanded and marked his Hadi and assumed the state of \nIhram.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ مَرْوَانَ، وَالْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، فَلَمَّا كَانَ بِذِي الْحُلَيْفَةِ قَلَّدَ الْهَدْىَ وَأَشْعَرَ وَأَحْرَمَ مِنْهَا‏.‏ لاَ أُحْصِي كَمْ سَمِعْتُهُ مِنْ سُفْيَانَ حَتَّى سَمِعْتُهُ يَقُولُ لاَ أَحْفَظُ مِنَ الزُّهْرِيِّ الإِشْعَارَ وَالتَّقْلِيدَ، فَلاَ أَدْرِي ـ يَعْنِي ـ مَوْضِعَ الإِشْعَارِ وَالتَّقْلِيدِ، أَوِ الْحَدِيثَ كُلَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4157, 4158In-book reference : Book 64, Hadith 201USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4158,
    "id": 4158,
    "url": "https://sunnah.com/bukhari:4158",
    "bookNumber": 64,
    "hadithNumber": 201,
    "narrator": "Narrated Marwan and Al-Miswar bin Makhrama:",
    "english": "The Prophet (ﷺ) went out in the company of 1300 to 1500 of his companions in the year of Al-Hudaibiya, \nand when they reached Dhul-Hulaifa, he garlanded and marked his Hadi and assumed the state of \nIhram.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ مَرْوَانَ، وَالْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، فَلَمَّا كَانَ بِذِي الْحُلَيْفَةِ قَلَّدَ الْهَدْىَ وَأَشْعَرَ وَأَحْرَمَ مِنْهَا‏.‏ لاَ أُحْصِي كَمْ سَمِعْتُهُ مِنْ سُفْيَانَ حَتَّى سَمِعْتُهُ يَقُولُ لاَ أَحْفَظُ مِنَ الزُّهْرِيِّ الإِشْعَارَ وَالتَّقْلِيدَ، فَلاَ أَدْرِي ـ يَعْنِي ـ مَوْضِعَ الإِشْعَارِ وَالتَّقْلِيدِ، أَوِ الْحَدِيثَ كُلَّهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4157, 4158In-book reference : Book 64, Hadith 201USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 477   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4159,
    "id": 4159,
    "url": "https://sunnah.com/bukhari:4159",
    "bookNumber": 64,
    "hadithNumber": 202,
    "narrator": "Narrated Ka`b bin Ujra:",
    "english": "That Allah's Messenger (ﷺ) saw him with the lice falling (from his head) on his face. Allah's Messenger (ﷺ) said, \n\"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Messenger (ﷺ) thus ordered him to shave his head \nwhile he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their \nstate of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, \nso Allah's Messenger (ﷺ) ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep \nor fast for three days.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ خَلَفٍ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، عَنْ أَبِي بِشْرٍ، وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَآهُ وَقَمْلُهُ يَسْقُطُ عَلَى وَجْهِهِ فَقَالَ ‏\n\"‏ أَيُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَحْلِقَ وَهْوَ بِالْحُدَيْبِيَةِ، لَمْ يُبَيِّنْ لَهُمْ أَنَّهُمْ يَحِلُّونَ بِهَا، وَهُمْ عَلَى طَمَعٍ أَنْ يَدْخُلُوا مَكَّةَ، فَأَنْزَلَ اللَّهُ الْفِدْيَةَ، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُطْعِمَ فَرَقًا بَيْنَ سِتَّةِ مَسَاكِينَ، أَوْ يُهْدِيَ شَاةً، أَوْ يَصُومَ ثَلاَثَةَ أَيَّامٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4159In-book reference : Book 64, Hadith 202USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 478   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4160,
    "id": 4160,
    "url": "https://sunnah.com/bukhari:4160",
    "bookNumber": 64,
    "hadithNumber": 203,
    "narrator": "Narrated Aslam:",
    "english": "Once I went with `Umar bin Al-Khattab to the market. A young woman followed `Umar and said, \"O \nchief of the believers! My husband has died, leaving little children. By Allah, they have not even a \nsheep's trotter to cook; they have no farms or animals. I am afraid that they may die because of \nhunger, and I am the daughter of Khufaf bin Ima Al-Ghafari, and my father witnessed the Pledge of \nallegiance) of Al-Hudaibiya with the Prophet.' `Umar stopped and did not proceed, and said, \"I \nwelcome my near relative.\" Then he went towards a strong camel which was tied in the house, and \ncarried on to it, two sacks he had loaded with food grains and put between them money and clothes \nand gave her its rope to hold and said, \"Lead it, and this provision will not finish till Allah gives you a \ngood supply.\" A man said, \"O chief of the believers! You have given her too much.\" \"`Umar said \ndisapprovingly. \"May your mother be bereaved of you! By Allah, I have seen her father and brother \nbesieging a fort for a long time and conquering it, and then we were discussing what their shares they \nwould have from that war booty.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ إِلَى السُّوقِ، فَلَحِقَتْ عُمَرَ امْرَأَةٌ شَابَّةٌ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ هَلَكَ زَوْجِي وَتَرَكَ صِبْيَةً صِغَارًا، وَاللَّهِ مَا يُنْضِجُونَ كُرَاعًا، وَلاَ لَهُمْ زَرْعٌ وَلاَ ضَرْعٌ، وَخَشِيتُ أَنْ تَأْكُلَهُمُ الضَّبُعُ، وَأَنَا بِنْتُ خُفَافِ بْنِ إِيمَاءَ الْغِفَارِيِّ، وَقَدْ شَهِدَ أَبِي الْحُدَيْبِيَةَ مَعَ النَّبِيِّ صلى الله عليه وسلم، فَوَقَفَ مَعَهَا عُمَرُ، وَلَمْ يَمْضِ، ثُمَّ قَالَ مَرْحَبًا بِنَسَبٍ قَرِيبٍ‏.‏ ثُمَّ انْصَرَفَ إِلَى بَعِيرٍ ظَهِيرٍ كَانَ مَرْبُوطًا فِي الدَّارِ، فَحَمَلَ عَلَيْهِ غِرَارَتَيْنِ مَلأَهُمَا طَعَامًا، وَحَمَلَ بَيْنَهُمَا نَفَقَةً وَثِيَابًا، ثُمَّ نَاوَلَهَا بِخِطَامِهِ ثُمَّ قَالَ اقْتَادِيهِ فَلَنْ يَفْنَى حَتَّى يَأْتِيَكُمُ اللَّهُ بِخَيْرٍ‏.‏ فَقَالَ رَجُلٌ يَا أَمِيرَ الْمُؤْمِنِينَ أَكْثَرْتَ لَهَا‏.‏ قَالَ عُمَرُ ثَكِلَتْكَ أُمُّكَ، وَاللَّهِ إِنِّي لأَرَى أَبَا هَذِهِ وَأَخَاهَا قَدْ حَاصَرَا حِصْنًا زَمَانًا، فَافْتَتَحَاهُ، ثُمَّ أَصْبَحْنَا نَسْتَفِيءُ سُهْمَانَهُمَا فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4160, 4161In-book reference : Book 64, Hadith 203USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4161,
    "id": 4161,
    "url": "https://sunnah.com/bukhari:4161",
    "bookNumber": 64,
    "hadithNumber": 203,
    "narrator": "Narrated Aslam:",
    "english": "Once I went with `Umar bin Al-Khattab to the market. A young woman followed `Umar and said, \"O \nchief of the believers! My husband has died, leaving little children. By Allah, they have not even a \nsheep's trotter to cook; they have no farms or animals. I am afraid that they may die because of \nhunger, and I am the daughter of Khufaf bin Ima Al-Ghafari, and my father witnessed the Pledge of \nallegiance) of Al-Hudaibiya with the Prophet.' `Umar stopped and did not proceed, and said, \"I \nwelcome my near relative.\" Then he went towards a strong camel which was tied in the house, and \ncarried on to it, two sacks he had loaded with food grains and put between them money and clothes \nand gave her its rope to hold and said, \"Lead it, and this provision will not finish till Allah gives you a \ngood supply.\" A man said, \"O chief of the believers! You have given her too much.\" \"`Umar said \ndisapprovingly. \"May your mother be bereaved of you! By Allah, I have seen her father and brother \nbesieging a fort for a long time and conquering it, and then we were discussing what their shares they \nwould have from that war booty.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ إِلَى السُّوقِ، فَلَحِقَتْ عُمَرَ امْرَأَةٌ شَابَّةٌ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ هَلَكَ زَوْجِي وَتَرَكَ صِبْيَةً صِغَارًا، وَاللَّهِ مَا يُنْضِجُونَ كُرَاعًا، وَلاَ لَهُمْ زَرْعٌ وَلاَ ضَرْعٌ، وَخَشِيتُ أَنْ تَأْكُلَهُمُ الضَّبُعُ، وَأَنَا بِنْتُ خُفَافِ بْنِ إِيمَاءَ الْغِفَارِيِّ، وَقَدْ شَهِدَ أَبِي الْحُدَيْبِيَةَ مَعَ النَّبِيِّ صلى الله عليه وسلم، فَوَقَفَ مَعَهَا عُمَرُ، وَلَمْ يَمْضِ، ثُمَّ قَالَ مَرْحَبًا بِنَسَبٍ قَرِيبٍ‏.‏ ثُمَّ انْصَرَفَ إِلَى بَعِيرٍ ظَهِيرٍ كَانَ مَرْبُوطًا فِي الدَّارِ، فَحَمَلَ عَلَيْهِ غِرَارَتَيْنِ مَلأَهُمَا طَعَامًا، وَحَمَلَ بَيْنَهُمَا نَفَقَةً وَثِيَابًا، ثُمَّ نَاوَلَهَا بِخِطَامِهِ ثُمَّ قَالَ اقْتَادِيهِ فَلَنْ يَفْنَى حَتَّى يَأْتِيَكُمُ اللَّهُ بِخَيْرٍ‏.‏ فَقَالَ رَجُلٌ يَا أَمِيرَ الْمُؤْمِنِينَ أَكْثَرْتَ لَهَا‏.‏ قَالَ عُمَرُ ثَكِلَتْكَ أُمُّكَ، وَاللَّهِ إِنِّي لأَرَى أَبَا هَذِهِ وَأَخَاهَا قَدْ حَاصَرَا حِصْنًا زَمَانًا، فَافْتَتَحَاهُ، ثُمَّ أَصْبَحْنَا نَسْتَفِيءُ سُهْمَانَهُمَا فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4160, 4161In-book reference : Book 64, Hadith 203USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 479   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4162,
    "id": 4162,
    "url": "https://sunnah.com/bukhari:4162",
    "bookNumber": 64,
    "hadithNumber": 204,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "That his father said, \"I saw the Tree (of the Ar-Ridwan Pledge of allegiance and when I returned to it \nlater, I was not able to recognize it. (The sub--narrator MahmiJd said, Al-Musaiyab said, 'Then; forgot \nit (i.e., the Tree).)\"",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ أَبُو عَمْرٍو الْفَزَارِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَقَدْ رَأَيْتُ الشَّجَرَةَ، ثُمَّ أَتَيْتُهَا بَعْدُ فَلَمْ أَعْرِفْهَا‏.‏ قَالَ مَحْمُودٌ ثُمَّ أُنْسِيتُهَا بَعْدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4162In-book reference : Book 64, Hadith 204USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 480   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4163,
    "id": 4163,
    "url": "https://sunnah.com/bukhari:4163",
    "bookNumber": 64,
    "hadithNumber": 205,
    "narrator": "Narrated Tariq bin `Abdur-Rahman:",
    "english": "When I set out for Hajj, I passed by some people offering a prayer, I asked, \"What is this mosque?\" \nThey said, \"This is the Tree where Allah's Messenger (ﷺ) took the Ar-Ridwan Pledge of allegiance. Then I \nwent to Sa`id bin Musaiyab and informed him about it. Sa`id said, \"My father said that he was \namongst those who had given the Pledge of allegiance to Allah's Messenger (ﷺ) beneath the Tree. He (i.e. my \nfather) said, \"When we set out the following year, we forgot the Tree and were unable to recognize it. \n\"Then Sa`id said (perhaps ironically) \"The companions of the Prophet (ﷺ) could not recognize it; \nnevertheless, you do recognize it; therefore you have a better knowledge.\"",
    "arabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ انْطَلَقْتُ حَاجًّا فَمَرَرْتُ بِقَوْمٍ يُصَلُّونَ قُلْتُ مَا هَذَا الْمَسْجِدُ قَالُوا هَذِهِ الشَّجَرَةُ، حَيْثُ بَايَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْعَةَ الرُّضْوَانِ‏.‏ فَأَتَيْتُ سَعِيدَ بْنَ الْمُسَيَّبِ فَأَخْبَرْتُهُ فَقَالَ سَعِيدٌ حَدَّثَنِي أَبِي أَنَّهُ كَانَ فِيمَنْ بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم تَحْتَ الشَّجَرَةِ، قَالَ فَلَمَّا خَرَجْنَا مِنَ الْعَامِ الْمُقْبِلِ نَسِينَاهَا، فَلَمْ نَقْدِرْ عَلَيْهَا‏.‏ فَقَالَ سَعِيدٌ إِنَّ أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم لَمْ يَعْلَمُوهَا وَعَلِمْتُمُوهَا أَنْتُمْ، فَأَنْتُمْ أَعْلَمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4163In-book reference : Book 64, Hadith 205USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 481   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4164,
    "id": 4164,
    "url": "https://sunnah.com/bukhari:4164",
    "bookNumber": 64,
    "hadithNumber": 206,
    "narrator": "Narrated Sa`id bin Al-Musaiyab:",
    "english": "That his father was amongst those who had given the Pledge of allegiance (to the Prophet (ﷺ) ) beneath \nthe Tree, and the next year when they went towards the Tree, they were not able to recognize it.",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا طَارِقٌ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ، فَرَجَعْنَا إِلَيْهَا الْعَامَ الْمُقْبِلَ فَعَمِيَتْ عَلَيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4164In-book reference : Book 64, Hadith 206USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 482   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4165,
    "id": 4165,
    "url": "https://sunnah.com/bukhari:4165",
    "bookNumber": 64,
    "hadithNumber": 207,
    "narrator": "Narrated Tariq:",
    "english": "(The tree where the Ridwan Pledge of allegiance was taken by the Prophet) was mentioned before \nSa`id bin Al-Musaiyab. On that he smiled and said, \"My father informed me (about it) and he had \nwitnessed it (i.e. the Pledge) .\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ طَارِقٍ، قَالَ ذُكِرَتْ عِنْدَ سَعِيدِ بْنِ الْمُسَيَّبِ الشَّجَرَةُ فَضَحِكَ فَقَالَ أَخْبَرَنِي أَبِي وَكَانَ، شَهِدَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4165In-book reference : Book 64, Hadith 207USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 483   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4166,
    "id": 4166,
    "url": "https://sunnah.com/bukhari:4166",
    "bookNumber": 64,
    "hadithNumber": 208,
    "narrator": "Narrated `Abdullah bin Abi `Aufa:",
    "english": "(Who was one of those who had given the Pledge of allegiance to the Prophet (ﷺ) beneath the Tree) When \nthe people brought Sadaqa (i.e. rak`at) to the Prophet (ﷺ) he used to say, \"O Allah! Bless them with your \nMercy.\" Once my father came with his Sadaqa to him whereupon he (i.e. the Prophet) said. \"O Allah! \nBless the family of Abu `Aufa.\"",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ وَكَانَ مِنْ أَصْحَابِ الشَّجَرَةِ ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَتَاهُ قَوْمٌ بِصَدَقَةٍ قَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَيْهِمْ ‏\"‏‏.‏ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4166In-book reference : Book 64, Hadith 208USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 484   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4167,
    "id": 4167,
    "url": "https://sunnah.com/bukhari:4167",
    "bookNumber": 64,
    "hadithNumber": 209,
    "narrator": "Narrated `Abbas bin Tamim:",
    "english": "When it was the day (of the battle) of Al-Harra the people were giving Pledge of allegiance to \n`Abdullah bin Hanzala. Ibn Zaid said, \"For what are the people giving Pledge of allegiance to \n`Abdullah bin Hanzala?\" It was said to him, \"For death.\" Ibn Zaid said, \"I will never give the Pledge \nof allegiance for that to anybody else after Allah's Messenger (ﷺ) .\" Ibn Zaid was one of those who had \nwitnessed the day of Al-Hudaibiya with the Prophet.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، قَالَ لَمَّا كَانَ يَوْمُ الْحَرَّةِ وَالنَّاسُ يُبَايِعُونَ لِعَبْدِ اللَّهِ بْنِ حَنْظَلَةَ فَقَالَ ابْنُ زَيْدٍ عَلَى مَا يُبَايِعُ ابْنُ حَنْظَلَةَ النَّاسَ قِيلَ لَهُ عَلَى الْمَوْتِ‏.‏ قَالَ لاَ أُبَايِعُ عَلَى ذَلِكَ أَحَدًا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَكَانَ شَهِدَ مَعَهُ الْحُدَيْبِيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4167In-book reference : Book 64, Hadith 209USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 485   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4168,
    "id": 4168,
    "url": "https://sunnah.com/bukhari:4168",
    "bookNumber": 64,
    "hadithNumber": 210,
    "narrator": "Narrated Iyas bin Salama bin Al-Akwa`:",
    "english": "My father who was amongst those who had given the Pledge of allegiance to the Prophet (ﷺ) beneath the \nTree, said to me, \"We used to offer the Jumua prayer with the Prophet (ﷺ) and then depart at a time when \nthe walls had no shade for us to take shelter in.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَعْلَى الْمُحَارِبِيُّ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ حَدَّثَنِي ـ أَبِي وَكَانَ، مِنْ أَصْحَابِ الشَّجَرَةِ ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ نَنْصَرِفُ، وَلَيْسَ لِلْحِيطَانِ ظِلٌّ نَسْتَظِلُّ فِيهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4168In-book reference : Book 64, Hadith 210USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 486   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4169,
    "id": 4169,
    "url": "https://sunnah.com/bukhari:4169",
    "bookNumber": 64,
    "hadithNumber": 211,
    "narrator": "Narrated Yazid bin Abi Ubaid:",
    "english": "I said to Salama bin Al-Akwa`, \"For what did you give the Pledge of allegiance to Allah's Messenger (ﷺ) on \nthe day of Al-Hudaibiya?\" He replied, \"For death (in the Cause of Islam.).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ قُلْتُ لِسَلَمَةَ بْنِ الأَكْوَعِ عَلَى أَىِّ شَىْءٍ بَايَعْتُمْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ‏.‏ قَالَ عَلَى الْمَوْتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4169In-book reference : Book 64, Hadith 211USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 487   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4170,
    "id": 4170,
    "url": "https://sunnah.com/bukhari:4170",
    "bookNumber": 64,
    "hadithNumber": 212,
    "narrator": "Narrated Al-Musaiyab:",
    "english": "I met Al-Bara bin `Azib and said (to him). \"May you live prosperously! You enjoyed the company of \nthe Prophet (ﷺ) and gave him the Pledge of allegiance (of Al-Hudaibiya) under the Tree.\" On that, Al- \nBara' said, \"O my nephew! You do not know what we have done after him (i.e. his death).",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِشْكَابٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَقِيتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ فَقُلْتُ طُوبَى لَكَ صَحِبْتَ النَّبِيَّ صلى الله عليه وسلم وَبَايَعْتَهُ تَحْتَ الشَّجَرَةِ‏.‏ فَقَالَ يَا ابْنَ أَخِي إِنَّكَ لاَ تَدْرِي مَا أَحْدَثْنَا بَعْدَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4170In-book reference : Book 64, Hadith 212USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 488   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4171,
    "id": 4171,
    "url": "https://sunnah.com/bukhari:4171",
    "bookNumber": 64,
    "hadithNumber": 213,
    "narrator": "Narrated Abu Qilaba:",
    "english": "that Thabit bin Ad-Dahhak had informed him that he was one of those who had given the Pledge of \nallegiance (of Al-Hudaibiya) beneath the Tree.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ ـ هُوَ ابْنُ سَلاَّمٍ ـ عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، أَنَّ ثَابِتَ بْنَ الضَّحَّاكِ، أَخْبَرَهُ أَنَّهُ، بَايَعَ النَّبِيَّ صلى الله عليه وسلم تَحْتَ الشَّجَرَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4171In-book reference : Book 64, Hadith 213USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 489   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4172,
    "id": 4172,
    "url": "https://sunnah.com/bukhari:4172",
    "bookNumber": 64,
    "hadithNumber": 214,
    "narrator": "Narrated Anas bin Malik:",
    "english": "regarding Allah's Statement: \"Verily! We have granted you (O, Muhammad) Manifest victory.\" \n(48.1) It refers to the Al-Hudaibiya Pledge. And the companions of the Prophet (ﷺ) said (to the Prophet), \n\"Congratulations and happiness for you; but what reward shall we get?\" So Allah revealed:-- \"That He \nmay admit the believing men and women to gardens beneath which rivers flow.\" (48.5)",
    "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏ قَالَ الْحُدَيْبِيَةُ‏.‏ قَالَ أَصْحَابُهُ هَنِيئًا مَرِيئًا فَمَا لَنَا فَأَنْزَلَ اللَّهُ ‏{‏لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ‏}‏ قَالَ شُعْبَةُ فَقَدِمْتُ الْكُوفَةَ فَحَدَّثْتُ بِهَذَا كُلِّهِ عَنْ قَتَادَةَ ثُمَّ رَجَعْتُ فَذَكَرْتُ لَهُ فَقَالَ أَمَّا ‏{‏إِنَّا فَتَحْنَا لَكَ‏}‏ فَعَنْ أَنَسٍ، وَأَمَّا هَنِيئًا مَرِيئًا فَعَنْ عِكْرِمَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4172In-book reference : Book 64, Hadith 214USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 490   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4173,
    "id": 4173,
    "url": "https://sunnah.com/bukhari:4173",
    "bookNumber": 64,
    "hadithNumber": 215,
    "narrator": "Narrated Zahir Al-Aslami:",
    "english": "(who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree) While I was \nmaking fire beneath the cooking pots containing donkey's meat, the announcer of Allah's Messenger (ﷺ) \nannounced, \"Allah's Messenger (ﷺ) forbids you to eat donkey's meat.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَجْزَأَةَ بْنِ زَاهِرٍ الأَسْلَمِيِّ، عَنْ أَبِيهِ ـ وَكَانَ مِمَّنْ شَهِدَ الشَّجَرَةَ ـ قَالَ إِنِّي لأُوقِدُ تَحْتَ الْقِدْرِ بِلُحُومِ الْحُمُرِ إِذْ نَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4173In-book reference : Book 64, Hadith 215USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4174,
    "id": 4174,
    "url": "https://sunnah.com/bukhari:4174",
    "bookNumber": 64,
    "hadithNumber": 216,
    "narrator": "",
    "english": "The same narration was told by Majzaa from a man called Uhban bin Aus who was one of those who \nhad witnessed (the Pledge of allegiance beneath) the Tree., and who had some trouble in his knee so \nthat while doing prostrations, he used to put a pillow underneath his knee.",
    "arabic": "وَعَنْ مَجْزَأَةَ، عَنْ رَجُلٍ، مِنْهُمْ مِنْ أَصْحَابِ الشَّجَرَةِ اسْمُهُ أُهْبَانُ بْنُ أَوْسٍ وَكَانَ اشْتَكَى رُكْبَتَهُ، وَكَانَ إِذَا سَجَدَ جَعَلَ تَحْتَ رُكْبَتِهِ وِسَادَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4174In-book reference : Book 64, Hadith 216USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 491   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4175,
    "id": 4175,
    "url": "https://sunnah.com/bukhari:4175",
    "bookNumber": 64,
    "hadithNumber": 217,
    "narrator": "Narrated Suwaid bin An-Nu`man:",
    "english": "who was one of those who witnessed (the Pledge of allegiance beneath) the Tree: Allah's Messenger (ﷺ) and \nhis companions were given Sawiq and they chewed it.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ ـ وَكَانَ مِنْ أَصْحَابِ الشَّجَرَةِ ـ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ أُتُوا بِسَوِيقٍ فَلاَكُوهُ‏.‏ تَابَعَهُ مُعَاذٌ عَنْ شُعْبَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4175In-book reference : Book 64, Hadith 217USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 492   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4176,
    "id": 4176,
    "url": "https://sunnah.com/bukhari:4176",
    "bookNumber": 64,
    "hadithNumber": 218,
    "narrator": "Narrated Abu Jamra:",
    "english": "I asked Aidh bin `Amr, who was one of the companions of the Prophet (ﷺ) one of those (who gave the \nallegiance to the Prophet (ﷺ) the Tree: \"Can the witr prayer be repeated (in one night)?\" He said, \"If you \nhave offered it in the first part of the night, you should not repeat it in the last part 'of the night.\" (See \nFath-ul-Bari page 458 Vol 8th).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، حَدَّثَنَا شَاذَانُ، عَنْ شُعْبَةَ، عَنْ أَبِي جَمْرَةَ، قَالَ سَأَلْتُ عَائِذَ بْنَ عَمْرٍو ـ رضى الله عنه ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْ أَصْحَابِ الشَّجَرَةِ هَلْ يُنْقَضُ الْوِتْرُ قَالَ إِذَا أَوْتَرْتَ مِنْ أَوَّلِهِ، فَلاَ تُوتِرْ مِنْ آخِرِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4176In-book reference : Book 64, Hadith 218USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 493   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4177,
    "id": 4177,
    "url": "https://sunnah.com/bukhari:4177",
    "bookNumber": 64,
    "hadithNumber": 219,
    "narrator": "Narrated Zaid bin Aslam:",
    "english": "My father said, \"Allah's Messenger (ﷺ) was proceeding at night on one of his journeys and `Umar bin Al- \nKhattab was going along with him. `Umar bin Al-Khattab asked him (about something) but Allah's \nApostle did not answer him. `Umar asked him again, but he did not answer him. He asked him again \n(for the third time) but he did not answer him. On that `Umar bin Al-Khattab addressed himself \nsaying, \"May your mother be bereaved of you, O `Umar, for you have asked Allah's Messenger (ﷺ) thrice, \nyet he has not answered you.\" `Umar said, \"Then I made my camel run fast and took it in front of the \nother Muslims, and I was afraid that something might be revealed in my connection. I had hardly \nwaited for a moment when I heard somebody calling me. I said, 'I was afraid that something might \nhave been revealed about me.' Then I came to Allah's Messenger (ﷺ) and greeted him. He (i.e. the Prophet) \nsaid, 'Tonight there has been revealed to me, a Sura which is dearer to me than (all the world) on \nwhich the sun rises,' and then he recited: 'Verily! We have granted you (O Muhammad) A manifest \nvictory.\" (48.1)",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسِيرُ فِي بَعْضِ أَسْفَارِهِ، وَعُمَرُ بْنُ الْخَطَّابِ يَسِيرُ مَعَهُ لَيْلاً، فَسَأَلَهُ عُمَرُ بْنُ الْخَطَّابِ عَنْ شَىْءٍ فَلَمْ يُجِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ، ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ وَقَالَ عُمَرُ بْنُ الْخَطَّابِ ثَكِلَتْكَ أُمُّكَ يَا عُمَرُ، نَزَرْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ، كُلُّ ذَلِكَ لاَ يُجِيبُكَ‏.‏ قَالَ عُمَرُ فَحَرَّكْتُ بَعِيرِي ثُمَّ تَقَدَّمْتُ أَمَامَ الْمُسْلِمِينَ، وَخَشِيتُ أَنْ يَنْزِلَ فِيَّ قُرْآنٌ، فَمَا نَشِبْتُ أَنْ سَمِعْتُ صَارِخًا يَصْرُخُ بِي ـ قَالَ ـ فَقُلْتُ لَقَدْ خَشِيتُ أَنْ يَكُونَ نَزَلَ فِيَّ قُرْآنٌ‏.‏ وَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ لَقَدْ أُنْزِلَتْ عَلَىَّ اللَّيْلَةَ سُورَةٌ لَهِيَ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ، ثُمَّ قَرَأَ ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏‏.‏‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 4177In-book reference : Book 64, Hadith 219USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 494   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4178,
    "id": 4178,
    "url": "https://sunnah.com/bukhari:4178",
    "bookNumber": 64,
    "hadithNumber": 220,
    "narrator": "Narrated Al-Miswar bin Makhrama and Marwan bin Al-Hakam:",
    "english": "(one of them said more than his friend): The Prophet (ﷺ) set out in the company of more than onethousand \nof his companions in the year of Al-Hudaibiya, and when he reached Dhul-Hulaifa, he \ngarlanded his Hadi (i.e. sacrificing animal), assumed the state of Ihram for `Umra from that place and \nsent a spy of his from Khuzaa'ah (tribe). The Prophet (ﷺ) proceeded on till he reached (a village called) \nGhadir-al-Ashtat. There his spy came and said, \"The Quraish (infidels) have collected a great number \nof people against you, and they have collected against you the Ethiopians, and they will fight with \nyou, and will stop you from entering the Ka`ba and prevent you.\" The Prophet (ﷺ) said, \"O people! Give \nme your opinion. Do you recommend that I should destroy the families and offspring of those who \nwant to stop us from the Ka`ba? If they should come to us (for peace) then Allah will destroy a spy \nfrom the pagans, or otherwise we will leave them in a miserable state.\" On that Abu Bakr said, \"O \nAllah Apostle! You have come with the intention of visiting this House (i.e. Ka`ba) and you do not \nwant to kill or fight anybody. So proceed to it, and whoever should stop us from it, we will fight him.\" \nOn that the Prophet (ﷺ) said, \"Proceed on, in the Name of Allah !\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، حِينَ حَدَّثَ هَذَا الْحَدِيثَ،، حَفِظْتُ بَعْضَهُ، وَثَبَّتَنِي مَعْمَرٌ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَمَرْوَانَ بْنِ الْحَكَمِ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، فَلَمَّا أَتَى ذَا الْحُلَيْفَةِ قَلَّدَ الْهَدْىَ، وَأَشْعَرَهُ، وَأَحْرَمَ مِنْهَا بِعُمْرَةٍ، وَبَعَثَ عَيْنًا لَهُ مِنْ خُزَاعَةَ، وَسَارَ النَّبِيُّ صلى الله عليه وسلم حَتَّى كَانَ بِغَدِيرِ الأَشْطَاطِ، أَتَاهُ عَيْنُهُ قَالَ إِنَّ قُرَيْشًا جَمَعُوا لَكَ جُمُوعًا، وَقَدْ جَمَعُوا لَكَ الأَحَابِيشَ، وَهُمْ مُقَاتِلُوكَ وَصَادُّوكَ عَنِ الْبَيْتِ وَمَانِعُوكَ‏.‏ فَقَالَ ‏\"‏ أَشِيرُوا أَيُّهَا النَّاسُ عَلَىَّ، أَتَرَوْنَ أَنْ أَمِيلَ إِلَى عِيَالِهِمْ وَذَرَارِيِّ هَؤُلاَءِ الَّذِينَ يُرِيدُونَ أَنْ يَصُدُّونَا عَنِ الْبَيْتِ، فَإِنْ يَأْتُونَا كَانَ اللَّهُ عَزَّ وَجَلَّ قَدْ قَطَعَ عَيْنًا مِنَ الْمُشْرِكِينَ، وَإِلاَّ تَرَكْنَاهُمْ مَحْرُوبِينَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ، خَرَجْتَ عَامِدًا لِهَذَا الْبَيْتِ، لاَ تُرِيدُ قَتْلَ أَحَدٍ وَلاَ حَرْبَ أَحَدٍ، فَتَوَجَّهْ لَهُ، فَمَنْ صَدَّنَا عَنْهُ قَاتَلْنَاهُ‏.‏ قَالَ ‏\"‏ امْضُوا عَلَى اسْمِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4178, 4179In-book reference : Book 64, Hadith 220USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4179,
    "id": 4179,
    "url": "https://sunnah.com/bukhari:4179",
    "bookNumber": 64,
    "hadithNumber": 220,
    "narrator": "Narrated Al-Miswar bin Makhrama and Marwan bin Al-Hakam:",
    "english": "(one of them said more than his friend): The Prophet (ﷺ) set out in the company of more than onethousand \nof his companions in the year of Al-Hudaibiya, and when he reached Dhul-Hulaifa, he \ngarlanded his Hadi (i.e. sacrificing animal), assumed the state of Ihram for `Umra from that place and \nsent a spy of his from Khuzaa'ah (tribe). The Prophet (ﷺ) proceeded on till he reached (a village called) \nGhadir-al-Ashtat. There his spy came and said, \"The Quraish (infidels) have collected a great number \nof people against you, and they have collected against you the Ethiopians, and they will fight with \nyou, and will stop you from entering the Ka`ba and prevent you.\" The Prophet (ﷺ) said, \"O people! Give \nme your opinion. Do you recommend that I should destroy the families and offspring of those who \nwant to stop us from the Ka`ba? If they should come to us (for peace) then Allah will destroy a spy \nfrom the pagans, or otherwise we will leave them in a miserable state.\" On that Abu Bakr said, \"O \nAllah Apostle! You have come with the intention of visiting this House (i.e. Ka`ba) and you do not \nwant to kill or fight anybody. So proceed to it, and whoever should stop us from it, we will fight him.\" \nOn that the Prophet (ﷺ) said, \"Proceed on, in the Name of Allah !\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، حِينَ حَدَّثَ هَذَا الْحَدِيثَ،، حَفِظْتُ بَعْضَهُ، وَثَبَّتَنِي مَعْمَرٌ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَمَرْوَانَ بْنِ الْحَكَمِ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، فَلَمَّا أَتَى ذَا الْحُلَيْفَةِ قَلَّدَ الْهَدْىَ، وَأَشْعَرَهُ، وَأَحْرَمَ مِنْهَا بِعُمْرَةٍ، وَبَعَثَ عَيْنًا لَهُ مِنْ خُزَاعَةَ، وَسَارَ النَّبِيُّ صلى الله عليه وسلم حَتَّى كَانَ بِغَدِيرِ الأَشْطَاطِ، أَتَاهُ عَيْنُهُ قَالَ إِنَّ قُرَيْشًا جَمَعُوا لَكَ جُمُوعًا، وَقَدْ جَمَعُوا لَكَ الأَحَابِيشَ، وَهُمْ مُقَاتِلُوكَ وَصَادُّوكَ عَنِ الْبَيْتِ وَمَانِعُوكَ‏.‏ فَقَالَ ‏\"‏ أَشِيرُوا أَيُّهَا النَّاسُ عَلَىَّ، أَتَرَوْنَ أَنْ أَمِيلَ إِلَى عِيَالِهِمْ وَذَرَارِيِّ هَؤُلاَءِ الَّذِينَ يُرِيدُونَ أَنْ يَصُدُّونَا عَنِ الْبَيْتِ، فَإِنْ يَأْتُونَا كَانَ اللَّهُ عَزَّ وَجَلَّ قَدْ قَطَعَ عَيْنًا مِنَ الْمُشْرِكِينَ، وَإِلاَّ تَرَكْنَاهُمْ مَحْرُوبِينَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ، خَرَجْتَ عَامِدًا لِهَذَا الْبَيْتِ، لاَ تُرِيدُ قَتْلَ أَحَدٍ وَلاَ حَرْبَ أَحَدٍ، فَتَوَجَّهْ لَهُ، فَمَنْ صَدَّنَا عَنْهُ قَاتَلْنَاهُ‏.‏ قَالَ ‏\"‏ امْضُوا عَلَى اسْمِ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4178, 4179In-book reference : Book 64, Hadith 220USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 495   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4180,
    "id": 4180,
    "url": "https://sunnah.com/bukhari:4180",
    "bookNumber": 64,
    "hadithNumber": 221,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that \nhappened to Allah's Messenger (ﷺ) in the `Umra of Al-Hudaibiya. They said, \"When Allah's Messenger (ﷺ) \nconcluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which \nSuhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever \ncomes to you, though he has embraced your religion, you should return him to us, and should not \ninterfere between us and him.\" Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on \nthis condition. The believers disliked this condition and got disgusted with it and argued about it. But \nwhen Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on that condition, Allah's \nApostle concluded it. Accordingly, Allah's Messenger (ﷺ) then returned Abu Jandal bin Suhail to his father, \nSuhail bin `Amr, and returned every man coming to him from them during that period even if he was a \nMuslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba \nbin Abi Mu'ait was one of those who came to Allah's Messenger (ﷺ) and she was an adult at that time. Her \nrelatives came, asking Allah's Messenger (ﷺ) to return her to them, and in this connection, Allah revealed the \nVerses dealing with the believing (women).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ، حَدَّثَنِي ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، يُخْبِرَانِ خَبَرًا مِنْ خَبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي عُمْرَةِ الْحُدَيْبِيَةِ فَكَانَ فِيمَا أَخْبَرَنِي عُرْوَةُ عَنْهُمَا أَنَّهُ لَمَّا كَاتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُهَيْلَ بْنَ عَمْرٍو، يَوْمَ الْحُدَيْبِيَةِ عَلَى قَضِيَّةِ الْمُدَّةِ، وَكَانَ فِيمَا اشْتَرَطَ سُهَيْلُ بْنُ عَمْرٍو أَنَّهُ قَالَ لاَ يَأْتِيكَ مِنَّا أَحَدٌ وَإِنْ كَانَ عَلَى دِينِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا، وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ‏.‏ وَأَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، فَكَرِهَ الْمُؤْمِنُونَ ذَلِكَ وَامَّعَضُوا، فَتَكَلَّمُوا فِيهِ، فَلَمَّا أَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، كَاتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَرَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا جَنْدَلِ بْنَ سُهَيْلٍ يَوْمَئِذٍ إِلَى أَبِيهِ سُهَيْلِ بْنِ عَمْرٍو، وَلَمْ يَأْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَدٌ مِنَ الرِّجَالِ إِلاَّ رَدَّهُ فِي تِلْكَ الْمُدَّةِ، وَإِنْ كَانَ مُسْلِمًا، وَجَاءَتِ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ، فَكَانَتْ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ بْنِ مُعَيْطٍ مِمَّنْ خَرَجَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْىَ عَاتِقٌ، فَجَاءَ أَهْلُهَا يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَرْجِعَهَا إِلَيْهِمْ، حَتَّى أَنْزَلَ اللَّهُ تَعَالَى فِي الْمُؤْمِنَاتِ مَا أَنْزَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4180, 4181In-book reference : Book 64, Hadith 221USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4181,
    "id": 4181,
    "url": "https://sunnah.com/bukhari:4181",
    "bookNumber": 64,
    "hadithNumber": 221,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that \nhappened to Allah's Messenger (ﷺ) in the `Umra of Al-Hudaibiya. They said, \"When Allah's Messenger (ﷺ) \nconcluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which \nSuhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever \ncomes to you, though he has embraced your religion, you should return him to us, and should not \ninterfere between us and him.\" Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on \nthis condition. The believers disliked this condition and got disgusted with it and argued about it. But \nwhen Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on that condition, Allah's \nApostle concluded it. Accordingly, Allah's Messenger (ﷺ) then returned Abu Jandal bin Suhail to his father, \nSuhail bin `Amr, and returned every man coming to him from them during that period even if he was a \nMuslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba \nbin Abi Mu'ait was one of those who came to Allah's Messenger (ﷺ) and she was an adult at that time. Her \nrelatives came, asking Allah's Messenger (ﷺ) to return her to them, and in this connection, Allah revealed the \nVerses dealing with the believing (women).",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ، حَدَّثَنِي ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، يُخْبِرَانِ خَبَرًا مِنْ خَبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي عُمْرَةِ الْحُدَيْبِيَةِ فَكَانَ فِيمَا أَخْبَرَنِي عُرْوَةُ عَنْهُمَا أَنَّهُ لَمَّا كَاتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُهَيْلَ بْنَ عَمْرٍو، يَوْمَ الْحُدَيْبِيَةِ عَلَى قَضِيَّةِ الْمُدَّةِ، وَكَانَ فِيمَا اشْتَرَطَ سُهَيْلُ بْنُ عَمْرٍو أَنَّهُ قَالَ لاَ يَأْتِيكَ مِنَّا أَحَدٌ وَإِنْ كَانَ عَلَى دِينِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا، وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ‏.‏ وَأَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، فَكَرِهَ الْمُؤْمِنُونَ ذَلِكَ وَامَّعَضُوا، فَتَكَلَّمُوا فِيهِ، فَلَمَّا أَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، كَاتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَرَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا جَنْدَلِ بْنَ سُهَيْلٍ يَوْمَئِذٍ إِلَى أَبِيهِ سُهَيْلِ بْنِ عَمْرٍو، وَلَمْ يَأْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَدٌ مِنَ الرِّجَالِ إِلاَّ رَدَّهُ فِي تِلْكَ الْمُدَّةِ، وَإِنْ كَانَ مُسْلِمًا، وَجَاءَتِ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ، فَكَانَتْ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ بْنِ مُعَيْطٍ مِمَّنْ خَرَجَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْىَ عَاتِقٌ، فَجَاءَ أَهْلُهَا يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَرْجِعَهَا إِلَيْهِمْ، حَتَّى أَنْزَلَ اللَّهُ تَعَالَى فِي الْمُؤْمِنَاتِ مَا أَنْزَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4180, 4181In-book reference : Book 64, Hadith 221USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4182,
    "id": 4182,
    "url": "https://sunnah.com/bukhari:4182",
    "bookNumber": 64,
    "hadithNumber": 222,
    "narrator": "Aisha said, \"Allah's Messenger (ﷺ) used to test all the believing \nwomen who migrated to him, with the following Verse:",
    "english": "-- \"O Prophet! When the believing Women \ncome to you, to give the pledge of allegiance to you.\" (60.12) \n`Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what \nthey had given to their wives who lately migrated (to Medina) and we were informed that Abu \nBasir...\" relating the whole narration.",
    "arabic": "قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُ مَنْ هَاجَرَ مِنَ الْمُؤْمِنَاتِ بِهَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ‏}‏‏.‏ وَعَنْ عَمِّهِ قَالَ بَلَغَنَا حِينَ أَمَرَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم أَنْ يَرُدَّ إِلَى الْمُشْرِكِينَ مَا أَنْفَقُوا عَلَى مَنْ هَاجَرَ مِنْ أَزْوَاجِهِمْ، وَبَلَغَنَا أَنَّ أَبَا بَصِيرٍ‏.‏ فَذَكَرَهُ بِطُولِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4182In-book reference : Book 64, Hadith 222USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 496   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4183,
    "id": 4183,
    "url": "https://sunnah.com/bukhari:4183",
    "bookNumber": 64,
    "hadithNumber": 223,
    "narrator": "Narrated Nafi`:",
    "english": "`Abdullah bin `Umar set out for Umra during the period of afflictions, and he said, \"If I should be \nstopped from visiting the Ka`ba, I will do what we did when we were with Allah's Messenger (ﷺ).\" He \nassumed Ihram for `Umra in the year of Al-Hudaibiya.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ خَرَجَ مُعْتَمِرًا فِي الْفِتْنَةِ فَقَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ، صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَهَلَّ بِعُمْرَةٍ مِنْ أَجْلِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4183In-book reference : Book 64, Hadith 223USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 497   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4184,
    "id": 4184,
    "url": "https://sunnah.com/bukhari:4184",
    "bookNumber": 64,
    "hadithNumber": 224,
    "narrator": "Narrated Nafi`:",
    "english": "Ibn `Umar assumed Ihram and said, \"If something should intervene between me and the Ka`ba, then I \nwill do what the Prophet (ﷺ) did when the Quraish infidels intervened between him and (the Ka`ba). Then \nIbn `Umar recited: \"You have indeed in Allah's Messenger (ﷺ) A good example to follow.\" (33.21)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ أَهَلَّ وَقَالَ إِنْ حِيلَ بَيْنِي وَبَيْنَهُ لَفَعَلْتُ كَمَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم حِينَ حَالَتْ كُفَّارُ قُرَيْشٍ بَيْنَهُ‏.‏ وَتَلاَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4184In-book reference : Book 64, Hadith 224USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 498   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4185,
    "id": 4185,
    "url": "https://sunnah.com/bukhari:4185",
    "bookNumber": 64,
    "hadithNumber": 225,
    "narrator": "Narrated Nafi`:",
    "english": "One of `Abdullah's sons said to `Abdullah (bin `Umar) \"I wish you would stay this year (and not \nperform Hajj) as I am afraid that you will not be able to reach the Ka`ba.\" On that he (i.e. `Abdullah \nbin `Umar) said, \"We went out with the Prophet (for `Umra), and when the Quraish infidel intervened \nbetween us and the Ka`ba, the Prophet (ﷺ) slaughtered his Hadi and shaved (his head), and his \ncompanions cut short their hair.\" Then `Abdullah bin `Umar said, \"I make you witness that I have \nintended to perform `Umra and if I am allowed to reach the Ka`ba, I will perform the Tawaf, and if \nsomething (i.e. obstacles) intervene between me and the Ka`ba, then I will do what Allah's Messenger (ﷺ) \ndid.\" Then after going for a while, he said, \"I consider the ceremonies (of both `Umra and Hajj as one \nand the same, so I would like you to witness that I have intended to perform Hajj along with my \n`Umra.\" So he performed only one Tawaf and one Sai (between Safa and Marwa) and finished the \nIhram of both Umra and Hajj).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَاهُ أَنَّهُمَا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ‏.‏ وَحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ بَعْضَ بَنِي عَبْدِ اللَّهِ، قَالَ لَهُ لَوْ أَقَمْتَ الْعَامَ، فَإِنِّي أَخَافُ أَنْ لاَ تَصِلَ إِلَى الْبَيْتِ‏.‏ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ النَّبِيُّ صلى الله عليه وسلم هَدَايَاهُ، وَحَلَقَ وَقَصَّرَ أَصْحَابُهُ، وَقَالَ ‏\n\"‏ أُشْهِدُكُمْ أَنِّي أَوْجَبْتُ عُمْرَةً ‏\"‏‏.‏ فَإِنْ خُلِّيَ بَيْنِي وَبَيْنَ الْبَيْتِ طُفْتُ، وَإِنْ حِيلَ بَيْنِي وَبَيْنَ الْبَيْتِ صَنَعْتُ كَمَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَارَ سَاعَةً ثُمَّ قَالَ مَا أُرَى شَأْنَهُمَا إِلاَّ وَاحِدًا، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَتِي‏.‏ فَطَافَ طَوَافًا وَاحِدًا وَسَعْيًا وَاحِدًا، حَتَّى حَلَّ مِنْهُمَا جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4185In-book reference : Book 64, Hadith 225USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 499   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4186,
    "id": 4186,
    "url": "https://sunnah.com/bukhari:4186",
    "bookNumber": 64,
    "hadithNumber": 226,
    "narrator": "Narrated Nafi`:",
    "english": "The people used to say that Ibn `Umar had embraced Islam before `Umar. This is not true. What \nhappened is that `Umar sent `Abdullah to bring his horse from an Ansari man so as to fight on it. At \nthat time the people were giving the Pledge of allegiance to Allah's Messenger (ﷺ) near the Tree, and `Umar \nwas not aware of that. So `Abdullah (bin `Umar) gave the Pledge of Allegiance (to the Prophet) and \nwent to take the horse and brought it to `Umar. While `Umar was putting on the armor to get ready for \nfighting, `Abdullah informed him that the people were giving the Pledge of allegiance to Allah's \nApostle beneath the Tree. So `Umar set out and `Abdullah accompanied him till he gave the Pledge of \nallegiance to Allah's Messenger (ﷺ), and it was this event that made people say that Ibn `Umar had embraced \nIslam before `Umar.",
    "arabic": "حَدَّثَنِي شُجَاعُ بْنُ الْوَلِيدِ، سَمِعَ النَّضْرَ بْنَ مُحَمَّدٍ، حَدَّثَنَا صَخْرٌ، عَنْ نَافِعٍ، قَالَ إِنَّ النَّاسَ يَتَحَدَّثُونَ أَنَّ ابْنَ عُمَرَ، أَسْلَمَ قَبْلَ عُمَرَ، وَلَيْسَ كَذَلِكَ، وَلَكِنْ عُمَرُ يَوْمَ الْحُدَيْبِيَةِ أَرْسَلَ عَبْدَ اللَّهِ إِلَى فَرَسٍ لَهُ عِنْدَ رَجُلٍ مِنَ الأَنْصَارِ يَأْتِي بِهِ لِيُقَاتِلَ عَلَيْهِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُبَايِعُ عِنْدَ الشَّجَرَةِ، وَعُمَرُ لاَ يَدْرِي بِذَلِكَ، فَبَايَعَهُ عَبْدُ اللَّهِ، ثُمَّ ذَهَبَ إِلَى الْفَرَسِ، فَجَاءَ بِهِ إِلَى عُمَرَ، وَعُمَرُ يَسْتَلْئِمُ لِلْقِتَالِ، فَأَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُبَايِعُ تَحْتَ الشَّجَرَةِ ـ قَالَ ـ فَانْطَلَقَ فَذَهَبَ مَعَهُ حَتَّى بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم، فَهِيَ الَّتِي يَتَحَدَّثُ النَّاسُ أَنَّ ابْنَ عُمَرَ أَسْلَمَ قَبْلَ عُمَرَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4186In-book reference : Book 64, Hadith 226USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 500   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4187,
    "id": 4187,
    "url": "https://sunnah.com/bukhari:4187",
    "bookNumber": 64,
    "hadithNumber": 227,
    "narrator": "`Abdullah bin `Umar added:",
    "english": "\"The people were along with the Prophet (ﷺ) on the day \nof Al-Hudaibiya spreading in the shade of the trees. Suddenly the people surrounded the Prophet (ﷺ) and \nstarted looking at him.\" `Umar said, \"O `Abdullah! Go and see why the people are encircling Allah's \nApostle and looking at him.\" `Abdullah bin `Umar then saw the people giving the Pledge o allegiance \nto the Prophet. So he also gave the Pledge of allegiance and returned to `Umar who went out in his \nturn and gave the Pledge of allegiance to the Prophet.'",
    "arabic": "وَقَالَ هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ الْعُمَرِيُّ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّاسَ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ، تَفَرَّقُوا فِي ظِلاَلِ الشَّجَرِ، فَإِذَا النَّاسُ مُحْدِقُونَ بِالنَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا عَبْدَ اللَّهِ، انْظُرْ مَا شَأْنُ النَّاسِ قَدْ أَحْدَقُوا بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدَهُمْ يُبَايِعُونَ، فَبَايَعَ ثُمَّ رَجَعَ إِلَى عُمَرَ فَخَرَجَ فَبَايَعَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4187In-book reference : Book 64, Hadith 227USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 500   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4188,
    "id": 4188,
    "url": "https://sunnah.com/bukhari:4188",
    "bookNumber": 64,
    "hadithNumber": 228,
    "narrator": "Narrated `Abdullah bin Abi `Aufa:",
    "english": "We were in the company of the Prophet (ﷺ) when he performed the `Umra. He performed the Tawaf and \nwe did the same; he offered the prayer and we also offered the prayer with him. Then he performed \nthe Sai between Safa and Marwa and we were guarding him against the people of Mecca so that \nnobody should harm him.",
    "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا يَعْلَى، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم حِينَ اعْتَمَرَ فَطَافَ فَطُفْنَا مَعَهُ، وَصَلَّى وَصَلَّيْنَا مَعَهُ، وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ، لاَ يُصِيبُهُ أَحَدٌ بِشَىْءٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4188In-book reference : Book 64, Hadith 228USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 501   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4189,
    "id": 4189,
    "url": "https://sunnah.com/bukhari:4189",
    "bookNumber": 64,
    "hadithNumber": 229,
    "narrator": "Narrated Abu Wail:",
    "english": "When Sahl bin Hunaif returned from (the battle of) Siffin, we went to ask him (as to why he had come \nback). He replied, \"(You should not consider me a coward) but blame your opinions. I saw myself on \nthe day of Abu Jandal (inclined to fight), and if I had the power of refusing the order of Allah's \nApostle then, I would have refused it (and fought the infidels bravely). Allah and His Apostle know \n(what is convenient) better. Whenever we put our swords on our shoulders for any matter that terrified \nus, our swords led us to an easy agreeable solution before the present situation (of disagreement and \ndispute between the Muslims). When we mend the breach in one side, it opened in another, and we do \nnot know what to do about it.\"",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ إِسْحَاقَ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، قَالَ سَمِعْتُ أَبَا حَصِينٍ، قَالَ قَالَ أَبُو وَائِلٍ لَمَّا قَدِمَ سَهْلُ بْنُ حُنَيْفٍ مِنْ صِفِّينَ أَتَيْنَاهُ نَسْتَخْبِرُهُ فَقَالَ اتَّهِمُوا الرَّأْىَ، فَلَقَدْ رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ وَلَوْ أَسْتَطِيعُ أَنْ أَرُدَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَمْرَهُ لَرَدَدْتُ، وَاللَّهُ وَرَسُولُهُ أَعْلَمُ، وَمَا وَضَعْنَا أَسْيَافَنَا عَلَى عَوَاتِقِنَا لأَمْرٍ يُفْظِعُنَا إِلاَّ أَسْهَلْنَ بِنَا إِلَى أَمْرٍ نَعْرِفُهُ قَبْلَ هَذَا الأَمْرِ، مَا نَسُدُّ مِنْهَا خُصْمًا إِلاَّ انْفَجَرَ عَلَيْنَا خُصْمٌ مَا نَدْرِي كَيْفَ نَأْتِي لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4189In-book reference : Book 64, Hadith 229USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 502   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4190,
    "id": 4190,
    "url": "https://sunnah.com/bukhari:4190",
    "bookNumber": 64,
    "hadithNumber": 230,
    "narrator": "Narrated Ka`b bin Ujra:",
    "english": "The Prophet (ﷺ) came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He \nsaid, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for \nthree days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \n\"I do not know with which of these three options he started.\")",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى عَلَىَّ النَّبِيُّ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ، وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏{‏أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ‏}‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\n\"‏ فَاحْلِقْ، وَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، أَوِ انْسُكْ نَسِيكَةً ‏\"‏‏.‏ قَالَ أَيُّوبُ لاَ أَدْرِي بِأَىِّ هَذَا بَدَأَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4190In-book reference : Book 64, Hadith 230USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 503   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4191,
    "id": 4191,
    "url": "https://sunnah.com/bukhari:4191",
    "bookNumber": 64,
    "hadithNumber": 231,
    "narrator": "Narrated Ka`b bin Ujra:",
    "english": "We were in the company of Allah's Messenger (ﷺ) at Al-Hudaibiya in the state of Ihram and the pagans did \nnot allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet (ﷺ) \npassed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator \nadded, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an \nailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the \npoor, Or offering a sacrifice.\" (2.196)",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ هِشَامٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ وَنَحْنُ مُحْرِمُونَ، وَقَدْ حَصَرَنَا الْمُشْرِكُونَ ـ قَالَ ـ وَكَانَتْ لِي وَفْرَةٌ فَجَعَلَتِ الْهَوَامُّ تَسَّاقَطُ عَلَى وَجْهِي، فَمَرَّ بِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ وَأُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 4191In-book reference : Book 64, Hadith 231USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 504   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4192,
    "id": 4192,
    "url": "https://sunnah.com/bukhari:4192",
    "bookNumber": 64,
    "hadithNumber": 232,
    "narrator": "Narrated Anas:",
    "english": "Some people of the tribe of `Ukl and `Uraina arrived at Medina to meet the Prophet (ﷺ) and embraced \nIslam and said, \"O Allah's Prophet! We are the owners of milch livestock (i.e. bedouins) and not \nfarmers (i.e. countrymen).\" They found the climate of Medina unsuitable for them. So Allah's Messenger (ﷺ) \nordered that they should be provided with some milch camels and a shepherd and ordered them to go \nout of Medina and to drink the camels' milk and urine (as medicine) So they set out and when they \nreached Al-Harra, they reverted to Heathenism after embracing Islam, and killed the shepherd of the \nProphet and drove away the camels. When this news reached the Prophet, he sent some people in \npursuit of them. (So they were caught and brought back to the Prophet (ﷺ) ). The Prophet (ﷺ) gave his orders \nin their concern. So their eyes were branded with pieces of iron and their hands and legs were cut off \nand they were left away in Harra till they died in that state of theirs. (See Hadith 234 Vol 1)",
    "arabic": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُمْ أَنَّ نَاسًا مِنْ عُكْلٍ وَعُرَيْنَةَ قَدِمُوا الْمَدِينَةَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَتَكَلَّمُوا بِالإِسْلاَمِ فَقَالُوا يَا نَبِيَّ اللَّهِ إِنَّا كُنَّا أَهْلَ ضَرْعٍ، وَلَمْ نَكُنْ أَهْلَ رِيفٍ‏.‏ وَاسْتَوْخَمُوا الْمَدِينَةَ، فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَوْدٍ وَرَاعٍ، وَأَمَرَهُمْ أَنْ يَخْرُجُوا فِيهِ، فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَانْطَلَقُوا حَتَّى إِذَا كَانُوا نَاحِيَةَ الْحَرَّةِ كَفَرُوا بَعْدَ إِسْلاَمِهِمْ، وَقَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم، وَاسْتَاقُوا الذَّوْدَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ فَأَمَرَ بِهِمْ فَسَمَرُوا أَعْيُنَهُمْ، وَقَطَعُوا أَيْدِيَهُمْ، وَتُرِكُوا فِي نَاحِيَةِ الْحَرَّةِ حَتَّى مَاتُوا عَلَى حَالِهِمْ‏.‏ قَالَ قَتَادَةُ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعْدَ ذَلِكَ كَانَ يَحُثُّ عَلَى الصَّدَقَةِ، وَيَنْهَى عَنِ الْمُثْلَةِ‏.‏ وَقَالَ شُعْبَةُ وَأَبَانُ وَحَمَّادٌ عَنْ قَتَادَةَ مِنْ عُرَيْنَةَ‏.‏ وَقَالَ يَحْيَى بْنُ أَبِي كَثِيرٍ وَأَيُّوبُ عَنْ أَبِي قِلاَبَةَ عَنْ أَنَسٍ قَدِمَ نَفَرٌ مِنْ عُكْلٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4192In-book reference : Book 64, Hadith 232USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 505   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4193,
    "id": 4193,
    "url": "https://sunnah.com/bukhari:4193",
    "bookNumber": 64,
    "hadithNumber": 233,
    "narrator": "Narrated Abu Raja:",
    "english": "The freed slave of Abu Qilaba, who was with Abu Qilaba in Sham: `Umar bin `Abdul `Aziz consulted \nthe people saying, \"What do you think of Qasama.\" They said, \"'It is a right (judgment) which Allah's \nApostle and the Caliphs before you acted on.\" Abu Qilaba was behind `Umar's bed. 'Anbasa bin Sa`id \nsaid, But what about the narration concerning the people of `Uraina?\" Abu Qilaba said, \"Anas bin \nMalik narrated it to me,\" and then narrated the whole story.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَبُو عُمَرَ الْحَوْضِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَالْحَجَّاجُ الصَّوَّافُ، قَالَ حَدَّثَنِي أَبُو رَجَاءٍ، مَوْلَى أَبِي قِلاَبَةَ وَكَانَ مَعَهُ بِالشَّأْمِ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، اسْتَشَارَ النَّاسَ يَوْمًا قَالَ مَا تَقُولُونَ فِي هَذِهِ الْقَسَامَةِ فَقَالُوا حَقٌّ، قَضَى بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَضَتْ بِهَا الْخُلَفَاءُ، قَبْلَكَ‏.‏ قَالَ وَأَبُو قِلاَبَةَ خَلْفَ سَرِيرِهِ فَقَالَ عَنْبَسَةُ بْنُ سَعِيدٍ فَأَيْنَ حَدِيثُ أَنَسٍ فِي الْعُرَنِيِّينَ قَالَ أَبُو قِلاَبَةَ إِيَّاىَ حَدَّثَهُ أَنَسُ بْنُ مَالِكٍ‏.‏ قَالَ عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسٍ مِنْ عُرَيْنَةَ‏.‏ وَقَالَ أَبُو قِلاَبَةَ عَنْ أَنَسٍ مِنْ عُكْلٍ‏.‏ ذَكَرَ الْقِصَّةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4193In-book reference : Book 64, Hadith 233USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 506   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4194,
    "id": 4194,
    "url": "https://sunnah.com/bukhari:4194",
    "bookNumber": 64,
    "hadithNumber": 234,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "Once I went (from Medina) towards (Al-Ghaba) before the first Adhan of the Fajr Prayer. The shecamels \nof Allah's Messenger (ﷺ) used to graze at a place called Dhi-Qarad. A slave of `Abdur-Rahman bin \n`Auf met me (on the way) and said, \"The she-camels of Allah's Messenger (ﷺ) had been taken away by \nforce.\" I asked, \"Who had taken them?\" He replied \"(The people of) Ghatafan.\" I made three loud \ncries (to the people of Medina) saying, \"O Sabahah!\" I made the people between the two mountains of \nMedina hear me. Then I rushed onward and caught up with the robbers while they were watering the \ncamels. I started throwing arrows at them as I was a good archer and I was saying, \"I am the son of \nAl-Akwa`, and today will perish the wicked people.\" I kept on saying like that till I restored the shecamels \n(of the Prophet), I also snatched thirty Burda (i.e. garments) from them. Then the Prophet (ﷺ) and \nthe other people came there, and I said, \"O Allah's Prophet! I have stopped the people (of Ghatafan) \nfrom taking water and they are thirsty now. So send (some people) after them now.\" On that the \nProphet said, \"O the son of Al-Akwa`! You have over-powered them, so forgive them.\" Then we all \ncame back and Allah's Messenger (ﷺ) seated me behind him on his she-camel till we entered Medina.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ سَمِعْتُ سَلَمَةَ بْنَ الأَكْوَعِ، يَقُولُ خَرَجْتُ قَبْلَ أَنْ يُؤَذَّنَ، بِالأُولَى، وَكَانَتْ لِقَاحُ رَسُولِ اللَّهِ صلى الله عليه وسلم تَرْعَى بِذِي قَرَدٍ ـ قَالَ ـ فَلَقِيَنِي غُلاَمٌ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فَقَالَ أُخِذَتْ لِقَاحُ رَسُولِ اللَّهِ صلى الله عليه وسلم قُلْتُ مَنْ أَخَذَهَا قَالَ غَطَفَانُ‏.‏ قَالَ فَصَرَخْتُ ثَلاَثَ صَرَخَاتٍ ـ يَا صَبَاحَاهْ ـ قَالَ فَأَسْمَعْتُ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ، ثُمَّ انْدَفَعْتُ عَلَى وَجْهِي حَتَّى أَدْرَكْتُهُمْ وَقَدْ أَخَذُوا يَسْتَقُونَ مِنَ الْمَاءِ، فَجَعَلْتُ أَرْمِيهِمْ بِنَبْلِي، وَكُنْتُ رَامِيًا، وَأَقُولُ أَنَا ابْنُ الأَكْوَعْ، الْيَوْمُ يَوْمُ الرُّضَّعْ‏.‏ وَأَرْتَجِزُ حَتَّى اسْتَنْقَذْتُ اللِّقَاحَ مِنْهُمْ، وَاسْتَلَبْتُ مِنْهُمْ ثَلاَثِينَ بُرْدَةً، قَالَ وَجَاءَ النَّبِيُّ صلى الله عليه وسلم وَالنَّاسُ فَقُلْتُ يَا نَبِيَّ اللَّهِ قَدْ حَمَيْتُ الْقَوْمَ الْمَاءَ وَهُمْ عِطَاشٌ، فَابْعَثْ إِلَيْهِمُ السَّاعَةَ‏.‏ فَقَالَ ‏\n\"‏ يَا ابْنَ الأَكْوَعِ، مَلَكْتَ فَأَسْجِحْ ‏\"‏‏.‏ قَالَ ثُمَّ رَجَعْنَا وَيُرْدِفُنِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى نَاقَتِهِ حَتَّى دَخَلْنَا الْمَدِينَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4194In-book reference : Book 64, Hadith 234USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 507   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4195,
    "id": 4195,
    "url": "https://sunnah.com/bukhari:4195",
    "bookNumber": 64,
    "hadithNumber": 235,
    "narrator": "Narrated Suwaid bin An-Nu`man:",
    "english": "I went out in the company of the Prophet (ﷺ) in the year of Khaibar, and when we reached As Sahba' \nwhich is the lower part of Khaibar, the Prophet (ﷺ) offered the `Asr prayer and then asked the people to \ncollect the journey food. Nothing was brought but Sawiq which the Prophet (ﷺ) ordered to be moistened \nwith water, and then he ate it and we also ate it. Then he got up to offer the Maghrib prayer. He \nwashed his mouth, and we too washed our mouths, and then he offered the prayer without repeating \nhis abulution.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، أَنَّ سُوَيْدَ بْنَ النُّعْمَانِ، أَخْبَرَهُ أَنَّهُ، خَرَجَ مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ ـ وَهْىَ مِنْ أَدْنَى خَيْبَرَ ـ صَلَّى الْعَصْرَ، ثُمَّ دَعَا بِالأَزْوَادِ فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ، فَأَمَرَ بِهِ فَثُرِّيَ، فَأَكَلَ وَأَكَلْنَا، ثُمَّ قَامَ إِلَى الْمَغْرِبِ، فَمَضْمَضَ وَمَضْمَضْنَا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4195In-book reference : Book 64, Hadith 235USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 508   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4196,
    "id": 4196,
    "url": "https://sunnah.com/bukhari:4196",
    "bookNumber": 64,
    "hadithNumber": 236,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "We went out to Khaibar in the company of the Prophet. While we were proceeding at night, a man \nfrom the group said to 'Amir, \"O 'Amir! Won't you let us hear your poetry?\" 'Amir was a poet, so he \ngot down and started reciting for the people poetry that kept pace with the camels' footsteps, saying:-- \n\"O Allah! Without You we Would not have been guided On the right path Neither would be have \ngiven In charity, nor would We have prayed. So please forgive us, what we have committed (i.e. our \ndefects); let all of us Be sacrificed for Your Cause And send Sakina (i.e. calmness) Upon us to make \nour feet firm When we meet our enemy, and If they will call us towards An unjust thing, We will \nrefuse. The infidels have made a hue and Cry to ask others' help Against us.\" The Prophet (ﷺ) on that, \nasked, \"Who is that (camel) driver (reciting poetry)?\" The people said, \"He is 'Amir bin Al-Akwa`.\" \nThen the Prophet (ﷺ) said, \"May Allah bestow His Mercy on him.\" A man amongst the people said, \"O \nAllah's Prophet! has (martyrdom) been granted to him. Would that you let us enjoy his company \nlonger.\" Then we reached and besieged Khaibar till we were afflicted with severe hunger. Then Allah \nhelped the Muslims conquer it (i.e. Khaibar). In the evening of the day of the conquest of the city, the \nMuslims made huge fires. The Prophet (ﷺ) said, \"What are these fires? For cooking what, are you making \nthe fire?\" The people replied, \"(For cooking) meat.\" He asked, \"What kind of meat?\" They (i.e. \npeople) said, \"The meat of donkeys.\" The Prophet (ﷺ) said, \"Throw away the meat and break the pots!\" \nSome man said, \"O Allah's Messenger (ﷺ)! Shall we throw away the meat and wash the pots instead?\" He \nsaid, \"(Yes, you can do) that too.\" So when the army files were arranged in rows (for the clash), \n'Amir's sword was short and he aimed at the leg of a Jew to strike it, but the sharp blade of the sword \nreturned to him and injured his own knee, and that caused him to die. When they returned from the \nbattle, Allah's Messenger (ﷺ) saw me (in a sad mood). He took my hand and said, \"What is bothering you?\" I \nreplied, \"Let my father and mother be sacrificed for you! The people say that the deeds of 'Amir are \nlost.\" The Prophet (ﷺ) said, \"Whoever says so, is mistaken, for 'Amir has got a double reward.\" The \nProphet raised two fingers and added, \"He (i.e. Amir) was a persevering struggler in the Cause of \nAllah and there are few 'Arabs who achieved the like of (good deeds) 'Amir had done.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى خَيْبَرَ فَسِرْنَا لَيْلاً، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ لِعَامِرٍ يَا عَامِرُ أَلاَ تُسْمِعُنَا مِنْ هُنَيْهَاتِكَ‏.‏ وَكَانَ عَامِرٌ رَجُلاً شَاعِرًا فَنَزَلَ يَحْدُو بِالْقَوْمِ يَقُولُ:\n\nاللَّهُمَّ لَوْلاَ أَنْتَ مَا اهْتَدَيْنَا     وَلاَ تَصَدَّقْنَا وَلاَ صَلَّيْنَا\n\nفَاغْفِرْ فِدَاءً لَكَ مَا أَبْقَيْنَا     وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا\n\n وَأَلْقِيَنْ سَكِينَةً عَلَيْنَا     إِنَّا إِذَا صِيحَ بِنَا أَبَيْنَا\n\n وَبِالصِّيَاحِ عَوَّلُوا عَلَيْنَا\n\n فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ هَذَا السَّائِقُ ‏\"‏‏.‏ قَالُوا عَامِرُ بْنُ الأَكْوَعِ‏.‏ قَالَ ‏\"‏ يَرْحَمُهُ اللَّهُ ‏\"‏‏.‏ قَالَ رَجُلٌ مِنَ الْقَوْمِ وَجَبَتْ يَا نَبِيَّ اللَّهِ، لَوْلاَ أَمْتَعْتَنَا بِهِ‏.‏ فَأَتَيْنَا خَيْبَرَ، فَحَاصَرْنَاهُمْ حَتَّى أَصَابَتْنَا مَخْمَصَةٌ شَدِيدَةٌ، ثُمَّ إِنَّ اللَّهَ تَعَالَى فَتَحَهَا عَلَيْهِمْ، فَلَمَّا أَمْسَى النَّاسُ مَسَاءَ الْيَوْمِ الَّذِي فُتِحَتْ عَلَيْهِمْ أَوْقَدُوا نِيرَانًا كَثِيرَةً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا هَذِهِ النِّيرَانُ عَلَى أَىِّ شَىْءٍ تُوقِدُونَ ‏\"‏‏.‏ قَالُوا عَلَى لَحْمٍ‏.‏ قَالَ ‏\"‏ عَلَى أَىِّ لَحْمٍ ‏\"‏‏.‏ قَالُوا لَحْمِ حُمُرِ الإِنْسِيَّةِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَهْرِيقُوهَا وَاكْسِرُوهَا ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، أَوْ نُهَرِيقُهَا وَنَغْسِلُهَا قَالَ ‏\"‏ أَوْ ذَاكَ ‏\"‏‏.‏ فَلَمَّا تَصَافَّ الْقَوْمُ كَانَ سَيْفُ عَامِرٍ قَصِيرًا فَتَنَاوَلَ بِهِ سَاقَ يَهُودِيٍّ لِيَضْرِبَهُ، وَيَرْجِعُ ذُبَابُ سَيْفِهِ، فَأَصَابَ عَيْنَ رُكْبَةِ عَامِرٍ، فَمَاتَ مِنْهُ قَالَ فَلَمَّا قَفَلُوا، قَالَ سَلَمَةُ رَآنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِي، قَالَ ‏\"‏ مَا لَكَ ‏\"‏‏.‏ قُلْتُ لَهُ فِدَاكَ أَبِي وَأُمِّي، زَعَمُوا أَنَّ عَامِرًا حَبِطَ عَمَلُهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ كَذَبَ مَنْ قَالَهُ، إِنَّ لَهُ لأَجْرَيْنِ ـ وَجَمَعَ بَيْنَ إِصْبَعَيْهِ ـ إِنَّهُ لَجَاهِدٌ مُجَاهِدٌ قَلَّ عَرَبِيٌّ مَشَى بِهَا مِثْلَهُ ‏\"‏‏.‏ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمٌ قَالَ ‏\"‏ نَشَأَ بِهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4196In-book reference : Book 64, Hadith 236USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 509   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4197,
    "id": 4197,
    "url": "https://sunnah.com/bukhari:4197",
    "bookNumber": 64,
    "hadithNumber": 237,
    "narrator": "Narrated Anas:",
    "english": "Allah's Messenger (ﷺ) reached Khaibar at night and it was his habit that, whenever he reached the enemy at \nnight, he will not attack them till it was morning. When it was morning, the Jews came out with their \nspades and baskets, and when they saw him(i.e. the Prophet (ﷺ) ), they said, \"Muhammad! By Allah! \nMuhammad and his army!\" The Prophet (ﷺ) said, \"Khaibar is destroyed, for whenever we approach a \n(hostile) nation (to fight), then evil will be the morning for those who have been warned.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى خَيْبَرَ لَيْلاً، وَكَانَ إِذَا أَتَى قَوْمًا بِلَيْلٍ لَمْ يُغِرْ بِهِمْ حَتَّى يُصْبِحَ، فَلَمَّا أَصْبَحَ خَرَجَتِ الْيَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ، فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ، مُحَمَّدٌ وَالْخَمِيسُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4197In-book reference : Book 64, Hadith 237USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4198,
    "id": 4198,
    "url": "https://sunnah.com/bukhari:4198",
    "bookNumber": 64,
    "hadithNumber": 238,
    "narrator": "Narrated Anas bin Malik:",
    "english": "We reached Khaibar early in the morning and the inhabitants of Khaibar \ncame out carrying their spades, and when they saw the Prophet (ﷺ) they said, \"Muhammad! By Allah! \nMuhammad and his army!\" The Prophet (ﷺ) said, \"Allahu-Akbar! Khaibar is destroyed, for whenever we \napproach a (hostile) nation (to fight) then evil will be the morning for those who have been warned.\" \nWe then got the meat of donkeys (and intended to eat it), but an announcement was made by the \nannouncer of the Prophet, \"Allah and His Apostle forbid you to eat the meat of donkeys as it is an \nimpure thing.\"",
    "arabic": "أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَبَّحْنَا خَيْبَرَ بُكْرَةً، فَخَرَجَ أَهْلُهَا بِالْمَسَاحِي، فَلَمَّا بَصُرُوا بِالنَّبِيِّ صلى الله عليه وسلم قَالُوا مُحَمَّدٌ وَاللَّهِ، مُحَمَّدٌ وَالْخَمِيسُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏ فَأَصَبْنَا مِنْ لُحُومِ الْحُمُرِ فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ، فَإِنَّهَا رِجْسٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4198In-book reference : Book 64, Hadith 238USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4199,
    "id": 4199,
    "url": "https://sunnah.com/bukhari:4199",
    "bookNumber": 64,
    "hadithNumber": 239,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Someone came to Allah's Messenger (ﷺ)s and said, \"The donkeys have been eaten (by the Muslims).\" The \nProphet kept quiet. Then the man came again and said, \"The donkeys have been eaten.\" The Prophet (ﷺ) \nkept quiet. The man came to him the third time and said, \"The donkeys have been consumed.\" On that \nthe Prophet (ﷺ) ordered an announcer to announce to the people, \"Allah and His Apostle forbid you to eat \nthe meat of donkeys.\" Then the cooking pots were upset while the meat was still boiling in them.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَهُ جَاءٍ فَقَالَ أُكِلَتِ الْحُمُرُ‏.‏ فَسَكَتَ، ثُمَّ أَتَاهُ الثَّانِيَةَ فَقَالَ أُكِلَتِ الْحُمُرُ‏.‏ فَسَكَتَ، ثُمَّ الثَّالِثَةَ فَقَالَ أُفْنِيَتِ الْحُمُرُ‏.‏ فَأَمَرَ مُنَادِيًا فَنَادَى فِي النَّاسِ إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ‏.‏ فَأُكْفِئَتِ الْقُدُورُ، وَإِنَّهَا لَتَفُورُ بِاللَّحْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4199In-book reference : Book 64, Hadith 239USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 511   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 4200,
    "id": 4200,
    "url": "https://sunnah.com/bukhari:4200",
    "bookNumber": 64,
    "hadithNumber": 240,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) offered the Fajr Prayer near Khaibar when it was still dark and then said, \"Allahu-Akbar! \nKhaibar is destroyed, for whenever we approach a (hostile) nation (to fight), then evil will be the \nmorning for those who have been warned.\" Then the inhabitants of Khaibar came out running on the \nroads. The Prophet (ﷺ) had their warriors killed, their offspring and woman taken as captives. Safiya was \namongst the captives, She first came in the share of Dahya Alkali but later on she belonged to the \nProphet . The Prophet (ﷺ) made her manumission as her 'Mahr'.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الصُّبْحَ قَرِيبًا مِنْ خَيْبَرَ بِغَلَسٍ ثُمَّ قَالَ ‏\n\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ، فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏ فَخَرَجُوا يَسْعَوْنَ فِي السِّكَكِ، فَقَتَلَ النَّبِيُّ صلى الله عليه وسلم الْمُقَاتِلَةَ، وَسَبَى الذُّرِّيَّةَ، وَكَانَ فِي السَّبْىِ صَفِيَّةُ، فَصَارَتْ إِلَى دِحْيَةَ الْكَلْبِيِّ، ثُمَّ صَارَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَجَعَلَ عِتْقَهَا صَدَاقَهَا‏.‏ فَقَالَ عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ لِثَابِتٍ يَا أَبَا مُحَمَّدٍ آنْتَ قُلْتَ لأَنَسٍ مَا أَصْدَقَهَا فَحَرَّكَ ثَابِتٌ رَأْسَهُ تَصْدِيقًا لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 4200In-book reference : Book 64, Hadith 240USC-MSA web (English) reference : Vol. 5, Book 59, Hadith 512   (deprecated numbering scheme)"
  }
]