[
  {
    "hadithGlobalNumber": 2901,
    "id": 2901,
    "url": "https://sunnah.com/bukhari:2901",
    "bookNumber": 56,
    "hadithNumber": 115,
    "narrator": "Narrated Abu Huraira:",
    "english": "While some Ethiopians were playing in the presence of the Prophet, `Umar came in, picked up a stone \nand hit them with it. On that the Prophet (ﷺ) said, \"O `Umar! Allow them (to play).\" Ma`mar (the subnarrator) \nadded that they were playing in the Mosque.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَا الْحَبَشَةُ يَلْعَبُونَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم بِحِرَابِهِمْ دَخَلَ عُمَرُ، فَأَهْوَى إِلَى الْحَصَى فَحَصَبَهُمْ بِهَا‏.‏ فَقَالَ ‏\n\"‏ دَعْهُمْ يَا عُمَرُ ‏\"‏‏.‏ وَزَادَ عَلِيٌّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ فِي الْمَسْجِدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2901In-book reference : Book 56, Hadith 115USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 150   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2902,
    "id": 2902,
    "url": "https://sunnah.com/bukhari:2902",
    "bookNumber": 56,
    "hadithNumber": 116,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Talha and the Prophet (ﷺ) used to shield themselves with one shield. Abu Talha was a good archer, \nand when he threw (his arrows) the Prophet (ﷺ) would look at the target of his arrows.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ أَبُو طَلْحَةَ يَتَتَرَّسُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِتُرْسٍ وَاحِدٍ، وَكَانَ أَبُو طَلْحَةَ حَسَنَ الرَّمْىِ، فَكَانَ إِذَا رَمَى تَشَرَّفَ النَّبِيُّ صلى الله عليه وسلم فَيَنْظُرُ إِلَى مَوْضِعِ نَبْلِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2902In-book reference : Book 56, Hadith 116USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 151   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2903,
    "id": 2903,
    "url": "https://sunnah.com/bukhari:2903",
    "bookNumber": 56,
    "hadithNumber": 117,
    "narrator": "Narrated Sahl:",
    "english": "When the helmet of the Prophet (ﷺ) was smashed on his head and blood covered his face and one of his \nfront teeth got broken, `Ali brought the water in his shield and Fatima the Prophet's daughter) washed \nhim. But when she saw that the bleeding increased more by the water, she took a mat, burnt it, and \nplaced the ashes on the wound of the Prophet (ﷺ) and so the blood stopped oozing out.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، قَالَ لَمَّا كُسِرَتْ بَيْضَةُ النَّبِيِّ صلى الله عليه وسلم عَلَى رَأْسِهِ وَأُدْمِيَ وَجْهُهُ، وَكُسِرَتْ رَبَاعِيَتُهُ، وَكَانَ عَلِيٌّ يَخْتَلِفُ بِالْمَاءِ فِي الْمِجَنِّ، وَكَانَتْ فَاطِمَةُ تَغْسِلُهُ، فَلَمَّا رَأَتِ الدَّمَ يَزِيدُ عَلَى الْمَاءِ كَثْرَةً عَمَدَتْ إِلَى حَصِيرٍ، فَأَحْرَقَتْهَا وَأَلْصَقَتْهَا عَلَى جُرْحِهِ، فَرَقَأَ الدَّمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2903In-book reference : Book 56, Hadith 117USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 152   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2904,
    "id": 2904,
    "url": "https://sunnah.com/bukhari:2904",
    "bookNumber": 56,
    "hadithNumber": 118,
    "narrator": "Narrated `Umar:",
    "english": "The properties of Bani An-Nadir which Allah had transferred to His Apostle as Fai Booty were not \ngained by the Muslims with their horses and camels. The properties therefore, belonged especially to \nAllah's Messenger (ﷺ) who used to give his family their yearly expenditure and spend what remained thereof \non arms and horses to be used in Allah's Cause.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مِمَّا لَمْ يُوجِفِ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلاَ رِكَابٍ، فَكَانَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً، وَكَانَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَجْعَلُ مَا بَقِيَ فِي السِّلاَحِ وَالْكُرَاعِ، عُدَّةً فِي سَبِيلِ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2904In-book reference : Book 56, Hadith 118USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 153   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2905,
    "id": 2905,
    "url": "https://sunnah.com/bukhari:2905",
    "bookNumber": 56,
    "hadithNumber": 119,
    "narrator": "Narrated `Ali:",
    "english": "I never saw the Prophet (ﷺ) saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I \nheard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ عَلِيٍّ، حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ شَدَّادٍ، قَالَ سَمِعْتُ عَلِيًّا ـ رضى الله عنه ـ يَقُولُ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُفَدِّي رَجُلاً بَعْدَ سَعْدٍ، سَمِعْتُهُ يَقُولُ ‏\n\"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2905In-book reference : Book 56, Hadith 119USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 154   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2906,
    "id": 2906,
    "url": "https://sunnah.com/bukhari:2906",
    "bookNumber": 56,
    "hadithNumber": 120,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) came to my house while two girls were singing beside me the songs of Bu'ath (a story \nabout the war between the two tribes of the Ansar, i.e. Khazraj and Aus, before Islam.) The Prophet (ﷺ) \nreclined on the bed and turned his face to the other side. Abu Bakr came and scolded me and said \nprotestingly, \"Instrument of Satan in the presence of Allah's Messenger (ﷺ)?\" Allah's Messenger (ﷺ) turned his face \ntowards him and said, \"Leave them.\" When Abu Bakr became inattentive, I waved the two girls to go \naway and they left. It was the day of `Id when negroes used to play with leather shields and spears. \nEither I requested Allah's Messenger (ﷺ) or he himself asked me whether I would like to see the display. I \nreplied in the affirmative. Then he let me stand behind him and my cheek was touching his cheek and \nhe was saying, \"Carry on, O Bani Arfida (i.e. negroes)!\" When I got tired, he asked me if that was \nenough. I replied in the affirmative and he told me to leave.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ عَمْرٌو حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏‏.‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.‏   قَالَتْ وَكَانَ يَوْمُ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقَالَتْ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَيَقُولُ ‏\"‏ دُونَكُمْ بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏ قَالَ أَحْمَدُ عَنِ ابْنِ وَهْبٍ، فَلَمَّا غَفَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2906, 2907In-book reference : Book 56, Hadith 120USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 155   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2907,
    "id": 2907,
    "url": "https://sunnah.com/bukhari:2907",
    "bookNumber": 56,
    "hadithNumber": 120,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) came to my house while two girls were singing beside me the songs of Bu'ath (a story \nabout the war between the two tribes of the Ansar, i.e. Khazraj and Aus, before Islam.) The Prophet (ﷺ) \nreclined on the bed and turned his face to the other side. Abu Bakr came and scolded me and said \nprotestingly, \"Instrument of Satan in the presence of Allah's Messenger (ﷺ)?\" Allah's Messenger (ﷺ) turned his face \ntowards him and said, \"Leave them.\" When Abu Bakr became inattentive, I waved the two girls to go \naway and they left. It was the day of `Id when negroes used to play with leather shields and spears. \nEither I requested Allah's Messenger (ﷺ) or he himself asked me whether I would like to see the display. I \nreplied in the affirmative. Then he let me stand behind him and my cheek was touching his cheek and \nhe was saying, \"Carry on, O Bani Arfida (i.e. negroes)!\" When I got tired, he asked me if that was \nenough. I replied in the affirmative and he told me to leave.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ عَمْرٌو حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏‏.‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.‏   قَالَتْ وَكَانَ يَوْمُ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقَالَتْ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَيَقُولُ ‏\"‏ دُونَكُمْ بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏ قَالَ أَحْمَدُ عَنِ ابْنِ وَهْبٍ، فَلَمَّا غَفَلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2906, 2907In-book reference : Book 56, Hadith 120USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 155   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2908,
    "id": 2908,
    "url": "https://sunnah.com/bukhari:2908",
    "bookNumber": 56,
    "hadithNumber": 121,
    "narrator": "Narrated Anas:",
    "english": "The 'Prophet was the best and the bravest amongst the people. Once the people of Medina got terrified \nat night, so they went in the direction of the noise (that terrified them). The Prophet (ﷺ) met them (on his \nway back) after he had found out the truth. He was riding an unsaddled horse belonging to Abu Talha \nand a sword was hanging by his neck, and he was saying, \"Don't be afraid! Don't be afraid!\" He \nfurther said, \"I found it (i.e. the horse) very fast,\" or said, \"This horse is very fast.\" (Qastala-ni)",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَأَشْجَعَ النَّاسِ، وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ لَيْلَةً فَخَرَجُوا نَحْوَ الصَّوْتِ فَاسْتَقْبَلَهُمُ النَّبِيُّ صلى الله عليه وسلم وَقَدِ اسْتَبْرَأَ الْخَبَرَ، وَهْوَ عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْىٍ وَفِي عُنُقِهِ السَّيْفُ وَهْوَ يَقُولُ ‏\"‏ لَمْ تُرَاعُوا لَمْ تُرَاعُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ وَجَدْنَاهُ بَحْرًا ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ إِنَّهُ لَبَحْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2908In-book reference : Book 56, Hadith 121USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 156   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2909,
    "id": 2909,
    "url": "https://sunnah.com/bukhari:2909",
    "bookNumber": 56,
    "hadithNumber": 122,
    "narrator": "Narrated Abu Umama:",
    "english": "Some people conquered many countries and their swords were decorated neither with gold nor silver, \nbut they were decorated with leather, lead and iron.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ حَبِيبٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، يَقُولُ لَقَدْ فَتَحَ الْفُتُوحَ قَوْمٌ مَا كَانَتْ حِلْيَةُ سُيُوفِهِمِ الذَّهَبَ وَلاَ الْفِضَّةَ، إِنَّمَا كَانَتْ حِلْيَتُهُمُ الْعَلاَبِيَّ وَالآنُكَ وَالْحَدِيدَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2909In-book reference : Book 56, Hadith 122USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 157   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2910,
    "id": 2910,
    "url": "https://sunnah.com/bukhari:2910",
    "bookNumber": 56,
    "hadithNumber": 123,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "That he proceeded in the company of Allah's Messenger (ﷺ) towards Najd to participate in a Ghazwa. (Holybattle) \nWhen Allah's Messenger (ﷺ) returned, he too returned with him. Midday came upon them while they \nwere in a valley having many thorny trees. Allah's Messenger (ﷺ) and the people dismounted and dispersed \nto rest in the shade of the trees. Allah's Messenger (ﷺ) rested under a tree and hung his sword on it. We all \ntook a nap and suddenly we heard Allah's Messenger (ﷺ) calling us. (We woke up) to see a bedouin with \nhim. The Prophet (ﷺ) said, \"This bedouin took out my sword while I was sleeping and when I woke up, I \nfound the unsheathed sword in his hand and he challenged me saying, 'Who will save you from me?' I \nsaid thrice, 'Allah.' The Prophet (ﷺ) did not punish him but sat down.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَ أَنَّهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَلَمَّا قَفَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَفَلَ مَعَهُ، فَأَدْرَكَتْهُمُ الْقَائِلَةُ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَفَرَّقَ النَّاسُ يَسْتَظِلُّونَ بِالشَّجَرِ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَحْتَ سَمُرَةٍ وَعَلَّقَ بِهَا سَيْفَهُ وَنِمْنَا نَوْمَةً، فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُونَا وَإِذَا عِنْدَهُ أَعْرَابِيٌّ فَقَالَ ‏\"‏ إِنَّ هَذَا اخْتَرَطَ عَلَىَّ سَيْفِي وَأَنَا نَائِمٌ، فَاسْتَيْقَظْتُ وَهْوَ فِي يَدِهِ صَلْتًا ‏\"‏‏.‏ فَقَالَ مَنْ يَمْنَعُكَ مِنِّي فَقُلْتُ ‏\"‏ اللَّهُ ‏\"‏‏.‏ ثَلاَثًا وَلَمْ يُعَاقِبْهُ وَجَلَسَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2910In-book reference : Book 56, Hadith 123USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 158   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2911,
    "id": 2911,
    "url": "https://sunnah.com/bukhari:2911",
    "bookNumber": 56,
    "hadithNumber": 124,
    "narrator": "Narrated Sahl:",
    "english": "That he was asked about the wound of the Prophet (ﷺ) on the day (of the battle) of Uhud. He said, \"The \nface of the Prophet (ﷺ) as wounded and one of his front teeth as broken and the helmet over his head was \nsmashed. Fatima washed of the blood while `Ali held water. When she saw that bleeding was \nincreasing continuously, she burnt a mat (of date-palm leaves) till it turned into ashes which she put \nover the wound and thus the bleeding ceased.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ أَنَّهُ سُئِلَ عَنْ جُرْحِ النَّبِيِّ، صلى الله عليه وسلم يَوْمَ أُحُدٍ‏.‏ فَقَالَ جُرِحَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم وَكُسِرَتْ رَبَاعِيَتُهُ وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ، فَكَانَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ تَغْسِلُ الدَّمَ وَعَلِيٌّ يُمْسِكُ، فَلَمَّا رَأَتْ أَنَّ الدَّمَ لاَ يَزِيدُ إِلاَّ كَثْرَةً أَخَذَتْ حَصِيرًا فَأَحْرَقَتْهُ حَتَّى صَارَ رَمَادًا ثُمَّ أَلْزَقَتْهُ، فَاسْتَمْسَكَ الدَّمُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2911In-book reference : Book 56, Hadith 124USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 159   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2912,
    "id": 2912,
    "url": "https://sunnah.com/bukhari:2912",
    "bookNumber": 56,
    "hadithNumber": 125,
    "narrator": "Narrated `Amr bin Al-Harith:",
    "english": "The Prophet (ﷺ) did not leave behind him after his death, anything except his arms, his white mule, and a \npiece of land at Khaibar which he left to be given in charity .",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ مَا تَرَكَ النَّبِيُّ صلى الله عليه وسلم إِلاَّ سِلاَحَهُ وَبَغْلَةً بَيْضَاءَ وَأَرْضًا جَعَلَهَا صَدَقَةً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2912In-book reference : Book 56, Hadith 125USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 160   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2913,
    "id": 2913,
    "url": "https://sunnah.com/bukhari:2913",
    "bookNumber": 56,
    "hadithNumber": 126,
    "narrator": "Narrated Jabir:",
    "english": "as above (Hadith No. 158).\nNarrated Jabir bin `Abdullah:\n\nThat he participated in a Ghazwa (Holy-Battle) in the company of Allah's Messenger (ﷺ). Midday came upon \nthem while they were in a valley having many thorny trees. The people dispersed to rest in the shade \nof the trees. The Prophet (ﷺ) rested under a tree, hung his sword on it, and then slept. Then he woke up to \nfind near to him, a man whose presence he had not noticed before. The Prophet (ﷺ) said, \"This (man) took \nmy sword (out of its scabbard) and said, 'Who will save you from me.' I replied, 'Allah.' So, he put the \nsword back into its scabbard, and you see him sitting here.\" Anyhow, the Prophet (ﷺ) did not punish him. \n(See Hadith No. 158)",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا سِنَانُ بْنُ أَبِي سِنَانٍ، وَأَبُو سَلَمَةَ أَنَّ جَابِرًا، أَخْبَرَهُ‏.‏ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ سِنَانِ بْنِ أَبِي سِنَانٍ الدُّؤَلِيِّ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَأَدْرَكَتْهُمُ الْقَائِلَةُ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَتَفَرَّقَ النَّاسُ فِي الْعِضَاهِ يَسْتَظِلُّونَ بِالشَّجَرِ، فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم تَحْتَ شَجَرَةٍ فَعَلَّقَ بِهَا سَيْفَهُ ثُمَّ نَامَ، فَاسْتَيْقَظَ وَعِنْدَهُ رَجُلٌ وَهْوَ لاَ يَشْعُرُ بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ هَذَا اخْتَرَطَ سَيْفِي ‏\"‏‏.‏ فَقَالَ مَنْ يَمْنَعُكَ قُلْتُ ‏\"‏ اللَّهُ ‏\"‏‏.‏ فَشَامَ السَّيْفَ، فَهَا هُوَ ذَا جَالِسٌ، ثُمَّ لَمْ يُعَاقِبْهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2913In-book reference : Book 56, Hadith 126USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 161   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2914,
    "id": 2914,
    "url": "https://sunnah.com/bukhari:2914",
    "bookNumber": 56,
    "hadithNumber": 127,
    "narrator": "Narrated Abu Qatada:",
    "english": "That he was in the company of Allah's Messenger (ﷺ) and when they had covered a portion of the road to \nMecca, he and some of the companions lagged behind. The latter were in a state of Ihram, while he \nwas not. He saw an onager and rode his horse and requested his companions to give him his lash but \nthey refused. Then he asked them to give him his spear but they refused, so he took it himself, \nattacked the onager, and killed it. Some of the companions of the Prophet (ﷺ) ate of it while some others \nrefused to eat. When they caught up with Allah's Messenger (ﷺ) they asked him about that, and he said, \n\"That was a meal Allah fed you with.\" (It is also said that Allah's Messenger (ﷺ) asked, \"Have you got \nsomething of its meat?\")",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ الأَنْصَارِيِّ عَنْ أَبِي قَتَادَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ وَهْوَ غَيْرُ مُحْرِمٍ، فَرَأَى حِمَارًا وَحْشِيًّا فَاسْتَوَى عَلَى فَرَسِهِ، فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا، فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا، فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ، فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، وَأَبَى بَعْضٌ، فَلَمَّا أَدْرَكُوا رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلُوهُ عَنْ ذَلِكَ قَالَ ‏\"‏ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏‏.‏ وَعَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ فِي الْحِمَارِ الْوَحْشِيِّ مِثْلُ حَدِيثِ أَبِي النَّضْرِ قَالَ ‏\"‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2914In-book reference : Book 56, Hadith 127USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 163   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2915,
    "id": 2915,
    "url": "https://sunnah.com/bukhari:2915",
    "bookNumber": 56,
    "hadithNumber": 128,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) , while in a tent (on the day of the battle of Badr) said, \"O Allah! I ask you the fulfillment \nof Your Covenant and Promise. O Allah! If You wish (to destroy the believers) You will never be \nworshipped after today.\" Abu Bakr caught him by the hand and said, \"This is sufficient, O Allah's \nApostle! You have asked Allah pressingly.\" The Prophet (ﷺ) was clad in his armor at that time. He went \nout, saying to me: \"There multitude will be put to flight and they will show their backs. Nay, but the \nHour is their appointed time (for their full recompense) and that Hour will be more grievous and more \nbitter (than their worldly failure).\" (54.45-46) Khalid said that was on the day of the battle of Badr.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ فِي قُبَّةٍ ‏\"‏ اللَّهُمَّ إِنِّي أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ شِئْتَ لَمْ تُعْبَدْ بَعْدَ الْيَوْمِ ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ فَقَالَ حَسْبُكَ يَا رَسُولَ اللَّهِ، فَقَدْ أَلْحَحْتَ عَلَى رَبِّكَ، وَهْوَ فِي الدِّرْعِ، فَخَرَجَ وَهْوَ يَقُولُ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ * بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ ‏}‏‏.‏ وَقَالَ وُهَيْبٌ حَدَّثَنَا خَالِدٌ يَوْمَ بَدْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2915In-book reference : Book 56, Hadith 128USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 164   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2916,
    "id": 2916,
    "url": "https://sunnah.com/bukhari:2916",
    "bookNumber": 56,
    "hadithNumber": 129,
    "narrator": "Narrated `Aisha:",
    "english": "Allah's Messenger (ﷺ) died while his (iron) armor was mortgaged to a Jew for thirty Sas of barley.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلاَثِينَ صَاعًا مِنْ شَعِيرٍ‏.‏ وَقَالَ يَعْلَى حَدَّثَنَا الأَعْمَشُ دِرْعٌ مِنْ حَدِيدٍ‏.‏ وَقَالَ مُعَلًّى حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الأَعْمَشُ وَقَالَ رَهَنَهُ دِرْعًا مِنْ حَدِيدٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2916In-book reference : Book 56, Hadith 129USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 165   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2917,
    "id": 2917,
    "url": "https://sunnah.com/bukhari:2917",
    "bookNumber": 56,
    "hadithNumber": 130,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The example of a miser and the one who gives in charity, is like the example of \ntwo men wearing iron cloaks so tightly that their arms are raised forcibly towards their collar-bones. \nSo, whenever a charitable person wants to give in charity, his cloak spreads over his body so much so \nthat it wipes out his traces, but whenever the miser wants to give in charity, the rings (of the iron \ncloak) come closer to each other and press over his body, and his hands gets connected to his collarbones. \nAbu Huraira heard the Prophet (ﷺ) saying. \"The miser then tries to widen it but in vain.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ مَثَلُ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، قَدِ اضْطَرَّتْ أَيْدِيَهُمَا إِلَى تَرَاقِيهِمَا، فَكُلَّمَا هَمَّ الْمُتَصَدِّقُ بِصَدَقَتِهِ اتَّسَعَتْ عَلَيْهِ حَتَّى تُعَفِّيَ أَثَرَهُ، وَكُلَّمَا هَمَّ الْبَخِيلُ بِالصَّدَقَةِ انْقَبَضَتْ كُلُّ حَلْقَةٍ إِلَى صَاحِبَتِهَا وَتَقَلَّصَتْ عَلَيْهِ وَانْضَمَّتْ يَدَاهُ إِلَى تَرَاقِيهِ ‏\"‏‏.‏ فَسَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ فَيَجْتَهِدُ أَنْ يُوَسِّعَهَا فَلاَ تَتَّسِعُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2917In-book reference : Book 56, Hadith 130USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 166   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2918,
    "id": 2918,
    "url": "https://sunnah.com/bukhari:2918",
    "bookNumber": 56,
    "hadithNumber": 131,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "Allah's Messenger (ﷺ) went out to answer the call of nature and on his return I brought some water to him. \nHe performed the ablution while he was wearing a Sha'mi cloak. He rinsed his mouth and washed his \nnose by putting water in it and then blowing it out, and washed his face. Then he tried to take out his \nhands through his sleeves but they were tight, so he took them out from underneath, washed them and \npassed wet hands over his head and over his leather socks.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، مُسْلِمٍ ـ هُوَ ابْنُ صُبَيْحٍ ـ عَنْ مَسْرُوقٍ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ شُعْبَةَ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحَاجَتِهِ ثُمَّ أَقْبَلَ، فَلَقِيتُهُ بِمَاءٍ، وَعَلَيْهِ جُبَّةٌ شَأْمِيَّةٌ، فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ، فَذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّيْهِ فَكَانَا ضَيِّقَيْنِ، فَأَخْرَجَهُمَا مِنْ تَحْتُ، فَغَسَلَهُمَا وَمَسَحَ بِرَأْسِهِ وَعَلَى خُفَّيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2918In-book reference : Book 56, Hadith 131USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 167   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2919,
    "id": 2919,
    "url": "https://sunnah.com/bukhari:2919",
    "bookNumber": 56,
    "hadithNumber": 132,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair to wear silken shirts because they had a \nskin disease causing itching.",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ فِي قَمِيصٍ مِنْ حَرِيرٍ، مِنْ حِكَّةٍ كَانَتْ بِهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2919In-book reference : Book 56, Hadith 132USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 168   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2920,
    "id": 2920,
    "url": "https://sunnah.com/bukhari:2920",
    "bookNumber": 56,
    "hadithNumber": 133,
    "narrator": "Narrated Anas:",
    "english": "As above.\nNarrated Anas:\n\n`Abdur Rahman bin `Auf and Az-Zubair complained to the Prophet, i.e. about the lice (that caused \nitching) so he allowed them to wear silken clothes. I saw them wearing such clothes in a holy battle.",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ عَبْدَ، الرَّحْمَنِ بْنَ عَوْفٍ وَالزُّبَيْرَ شَكَوَا إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يَعْنِي الْقَمْلَ ـ فَأَرْخَصَ لَهُمَا فِي الْحَرِيرِ، فَرَأَيْتُهُ عَلَيْهِمَا فِي غَزَاةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2920In-book reference : Book 56, Hadith 133USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 169   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2921,
    "id": 2921,
    "url": "https://sunnah.com/bukhari:2921",
    "bookNumber": 56,
    "hadithNumber": 134,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair bin Al-`Awwam to wear silk.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، أَخْبَرَنِي قَتَادَةُ، أَنَّ أَنَسًا، حَدَّثَهُمْ قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ فِي حَرِيرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2921In-book reference : Book 56, Hadith 134USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 171   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2922,
    "id": 2922,
    "url": "https://sunnah.com/bukhari:2922",
    "bookNumber": 56,
    "hadithNumber": 135,
    "narrator": "Narrated Anas:",
    "english": "(Wearing of silk) was allowed to them (i.e. `AbdurRahman and Az-Zubair) because of the itching they \nsuffered from.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ، رَخَّصَ أَوْ رُخِّصَ لِحِكَّةٍ بِهِمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2922In-book reference : Book 56, Hadith 135USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 172   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2923,
    "id": 2923,
    "url": "https://sunnah.com/bukhari:2923",
    "bookNumber": 56,
    "hadithNumber": 136,
    "narrator": "Narrated Umaiya Ad-Damri:",
    "english": "I saw the Prophet (ﷺ) eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer \nand he prayed without repeating his ablution.\nNarrated Az-Zuhri:\n\nas above (Hadith No. 173...) and added that the Prophet (ﷺ) put the knife down.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ مِنْ كَتِفٍ يَحْتَزُّ مِنْهَا، ثُمَّ دُعِيَ إِلَى الصَّلاَةِ فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ وَزَادَ فَأَلْقَى السِّكِّينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2923In-book reference : Book 56, Hadith 136USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 173   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2924,
    "id": 2924,
    "url": "https://sunnah.com/bukhari:2924",
    "bookNumber": 56,
    "hadithNumber": 137,
    "narrator": "Narrated Khalid bin Madan:",
    "english": "That 'Umair bin Al-Aswad Al-Anasi told him that he went to 'Ubada bin As-Samit while he was \nstaying in his house at the sea-shore of Hims with (his wife) Um Haram. 'Umair said. Um Haram \ninformed us that she heard the Prophet (ﷺ) saying, \"Paradise is granted to the first batch of my followers \nwho will undertake a naval expedition.\" Um Haram added, I said, 'O Allah's Messenger (ﷺ)! Will I be \namongst them?' He replied, 'You are amongst them.' The Prophet (ﷺ) then said, 'The first army amongst' \nmy followers who will invade Caesar's City will be forgiven their sins.' I asked, 'Will I be one of them, \nO Allah's Messenger (ﷺ)?' He replied in the negative.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ يَزِيدَ الدِّمَشْقِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، أَنَّ عُمَيْرَ بْنَ الأَسْوَدِ الْعَنْسِيَّ، حَدَّثَهُ أَنَّهُ، أَتَى عُبَادَةَ بْنَ الصَّامِتِ وَهْوَ نَازِلٌ فِي سَاحِلِ حِمْصَ، وَهْوَ فِي بِنَاءٍ لَهُ وَمَعَهُ أُمُّ حَرَامٍ، قَالَ عُمَيْرٌ فَحَدَّثَتْنَا أُمُّ حَرَامٍ أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَوَّلُ جَيْشٍ مِنْ أُمَّتِي يَغْزُونَ الْبَحْرَ قَدْ أَوْجَبُوا ‏\"‏‏.‏ قَالَتْ أُمُّ حَرَامٍ قُلْتُ يَا رَسُولَ اللَّهِ أَنَا فِيهِمْ‏.‏ قَالَ ‏\"‏ أَنْتِ فِيهِمْ ‏\"‏‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوَّلُ جَيْشٍ مِنْ أُمَّتِي يَغْزُونَ مَدِينَةَ قَيْصَرَ مَغْفُورٌ لَهُمْ ‏\"‏‏.‏ فَقُلْتُ أَنَا فِيهِمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2924In-book reference : Book 56, Hadith 137USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 175   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2925,
    "id": 2925,
    "url": "https://sunnah.com/bukhari:2925",
    "bookNumber": 56,
    "hadithNumber": 138,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"You (i.e. Muslims) will fight with the Jews until some of them will hide behind \nstones. The stones will (betray them) saying, 'O `Abdullah (i.e. slave of Allah)! There is a Jew hiding \nbehind me; so kill him.'\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تُقَاتِلُونَ الْيَهُودَ حَتَّى يَخْتَبِيَ أَحَدُهُمْ وَرَاءَ الْحَجَرِ فَيَقُولُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2925In-book reference : Book 56, Hadith 138USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 176   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2926,
    "id": 2926,
    "url": "https://sunnah.com/bukhari:2926",
    "bookNumber": 56,
    "hadithNumber": 139,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Jews, and the stone \nbehind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill \nhim.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا الْيَهُودَ حَتَّى يَقُولَ الْحَجَرُ وَرَاءَهُ الْيَهُودِيُّ يَا مُسْلِمُ، هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2926In-book reference : Book 56, Hadith 139USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 177   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2927,
    "id": 2927,
    "url": "https://sunnah.com/bukhari:2927",
    "bookNumber": 56,
    "hadithNumber": 140,
    "narrator": "Narrated `Amr bin Taghlib:",
    "english": "The Prophet (ﷺ) said, \"One of the portents of the Hour is that you will fight with people wearing shoes \nmade of hair; and one of the portents of the Hour is that you will fight with broad-faced people whose \nfaces will look like shields coated with leather.\"",
    "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا يَنْتَعِلُونَ نِعَالَ الشَّعَرِ، وَإِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا عِرَاضَ الْوُجُوهِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2927In-book reference : Book 56, Hadith 140USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 178   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2928,
    "id": 2928,
    "url": "https://sunnah.com/bukhari:2928",
    "bookNumber": 56,
    "hadithNumber": 141,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Turks; people with \nsmall eyes, red faces, and flat noses. Their faces will look like shields coated with leather. The Hour \nwill not be established till you fight with people whose shoes are made of hair.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا التُّرْكَ صِغَارَ الأَعْيُنِ، حُمْرَ الْوُجُوهِ، ذُلْفَ الأُنُوفِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ، وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2928In-book reference : Book 56, Hadith 141USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 179   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2929,
    "id": 2929,
    "url": "https://sunnah.com/bukhari:2929",
    "bookNumber": 56,
    "hadithNumber": 142,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight with people wearing shoes made of \nhair. And the Hour will not be established till you fight with people whose faces look like shields \ncoated with leather. \" (Abu Huraira added, \"They will be) small-eyed, flat nosed, and their faces will \nlook like shields coated with leather.\")",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَزَادَ فِيهِ أَبُو الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً ‏\"‏ صِغَارَ الأَعْيُنِ، ذُلْفَ الأُنُوفِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2929In-book reference : Book 56, Hadith 142USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 180   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2930,
    "id": 2930,
    "url": "https://sunnah.com/bukhari:2930",
    "bookNumber": 56,
    "hadithNumber": 143,
    "narrator": "Narrated Abu 'Is-haq:",
    "english": "A man asked Al-Bara', \"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He \nreplied, \"No, by Allah! Allah's Messenger (ﷺ) did not flee, but his young unarmed companions passed by the \narchers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw \narrows at them hardly missing a shot. So the Muslims retreated towards the Prophet (ﷺ) while he was \nriding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul \nMuttalib. The Prophet (ﷺ) dismounted and invoked Allah for victory; then he said, 'I am the Prophet, \nwithout a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows.\"",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، وَسَأَلَهُ، رَجُلٌ أَكُنْتُمْ فَرَرْتُمْ يَا أَبَا عُمَارَةَ يَوْمَ حُنَيْنٍ قَالَ لاَ، وَاللَّهِ مَا وَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم، وَلَكِنَّهُ خَرَجَ شُبَّانُ أَصْحَابِهِ وَأَخِفَّاؤُهُمْ حُسَّرًا لَيْسَ بِسِلاَحٍ، فَأَتَوْا قَوْمًا رُمَاةً، جَمْعَ هَوَازِنَ وَبَنِي نَصْرٍ، مَا يَكَادُ يَسْقُطُ لَهُمْ سَهْمٌ، فَرَشَقُوهُمْ رَشْقًا مَا يَكَادُونَ يُخْطِئُونَ، فَأَقْبَلُوا هُنَالِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ عَلَى بَغْلَتِهِ الْبَيْضَاءِ، وَابْنُ عَمِّهِ أَبُو سُفْيَانَ بْنُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ يَقُودُ بِهِ، فَنَزَلَ وَاسْتَنْصَرَ ثُمَّ قَالَ أَنَا النَّبِيُّ لاَ كَذِبْ أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ ثُمَّ صَفَّ أَصْحَابَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2930In-book reference : Book 56, Hadith 143USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 181   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2931,
    "id": 2931,
    "url": "https://sunnah.com/bukhari:2931",
    "bookNumber": 56,
    "hadithNumber": 144,
    "narrator": "Narrated `Ali:",
    "english": "When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Messenger (ﷺ) said, \"O Allah! Fill their \n(i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the \nprayer (i.e. `Asr) till the sun set.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ الأَحْزَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَلأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا، شَغَلُونَا عَنِ الصَّلاَةِ الْوُسْطَى حِينَ غَابَتِ الشَّمْسُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2931In-book reference : Book 56, Hadith 144USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 182   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2932,
    "id": 2932,
    "url": "https://sunnah.com/bukhari:2932",
    "bookNumber": 56,
    "hadithNumber": 145,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) used to recite the following invocations during Qunut: \"O Allah! Save Salama bin \nHisham. O Allah! Save Al-Walid bin Al-Walid. O Allah! Save `Aiyash bin Rabi`a O Allah ! Save the \nweak Muslims. O Allah! Be very hard on Mudar tribe. O Allah! Afflict them with years (of famine) \nsimilar to the (famine) years of the time of Prophet Joseph.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو فِي الْقُنُوتِ ‏\n\"‏ اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2932In-book reference : Book 56, Hadith 145USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 183   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2933,
    "id": 2933,
    "url": "https://sunnah.com/bukhari:2933",
    "bookNumber": 56,
    "hadithNumber": 146,
    "narrator": "Narrated `Abdullah bin Abi `Aufa:",
    "english": "Allah's Messenger (ﷺ) invoked evil upon the pagans on the ay (of the battle) of Al-Ahzab, saying, \"O Allah! \nThe Revealer of the Holy Book, the Swift-Taker of Accounts, O Allah, defeat Al-Ahzab (i.e. the \nclans), O Allah, defeat them and shake them.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ يَقُولُ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ عَلَى الْمُشْرِكِينَ فَقَالَ ‏\n\"‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ، اللَّهُمَّ اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2933In-book reference : Book 56, Hadith 146USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 184   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2934,
    "id": 2934,
    "url": "https://sunnah.com/bukhari:2934",
    "bookNumber": 56,
    "hadithNumber": 147,
    "narrator": "Narrated `Abdullah:",
    "english": "Once the Prophet (ﷺ) was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men \nsent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere \nin Mecca, and when he brought them, they put them over the Prophet (ﷺ) Then Fatima (i.e. the Prophet's \ndaughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) \nQuraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin \nHisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi \nMitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي ظِلِّ الْكَعْبَةِ، فَقَالَ أَبُو جَهْلٍ وَنَاسٌ مِنْ قُرَيْشٍ، وَنُحِرَتْ جَزُورٌ بِنَاحِيَةِ مَكَّةَ، فَأَرْسَلُوا فَجَاءُوا مِنْ سَلاَهَا، وَطَرَحُوهُ عَلَيْهِ، فَجَاءَتْ فَاطِمَةُ فَأَلْقَتْهُ عَنْهُ، فَقَالَ ‏\n\"‏ اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ، اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ، اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ ‏\"‏‏.‏ لأَبِي جَهْلِ بْنِ هِشَامٍ، وَعُتْبَةَ بْنِ رَبِيعَةَ، وَشَيْبَةَ بْنِ رَبِيعَةَ، وَالْوَلِيدِ بْنِ عُتْبَةَ، وَأُبَىِّ بْنِ خَلَفٍ، وَعُقْبَةَ بْنِ أَبِي مُعَيْطٍ‏.‏ قَالَ عَبْدُ اللَّهِ فَلَقَدْ رَأَيْتُهُمْ فِي قَلِيبِ بَدْرٍ قَتْلَى‏.‏ قَالَ أَبُو إِسْحَاقَ وَنَسِيتُ السَّابِعَ‏.‏ وَقَالَ يُوسُفُ بْنُ إِسْحَاقَ عَنْ أَبِي إِسْحَاقَ أُمَيَّةُ بْنُ خَلَفٍ‏.‏ وَقَالَ شُعْبَةُ أُمَيَّةُ أَوْ أُبَىٌّ‏.‏ وَالصَّحِيحُ أُمَيَّةُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2934In-book reference : Book 56, Hadith 147USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 185   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2935,
    "id": 2935,
    "url": "https://sunnah.com/bukhari:2935",
    "bookNumber": 56,
    "hadithNumber": 148,
    "narrator": "Narrated `Aisha:",
    "english": "Once the Jews came to the Prophet (ﷺ) and said, \"Death be upon you.\" So I cursed them. The Prophet (ﷺ) \nsaid, \"What is the matter?\" I said, \"Have you not heard what they said?\" The Prophet (ﷺ) said, \"Have you \nnot heard what I replied (to them)? (I said), ('The same is upon you.')\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الْيَهُودَ، دَخَلُوا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ فَلَعَنْتُهُمْ‏.‏ فَقَالَ ‏\"‏ مَا لَكِ ‏\"‏‏.‏ قُلْتُ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ فَلَمْ تَسْمَعِي مَا قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2935In-book reference : Book 56, Hadith 148USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 186   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2936,
    "id": 2936,
    "url": "https://sunnah.com/bukhari:2936",
    "bookNumber": 56,
    "hadithNumber": 149,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the tillers (i.e. your people).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى قَيْصَرَ، وَقَالَ ‏\n\"‏ فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2936In-book reference : Book 56, Hadith 149USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 187   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2937,
    "id": 2937,
    "url": "https://sunnah.com/bukhari:2937",
    "bookNumber": 56,
    "hadithNumber": 150,
    "narrator": "Narrated Abu Huraira:",
    "english": "Tufail bin `Amr Ad-Dausi and his companions came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The \npeople of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The \npeople said, \"The tribe of Daus is ruined.\" The Prophet (ﷺ) said, \"O Allah! Give guidance to the people of \nDaus, and let them embrace Islam.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه قَدِمَ طُفَيْلُ بْنُ عَمْرٍو الدَّوْسِيُّ وَأَصْحَابُهُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ، إِنَّ دَوْسًا عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهَا‏.‏ فَقِيلَ هَلَكَتْ دَوْسٌ‏.‏ قَالَ ‏\n\"‏ اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2937In-book reference : Book 56, Hadith 150USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 188   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2938,
    "id": 2938,
    "url": "https://sunnah.com/bukhari:2938",
    "bookNumber": 56,
    "hadithNumber": 151,
    "narrator": "Narrated Anas:",
    "english": "When the Prophet (ﷺ) intended to write a letter to the ruler of the Byzantines, he was told that those \npeople did not read any letter unless it was stamped with a seal. So, the Prophet (ﷺ) got a silver ring-- as if \nI were just looking at its white glitter on his hand ---- and stamped on it the expression \"Muhammad, \nApostle of Allah\".",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكْتُبَ إِلَى الرُّومِ، قِيلَ لَهُ إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ أَنْ يَكُونَ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، فَكَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ، وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2938In-book reference : Book 56, Hadith 151USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 189   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2939,
    "id": 2939,
    "url": "https://sunnah.com/bukhari:2939",
    "bookNumber": 56,
    "hadithNumber": 152,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) sent his letter to Khusrau and ordered his messenger to hand it over to the Governor of \nBahrain who was to hand it over to Khusrau. So, when Khusrau read the letter he tore it. Sa`id bin Al- \nMusaiyab said, \"The Prophet (ﷺ) then invoked Allah to disperse them with full dispersion, (destroy them \n(i.e. Khusrau and his followers) severely)\".",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، يَدْفَعُهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ كِسْرَى خَرَّقَهُ، فَحَسِبْتُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2939In-book reference : Book 56, Hadith 152USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 190   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2940,
    "id": 2940,
    "url": "https://sunnah.com/bukhari:2940",
    "bookNumber": 56,
    "hadithNumber": 153,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) wrote to Caesar and invited him to Islam and sent him his letter with Dihya Al-Kalbi \nwhom Allah's Messenger (ﷺ) ordered to hand it over to the Governor of Busra who would forward it to \nCaesar. Caesar as a sign of gratitude to Allah, had walked from Hims to Ilya (i.e. Jerusalem) when \nAllah had granted Him victory over the Persian forces. So, when the letter of Allah's Messenger (ﷺ) reached \nCaesar, he said after reading it, 'Seek for me any one of his people! (Arabs of Quraish tribe) if present \nhere, in order to ask him about Allah's Messenger (ﷺ). At that time Abu Sufyan bin Harb was in Sham with \nsome men from Quraish who had come (to Sham) as merchants during the truce that had been \nconcluded between Allah's Messenger (ﷺ); and the infidels of Quraish. \nAbu Sufyan said, Caesar's messenger found us somewhere in Sham so he took me and my \ncompanions to Ilya and we were admitted into Ceasar's court to find him sitting in his royal court \nwearing a crown and surrounded by the senior dignitaries of the Byzantine. He said to his translator. \n'Ask them who amongst them is a close relation to the man who claims to be a prophet.\" Abu Sufyan \nadded, \"I replied, 'I am the nearest relative to him.' He asked, 'What degree of relationship do you have \nwith him?' I replied, 'He is my cousin,' and there was none of Bani Abu Manaf in the caravan except \nmyself. Caesar said, 'Let him come nearer.' He then ordered that my companions stand behind me near \nmy shoulder and said to his translator, 'Tell his companions that I am going to ask this man about the \nman who claims to be a prophet. If he tells a lie, they should contradict him immediately.\" Abu \nSufyan added, \"By Allah! Had it not been shameful that my companions label me a liar, I would not \nhave spoken the truth about him when he asked me. But I considered it shameful to be called a liar by \nmy companions. So I told the truth. \nHe then said to his translator, 'Ask him what kind of family does he belong to.' I replied, 'He belongs \nto a noble family amongst us.' He said, 'Have anybody else amongst you ever claimed the same before \nhim? 'I replied, 'No.' He said, 'Had you ever blamed him for telling lies before he claimed what he \nclaimed? ' I replied, 'No.' He said, 'Was anybody amongst his ancestors a king?' I replied, 'No.' He \nsaid, \"Do the noble or the poor follow him?' I replied, 'It is the poor who follow him.' He said, 'Are \nthey increasing or decreasing (day by day)?' I replied,' They are increasing.' He said, 'Does anybody \namongst those who embrace his (the Prophet's) Religion become displeased and then discard his \nReligion?'. I replied, 'No. ' He said, 'Does he break his promises? I replied, 'No, but we are now at \ntruce with him and we are afraid that he may betray us.\" Abu Sufyan added, \"Other than the last \nsentence, I could not say anything against him. Caesar then asked, 'Have you ever had a war with \nhim?' I replied, 'Yes.' He said, 'What was the outcome of your battles with him?' I replied, 'The result \nwas unstable; sometimes he was victorious and sometimes we.' He said, 'What does he order you to \ndo?' I said, 'He tells us to worship Allah alone, and not to worship others along with Him, and to leave \nall that our fore-fathers used to worship. He orders us to pray, give in charity, be chaste, keep \npromises and return what is entrusted to us.' \nWhen I had said that, Caesar said to his translator, 'Say to him: I ask you about his lineage and your \nreply was that he belonged to a noble family. In fact, all the apostles came from the noblest lineage of \ntheir nations. Then I questioned you whether anybody else amongst you had claimed such a thing, and \nyour reply was in the negative. If the answer had been in the affirmative, I would have thought that \nthis man was following a claim that had been said before him. When I asked you whether he was ever \nblamed for telling lies, your reply was in the negative, so I took it for granted that a person who did \nnot tell a lie about (others) the people could never tell a lie about Allah. Then I asked you whether any \nof his ancestors was a king. Your reply was in the negative, and if it had been in the affirmative, I \nwould have thought that this man wanted to take back his ancestral kingdom. When I asked you \nwhether the rich or the poor people followed him, you replied that it was the poor who followed him. \nIn fact, such are the followers of the apostles. Then I asked you whether his followers were increasing \nor decreasing. You replied that they were increasing. In fact, this is the result of true faith till it is \ncomplete (in all respects). \nI asked you whether there was anybody who, after embracing his religion, became displeased and \ndiscarded his religion; your reply was in the negative. In fact, this is the sign of true faith, for when its \ncheerfulness enters and mixes in the hearts completely, nobody will be displeased with it. I asked you \nwhether he had ever broken his promise. You replied in the negative. And such are the apostles; they \nnever break their promises. When I asked you whether you fought with him and he fought with you, \nyou replied that he did, and that sometimes he was victorious and sometimes you. Indeed, such are the \napostles; they are put to trials and the final victory is always theirs. \nThen I asked you what he ordered you. You replied that he ordered you to worship Allah alone and \nnot to worship others along with Him, to leave all that your fore-fathers used to worship, to offer \nprayers, to speak the truth, to be chaste, to keep promises, and to return what is entrusted to you. \nThese are really the qualities of a prophet who, I knew (from the previous Scriptures) would appear, \nbut I did not know that he would be from amongst you. If what you say should be true, he will very \nsoon occupy the earth under my feet, and if I knew that I would reach him definitely, I would go \nimmediately to meet Him; and were I with him, then I would certainly wash his feet.' \" Abu Sufyan \nadded, \"Caesar then asked for the letter of Allah's Messenger (ﷺ) and it was read. Its contents were: \n\"In the name of Allah, the most Beneficent, the most Merciful (This letter is) from Muhammad, the \nslave of Allah, and His Apostle, to Heraculius, the Ruler of the Byzantine. Peace be upon the \nfollowers of guidance. Now then, I invite you to Islam (i.e. surrender to Allah), embrace Islam and \nyou will be safe; embrace Islam and Allah will bestow on you a double reward. But if you reject this \ninvitation of Islam, you shall be responsible for misguiding the tillers (i.e. your nation). O people of \nthe Scriptures! Come to a word common to you and us and you, that we worship. None but Allah, and \nthat we associate nothing in worship with Him; and that none of us shall take others as Lords besides \nAllah. Then if they turn away, say: Bear witness that we are (they who have surrendered (unto \nHim)..(3.64) \nAbu Sufyan added, \"When Heraclius had finished his speech, there was a great hue and cry caused by \nthe Byzantine Royalties surrounding him, and there was so much noise that I did not understand what \nthey said. So, we were turned out of the court. When I went out with my companions and we were \nalone, I said to them, 'Verily, Ibn Abi Kabsha's (i.e. the Prophet's) affair has gained power. This is the \nKing of Bani Al-Asfar fearing him.\" Abu Sufyan added, \"By Allah, I remained low and was sure that \nhis religion would be victorious till Allah converted me to Islam, though I disliked it.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى قَيْصَرَ يَدْعُوهُ إِلَى الإِسْلاَمِ، وَبَعَثَ بِكِتَابِهِ إِلَيْهِ مَعَ دِحْيَةَ الْكَلْبِيِّ، وَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَدْفَعَهُ إِلَى عَظِيمِ بُصْرَى لِيَدْفَعَهُ إِلَى قَيْصَرَ، وَكَانَ قَيْصَرُ لَمَّا كَشَفَ اللَّهُ عَنْهُ جُنُودَ فَارِسَ مَشَى مِنْ حِمْصَ إِلَى إِيلِيَاءَ، شُكْرًا لِمَا أَبْلاَهُ اللَّهُ، فَلَمَّا جَاءَ قَيْصَرَ كِتَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ قَرَأَهُ الْتَمِسُوا لِي هَا هُنَا أَحَدًا مِنْ قَوْمِهِ لأَسْأَلَهُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏   قَالَ ابْنُ عَبَّاسٍ فَأَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّهُ كَانَ بِالشَّأْمِ فِي رِجَالٍ مِنْ قُرَيْشٍ، قَدِمُوا تِجَارًا فِي الْمُدَّةِ الَّتِي كَانَتْ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كُفَّارِ قُرَيْشٍ، قَالَ أَبُو سُفْيَانَ فَوَجَدَنَا رَسُولُ قَيْصَرَ بِبَعْضِ الشَّأْمِ فَانْطَلَقَ بِي وَبِأَصْحَابِي حَتَّى قَدِمْنَا إِيلِيَاءَ، فَأُدْخِلْنَا عَلَيْهِ، فَإِذَا هُوَ جَالِسٌ فِي مَجْلِسِ مُلْكِهِ وَعَلَيْهِ التَّاجُ، وَإِذَا حَوْلَهُ عُظَمَاءُ الرُّومِ فَقَالَ لِتُرْجُمَانِهِ سَلْهُمْ أَيُّهُمْ أَقْرَبُ نَسَبًا إِلَى هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ قَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا‏.‏ قَالَ مَا قَرَابَةُ مَا بَيْنَكَ وَبَيْنَهُ فَقُلْتُ هُوَ ابْنُ عَمِّي، وَلَيْسَ فِي الرَّكْبِ يَوْمَئِذٍ أَحَدٌ مِنْ بَنِي عَبْدِ مَنَافٍ غَيْرِي‏.‏ فَقَالَ قَيْصَرُ أَدْنُوهُ‏.‏ وَأَمَرَ بِأَصْحَابِي فَجُعِلُوا خَلْفَ ظَهْرِي عِنْدَ كَتِفِي، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لأَصْحَابِهِ إِنِّي سَائِلٌ هَذَا الرَّجُلَ عَنِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ، فَإِنْ كَذَبَ فَكَذِّبُوهُ‏.‏ قَالَ أَبُو سُفْيَانَ وَاللَّهِ لَوْلاَ الْحَيَاءُ يَوْمَئِذٍ مِنْ أَنْ يَأْثُرَ أَصْحَابِي عَنِّي الْكَذِبَ لَكَذَبْتُهُ حِينَ سَأَلَنِي عَنْهُ، وَلَكِنِّي اسْتَحْيَيْتُ أَنْ يَأْثُرُوا الْكَذِبَ عَنِّي فَصَدَقْتُهُ، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لَهُ كَيْفَ نَسَبُ هَذَا الرَّجُلِ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ‏.‏ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ أَحَدٌ مِنْكُمْ قَبْلَهُ قُلْتُ لاَ‏.‏ فَقَالَ كُنْتُمْ تَتَّهِمُونَهُ عَلَى الْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لاَ‏.‏ قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ قُلْتُ بَلْ ضُعَفَاؤُهُمْ‏.‏ قَالَ فَيَزِيدُونَ أَوْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ‏.‏ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ يَغْدِرُ قُلْتُ لاَ، وَنَحْنُ الآنَ مِنْهُ فِي مُدَّةٍ، نَحْنُ نَخَافُ أَنْ يَغْدِرَ‏.‏ قَالَ أَبُو سُفْيَانَ وَلَمْ يُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا أَنْتَقِصُهُ بِهِ لاَ أَخَافُ أَنْ تُؤْثَرَ عَنِّي غَيْرُهَا‏.‏ قَالَ فَهَلْ قَاتَلْتُمُوهُ أَوْ قَاتَلَكُمْ قُلْتُ نَعَمْ‏.‏ قَالَ فَكَيْفَ كَانَتْ حَرْبُهُ وَحَرْبُكُمْ قُلْتُ كَانَتْ دُوَلاً وَسِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الأُخْرَى‏.‏ قَالَ فَمَاذَا يَأْمُرُكُمْ قَالَ يَأْمُرُنَا أَنْ نَعْبُدَ اللَّهَ وَحْدَهُ لاَ نُشْرِكُ بِهِ شَيْئًا، وَيَنْهَانَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا، وَيَأْمُرُنَا بِالصَّلاَةِ وَالصَّدَقَةِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ وَأَدَاءِ الأَمَانَةِ‏.‏ فَقَالَ لِتُرْجُمَانِهِ حِينَ قُلْتُ ذَلِكَ لَهُ قُلْ لَهُ إِنِّي سَأَلْتُكَ عَنْ نَسَبِهِ فِيكُمْ، فَزَعَمْتَ أَنَّهُ ذُو نَسَبٍ، وَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا، وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ قَبْلَهُ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ أَحَدٌ مِنْكُمْ قَالَ هَذَا الْقَوْلَ قَبْلَهُ قُلْتُ رَجُلٌ يَأْتَمُّ بِقَوْلٍ قَدْ قِيلَ قَبْلَهُ‏.‏ وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَزَعَمْتَ أَنْ لاَ، فَعَرَفْتُ أَنَّهُ لَمْ يَكُنْ لِيَدَعَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ، وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ مِنْ آبَائِهِ مَلِكٌ قُلْتُ يَطْلُبُ مُلْكَ آبَائِهِ‏.‏ وَسَأَلْتُكَ أَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَزَعَمْتَ أَنَّ ضُعَفَاءَهُمُ اتَّبَعُوهُ، وَهُمْ أَتْبَاعُ الرُّسُلِ، وَسَأَلْتُكَ هَلْ يَزِيدُونَ أَوْ يَنْقُصُونَ فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ، وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَزَعَمْتَ أَنْ لاَ، فَكَذَلِكَ الإِيمَانُ حِينَ تَخْلِطُ بَشَاشَتُهُ الْقُلُوبَ لاَ يَسْخَطُهُ أَحَدٌ، وَسَأَلْتُكَ هَلْ يَغْدِرُ فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الرُّسُلُ لاَ يَغْدِرُونَ‏.‏ وَسَأَلْتُكَ هَلْ قَاتَلْتُمُوهُ وَقَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَأَنَّ حَرْبَكُمْ وَحَرْبَهُ تَكُونُ دُوَلاً، وَيُدَالُ عَلَيْكُمُ الْمَرَّةَ وَتُدَالُونَ عَلَيْهِ الأُخْرَى، وَكَذَلِكَ الرُّسُلُ تُبْتَلَى، وَتَكُونُ لَهَا الْعَاقِبَةُ، وَسَأَلْتُكَ بِمَاذَا يَأْمُرُكُمْ فَزَعَمْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَيَنْهَاكُمْ عَمَّا كَانَ يَعْبُدُ آبَاؤُكُمْ، وَيَأْمُرُكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ، وَأَدَاءِ الأَمَانَةِ، قَالَ وَهَذِهِ صِفَةُ النَّبِيِّ، قَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، وَلَكِنْ لَمْ أَظُنَّ أَنَّهُ مِنْكُمْ، وَإِنْ يَكُ مَا قُلْتَ حَقًّا، فَيُوشِكُ أَنْ يَمْلِكَ مَوْضِعَ قَدَمَىَّ هَاتَيْنِ، وَلَوْ أَرْجُو أَنْ أَخْلُصَ إِلَيْهِ لَتَجَشَّمْتُ لُقِيَّهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ قَدَمَيْهِ‏.‏ قَالَ أَبُو سُفْيَانَ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُرِئَ فَإِذَا فِيهِ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ، إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، سَلاَمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، وَأَسْلِمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَعَلَيْكَ إِثْمُ الأَرِيسِيِّينَ وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلاَّ اللَّهَ وَلاَ نُشْرِكَ بِهِ شَيْئًا وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏‏\"‏‏.‏ قَالَ أَبُو سُفْيَانَ فَلَمَّا أَنْ قَضَى مَقَالَتَهُ، عَلَتْ أَصْوَاتُ الَّذِينَ حَوْلَهُ مِنْ عُظَمَاءِ الرُّومِ، وَكَثُرَ لَغَطُهُمْ، فَلاَ أَدْرِي مَاذَا قَالُوا، وَأُمِرَ بِنَا فَأُخْرِجْنَا، فَلَمَّا أَنْ خَرَجْتُ مَعَ أَصْحَابِي وَخَلَوْتُ بِهِمْ قُلْتُ لَهُمْ لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، هَذَا مَلِكُ بَنِي الأَصْفَرِ يَخَافُهُ، قَالَ أَبُو سُفْيَانَ وَاللَّهِ مَا زِلْتُ ذَلِيلاً مُسْتَيْقِنًا بِأَنَّ أَمْرَهُ سَيَظْهَرُ، حَتَّى أَدْخَلَ اللَّهُ قَلْبِي الإِسْلاَمَ وَأَنَا كَارِهٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2940, 2941In-book reference : Book 56, Hadith 153USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 191   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2941,
    "id": 2941,
    "url": "https://sunnah.com/bukhari:2941",
    "bookNumber": 56,
    "hadithNumber": 153,
    "narrator": "Narrated `Abdullah bin `Abbas:",
    "english": "Allah's Messenger (ﷺ) wrote to Caesar and invited him to Islam and sent him his letter with Dihya Al-Kalbi \nwhom Allah's Messenger (ﷺ) ordered to hand it over to the Governor of Busra who would forward it to \nCaesar. Caesar as a sign of gratitude to Allah, had walked from Hims to Ilya (i.e. Jerusalem) when \nAllah had granted Him victory over the Persian forces. So, when the letter of Allah's Messenger (ﷺ) reached \nCaesar, he said after reading it, 'Seek for me any one of his people! (Arabs of Quraish tribe) if present \nhere, in order to ask him about Allah's Messenger (ﷺ). At that time Abu Sufyan bin Harb was in Sham with \nsome men from Quraish who had come (to Sham) as merchants during the truce that had been \nconcluded between Allah's Messenger (ﷺ); and the infidels of Quraish. \nAbu Sufyan said, Caesar's messenger found us somewhere in Sham so he took me and my \ncompanions to Ilya and we were admitted into Ceasar's court to find him sitting in his royal court \nwearing a crown and surrounded by the senior dignitaries of the Byzantine. He said to his translator. \n'Ask them who amongst them is a close relation to the man who claims to be a prophet.\" Abu Sufyan \nadded, \"I replied, 'I am the nearest relative to him.' He asked, 'What degree of relationship do you have \nwith him?' I replied, 'He is my cousin,' and there was none of Bani Abu Manaf in the caravan except \nmyself. Caesar said, 'Let him come nearer.' He then ordered that my companions stand behind me near \nmy shoulder and said to his translator, 'Tell his companions that I am going to ask this man about the \nman who claims to be a prophet. If he tells a lie, they should contradict him immediately.\" Abu \nSufyan added, \"By Allah! Had it not been shameful that my companions label me a liar, I would not \nhave spoken the truth about him when he asked me. But I considered it shameful to be called a liar by \nmy companions. So I told the truth. \nHe then said to his translator, 'Ask him what kind of family does he belong to.' I replied, 'He belongs \nto a noble family amongst us.' He said, 'Have anybody else amongst you ever claimed the same before \nhim? 'I replied, 'No.' He said, 'Had you ever blamed him for telling lies before he claimed what he \nclaimed? ' I replied, 'No.' He said, 'Was anybody amongst his ancestors a king?' I replied, 'No.' He \nsaid, \"Do the noble or the poor follow him?' I replied, 'It is the poor who follow him.' He said, 'Are \nthey increasing or decreasing (day by day)?' I replied,' They are increasing.' He said, 'Does anybody \namongst those who embrace his (the Prophet's) Religion become displeased and then discard his \nReligion?'. I replied, 'No. ' He said, 'Does he break his promises? I replied, 'No, but we are now at \ntruce with him and we are afraid that he may betray us.\" Abu Sufyan added, \"Other than the last \nsentence, I could not say anything against him. Caesar then asked, 'Have you ever had a war with \nhim?' I replied, 'Yes.' He said, 'What was the outcome of your battles with him?' I replied, 'The result \nwas unstable; sometimes he was victorious and sometimes we.' He said, 'What does he order you to \ndo?' I said, 'He tells us to worship Allah alone, and not to worship others along with Him, and to leave \nall that our fore-fathers used to worship. He orders us to pray, give in charity, be chaste, keep \npromises and return what is entrusted to us.' \nWhen I had said that, Caesar said to his translator, 'Say to him: I ask you about his lineage and your \nreply was that he belonged to a noble family. In fact, all the apostles came from the noblest lineage of \ntheir nations. Then I questioned you whether anybody else amongst you had claimed such a thing, and \nyour reply was in the negative. If the answer had been in the affirmative, I would have thought that \nthis man was following a claim that had been said before him. When I asked you whether he was ever \nblamed for telling lies, your reply was in the negative, so I took it for granted that a person who did \nnot tell a lie about (others) the people could never tell a lie about Allah. Then I asked you whether any \nof his ancestors was a king. Your reply was in the negative, and if it had been in the affirmative, I \nwould have thought that this man wanted to take back his ancestral kingdom. When I asked you \nwhether the rich or the poor people followed him, you replied that it was the poor who followed him. \nIn fact, such are the followers of the apostles. Then I asked you whether his followers were increasing \nor decreasing. You replied that they were increasing. In fact, this is the result of true faith till it is \ncomplete (in all respects). \nI asked you whether there was anybody who, after embracing his religion, became displeased and \ndiscarded his religion; your reply was in the negative. In fact, this is the sign of true faith, for when its \ncheerfulness enters and mixes in the hearts completely, nobody will be displeased with it. I asked you \nwhether he had ever broken his promise. You replied in the negative. And such are the apostles; they \nnever break their promises. When I asked you whether you fought with him and he fought with you, \nyou replied that he did, and that sometimes he was victorious and sometimes you. Indeed, such are the \napostles; they are put to trials and the final victory is always theirs. \nThen I asked you what he ordered you. You replied that he ordered you to worship Allah alone and \nnot to worship others along with Him, to leave all that your fore-fathers used to worship, to offer \nprayers, to speak the truth, to be chaste, to keep promises, and to return what is entrusted to you. \nThese are really the qualities of a prophet who, I knew (from the previous Scriptures) would appear, \nbut I did not know that he would be from amongst you. If what you say should be true, he will very \nsoon occupy the earth under my feet, and if I knew that I would reach him definitely, I would go \nimmediately to meet Him; and were I with him, then I would certainly wash his feet.' \" Abu Sufyan \nadded, \"Caesar then asked for the letter of Allah's Messenger (ﷺ) and it was read. Its contents were: \n\"In the name of Allah, the most Beneficent, the most Merciful (This letter is) from Muhammad, the \nslave of Allah, and His Apostle, to Heraculius, the Ruler of the Byzantine. Peace be upon the \nfollowers of guidance. Now then, I invite you to Islam (i.e. surrender to Allah), embrace Islam and \nyou will be safe; embrace Islam and Allah will bestow on you a double reward. But if you reject this \ninvitation of Islam, you shall be responsible for misguiding the tillers (i.e. your nation). O people of \nthe Scriptures! Come to a word common to you and us and you, that we worship. None but Allah, and \nthat we associate nothing in worship with Him; and that none of us shall take others as Lords besides \nAllah. Then if they turn away, say: Bear witness that we are (they who have surrendered (unto \nHim)..(3.64) \nAbu Sufyan added, \"When Heraclius had finished his speech, there was a great hue and cry caused by \nthe Byzantine Royalties surrounding him, and there was so much noise that I did not understand what \nthey said. So, we were turned out of the court. When I went out with my companions and we were \nalone, I said to them, 'Verily, Ibn Abi Kabsha's (i.e. the Prophet's) affair has gained power. This is the \nKing of Bani Al-Asfar fearing him.\" Abu Sufyan added, \"By Allah, I remained low and was sure that \nhis religion would be victorious till Allah converted me to Islam, though I disliked it.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى قَيْصَرَ يَدْعُوهُ إِلَى الإِسْلاَمِ، وَبَعَثَ بِكِتَابِهِ إِلَيْهِ مَعَ دِحْيَةَ الْكَلْبِيِّ، وَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَدْفَعَهُ إِلَى عَظِيمِ بُصْرَى لِيَدْفَعَهُ إِلَى قَيْصَرَ، وَكَانَ قَيْصَرُ لَمَّا كَشَفَ اللَّهُ عَنْهُ جُنُودَ فَارِسَ مَشَى مِنْ حِمْصَ إِلَى إِيلِيَاءَ، شُكْرًا لِمَا أَبْلاَهُ اللَّهُ، فَلَمَّا جَاءَ قَيْصَرَ كِتَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ قَرَأَهُ الْتَمِسُوا لِي هَا هُنَا أَحَدًا مِنْ قَوْمِهِ لأَسْأَلَهُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏   قَالَ ابْنُ عَبَّاسٍ فَأَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّهُ كَانَ بِالشَّأْمِ فِي رِجَالٍ مِنْ قُرَيْشٍ، قَدِمُوا تِجَارًا فِي الْمُدَّةِ الَّتِي كَانَتْ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كُفَّارِ قُرَيْشٍ، قَالَ أَبُو سُفْيَانَ فَوَجَدَنَا رَسُولُ قَيْصَرَ بِبَعْضِ الشَّأْمِ فَانْطَلَقَ بِي وَبِأَصْحَابِي حَتَّى قَدِمْنَا إِيلِيَاءَ، فَأُدْخِلْنَا عَلَيْهِ، فَإِذَا هُوَ جَالِسٌ فِي مَجْلِسِ مُلْكِهِ وَعَلَيْهِ التَّاجُ، وَإِذَا حَوْلَهُ عُظَمَاءُ الرُّومِ فَقَالَ لِتُرْجُمَانِهِ سَلْهُمْ أَيُّهُمْ أَقْرَبُ نَسَبًا إِلَى هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ قَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا‏.‏ قَالَ مَا قَرَابَةُ مَا بَيْنَكَ وَبَيْنَهُ فَقُلْتُ هُوَ ابْنُ عَمِّي، وَلَيْسَ فِي الرَّكْبِ يَوْمَئِذٍ أَحَدٌ مِنْ بَنِي عَبْدِ مَنَافٍ غَيْرِي‏.‏ فَقَالَ قَيْصَرُ أَدْنُوهُ‏.‏ وَأَمَرَ بِأَصْحَابِي فَجُعِلُوا خَلْفَ ظَهْرِي عِنْدَ كَتِفِي، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لأَصْحَابِهِ إِنِّي سَائِلٌ هَذَا الرَّجُلَ عَنِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ، فَإِنْ كَذَبَ فَكَذِّبُوهُ‏.‏ قَالَ أَبُو سُفْيَانَ وَاللَّهِ لَوْلاَ الْحَيَاءُ يَوْمَئِذٍ مِنْ أَنْ يَأْثُرَ أَصْحَابِي عَنِّي الْكَذِبَ لَكَذَبْتُهُ حِينَ سَأَلَنِي عَنْهُ، وَلَكِنِّي اسْتَحْيَيْتُ أَنْ يَأْثُرُوا الْكَذِبَ عَنِّي فَصَدَقْتُهُ، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لَهُ كَيْفَ نَسَبُ هَذَا الرَّجُلِ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ‏.‏ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ أَحَدٌ مِنْكُمْ قَبْلَهُ قُلْتُ لاَ‏.‏ فَقَالَ كُنْتُمْ تَتَّهِمُونَهُ عَلَى الْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لاَ‏.‏ قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ قُلْتُ بَلْ ضُعَفَاؤُهُمْ‏.‏ قَالَ فَيَزِيدُونَ أَوْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ‏.‏ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ يَغْدِرُ قُلْتُ لاَ، وَنَحْنُ الآنَ مِنْهُ فِي مُدَّةٍ، نَحْنُ نَخَافُ أَنْ يَغْدِرَ‏.‏ قَالَ أَبُو سُفْيَانَ وَلَمْ يُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا أَنْتَقِصُهُ بِهِ لاَ أَخَافُ أَنْ تُؤْثَرَ عَنِّي غَيْرُهَا‏.‏ قَالَ فَهَلْ قَاتَلْتُمُوهُ أَوْ قَاتَلَكُمْ قُلْتُ نَعَمْ‏.‏ قَالَ فَكَيْفَ كَانَتْ حَرْبُهُ وَحَرْبُكُمْ قُلْتُ كَانَتْ دُوَلاً وَسِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الأُخْرَى‏.‏ قَالَ فَمَاذَا يَأْمُرُكُمْ قَالَ يَأْمُرُنَا أَنْ نَعْبُدَ اللَّهَ وَحْدَهُ لاَ نُشْرِكُ بِهِ شَيْئًا، وَيَنْهَانَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا، وَيَأْمُرُنَا بِالصَّلاَةِ وَالصَّدَقَةِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ وَأَدَاءِ الأَمَانَةِ‏.‏ فَقَالَ لِتُرْجُمَانِهِ حِينَ قُلْتُ ذَلِكَ لَهُ قُلْ لَهُ إِنِّي سَأَلْتُكَ عَنْ نَسَبِهِ فِيكُمْ، فَزَعَمْتَ أَنَّهُ ذُو نَسَبٍ، وَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا، وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ قَبْلَهُ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ أَحَدٌ مِنْكُمْ قَالَ هَذَا الْقَوْلَ قَبْلَهُ قُلْتُ رَجُلٌ يَأْتَمُّ بِقَوْلٍ قَدْ قِيلَ قَبْلَهُ‏.‏ وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَزَعَمْتَ أَنْ لاَ، فَعَرَفْتُ أَنَّهُ لَمْ يَكُنْ لِيَدَعَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ، وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ مِنْ آبَائِهِ مَلِكٌ قُلْتُ يَطْلُبُ مُلْكَ آبَائِهِ‏.‏ وَسَأَلْتُكَ أَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَزَعَمْتَ أَنَّ ضُعَفَاءَهُمُ اتَّبَعُوهُ، وَهُمْ أَتْبَاعُ الرُّسُلِ، وَسَأَلْتُكَ هَلْ يَزِيدُونَ أَوْ يَنْقُصُونَ فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ، وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَزَعَمْتَ أَنْ لاَ، فَكَذَلِكَ الإِيمَانُ حِينَ تَخْلِطُ بَشَاشَتُهُ الْقُلُوبَ لاَ يَسْخَطُهُ أَحَدٌ، وَسَأَلْتُكَ هَلْ يَغْدِرُ فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الرُّسُلُ لاَ يَغْدِرُونَ‏.‏ وَسَأَلْتُكَ هَلْ قَاتَلْتُمُوهُ وَقَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَأَنَّ حَرْبَكُمْ وَحَرْبَهُ تَكُونُ دُوَلاً، وَيُدَالُ عَلَيْكُمُ الْمَرَّةَ وَتُدَالُونَ عَلَيْهِ الأُخْرَى، وَكَذَلِكَ الرُّسُلُ تُبْتَلَى، وَتَكُونُ لَهَا الْعَاقِبَةُ، وَسَأَلْتُكَ بِمَاذَا يَأْمُرُكُمْ فَزَعَمْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَيَنْهَاكُمْ عَمَّا كَانَ يَعْبُدُ آبَاؤُكُمْ، وَيَأْمُرُكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ، وَأَدَاءِ الأَمَانَةِ، قَالَ وَهَذِهِ صِفَةُ النَّبِيِّ، قَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، وَلَكِنْ لَمْ أَظُنَّ أَنَّهُ مِنْكُمْ، وَإِنْ يَكُ مَا قُلْتَ حَقًّا، فَيُوشِكُ أَنْ يَمْلِكَ مَوْضِعَ قَدَمَىَّ هَاتَيْنِ، وَلَوْ أَرْجُو أَنْ أَخْلُصَ إِلَيْهِ لَتَجَشَّمْتُ لُقِيَّهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ قَدَمَيْهِ‏.‏ قَالَ أَبُو سُفْيَانَ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُرِئَ فَإِذَا فِيهِ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ، إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، سَلاَمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، وَأَسْلِمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَعَلَيْكَ إِثْمُ الأَرِيسِيِّينَ وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلاَّ اللَّهَ وَلاَ نُشْرِكَ بِهِ شَيْئًا وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏‏\"‏‏.‏ قَالَ أَبُو سُفْيَانَ فَلَمَّا أَنْ قَضَى مَقَالَتَهُ، عَلَتْ أَصْوَاتُ الَّذِينَ حَوْلَهُ مِنْ عُظَمَاءِ الرُّومِ، وَكَثُرَ لَغَطُهُمْ، فَلاَ أَدْرِي مَاذَا قَالُوا، وَأُمِرَ بِنَا فَأُخْرِجْنَا، فَلَمَّا أَنْ خَرَجْتُ مَعَ أَصْحَابِي وَخَلَوْتُ بِهِمْ قُلْتُ لَهُمْ لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، هَذَا مَلِكُ بَنِي الأَصْفَرِ يَخَافُهُ، قَالَ أَبُو سُفْيَانَ وَاللَّهِ مَا زِلْتُ ذَلِيلاً مُسْتَيْقِنًا بِأَنَّ أَمْرَهُ سَيَظْهَرُ، حَتَّى أَدْخَلَ اللَّهُ قَلْبِي الإِسْلاَمَ وَأَنَا كَارِهٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2940, 2941In-book reference : Book 56, Hadith 153USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 191   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2942,
    "id": 2942,
    "url": "https://sunnah.com/bukhari:2942",
    "bookNumber": 56,
    "hadithNumber": 154,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "That he heard the Prophet (ﷺ) on the day (of the battle) of Khaibar saying, \"I will give the flag to a person \nat whose hands Allah will grant victory.\" So, the companions of the Prophet (ﷺ) got up, wishing eagerly \nto see to whom the flag will be given, and everyone of them wished to be given the flag. But the \nProphet asked for `Ali. Someone informed him that he was suffering from eye-trouble. So, he ordered \nthem to bring `Ali in front of him. Then the Prophet (ﷺ) spat in his eyes and his eyes were cured \nimmediately as if he had never any eye-trouble. `Ali said, \"We will fight with them (i.e. infidels) till \nthey become like us (i.e. Muslims).\" The Prophet (ﷺ) said, \"Be patient, till you face them and invite them \nto Islam and inform them of what Allah has enjoined upon them. By Allah! If a single person \nembraces Islam at your hands (i.e. through you), that will be better for you than the red camels.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْد ٍ ـ رضى الله عنه ـ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ يَوْمَ خَيْبَرَ ‏\"‏ لأُعْطِيَنَّ الرَّايَةَ رَجُلاً يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ ‏\"‏‏.‏ فَقَامُوا يَرْجُونَ لِذَلِكَ أَيُّهُمْ يُعْطَى، فَغَدَوْا وَكُلُّهُمْ يَرْجُو أَنْ يُعْطَى فَقَالَ ‏\"‏ أَيْنَ عَلِيٌّ ‏\"‏‏.‏ فَقِيلَ يَشْتَكِي عَيْنَيْهِ، فَأَمَرَ فَدُعِيَ لَهُ، فَبَصَقَ فِي عَيْنَيْهِ، فَبَرَأَ مَكَانَهُ حَتَّى كَأَنَّهُ لَمْ يَكُنْ بِهِ شَىْءٌ فَقَالَ نُقَاتِلُهُمْ حَتَّى يَكُونُوا مِثْلَنَا‏.‏ فَقَالَ ‏\"‏ عَلَى رِسْلِكَ حَتَّى تَنْزِلَ بِسَاحَتِهِمْ، ثُمَّ ادْعُهُمْ إِلَى الإِسْلاَمِ، وَأَخْبِرْهُمْ بِمَا يَجِبُ عَلَيْهِمْ، فَوَاللَّهِ لأَنْ يُهْدَى بِكَ رَجُلٌ وَاحِدٌ خَيْرٌ لَكَ مِنْ حُمْرِ النَّعَمِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2942In-book reference : Book 56, Hadith 154USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 192   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2943,
    "id": 2943,
    "url": "https://sunnah.com/bukhari:2943",
    "bookNumber": 56,
    "hadithNumber": 155,
    "narrator": "Narrated Anas:",
    "english": "Whenever Allah's Messenger (ﷺ) attacked some people, he would never attack them till it was dawn. If he \nheard the Adhan (i.e. call for prayer) he would delay the fight, and if he did not hear the Adhan, he \nwould attack them immediately after dawn. We reached Khaibar at night.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا غَزَا قَوْمًا لَمْ يُغِرْ حَتَّى يُصْبِحَ، فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ، وَإِنْ لَمْ يَسْمَعْ أَذَانًا أَغَارَ بَعْدَ مَا يُصْبِحُ، فَنَزَلْنَا خَيْبَرَ لَيْلاً‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2943In-book reference : Book 56, Hadith 155USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 193   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2944,
    "id": 2944,
    "url": "https://sunnah.com/bukhari:2944",
    "bookNumber": 56,
    "hadithNumber": 156,
    "narrator": "Narrated Anas:",
    "english": "as Hadith No. 193 above.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا غَزَا بِنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2944In-book reference : Book 56, Hadith 156USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 194   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2945,
    "id": 2945,
    "url": "https://sunnah.com/bukhari:2945",
    "bookNumber": 56,
    "hadithNumber": 157,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) set out for Khaibar and reached it at night. He used not to attack if he reached the people \nat night, till the day broke. So, when the day dawned, the Jews came out with their bags and spades. \nWhen they saw the Prophet; they said, \"Muhammad and his army!\" The Prophet (ﷺ) said, Allahu--Akbar! \n(Allah is Greater) and Khaibar is ruined, for whenever we approach a nation (i.e. enemy to fight) then \nit will be a miserable morning for those who have been warned.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى خَيْبَرَ فَجَاءَهَا لَيْلاً، وَكَانَ إِذَا جَاءَ قَوْمًا بِلَيْلٍ لاَ يُغِيرُ عَلَيْهِمْ حَتَّى يُصْبِحَ، فَلَمَّا أَصْبَحَ، خَرَجَتْ يَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ، فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ، مُحَمَّدٌ وَالْخَمِيسُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اللَّهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2945In-book reference : Book 56, Hadith 157USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 195   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2946,
    "id": 2946,
    "url": "https://sunnah.com/bukhari:2946",
    "bookNumber": 56,
    "hadithNumber": 158,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah 's Apostle said, \" I have been ordered to fight with the people till they say, 'None has the right to \nbe worshipped but Allah,' and whoever says, 'None has the right to be worshipped but Allah,' his life \nand property will be saved by me except for Islamic law, and his accounts will be with Allah, (either \nto punish him or to forgive him.)\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، فَقَدْ عَصَمَ مِنِّي نَفْسَهُ وَمَالَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏ رَوَاهُ عُمَرُ وَابْنُ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2946In-book reference : Book 56, Hadith 158USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 196   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2947,
    "id": 2947,
    "url": "https://sunnah.com/bukhari:2947",
    "bookNumber": 56,
    "hadithNumber": 159,
    "narrator": "Narrated Ka`b bin Malik:",
    "english": "Whenever Allah's Messenger (ﷺ) intended to lead a Ghazwa, he would use an equivocation from which one \nwould understand that he was going to a different destination .",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ ـ رضى الله عنه ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ غَزْوَةً إِلاَّ وَرَّى بِغَيْرِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2947In-book reference : Book 56, Hadith 159USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 197   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2948,
    "id": 2948,
    "url": "https://sunnah.com/bukhari:2948",
    "bookNumber": 56,
    "hadithNumber": 160,
    "narrator": "Narrated Ka`b bin Malik:",
    "english": "Whenever Allah's Messenger (ﷺ) intended to carry out a Ghazwa, he would use an equivocation to conceal \nhis real destination till it was the Ghazwa of Tabuk which Allah's Messenger (ﷺ) carried out in very hot \nweather. As he was going to face a very long journey through a wasteland and was to meet and attack \na large number of enemies. So, he made the situation clear to the Muslims so that they might prepare \nthemselves accordingly and get ready to conquer their enemy. The Prophet (ﷺ) informed them of the \ndestination he was heading for.",
    "arabic": "وَحَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَلَّمَا يُرِيدُ غَزْوَةً يَغْزُوهَا إِلاَّ وَرَّى بِغَيْرِهَا، حَتَّى كَانَتْ غَزْوَةُ تَبُوكَ، فَغَزَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَرٍّ شَدِيدٍ، وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا، وَاسْتَقْبَلَ غَزْوَ عَدُوٍّ كَثِيرٍ، فَجَلَّى لِلْمُسْلِمِينَ أَمْرَهُمْ، لِيَتَأَهَّبُوا أُهْبَةَ عَدُوِّهِمْ، وَأَخْبَرَهُمْ بِوَجْهِهِ الَّذِي يُرِيدُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2948In-book reference : Book 56, Hadith 160USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 198   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2949,
    "id": 2949,
    "url": "https://sunnah.com/bukhari:2949",
    "bookNumber": 56,
    "hadithNumber": 161,
    "narrator": "Ka`b bin Malik used to say:",
    "english": "\"Scarcely did Allah's Messenger (ﷺ) set out for a journey on a day other than Thursday.\"",
    "arabic": "وَعَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ كَانَ يَقُولُ لَقَلَّمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْرُجُ إِذَا خَرَجَ فِي سَفَرٍ إِلاَّ يَوْمَ الْخَمِيسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2949In-book reference : Book 56, Hadith 161USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 198   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2950,
    "id": 2950,
    "url": "https://sunnah.com/bukhari:2950",
    "bookNumber": 56,
    "hadithNumber": 162,
    "narrator": "Narrated Ka`b bin Malik:",
    "english": "The Prophet (ﷺ) set out on Thursday for the Ghazwa of Tabuk and he used to prefer to set out (i.e. travel) \non Thursdays.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْخَمِيسِ فِي غَزْوَةِ تَبُوكَ، وَكَانَ يُحِبُّ أَنْ يَخْرُجَ يَوْمَ الْخَمِيسِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2950In-book reference : Book 56, Hadith 162USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 199   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2951,
    "id": 2951,
    "url": "https://sunnah.com/bukhari:2951",
    "bookNumber": 56,
    "hadithNumber": 163,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) offered a four-rak`at Zuhr prayer at Medina and then offered a two rak`at `Asr prayer at \nDhul-Hulaifa and I heard the companions of the Prophet (ﷺ) reciting Talbiya aloud (for Hajj and `Umra) \naltogether.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِالْمَدِينَةِ الظُّهْرَ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، وَسَمِعْتُهُمْ يَصْرُخُونَ بِهِمَا جَمِيعًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2951In-book reference : Book 56, Hadith 163USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 200   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2952,
    "id": 2952,
    "url": "https://sunnah.com/bukhari:2952",
    "bookNumber": 56,
    "hadithNumber": 164,
    "narrator": "Narrated `Aisha:",
    "english": "We set out in the company of Allah's Messenger (ﷺ) five days before the end of Dhul Qa'da intending to \nperform Hajj only. When we approached Mecca Allah's Messenger (ﷺ) ordered those who did not have the \nHadi (i.e. an animal for sacrifice) with them, to perform the Tawaf around the Ka`ba, and between \nSafa and Marwa and then finish their Ihram. Beef was brought to us on the day of (i.e. the days of \nslaughtering) and I asked, \"What is this?\" Somebody said, Allah's Messenger (ﷺ) has slaughtered (a cow) on \nbehalf of his wives.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا سَمِعَتْ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِخَمْسِ لَيَالٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، وَلاَ نُرَى إِلاَّ الْحَجَّ، فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ إِذَا طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَنْ يَحِلَّ‏.‏ قَالَتْ عَائِشَةُ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقَالَ نَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ‏.‏ قَالَ يَحْيَى فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ فَقَالَ أَتَتْكَ وَاللَّهِ بِالْحَدِيثِ عَلَى وَجْهِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2952In-book reference : Book 56, Hadith 164USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 201   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2953,
    "id": 2953,
    "url": "https://sunnah.com/bukhari:2953",
    "bookNumber": 56,
    "hadithNumber": 165,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Once the Prophet (ﷺ) set out in the month of Ramadan. He observed fasting till he reached a place called \nKadid where he broke his fast.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي رَمَضَانَ، فَصَامَ حَتَّى بَلَغَ الْكَدِيدَ أَفْطَرَ‏.‏ قَالَ سُفْيَانُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنِ ابْنِ عَبَّاسٍ‏.‏ وَسَاقَ الْحَدِيثَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2953In-book reference : Book 56, Hadith 165USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2954,
    "id": 2954,
    "url": "https://sunnah.com/bukhari:2954",
    "bookNumber": 56,
    "hadithNumber": 166,
    "narrator": "Narrated Abu Hurairah (ra):",
    "english": "Allah's Messenger (ﷺ) sent us on military expedition telling us, \"If you find such and such persons (he named two men from Quraish), burn them fire.\" Then we came to bid him farewell, when we wanted to set out, he said: \"Previously I ordered you to burn so-and-so and so-and-so with fire, but as punishment with fire is done by none except Allah, if you capture them, kill them, (instead).\"",
    "arabic": "وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْثٍ، وَقَالَ لَنَا ‏\"‏ إِنْ لَقِيتُمْ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ ـ لِرَجُلَيْنِ مِنْ قُرَيْشٍ سَمَّاهُمَا ـ فَحَرِّقُوهُمَا بِالنَّارِ‏.‏ قَالَ ثُمَّ أَتَيْنَاهُ نُوَدِّعُهُ حِينَ أَرَدْنَا الْخُرُوجَ فَقَالَ ‏\"‏ إِنِّي كُنْتُ أَمَرْتُكُمْ أَنْ تُحَرِّقُوا فُلاَنًا وَفُلاَنًا بِالنَّارِ، وَإِنَّ النَّارَ لاَ يُعَذِّبُ بِهَا إِلاَّ اللَّهُ، فَإِنْ أَخَذْتُمُوهُمَا فَاقْتُلُوهُمَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2954In-book reference : Book 56, Hadith 166USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 202   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2955,
    "id": 2955,
    "url": "https://sunnah.com/bukhari:2955",
    "bookNumber": 56,
    "hadithNumber": 167,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The 'Prophet said, \"It is obligatory for one to listen to and obey (the ruler's orders) unless these orders \ninvolve one disobedience (to Allah); but if an act of disobedience (to Allah) is imposed, he should not \nlisten to or obey it.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّمْعُ وَالطَّاعَةُ حَقٌّ، مَا لَمْ يُؤْمَرْ بِالْمَعْصِيَةِ، فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلاَ سَمْعَ وَلاَ طَاعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2955In-book reference : Book 56, Hadith 167USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 203   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2956,
    "id": 2956,
    "url": "https://sunnah.com/bukhari:2956",
    "bookNumber": 56,
    "hadithNumber": 168,
    "narrator": "Narrated Abu Huraira:",
    "english": "That heard Allah's Messenger (ﷺ) saying, \"We are the last but will be the foremost to enter Paradise).\" The \nProphet added, \"He who obeys me, obeys Allah, and he who disobeys me, disobeys Allah. He who \nobeys the chief, obeys me, and he who disobeys the chief, disobeys me. The Imam is like a shelter for \nwhose safety the Muslims should fight and where they should seek protection. If the Imam orders \npeople with righteousness and rules justly, then he will be rewarded for that, and if he does the \nopposite, he will be responsible for that.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏.‏   وَبِهَذَا الإِسْنَادِ ‏\"‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ، وَمَنْ يُطِعِ الأَمِيرَ فَقَدْ أَطَاعَنِي، وَمَنْ يَعْصِ الأَمِيرَ فَقَدْ عَصَانِي، وَإِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ، فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ، فَإِنَّ لَهُ بِذَلِكَ أَجْرًا، وَإِنْ قَالَ بِغَيْرِهِ، فَإِنَّ عَلَيْهِ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2956, 2957In-book reference : Book 56, Hadith 168USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 204   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2957,
    "id": 2957,
    "url": "https://sunnah.com/bukhari:2957",
    "bookNumber": 56,
    "hadithNumber": 168,
    "narrator": "Narrated Abu Huraira:",
    "english": "That heard Allah's Messenger (ﷺ) saying, \"We are the last but will be the foremost to enter Paradise).\" The \nProphet added, \"He who obeys me, obeys Allah, and he who disobeys me, disobeys Allah. He who \nobeys the chief, obeys me, and he who disobeys the chief, disobeys me. The Imam is like a shelter for \nwhose safety the Muslims should fight and where they should seek protection. If the Imam orders \npeople with righteousness and rules justly, then he will be rewarded for that, and if he does the \nopposite, he will be responsible for that.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏.‏   وَبِهَذَا الإِسْنَادِ ‏\"‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ، وَمَنْ يُطِعِ الأَمِيرَ فَقَدْ أَطَاعَنِي، وَمَنْ يَعْصِ الأَمِيرَ فَقَدْ عَصَانِي، وَإِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ، فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ، فَإِنَّ لَهُ بِذَلِكَ أَجْرًا، وَإِنْ قَالَ بِغَيْرِهِ، فَإِنَّ عَلَيْهِ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2956, 2957In-book reference : Book 56, Hadith 168USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 204   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2958,
    "id": 2958,
    "url": "https://sunnah.com/bukhari:2958",
    "bookNumber": 56,
    "hadithNumber": 169,
    "narrator": "Narrated Ibn `Umar:",
    "english": "When we reached (Hudaibiya) in the next year (of the treaty of Hudaibiya), not even two men \namongst us agreed unanimously as to which was the tree under which we had given the pledge of \nallegiance, and that was out of Allah's Mercy. (The sub narrator asked Naf'i, \"For what did the Prophet (ﷺ) \ntake their pledge of allegiance, was it for death?\" Naf'i replied \"No, but he took their pledge of \nallegiance for patience.\")",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، قَالَ قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ رَجَعْنَا مِنَ الْعَامِ الْمُقْبِلِ فَمَا اجْتَمَعَ مِنَّا اثْنَانِ عَلَى الشَّجَرَةِ الَّتِي بَايَعْنَا تَحْتَهَا، كَانَتْ رَحْمَةً مِنَ اللَّهِ‏.‏ فَسَأَلْتُ نَافِعًا عَلَى أَىِّ شَىْءٍ بَايَعَهُمْ عَلَى الْمَوْتِ قَالَ لاَ، بَايَعَهُمْ عَلَى الصَّبْرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2958In-book reference : Book 56, Hadith 169USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 205   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2959,
    "id": 2959,
    "url": "https://sunnah.com/bukhari:2959",
    "bookNumber": 56,
    "hadithNumber": 170,
    "narrator": "Narrated `Abdullah bin Zaid:",
    "english": "that in the time (of the battle) of Al-Harra a person came to him and said, \"Ibn Hanzala is taking the \npledge of allegiance from the people for death.\" He said, \"I will never give a pledge of allegiance for \nsuch a thing to anyone after Allah's Messenger (ﷺ).\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ زَمَنَ الْحَرَّةِ أَتَاهُ آتٍ فَقَالَ لَهُ إِنَّ ابْنَ حَنْظَلَةَ يُبَايِعُ النَّاسَ عَلَى الْمَوْتِ‏.‏ فَقَالَ لاَ أُبَايِعُ عَلَى هَذَا أَحَدًا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2959In-book reference : Book 56, Hadith 170USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 206   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2960,
    "id": 2960,
    "url": "https://sunnah.com/bukhari:2960",
    "bookNumber": 56,
    "hadithNumber": 171,
    "narrator": "Narrated Yazid bin Ubaid:",
    "english": "Salama said, \"I gave the Pledge of allegiance (Al-Ridwan) to Allah's Messenger (ﷺ) and then I moved to the \nshade of a tree. When the number of people around the Prophet (ﷺ) diminished, he said, 'O Ibn Al-Akwa` \n! Will you not give to me the pledge of Allegiance?' I replied, 'O Allah's Messenger (ﷺ)! I have already given \nto you the pledge of Allegiance.' He said, 'Do it again.' So I gave the pledge of allegiance for the \nsecond time.\" I asked 'O Abu Muslim! For what did you give he pledge of Allegiance on that day?\" \nHe replied, \"We gave the pledge of Allegiance for death.\"",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ ـ رضى الله عنه ـ قَالَ بَايَعْتُ النَّبِيَّ صلى الله عليه وسلم ثُمَّ عَدَلْتُ إِلَى ظِلِّ الشَّجَرَةِ، فَلَمَّا خَفَّ النَّاسُ قَالَ ‏\"‏ يَا ابْنَ الأَكْوَعِ، أَلاَ تُبَايِعُ ‏\"‏‏.‏ قَالَ قُلْتُ قَدْ بَايَعْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ وَأَيْضًا ‏\"‏‏.‏ فَبَايَعْتُهُ الثَّانِيَةَ،‏.‏ فَقُلْتُ لَهُ يَا أَبَا مُسْلِمٍ، عَلَى أَىِّ شَىْءٍ كُنْتُمْ تُبَايِعُونَ يَوْمَئِذٍ قَالَ عَلَى الْمَوْتِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2960In-book reference : Book 56, Hadith 171USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2961,
    "id": 2961,
    "url": "https://sunnah.com/bukhari:2961",
    "bookNumber": 56,
    "hadithNumber": 172,
    "narrator": "Narrated Anas:",
    "english": "On the day (of the battle) of the Trench, the Ansar were saying, \"We are those who have sworn \nallegiance to Muhammad for Jihaid (for ever) as long as we live.\" The Prophet (ﷺ) replied to them, \"O \nAllah! There is no life except the life of the Hereafter. So honor the Ansar and emigrants with Your \nGenerosity.\"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَتِ الأَنْصَارُ يَوْمَ الْخَنْدَقِ تَقُولُ نَحْنُ الَّذِينَ بَايَعُوا مُحَمَّدَا عَلَى الْجِهَادِ مَا حَيِينَا أَبَدَا فَأَجَابَهُمُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ اللَّهُمَّ لاَ عَيْشَ إِلاَّ عَيْشُ الآخِرَهْ فَأَكْرِمِ الأَنْصَارَ وَالْمُهَاجِرَهْ",
    "reference": "Reference : Sahih al-Bukhari 2961In-book reference : Book 56, Hadith 172USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2962,
    "id": 2962,
    "url": "https://sunnah.com/bukhari:2962",
    "bookNumber": 56,
    "hadithNumber": 173,
    "narrator": "Narrated Mujashi:",
    "english": "My brother and I came to the Prophet (ﷺ) and I requested him to take the pledge \nof allegiance from us for migration. He said, \"Migration has passed away with its people.\" I asked, \n\"For what will you take the pledge of allegiance from us then?\" He said, \"I will take (the pledge) for \nIslam and Jihad.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ مُحَمَّدَ بْنَ فُضَيْلٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ مُجَاشِعٍ ـ رضى الله عنه ـ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم أَنَا وَأَخِي فَقُلْتُ بَايِعْنَا عَلَى الْهِجْرَةِ‏.‏ فَقَالَ ‏\"‏ مَضَتِ الْهِجْرَةُ لأَهْلِهَا ‏\"‏‏.‏ فَقُلْتُ عَلاَمَ تُبَايِعُنَا قَالَ ‏\"‏ عَلَى الإِسْلاَمِ وَالْجِهَادِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2962, 2963In-book reference : Book 56, Hadith 173USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2963,
    "id": 2963,
    "url": "https://sunnah.com/bukhari:2963",
    "bookNumber": 56,
    "hadithNumber": 173,
    "narrator": "Narrated Mujashi:",
    "english": "My brother and I came to the Prophet (ﷺ) and I requested him to take the pledge \nof allegiance from us for migration. He said, \"Migration has passed away with its people.\" I asked, \n\"For what will you take the pledge of allegiance from us then?\" He said, \"I will take (the pledge) for \nIslam and Jihad.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ مُحَمَّدَ بْنَ فُضَيْلٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ مُجَاشِعٍ ـ رضى الله عنه ـ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم أَنَا وَأَخِي فَقُلْتُ بَايِعْنَا عَلَى الْهِجْرَةِ‏.‏ فَقَالَ ‏\"‏ مَضَتِ الْهِجْرَةُ لأَهْلِهَا ‏\"‏‏.‏ فَقُلْتُ عَلاَمَ تُبَايِعُنَا قَالَ ‏\"‏ عَلَى الإِسْلاَمِ وَالْجِهَادِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2962, 2963In-book reference : Book 56, Hadith 173USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2964,
    "id": 2964,
    "url": "https://sunnah.com/bukhari:2964",
    "bookNumber": 56,
    "hadithNumber": 174,
    "narrator": "Narrated `Abdullah:",
    "english": "Today a man came to me and asked me a question which I did not know how to answer. He said, \"Tell \nme, if a wealthy active man, well-equipped with arms, goes out on military expeditions with our \nchiefs, and orders us to do such things as we cannot do (should we obey him?)\" I replied, \"By Allah, I \ndo not know what to reply you, except that we, were in the company of the Prophet (ﷺ) and he used to \norder us to do a thing once only till we finished it. And no doubt, everyone among you will remain in \na good state as long as he obeys Allah. If one is in doubt as to the legality of something, he should ask \nsomebody who would satisfy him, but soon will come a time when you will not find such a man. By \nHim, except Whom none has the right to be worshipped. I see that the example of what has passed of \nthis life (to what remains thereof) is like a pond whose fresh water has been used up and nothing \nremains but muddy water.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ لَقَدْ أَتَانِي الْيَوْمَ رَجُلٌ فَسَأَلَنِي عَنْ أَمْرٍ مَا دَرَيْتُ مَا أَرُدُّ عَلَيْهِ، فَقَالَ أَرَأَيْتَ رَجُلاً مُؤْدِيًا نَشِيطًا، يَخْرُجُ مَعَ أُمَرَائِنَا فِي الْمَغَازِي، فَيَعْزِمُ عَلَيْنَا فِي أَشْيَاءَ لاَ نُحْصِيهَا‏.‏ فَقُلْتُ لَهُ وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لَكَ إِلاَّ أَنَّا كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فَعَسَى أَنْ لاَ يَعْزِمَ عَلَيْنَا فِي أَمْرٍ إِلاَّ مَرَّةً حَتَّى نَفْعَلَهُ، وَإِنَّ أَحَدَكُمْ لَنْ يَزَالَ بِخَيْرٍ مَا اتَّقَى اللَّهَ، وَإِذَا شَكَّ فِي نَفْسِهِ شَىْءٌ سَأَلَ رَجُلاً فَشَفَاهُ مِنْهُ، وَأَوْشَكَ أَنْ لاَ تَجِدُوهُ، وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ مَا أَذْكُرُ مَا غَبَرَ مِنَ الدُّنْيَا إِلاَّ كَالثَّغْبِ شُرِبَ صَفْوُهُ وَبَقِيَ كَدَرُهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2964In-book reference : Book 56, Hadith 174USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2965,
    "id": 2965,
    "url": "https://sunnah.com/bukhari:2965",
    "bookNumber": 56,
    "hadithNumber": 175,
    "narrator": "Narrated Salim Abu An-Nadr:",
    "english": "The freed slave of `Umar bin 'Ubaidullah who was `Umar's clerk: `Abdullah bin Abi `Aufa wrote him \n(i.e. `Umar) a letter that contained the following:-- \n\"Once Allah's Messenger (ﷺ) (during a holy battle), waited till the sun had declined and then he got up \namong the people and said, \"O people! Do not wish to face the enemy (in a battle) and ask Allah to \nsave you (from calamities) but if you should face the enemy, then be patient and let it be known to \nyou that Paradise is under the shades of swords.\" He then said,, \"O Allah! The Revealer of the (Holy) \nBook, the Mover of the clouds, and Defeater of Al-Ahzab (i.e. the clans of infidels), defeat them \ninfidels and bestow victory upon us.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ وَكَانَ كَاتِبًا لَهُ قَالَ كَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ أَبِي أَوْفَى ـ رضى الله عنهما ـ فَقَرَأْتُهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَيَّامِهِ الَّتِي لَقِيَ فِيهَا انْتَظَرَ حَتَّى مَالَتِ الشَّمْسُ‏.‏   ثُمَّ قَامَ فِي النَّاسِ قَالَ ‏\n\"‏ أَيُّهَا النَّاسُ، لاَ تَتَمَنَّوْا لِقَاءَ الْعَدُوِّ، وَسَلُوا اللَّهَ الْعَافِيَةَ، فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا، وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلاَلِ السُّيُوفِ، ثُمَّ قَالَ اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وَهَازِمَ الأَحْزَابِ، اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2965, 2966In-book reference : Book 56, Hadith 175USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2966,
    "id": 2966,
    "url": "https://sunnah.com/bukhari:2966",
    "bookNumber": 56,
    "hadithNumber": 175,
    "narrator": "Narrated Salim Abu An-Nadr:",
    "english": "The freed slave of `Umar bin 'Ubaidullah who was `Umar's clerk: `Abdullah bin Abi `Aufa wrote him \n(i.e. `Umar) a letter that contained the following:-- \n\"Once Allah's Messenger (ﷺ) (during a holy battle), waited till the sun had declined and then he got up \namong the people and said, \"O people! Do not wish to face the enemy (in a battle) and ask Allah to \nsave you (from calamities) but if you should face the enemy, then be patient and let it be known to \nyou that Paradise is under the shades of swords.\" He then said,, \"O Allah! The Revealer of the (Holy) \nBook, the Mover of the clouds, and Defeater of Al-Ahzab (i.e. the clans of infidels), defeat them \ninfidels and bestow victory upon us.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ وَكَانَ كَاتِبًا لَهُ قَالَ كَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ أَبِي أَوْفَى ـ رضى الله عنهما ـ فَقَرَأْتُهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَيَّامِهِ الَّتِي لَقِيَ فِيهَا انْتَظَرَ حَتَّى مَالَتِ الشَّمْسُ‏.‏   ثُمَّ قَامَ فِي النَّاسِ قَالَ ‏\n\"‏ أَيُّهَا النَّاسُ، لاَ تَتَمَنَّوْا لِقَاءَ الْعَدُوِّ، وَسَلُوا اللَّهَ الْعَافِيَةَ، فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا، وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلاَلِ السُّيُوفِ، ثُمَّ قَالَ اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وَهَازِمَ الأَحْزَابِ، اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2965, 2966In-book reference : Book 56, Hadith 175USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2967,
    "id": 2967,
    "url": "https://sunnah.com/bukhari:2967",
    "bookNumber": 56,
    "hadithNumber": 176,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I participated in a Ghazwa along with Allah's Messenger (ﷺ) The Prophet (ﷺ) met me (on the way) while I was \nriding a camel of ours used for irrigation and it had got so tired that it could hardly walk. The Prophet (ﷺ) \nasked me, \"What is wrong with the camel?\" I replied, \"It has got tired.\" So. Allah's Messenger (ﷺ) came from \nbehind it and rebuked it and prayed for it so it started surpassing the other camels and going ahead of \nthem. Then he asked me, \"How do you find your camel (now)?\" I replied, \"I find it quite well, now as \nit has received your blessings.\" He said, \"Will you sell it to me?\" I felt shy (to refuse his offer) though \nit was the only camel for irrigation we had. So, I said, \"Yes.\" He said, \"Sell it to me then.\" I sold it to \nhim on the condition that I should keep on riding it till I reached Medina. Then I said, \"O Allah's \nApostle! I am a bridegroom,\" and requested him to allow me to go home. He allowed me, and I set out \nfor Medina before the people till I reached Medina, where I met my uncle, who asked me about the \ncamel and I informed him all about it and he blamed me for that. When I took the permission of \nAllah's Messenger (ﷺ) he asked me whether I had married a virgin or a matron and I replied that I had \nmarried a matron. He said, \"Why hadn't you married a virgin who would have played with you, and \nyou would have played with her?\" I replied, \"O Allah's Messenger (ﷺ)! My father died (or was martyred) and \nI have some young sisters, so I felt it not proper that I should marry a young girl like them who would \nneither teach them manners nor serve them. So, I have married a matron so that she may serve them \nand teach them manners.\" When Allah's Messenger (ﷺ) arrived in Medina, I took the camel to him the next \nmorning and he gave me its price and gave me the camel itself as well.",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَتَلاَحَقَ بِي النَّبِيُّ صلى الله عليه وسلم وَأَنَا عَلَى نَاضِحٍ لَنَا قَدْ أَعْيَا فَلاَ يَكَادُ يَسِيرُ فَقَالَ لِي ‏\"‏ مَا لِبَعِيرِكَ ‏\"‏‏.‏ قَالَ قُلْتُ عَيِيَ‏.‏ قَالَ فَتَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَجَرَهُ وَدَعَا لَهُ، فَمَا زَالَ بَيْنَ يَدَىِ الإِبِلِ قُدَّامَهَا يَسِيرُ‏.‏ فَقَالَ لِي ‏\"‏ كَيْفَ تَرَى بَعِيرَكَ ‏\"‏‏.‏ قَالَ قُلْتُ بِخَيْرٍ قَدْ أَصَابَتْهُ بَرَكَتُكَ‏.‏ قَالَ ‏\"‏ أَفَتَبِيعُنِيهِ ‏\"‏‏.‏ قَالَ فَاسْتَحْيَيْتُ، وَلَمْ يَكُنْ لَنَا نَاضِحٌ غَيْرَهُ، قَالَ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَبِعْنِيهِ ‏\"‏‏.‏ فَبِعْتُهُ إِيَّاهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ‏.‏ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي عَرُوسٌ، فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي، فَتَقَدَّمْتُ النَّاسَ إِلَى الْمَدِينَةِ حَتَّى أَتَيْتُ الْمَدِينَةَ، فَلَقِيَنِي خَالِي فَسَأَلَنِي عَنِ الْبَعِيرِ، فَأَخْبَرْتُهُ بِمَا صَنَعْتُ فِيهِ فَلاَمَنِي، قَالَ وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي حِينَ اسْتَأْذَنْتُهُ ‏\"‏ هَلْ تَزَوَّجْتَ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ فَقُلْتُ تَزَوَّجْتُ ثَيِّبًا‏.‏ فَقَالَ ‏\"‏ هَلاَّ تَزَوَّجْتَ بِكْرًا تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ تُوُفِّيَ وَالِدِي ـ أَوِ اسْتُشْهِدَ ـ وَلِي أَخَوَاتٌ صِغَارٌ، فَكَرِهْتُ أَنْ أَتَزَوَّجَ مِثْلَهُنَّ، فَلاَ تُؤَدِّبُهُنَّ، وَلاَ تَقُومُ عَلَيْهِنَّ، فَتَزَوَّجْتُ ثَيِّبًا لِتَقُومَ عَلَيْهِنَّ وَتُؤَدِّبَهُنَّ‏.‏ قَالَ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ غَدَوْتُ عَلَيْهِ بِالْبَعِيرِ، فَأَعْطَانِي ثَمَنَهُ، وَرَدَّهُ عَلَىَّ‏.‏ قَالَ الْمُغِيرَةُ هَذَا فِي قَضَائِنَا حَسَنٌ لاَ نَرَى بِهِ بَأْسًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2967In-book reference : Book 56, Hadith 176USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2968,
    "id": 2968,
    "url": "https://sunnah.com/bukhari:2968",
    "bookNumber": 56,
    "hadithNumber": 177,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once there was a feeling of fright at Medina, so Allah's Messenger (ﷺ) rode a horse belonging to Abu Talha \nand (on his return) he said, \"We have not seen anything (fearful), but we found this horse very fast.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنِي قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ بِالْمَدِينَةِ فَزَعٌ، فَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَسًا لأَبِي طَلْحَةَ، فَقَالَ ‏\n\"‏ مَا رَأَيْنَا مِنْ شَىْءٍ، وَإِنْ وَجَدْنَاهُ لَبَحْرًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2968In-book reference : Book 56, Hadith 177USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 212   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2969,
    "id": 2969,
    "url": "https://sunnah.com/bukhari:2969",
    "bookNumber": 56,
    "hadithNumber": 178,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Once the people got frightened, so Allah's Messenger (ﷺ) rode a slow horse belonging to Abu Talha, and he \nset out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. \nOn his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a \nvery fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
    "arabic": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ فَزِعَ النَّاسُ فَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَسًا لأَبِي طَلْحَةَ بَطِيئًا، ثُمَّ خَرَجَ يَرْكُضُ وَحْدَهُ، فَرَكِبَ النَّاسُ يَرْكُضُونَ خَلْفَهُ، فَقَالَ ‏\n\"‏ لَمْ تُرَاعُوا، إِنَّهُ لَبَحْرٌ ‏\"‏‏.‏ فَمَا سُبِقَ بَعْدَ ذَلِكَ الْيَوْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2969In-book reference : Book 56, Hadith 178USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2970,
    "id": 2970,
    "url": "https://sunnah.com/bukhari:2970",
    "bookNumber": 56,
    "hadithNumber": 179,
    "narrator": "Narrated `Umar bin Al-Khattab:",
    "english": "I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet (ﷺ) whether \nI could buy it. He said, \"Don't buy it and don't take back your gift of charity.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، سَأَلَ زَيْدَ بْنَ أَسْلَمَ، فَقَالَ زَيْدٌ سَمِعْتُ أَبِي يَقُولُ، قَالَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ، فَرَأَيْتُهُ يُبَاعُ، فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم آشْتَرِيهِ فَقَالَ ‏\n\"‏ لاَ تَشْتَرِهِ، وَلاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2970In-book reference : Book 56, Hadith 179USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 214   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2971,
    "id": 2971,
    "url": "https://sunnah.com/bukhari:2971",
    "bookNumber": 56,
    "hadithNumber": 180,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "`Umar gave a horse to be used in Allah's Cause, but later on he found it being sold. So, he intended to \nbuy it and asked Allah's Messenger (ﷺ) who said, \"Don't buy it and don't take back your gift of charity.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما أَنَّ عُمَرَ بْنَ الْخَطَّابِ، حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ، فَوَجَدَهُ يُبَاعُ، فَأَرَادَ أَنْ يَبْتَاعَهُ، فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ تَبْتَعْهُ، وَلاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2971In-book reference : Book 56, Hadith 180USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 215   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2972,
    "id": 2972,
    "url": "https://sunnah.com/bukhari:2972",
    "bookNumber": 56,
    "hadithNumber": 181,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Were it not for the fear that it would be difficult for my followers, I would not \nhave remained behind any Sariya, (army-unit) but I don't have riding camels and have no other means \nof conveyance to carry them on, and it is hard for me that my companions should remain behind me. \nNo doubt I wish I could fight in Allah's Cause and be martyred and come to life again to be martyred \nand come to life once more.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، قَالَ حَدَّثَنِي أَبُو صَالِحٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي مَا تَخَلَّفْتُ عَنْ سَرِيَّةٍ، وَلَكِنْ لاَ أَجِدُ حَمُولَةً، وَلاَ أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ، وَيَشُقُّ عَلَىَّ أَنْ يَتَخَلَّفُوا عَنِّي، وَلَوَدِدْتُ أَنِّي قَاتَلْتُ فِي سَبِيلِ اللَّهِ فَقُتِلْتُ، ثُمَّ أُحْيِيتُ ثُمَّ قُتِلْتُ، ثُمَّ أُحْيِيتُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2972In-book reference : Book 56, Hadith 181USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 216   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2973,
    "id": 2973,
    "url": "https://sunnah.com/bukhari:2973",
    "bookNumber": 56,
    "hadithNumber": 182,
    "narrator": "Narrated Yali:",
    "english": "I participated in the Ghazwa of Tabuk along with Allah's Messenger (ﷺ) and I gave a young camel to be \nridden in Jihad and that was, to me, one of my best deeds. Then I employed a laborer who quarrelled \nwith another person. One of them bit the hand of the other and the latter drew his hand from the mouth \nof the former pulling out his front tooth. Then the former instituted a suit against the latter before the \nProphet who rejected that suit saying, \"Do you expect him to put out his hand for you to snap as a \nmale camel snaps (vegetation)?\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَزْوَةَ تَبُوكَ، فَحَمَلْتُ عَلَى بَكْرٍ، فَهْوَ أَوْثَقُ أَعْمَالِي فِي نَفْسِي، فَاسْتَأْجَرْتُ أَجِيرًا، فَقَاتَلَ رَجُلاً، فَعَضَّ أَحَدُهُمَا الآخَرَ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ، وَنَزَعَ ثَنِيَّتَهُ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَهْدَرَهَا فَقَالَ ‏\n\"‏ أَيَدْفَعُ يَدَهُ إِلَيْكَ فَتَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2973In-book reference : Book 56, Hadith 182USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 217   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2974,
    "id": 2974,
    "url": "https://sunnah.com/bukhari:2974",
    "bookNumber": 56,
    "hadithNumber": 183,
    "narrator": "Narrated Tha`laba bin Abi Malik Al-Qurazi:",
    "english": "When Qais bin Sa`d Al-Ansari, who used to carry the flag of the Prophet, intended to perform Hajj, he \ncombed his hair.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ أَخْبَرَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي ثَعْلَبَةُ بْنُ أَبِي مَالِكٍ الْقُرَظِيُّ، أَنَّ قَيْسَ بْنَ سَعْدٍ الأَنْصَارِيّ َ ـ رضى الله عنه ـ وَكَانَ صَاحِبَ لِوَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَرَادَ الْحَجَّ فَرَجَّلَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2974In-book reference : Book 56, Hadith 183USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 218   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2975,
    "id": 2975,
    "url": "https://sunnah.com/bukhari:2975",
    "bookNumber": 56,
    "hadithNumber": 184,
    "narrator": "Narrated Salama bin Al-Akwa:",
    "english": "Ali remained behind the Prophet (ﷺ) during the battle of Khaibar as he way\n     suffering from some eye trouble but then he said, \"How should I stay \n     behind Allah's Messenger (ﷺ)?\" So, he set out till he joined the Prophet. On\n     the eve of the day of the conquest of Khaibar, Allah's Messenger (ﷺ) said, \n     \"(No doubt) I will give the flag or, tomorrow, a man whom Allah and \n     His Apostle love or who loves Allah and His apostle will take the \n     flag. Allah will bestow victory upon him.\" Suddenly 'Ali joined us \n     though we were not expecting him. The people said, \"Here is 'Ali. \"So,\n     Allah's Messenger (ﷺ) gave the flag to him and Allah bestowed victory upon \n     him.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ كَانَ عَلِيٌّ ـ رضى الله عنه ـ تَخَلَّفَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي خَيْبَرَ، وَكَانَ بِهِ رَمَدٌ، فَقَالَ أَنَا أَتَخَلَّفُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ عَلِيٌّ فَلَحِقَ بِالنَّبِيِّ صلى الله عليه وسلم، فَلَمَّا كَانَ مَسَاءُ اللَّيْلَةِ الَّتِي فَتَحَهَا فِي صَبَاحِهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأُعْطِيَنَّ الرَّايَةَ ـ أَوْ قَالَ لَيَأْخُذَنَّ ـ غَدًا رَجُلٌ يُحِبُّهُ اللَّهُ وَرَسُولُهُ ـ أَوْ قَالَ يُحِبُّ اللَّهَ وَرَسُولَهُ ـ يَفْتَحُ اللَّهُ عَلَيْهِ ‏\"‏‏.‏ فَإِذَا نَحْنُ بِعَلِيٍّ، وَمَا نَرْجُوهُ، فَقَالُوا هَذَا عَلِيٌّ، فَأَعْطَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَفَتَحَ اللَّهُ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2975In-book reference : Book 56, Hadith 184USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2976,
    "id": 2976,
    "url": "https://sunnah.com/bukhari:2976",
    "bookNumber": 56,
    "hadithNumber": 185,
    "narrator": "Narrated Nafi bin Jubair:",
    "english": "I heard Al Abbas telling Az-Zubair, \"The Prophet (ﷺ) ordered you to fix \n     the flag here.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، قَالَ سَمِعْتُ الْعَبَّاسَ، يَقُولُ لِلزُّبَيْرِ رضى الله عنهما هَا هُنَا أَمَرَكَ النَّبِيُّ صلى الله عليه وسلم أَنْ تَرْكُزَ الرَّايَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2976In-book reference : Book 56, Hadith 185USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2977,
    "id": 2977,
    "url": "https://sunnah.com/bukhari:2977",
    "bookNumber": 56,
    "hadithNumber": 186,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"I have been sent with the shortest expressions bearing the widest meanings, and I have been made victorious with awe (cast in the hearts of the enemy), and while I was sleeping, the keys of the treasures of the world were brought to me and put in my hand.\" \nAbu Huraira added: Allah's Messenger (ﷺ) has left the world and now you, people, are bringing out those treasures (i.e. the Prophet (ﷺ) did not benefit by them).",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، فَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ، فَوُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَقَدْ ذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمْ تَنْتَثِلُونَهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2977In-book reference : Book 56, Hadith 186USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2978,
    "id": 2978,
    "url": "https://sunnah.com/bukhari:2978",
    "bookNumber": 56,
    "hadithNumber": 187,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Abu Sufyan said, \"Heraclius sent for me when I was in 'llya' (i.e. Jerusalem). Then he asked for the \nletter of Allah's Messenger (ﷺ) and when he had finished its reading there was a great hue and cry around \nhim and the voices grew louder and we were asked to quit the place. When we were turned out, I said \nto my companions, 'The cause of Ibn Abi Kabsha has become conspicuous as the King of Bani Al- \nAsfar is afraid of him.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ وَهُمْ بِإِيلِيَاءَ، ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَلَمَّا فَرَغَ مِنْ قِرَاءَةِ الْكِتَابِ كَثُرَ عِنْدَهُ الصَّخَبُ، فَارْتَفَعَتِ الأَصْوَاتُ، وَأُخْرِجْنَا، فَقُلْتُ لأَصْحَابِي حِينَ أُخْرِجْنَا لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، إِنَّهُ يَخَافُهُ مَلِكُ بَنِي الأَصْفَرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2978In-book reference : Book 56, Hadith 187USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2979,
    "id": 2979,
    "url": "https://sunnah.com/bukhari:2979",
    "bookNumber": 56,
    "hadithNumber": 188,
    "narrator": "Narrated Asma:",
    "english": "I prepared the journey-food for Allah's Messenger (ﷺ) in Abu Bakr's house when he intended to emigrate to \nMedina. I could not find anything to tie the food-container and the water skin with. So, I said to Abu \nBakr, \"By Allah, I do not find anything to tie (these things) with except my waist belt.\" He said, \"Cut \nit into two pieces and tie the water-skin with one piece and the food-container with the other (the subnarrator \nadded, \"She did accordingly and that was the reason for calling her Dhatun-Nitaqain (i.e. twobelted \nwoman)).",
    "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي وَ، حَدَّثَتْنِي أَيْضًا، فَاطِمَةُ عَنْ أَسْمَاءَ ـ رضى الله عنها ـ قَالَتْ صَنَعْتُ سُفْرَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ أَبِي بَكْرٍ حِينَ أَرَادَ أَنْ يُهَاجِرَ إِلَى الْمَدِينَةِ، قَالَتْ فَلَمْ نَجِدْ لِسُفْرَتِهِ وَلاَ لِسِقَائِهِ مَا نَرْبِطُهُمَا بِهِ، فَقُلْتُ لأَبِي بَكْرٍ وَاللَّهِ مَا أَجِدُ شَيْئًا أَرْبِطُ بِهِ إِلاَّ نِطَاقِي‏.‏ قَالَ فَشُقِّيهِ بِاثْنَيْنِ، فَارْبِطِيهِ بِوَاحِدٍ السِّقَاءَ وَبِالآخَرِ السُّفْرَةَ‏.‏ فَفَعَلْتُ، فَلِذَلِكَ سُمِّيَتْ ذَاتَ النِّطَاقَيْنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2979In-book reference : Book 56, Hadith 188USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2980,
    "id": 2980,
    "url": "https://sunnah.com/bukhari:2980",
    "bookNumber": 56,
    "hadithNumber": 189,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "During the life-time of the Prophet (ﷺ) we used to take the meat of sacrificed animals (as journey food) to \nMedina. (See Hadith No. 474 Vol. 7)",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الأَضَاحِيِّ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2980In-book reference : Book 56, Hadith 189USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2981,
    "id": 2981,
    "url": "https://sunnah.com/bukhari:2981",
    "bookNumber": 56,
    "hadithNumber": 190,
    "narrator": "Narrated Suwaid bin An-Nu`man:",
    "english": "That he went out in the company o; the Prophet (ﷺ) during the year of Khaibar (campaign till they reached \na place called As-Sahba', the lower part of Khaibar. They offered the `Asr prayer (there) and the \nProphet asked for the food. Nothing but Sawiq was brought to the Prophet. So, they chewed it and ate \nit and drank water. After that the Prophet (ﷺ) got up, washed his mouth, and they too washed their mouths \nand then offered the prayer.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى، قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، أَنَّ سُوَيْدَ بْنَ النُّعْمَانِ ـ رضى الله عنه ـ أَخْبَرَهُ أَنَّهُ، خَرَجَ مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ ـ وَهْىَ مِنْ خَيْبَرَ وَهْىَ أَدْنَى خَيْبَرَ ـ فَصَلَّوُا الْعَصْرَ، فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِالأَطْعِمَةِ، فَلَمْ يُؤْتَ النَّبِيُّ صلى الله عليه وسلم إِلاَّ بِسَوِيقٍ، فَلُكْنَا فَأَكَلْنَا وَشَرِبْنَا، ثُمَّ قَامَ النَّبِيُّ صلى الله عليه وسلم فَمَضْمَضَ وَمَضْمَضْنَا، وَصَلَّيْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2981In-book reference : Book 56, Hadith 190USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2982,
    "id": 2982,
    "url": "https://sunnah.com/bukhari:2982",
    "bookNumber": 56,
    "hadithNumber": 191,
    "narrator": "Narrated Salama:",
    "english": "Once the journey-food of the people ran short and they were in great need. So, they came to the \nProphet to take his permission for slaughtering their camels, and he permitted them. Then `Umar met \nthem and they informed him about it. He said, \"What will sustain you after your camels (are \nfinished)?\" Then `Umar went to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! What will sustain them \nafter their camels (are finished)?\" Allah's Messenger (ﷺ) said, \"Make an announcement amongst the people \nthat they should bring all their remaining food (to me).\" (They brought it and) the Prophet (ﷺ) invoked \nAllah and asked for His Blessings for it. Then he asked them to bring their food utensils and the \npeople started filling their food utensils with their hands till they were satisfied. Allah's Messenger (ﷺ) then \nsaid, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
    "arabic": "حَدَّثَنَا بِشْرُ بْنُ مَرْحُومٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ ـ رضى الله عنه قَالَ خَفَّتْ أَزْوَادُ النَّاسِ وَأَمْلَقُوا، فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فِي نَحْرِ إِبِلِهِمْ، فَأَذِنَ لَهُمْ، فَلَقِيَهُمْ عُمَرُ فَأَخْبَرُوهُ فَقَالَ مَا بَقَاؤُكُمْ بَعْدَ إِبِلِكُمْ فَدَخَلَ عُمَرُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا بَقَاؤُهُمْ بَعْدَ إِبِلِهِمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَادِ فِي النَّاسِ يَأْتُونَ بِفَضْلِ أَزْوَادِهِمْ ‏\"‏‏.‏ فَدَعَا وَبَرَّكَ عَلَيْهِ، ثُمَّ دَعَاهُمْ بِأَوْعِيَتِهِمْ، فَاحْتَثَى النَّاسُ حَتَّى فَرَغُوا، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2982In-book reference : Book 56, Hadith 191USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2983,
    "id": 2983,
    "url": "https://sunnah.com/bukhari:2983",
    "bookNumber": 56,
    "hadithNumber": 192,
    "narrator": "Narrated Wahb bin Kaisan:",
    "english": "Jabir bin `Abdullah said, \"We set out, and we were three-hundred men carrying our journey-food on \nour shoulders. Then we began to eat a single date each per day.\" A man asked (Jabir), \"O Abu \n`Abdullah! How could a person be satisfied with a single date?\" Jabir replied, \"We realized the value \nof that one date when we could not even have that much till we reached the sea-shore, when all of a \nsudden we saw a huge fish cast by the sea. So, we ate of it as much as we wished for eighteen days.\"",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ خَرَجْنَا وَنَحْنُ ثَلاَثُمِائَةٍ نَحْمِلُ زَادَنَا عَلَى رِقَابِنَا، فَفَنِيَ زَادُنَا، حَتَّى كَانَ الرَّجُلُ مِنَّا يَأْكُلُ فِي كُلِّ يَوْمٍ تَمْرَةً‏.‏ قَالَ رَجُلٌ يَا أَبَا عَبْدِ اللَّهِ، وَأَيْنَ كَانَتِ التَّمْرَةُ تَقَعُ مِنَ الرَّجُلِ قَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَقَدْنَاهَا، حَتَّى أَتَيْنَا الْبَحْرَ فَإِذَا حُوتٌ قَدْ قَذَفَهُ الْبَحْرُ، فَأَكَلْنَا مِنْهَا ثَمَانِيَةَ عَشَرَ يَوْمًا مَا أَحْبَبْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2983In-book reference : Book 56, Hadith 192USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2984,
    "id": 2984,
    "url": "https://sunnah.com/bukhari:2984",
    "bookNumber": 56,
    "hadithNumber": 193,
    "narrator": "Narrated Aisha:",
    "english": "That she said, \"O Allah's Messenger (ﷺ)! Your companions are returning with the reward of both Hajj and \n`Umra, while I am returning with (the reward of) Hajj only.\" He said to her, \"Go, and let `Abdur- \nRahman (i.e. your brother) make you sit behind him (on the animal).\" So, he ordered `AbdurRahman \nto let her perform `Umra from Al-Tan`im. Then the Prophet (ﷺ) waited for her at the higher region of \nMecca till she returned.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا عُثْمَانُ بْنُ الأَسْوَدِ، حَدَّثَنَا ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، يَرْجِعُ أَصْحَابُكَ بِأَجْرِ حَجٍّ وَعُمْرَةٍ، وَلَمْ أَزِدْ عَلَى الْحَجِّ‏.‏ فَقَالَ لَهَا ‏\n\"‏ اذْهَبِي وَلْيَرْدِفْكِ عَبْدُ الرَّحْمَنِ ‏\"‏‏.‏ فَأَمَرَ عَبْدَ الرَّحْمَنِ أَنْ يُعْمِرَهَا مِنَ التَّنْعِيمِ، فَانْتَظَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَعْلَى مَكَّةَ حَتَّى جَاءَتْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2984In-book reference : Book 56, Hadith 193USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2985,
    "id": 2985,
    "url": "https://sunnah.com/bukhari:2985",
    "bookNumber": 56,
    "hadithNumber": 194,
    "narrator": "Narrated `Abdur-Rahman bin Abi Bakr As-Siddiq:",
    "english": "The Prophet (ﷺ) ordered me to let `Aisha sit behind me (on the animal) and to let her perform `Umra from \nat-Tan`im.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ ـ رضى الله عنهما ـ قَالَ أَمَرَنِي النَّبِيُّ صلى الله عليه وسلم أَنْ أُرْدِفَ عَائِشَةَ وَأُعْمِرَهَا مِنَ التَّنْعِيمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2985In-book reference : Book 56, Hadith 194USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2986,
    "id": 2986,
    "url": "https://sunnah.com/bukhari:2986",
    "bookNumber": 56,
    "hadithNumber": 195,
    "narrator": "Narrated Anas:",
    "english": "I was riding behind Abu Talha (on the same) riding animal and (the Prophet's companions) were \nreciting Talbiya aloud for both Hajj and `Umra.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنْتُ رَدِيفَ أَبِي طَلْحَةَ، وَإِنَّهُمْ لَيَصْرُخُونَ بِهِمَا جَمِيعًا الْحَجِّ وَالْعُمْرَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2986In-book reference : Book 56, Hadith 195USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2987,
    "id": 2987,
    "url": "https://sunnah.com/bukhari:2987",
    "bookNumber": 56,
    "hadithNumber": 196,
    "narrator": "Narrated `Urwa from Usama bin Zaid:",
    "english": "Allah's Messenger (ﷺ) rode a donkey on which there was a saddle covered by a velvet sheet and let Usama \nride behind him (on the donkey).",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ، عَلَى إِكَافٍ عَلَيْهِ قَطِيفَةٌ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2987In-book reference : Book 56, Hadith 196USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2988,
    "id": 2988,
    "url": "https://sunnah.com/bukhari:2988",
    "bookNumber": 56,
    "hadithNumber": 197,
    "narrator": "Narrated Nafi` from `Abdullah:",
    "english": "Allah's Messenger (ﷺ) came to Mecca through its higher region on the day of the Conquest (of Mecca) riding \nhis she-camel on which Usama was riding behind him. Bilal and `Uthman bin Talha, one of the \nservants of the Ka`ba, were also accompanying him till he made his camel kneel in the mosque and \nordered the latter to bring the key of the Ka`ba. He opened the door of the Ka`ba and Allah's Messenger (ﷺ) \nentered in the company of Usama, Bilal and `Uthman, and stayed in it for a long period. When he \ncame out, the people rushed to it, and `Abdullah bin `Umar was the first to enter it and found Bilal \nstanding behind the door. He asked Bilal, \"Where did the Prophet (ﷺ) offer his prayer?\" He pointed to the \nplace where he had offered his prayer. `Abdullah said, \"I forgot to ask him how many rak`at he had \nperformed.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، قَالَ يُونُسُ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقْبَلَ يَوْمَ الْفَتْحِ مِنْ أَعْلَى مَكَّةَ عَلَى رَاحِلَتِهِ، مُرْدِفًا أُسَامَةَ بْنَ زَيْدٍ وَمَعَهُ بِلاَلٌ وَمَعَهُ عُثْمَانُ بْنُ طَلْحَةَ مِنَ الْحَجَبَةِ، حَتَّى أَنَاخَ فِي الْمَسْجِدِ، فَأَمَرَهُ أَنْ يَأْتِيَ بِمِفْتَاحِ الْبَيْتِ، فَفَتَحَ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ أُسَامَةُ وَبِلاَلٌ وَعُثْمَانُ، فَمَكَثَ فِيهَا نَهَارًا طَوِيلاً ثُمَّ خَرَجَ، فَاسْتَبَقَ النَّاسُ، وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَوَّلَ مَنْ دَخَلَ، فَوَجَدَ بِلاَلاً وَرَاءَ الْبَابِ قَائِمًا، فَسَأَلَهُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ لَهُ إِلَى الْمَكَانِ الَّذِي صَلَّى فِيهِ، قَالَ عَبْدُ اللَّهِ فَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى مِنْ سَجْدَةٍ",
    "reference": "Reference : Sahih al-Bukhari 2988In-book reference : Book 56, Hadith 197USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2989,
    "id": 2989,
    "url": "https://sunnah.com/bukhari:2989",
    "bookNumber": 56,
    "hadithNumber": 198,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There is a (compulsory) Sadaqa (charity) to be given for every joint of the \nhuman body (as a sign of gratitude to Allah) everyday the sun rises. To judge justly between two \npersons is regarded as Sadaqa, and to help a man concerning his riding animal by helping him to ride \nit or by lifting his luggage on to it, is also regarded as Sadaqa, and (saying) a good word is also \nSadaqa, and every step taken on one's way to offer the compulsory prayer (in the mosque) is also \nSadaqa and to remove a harmful thing from the way is also Sadaqa.\"",
    "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ، يَعْدِلُ بَيْنَ الاِثْنَيْنِ صَدَقَةٌ، وَيُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ، فَيَحْمِلُ عَلَيْهَا، أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَكُلُّ خَطْوَةٍ يَخْطُوهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَيُمِيطُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2989In-book reference : Book 56, Hadith 198USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2990,
    "id": 2990,
    "url": "https://sunnah.com/bukhari:2990",
    "bookNumber": 56,
    "hadithNumber": 199,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) forbade the people to travel to a hostile country carrying (copies of) the Qur'an.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2990In-book reference : Book 56, Hadith 199USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 233   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2991,
    "id": 2991,
    "url": "https://sunnah.com/bukhari:2991",
    "bookNumber": 56,
    "hadithNumber": 200,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) reached Khaibar in the morning, while the people were coming out carrying their spades \nover their shoulders. When they saw him they said, \"This is Muhammad and his army! Muhammad \nand his army!\" So, they took refuge in the fort. The Prophet (ﷺ) raised both his hands and said, \"Allahu \nAkbar, Khaibar is ruined, for when we approach a nation (i.e. enemy to fight) then miserable is the \nmorning of the warned ones.\" Then we found some donkeys which we (killed and) cooked: The \nannouncer of the Prophet (ﷺ) announced: \"Allah and His Apostle forbid you to eat donkey's meat.\" So, all \nthe pots including their contents were turned upside down.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَبَّحَ النَّبِيُّ صلى الله عليه وسلم خَيْبَرَ وَقَدْ خَرَجُوا بِالْمَسَاحِي عَلَى أَعْنَاقِهِمْ، فَلَمَّا رَأَوْهُ قَالُوا هَذَا مُحَمَّدٌ وَالْخَمِيسُ، مُحَمَّدٌ وَالْخَمِيسُ‏.‏ فَلَجَئُوا إِلَى الْحِصْنِ، فَرَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَيْهِ وَقَالَ ‏\n\"‏ اللَّهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏ وَأَصَبْنَا حُمُرًا فَطَبَخْنَاهَا، فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ، فَأُكْفِئَتِ الْقُدُورُ بِمَا فِيهَا‏.‏ تَابَعَهُ عَلِيٌّ عَنْ سُفْيَانَ رَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2991In-book reference : Book 56, Hadith 200USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2992,
    "id": 2992,
    "url": "https://sunnah.com/bukhari:2992",
    "bookNumber": 56,
    "hadithNumber": 201,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "We were in the company of Allah's Messenger (ﷺ) (during Hajj). Whenever we went up a high place we used \nto say: \"None has the right to be worshipped but Allah, and Allah is Greater,\" and our voices used to \nrise, so the Prophet (ﷺ) said, \"O people! Be merciful to yourselves (i.e. don't raise your voice), for you are \nnot calling a deaf or an absent one, but One Who is with you, no doubt He is All-Hearer, ever Near (to \nall things).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَكُنَّا إِذَا أَشْرَفْنَا عَلَى وَادٍ هَلَّلْنَا وَكَبَّرْنَا ارْتَفَعَتْ أَصْوَاتُنَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَيُّهَا النَّاسُ، ارْبَعُوا عَلَى أَنْفُسِكُمْ، فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا، إِنَّهُ مَعَكُمْ، إِنَّهُ سَمِيعٌ قَرِيبٌ، تَبَارَكَ اسْمُهُ وَتَعَالَى جَدُّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2992In-book reference : Book 56, Hadith 201USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2993,
    "id": 2993,
    "url": "https://sunnah.com/bukhari:2993",
    "bookNumber": 56,
    "hadithNumber": 202,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Whenever we went up a place we would say, \"Allahu--Akbar (i.e. Allah is Greater)\", and whenever \nwe went down a place we would say, \"Subhan Allah.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا إِذَا صَعِدْنَا كَبَّرْنَا، وَإِذَا نَزَلْنَا سَبَّحْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2993In-book reference : Book 56, Hadith 202USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2994,
    "id": 2994,
    "url": "https://sunnah.com/bukhari:2994",
    "bookNumber": 56,
    "hadithNumber": 203,
    "narrator": "Narrated Jabir:",
    "english": "Whenever we went up a place we would say Takbir, and whenever we went down we would say, \n\"Subhan Allah.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ كُنَّا إِذَا صَعِدْنَا كَبَّرْنَا، وَإِذَا تَصَوَّبْنَا سَبَّحْنَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2994In-book reference : Book 56, Hadith 203USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 237   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2995,
    "id": 2995,
    "url": "https://sunnah.com/bukhari:2995",
    "bookNumber": 56,
    "hadithNumber": 204,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Whenever the Prophet (ﷺ) returned from the Hajj or the `Umra or a Ghazwa, he would say Takbir thrice. \nWhenever he came upon a mountain path or wasteland, and then he would say, \"None has the right to \nbe worshipped but Allah, Alone Who has no partner. All the Kingdom belongs to Him and all the \npraises are for Him and He is Omnipotent. We are returning with repentance, worshipping, prostrating \nourselves and praising our Lord. Allah fulfilled His Promise, granted victory to His slave and He \nAlone defeated all the clans.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَفَلَ مِنَ الْحَجِّ أَوِ الْعُمْرَةِ ـ وَلاَ أَعْلَمُهُ إِلاَّ قَالَ الْغَزْوِ ـ يَقُولُ كُلَّمَا أَوْفَى عَلَى ثَنِيَّةٍ أَوْ فَدْفَدٍ كَبَّرَ ثَلاَثًا ثُمَّ قَالَ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏ قَالَ صَالِحٌ فَقُلْتُ لَهُ أَلَمْ يَقُلْ عَبْدُ اللَّهِ إِنْ شَاءَ اللَّهُ قَالَ لاَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2995In-book reference : Book 56, Hadith 204USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2996,
    "id": 2996,
    "url": "https://sunnah.com/bukhari:2996",
    "bookNumber": 56,
    "hadithNumber": 205,
    "narrator": "Narrated Ibrahim Abu Isma`il As-Saksaki:",
    "english": "I heard Abu Burda who accompanied Yazid bin Abi Kabsha on a journey. Yazid used to observe \nfasting on journeys. Abu Burda said to him, \"I heard Abu Musa several times saying that Allah's \nApostle said, 'When a slave falls ill or travels, then he will get reward similar to that he gets for good \ndeeds practiced at home when in good health.\"",
    "arabic": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا الْعَوَّامُ، حَدَّثَنَا إِبْرَاهِيمُ أَبُو إِسْمَاعِيلَ السَّكْسَكِيُّ، قَالَ سَمِعْتُ أَبَا بُرْدَةَ، وَاصْطَحَبَ، هُوَ وَيَزِيدُ بْنُ أَبِي كَبْشَةَ فِي سَفَرٍ، فَكَانَ يَزِيدُ يَصُومُ فِي السَّفَرِ فَقَالَ لَهُ أَبُو بُرْدَةَ سَمِعْتُ أَبَا مُوسَى مِرَارًا يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا مَرِضَ الْعَبْدُ أَوْ سَافَرَ، كُتِبَ لَهُ مِثْلُ مَا كَانَ يَعْمَلُ مُقِيمًا صَحِيحًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2996In-book reference : Book 56, Hadith 205USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2997,
    "id": 2997,
    "url": "https://sunnah.com/bukhari:2997",
    "bookNumber": 56,
    "hadithNumber": 206,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "On the day of the battle of the Trench, the Prophet (ﷺ) wanted somebody from amongst the people to \nvolunteer to be a reconnoitre. Az-Zubair volunteered. He demanded the same again and Az-Zubair \nvolunteered again. Then he repeated the same demand (thrice) and AzZubair volunteered once more. \nThe Prophet (ﷺ) then said, \" Every prophet has a disciple and my disciple is Az-Zubair.\"",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ نَدَبَ النَّبِيُّ صلى الله عليه وسلم النَّاسَ يَوْمَ الْخَنْدَقِ، فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَحَوَارِيَّ الزُّبَيْرُ ‏\"‏‏.‏ قَالَ سُفْيَانُ الْحَوَارِيُّ النَّاصِرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2997In-book reference : Book 56, Hadith 206USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2998,
    "id": 2998,
    "url": "https://sunnah.com/bukhari:2998",
    "bookNumber": 56,
    "hadithNumber": 207,
    "narrator": "Narrated Ibn' `Umar:",
    "english": "from the Prophet (ﷺ) the following Hadith (No. 242).\nNarrated Ibn `Umar:\n\nThe Prophet (ﷺ) said, \"If the people knew what I know about traveling alone, then nobody would travel \nalone at night.\"",
    "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي أَبِي، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏   حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي الْوَحْدَةِ مَا أَعْلَمُ مَا سَارَ رَاكِبٌ بِلَيْلٍ وَحْدَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2998In-book reference : Book 56, Hadith 207USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 2999,
    "id": 2999,
    "url": "https://sunnah.com/bukhari:2999",
    "bookNumber": 56,
    "hadithNumber": 208,
    "narrator": "Narrated Hisham's father:",
    "english": "Usama bin Zaid was asked at what pace the Prophet (ﷺ) rode during Hajjat-ul-Wada` \"He rode at a \nmedium pace, but when he came upon an open way he would go at full pace.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، سُئِلَ أُسَامَةُ بْنُ زَيْدٍ ـ رضى الله عنهما ـ كَانَ يَحْيَى يَقُولُ وَأَنَا أَسْمَعُ فَسَقَطَ عَنِّي ـ عَنْ مَسِيرِ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، قَالَ فَكَانَ يَسِيرُ الْعَنَقَ، فَإِذَا وَجَدَ فَجْوَةً نَصَّ‏.‏ وَالنَّصُّ فَوْقَ الْعَنَقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 2999In-book reference : Book 56, Hadith 208USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 3000,
    "id": 3000,
    "url": "https://sunnah.com/bukhari:3000",
    "bookNumber": 56,
    "hadithNumber": 209,
    "narrator": "Narrated Aslam:",
    "english": "While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the \nsevere illness of Safiya bint Abi Ubaid (i.e. his wife), so he proceeded at greater speed, and when the \ntwilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I \nsaw the Prophet (ﷺ) delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry \non a journey.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ ـ هُوَ ابْنُ أَسْلَمَ ـ عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ بِطَرِيقِ مَكَّةَ، فَبَلَغَهُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ شِدَّةُ وَجَعٍ، فَأَسْرَعَ السَّيْرَ حَتَّى إِذَا كَانَ بَعْدَ غُرُوبِ الشَّفَقِ، ثُمَّ نَزَلَ فَصَلَّى الْمَغْرِبَ وَالْعَتَمَةَ، يَجْمَعُ بَيْنَهُمَا، وَقَالَ إِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ أَخَّرَ الْمَغْرِبَ وَجَمَعَ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 3000In-book reference : Book 56, Hadith 209USC-MSA web (English) reference : Vol. 4, Book 52, Hadith 244   (deprecated numbering scheme)"
  }
]