[
  {
    "hadithGlobalNumber": 7084,
    "id": 7084,
    "url": "https://sunnah.com/bukhari:7084",
    "bookNumber": 92,
    "hadithNumber": 35,
    "narrator": "Narrated Hudhaifa bin Al-Yaman:",
    "english": "The people used to ask Allah's Messenger (ﷺ) about the good but I used to ask him about the evil lest I \nshould be overtaken by them. So I said, \"O Allah's Messenger (ﷺ)! We were living in ignorance and in an \n(extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil \nafter this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but \nit will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some \npeople who will guide others not according to my tradition? You will approve of some of their deeds \nand disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, \n(there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their \ncall, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them \nto us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do \nyou order me to do if such a state should take place in my life?\" He said, \"Stick to the group of \nMuslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" \nHe said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death \novertakes you while you are in that state.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جَابِرٍ، حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ الْحَضْرَمِيُّ، أَنَّهُ سَمِعَ أَبَا إِدْرِيسَ الْخَوْلاَنِيَّ، أَنَّهُ سَمِعَ حُذَيْفَةَ بْنَ الْيَمَانِ، يَقُولُ كَانَ النَّاسُ يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْخَيْرِ، وَكُنْتُ أَسْأَلُهُ عَنِ الشَّرِّ، مَخَافَةَ أَنْ يُدْرِكَنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ، فَهَلْ بَعْدَ هَذَا الْخَيْرِ مِنْ شَرٍّ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ وَهَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ قَالَ ‏\"‏ نَعَمْ، وَفِيهِ دَخَنٌ ‏\"‏‏.‏ قُلْتُ وَمَا دَخَنُهُ قَالَ ‏\"‏ قَوْمٌ يَهْدُونَ بِغَيْرِ هَدْىٍ، تَعْرِفُ مِنْهُمْ وَتُنْكِرُ ‏\"‏‏.‏ قُلْتُ فَهَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ قَالَ ‏\"‏ نَعَمْ، دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ، مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا‏.‏ قَالَ ‏\"‏ هُمْ مِنْ جِلْدَتِنَا، وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا ‏\"‏‏.‏ قُلْتُ فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ قَالَ ‏\"‏ تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ ‏\"‏‏.‏ قُلْتُ فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلاَ إِمَامٌ قَالَ ‏\"‏ فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا، وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ، حَتَّى يُدْرِكَكَ الْمَوْتُ، وَأَنْتَ عَلَى ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7084In-book reference : Book 92, Hadith 35USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 206   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7085,
    "id": 7085,
    "url": "https://sunnah.com/bukhari:7085",
    "bookNumber": 92,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Al-Aswad:",
    "english": "An army unit was being recruited from the people of Medina and my name was written among them. \nThen I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn \n`Abbas told me that there were some Muslims who were with the pagans to increase their number \nagainst Allah's Messenger (ﷺ) (and the Muslim army) so arrows (from the Muslim army) would hit one of \nthem and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- \n'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying \namong the disbelievers).' (4.97)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ، وَغَيْرُهُ، قَالاَ حَدَّثَنَا أَبُو الأَسْوَدِ،‏.‏ وَقَالَ اللَّيْثُ عَنْ أَبِي الأَسْوَدِ، قَالَ قُطِعَ عَلَى أَهْلِ الْمَدِينَةِ بَعْثٌ فَاكْتُتِبْتُ فِيهِ فَلَقِيتُ عِكْرِمَةَ فَأَخْبَرْتُهُ فَنَهَانِي أَشَدَّ النَّهْىِ ثُمَّ قَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ أُنَاسًا مِنَ الْمُسْلِمِينَ كَانُوا مَعَ الْمُشْرِكِينَ يُكَثِّرُونَ سَوَادَ الْمُشْرِكِينَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَأْتِي السَّهْمُ فَيُرْمَى فَيُصِيبُ أَحَدَهُمْ، فَيَقْتُلُهُ أَوْ يَضْرِبُهُ فَيَقْتُلُهُ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلاَئِكَةُ ظَالِمِي أَنْفُسِهِمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 7085In-book reference : Book 92, Hadith 36USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 207   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7086,
    "id": 7086,
    "url": "https://sunnah.com/bukhari:7086",
    "bookNumber": 92,
    "hadithNumber": 37,
    "narrator": "Narrated Hudhaifa:",
    "english": "Allah's Messenger (ﷺ) related to us, two prophetic narrations one of which I have seen fulfilled and I am \nwaiting for the fulfillment of the other. The Prophet (ﷺ) told us that the virtue of honesty descended in the \nroots of men's hearts (from Allah) and then they learned it from the Qur'an and then they learned it \nfrom the Sunna (the Prophet's traditions). The Prophet (ﷺ) further told us how that honesty will be taken \naway: He said: \"Man will go to sleep during which honesty will be taken away from his heart and only \nits trace will remain in his heart like the trace of a dark spot; then man will go to sleep, during which \nhonesty will decrease further still, so that its trace will resemble the trace of blister as when an ember \nis dropped on one's foot which would make it swell, and one would see it swollen but there would be \nnothing inside. People would be carrying out their trade but hardly will there be a trustworthy person. \nIt will be said, 'in such-and-such tribe there is an honest man,' and later it will be said about some man, \n'What a wise, polite and strong man he is!' Though he will not have faith equal even to a mustard seed \nin his heart.\" No doubt, there came upon me a time when I did not mind dealing (bargaining) with \nanyone of you, for if he was a Muslim his Islam would compel him to pay me what is due to me, and \nif he was a Christian, the Muslim official would compel him to pay me what is due to me, but today I \ndo not deal except with such-and-such person.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ زَيْدِ بْنِ وَهْبٍ، حَدَّثَنَا حُذَيْفَةُ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الآخَرَ حَدَّثَنَا ‏\"‏ أَنَّ الأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ، ثُمَّ عَلِمُوا مِنَ الْقُرْآنِ، ثُمَّ عَلِمُوا مِنَ السُّنَّةِ ‏\"‏‏.‏ وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ ‏\"‏ يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الأَمَانَةُ مِنْ قَلْبِهِ، فَيَظَلُّ أَثَرُهَا مِثْلَ أَثَرِ الْوَكْتِ، ثُمَّ يَنَامُ النَّوْمَةَ فَتُقْبَضُ فَيَبْقَى فِيهَا أَثَرُهَا مِثْلَ أَثَرِ الْمَجْلِ، كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ، فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَىْءٌ، وَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ فَلاَ يَكَادُ أَحَدٌ يُؤَدِّي الأَمَانَةَ فَيُقَالُ إِنَّ فِي بَنِي فُلاَنٍ رَجُلاً أَمِينًا‏.‏ وَيُقَالُ لِلرَّجُلِ مَا أَعْقَلَهُ، وَمَا أَظْرَفَهُ، وَمَا أَجْلَدَهُ، وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ، وَلَقَدْ أَتَى عَلَىَّ زَمَانٌ، وَلاَ أُبَالِي أَيُّكُمْ بَايَعْتُ، لَئِنْ كَانَ مُسْلِمًا رَدَّهُ عَلَىَّ الإِسْلاَمُ، وَإِنْ كَانَ نَصْرَانِيًّا رَدَّهُ عَلَىَّ سَاعِيهِ، وَأَمَّا الْيَوْمَ فَمَا كُنْتُ أُبَايِعُ إِلاَّ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7086In-book reference : Book 92, Hadith 37USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 208   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7087,
    "id": 7087,
    "url": "https://sunnah.com/bukhari:7087",
    "bookNumber": 92,
    "hadithNumber": 38,
    "narrator": "Narrated Salama bin Al-Akwa`:",
    "english": "That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your \nheels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but \nAllah's Messenger (ﷺ) allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: \nWhen `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- \nRabadha and married there and begot children, and he stayed there till a few nights before his death \nwhen he came to Medina.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ يَا ابْنَ الأَكْوَعِ ارْتَدَدْتَ عَلَى عَقِبَيْكَ تَعَرَّبْتَ قَالَ لاَ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَذِنَ لِي فِي الْبَدْوِ‏.‏ وَعَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ قَالَ لَمَّا قُتِلَ عُثْمَانُ بْنُ عَفَّانَ خَرَجَ سَلَمَةُ بْنُ الأَكْوَعِ إِلَى الرَّبَذَةِ، وَتَزَوَّجَ هُنَاكَ امْرَأَةً وَوَلَدَتْ لَهُ أَوْلاَدًا، فَلَمْ يَزَلْ بِهَا حَتَّى قَبْلَ أَنْ يَمُوتَ بِلَيَالٍ، فَنَزَلَ الْمَدِينَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7087In-book reference : Book 92, Hadith 38USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 209   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7088,
    "id": 7088,
    "url": "https://sunnah.com/bukhari:7088",
    "bookNumber": 92,
    "hadithNumber": 39,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) said, \"There will come a time when the best property of a Muslim will be sheep which \nhe will take to the tops of mountains and the places of rainfall so as to flee with his religion from the \nafflictions.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ، يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7088In-book reference : Book 92, Hadith 39USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 210   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7089,
    "id": 7089,
    "url": "https://sunnah.com/bukhari:7089",
    "bookNumber": 92,
    "hadithNumber": 40,
    "narrator": "Narrated Anas:",
    "english": "The people started asking the Prophet (ﷺ) too many questions importunately. So one day he ascended the \npulpit and said, \"You will not ask me any question but I will explain it to you.\" I looked right and left, \nand behold, every man was covering his head with his garment and weeping. Then got up a man who, \nwhenever quarreling with somebody, used to be accused of not being the son of his father. He said, \"O \nAllah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then `Umar got \nup and said, \"We accept Allah as our Lord, Islam as our religion and Muhammad as our Apostle and \nwe seek refuge with Allah from the evil of afflictions.\" The Prophet (ﷺ) said, \" I have never seen the good \nand bad like on this day. No doubt, Paradise and Hell was displayed in front of me till I saw them in \nfront of that wall,\" Qatada said: This Hadith used to be mentioned as an explanation of this Verse:-- 'O \nyou who believe! Ask not questions about things which, if made plain to you, may cause you trouble.' \n(5.101)",
    "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سَأَلُوا النَّبِيَّ صلى الله عليه وسلم حَتَّى أَحْفَوْهُ بِالْمَسْأَلَةِ، فَصَعِدَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ يَوْمٍ الْمِنْبَرَ فَقَالَ ‏\"‏ لاَ تَسْأَلُونِي عَنْ شَىْءٍ إِلاَّ بَيَّنْتُ لَكُمْ ‏\"‏‏.‏ فَجَعَلْتُ أَنْظُرُ يَمِينًا وَشِمَالاً، فَإِذَا كُلُّ رَجُلٍ رَأْسُهُ فِي ثَوْبِهِ يَبْكِي، فَأَنْشَأَ رَجُلٌ كَانَ إِذَا لاَحَى يُدْعَى إِلَى غَيْرِ أَبِيهِ فَقَالَ يَا نَبِيَّ اللَّهِ مَنْ أَبِي فَقَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَنْشَأَ عُمَرُ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ رَسُولاً، نَعُوذُ بِاللَّهِ مِنْ سُوءِ الْفِتَنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا رَأَيْتُ فِي الْخَيْرِ وَالشَّرِّ كَالْيَوْمِ قَطُّ، إِنَّهُ صُوِّرَتْ لِي الْجَنَّةُ وَالنَّارُ حَتَّى رَأَيْتُهُمَا دُونَ الْحَائِطِ ‏\"‏‏.‏ قَالَ قَتَادَةُ يُذْكَرُ هَذَا الْحَدِيثُ عِنْدَ هَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏",
    "reference": "Reference : Sahih al-Bukhari 7089In-book reference : Book 92, Hadith 40USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7090,
    "id": 7090,
    "url": "https://sunnah.com/bukhari:7090",
    "bookNumber": 92,
    "hadithNumber": 41,
    "narrator": "",
    "english": "The the above hadith was narrated by Anas through another chain and said (with the wording) \"and every man had his head wrapped in his garment and weeping\".  And he said (with the wording) \"seeking refuge with Allah from the evil of afflictions\" or he said \"I seek refuge with Allah from the evil of afflictions.\"",
    "arabic": "وَقَالَ عَبَّاسٌ النَّرْسِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسًا، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم بِهَذَا وَقَالَ كُلُّ رَجُلٍ لاَفًّا رَأْسَهُ فِي ثَوْبِهِ يَبْكِي‏.‏ وَقَالَ عَائِذًا بِاللَّهِ مِنْ سُوءِ الْفِتَنِ‏.‏ أَوْ قَالَ أَعُوذُ بِاللَّهِ مِنْ سُوءِ الْفِتَنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7090In-book reference : Book 92, Hadith 41USC-MSA web (English) reference : Vol. 1, Book 88, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7091,
    "id": 7091,
    "url": "https://sunnah.com/bukhari:7091",
    "bookNumber": 92,
    "hadithNumber": 42,
    "narrator": "Narrated Anas:",
    "english": "The above hadith is narrated on the authority of Anas thorugh another chain and he said (with the wording) \"seeking refuge with Allah from the evil of afflictions.\"",
    "arabic": "وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، وَمُعْتَمِرٌ، عَنْ أَبِيهِ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا وَقَالَ عَائِذًا بِاللَّهِ مِنْ شَرِّ الْفِتَنِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7091In-book reference : Book 92, Hadith 42USC-MSA web (English) reference : Vol. 1, Book 88, Hadith 211   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7092,
    "id": 7092,
    "url": "https://sunnah.com/bukhari:7092",
    "bookNumber": 92,
    "hadithNumber": 43,
    "narrator": "Narrated Salim's father:",
    "english": "The Prophet (ﷺ) stood up beside the pulpit (and pointed with his finger towards the East) and said, \n\"Afflictions are there! Afflictions are there, from where the side of the head of Satan comes out,\" or \nsaid, \"..the side of the sun..\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَامَ إِلَى جَنْبِ الْمِنْبَرِ فَقَالَ ‏\"‏ الْفِتْنَةُ هَا هُنَا الْفِتْنَةُ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ قَرْنُ الشَّمْسِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7092In-book reference : Book 92, Hadith 43USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 212   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7093,
    "id": 7093,
    "url": "https://sunnah.com/bukhari:7093",
    "bookNumber": 92,
    "hadithNumber": 44,
    "narrator": "Narrated Ibn `Umar:",
    "english": "I heard Allah's Messenger (ﷺ) while he was facing the East, saying, \"Verily! Afflictions are there, from \nwhere the side of the head of Satan comes out.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ مُسْتَقْبِلٌ الْمَشْرِقَ يَقُولُ ‏\n\"‏ أَلاَ إِنَّ الْفِتْنَةَ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7093In-book reference : Book 92, Hadith 44USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 213   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7094,
    "id": 7094,
    "url": "https://sunnah.com/bukhari:7094",
    "bookNumber": 92,
    "hadithNumber": 45,
    "narrator": "Narrated Ibn `Umar:",
    "english": "The Prophet (ﷺ) said, \"O Allah! Bestow Your blessings on our Sham! O Allah! Bestow Your blessings on \nour Yemen.\" The People said, \"And also on our Najd.\" He said, \"O Allah! Bestow Your blessings on \nour Sham (north)! O Allah! Bestow Your blessings on our Yemen.\" The people said, \"O Allah's \nApostle! And also on our Najd.\" I think the third time the Prophet (ﷺ) said, \"There (in Najd) is the place \nof earthquakes and afflictions and from there comes out the side of the head of Satan.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ ذَكَرَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي شَأْمِنَا، اللَّهُمَّ بَارِكْ لَنَا فِي يَمَنِنَا ‏\"‏‏.‏ قَالُوا وَفِي نَجْدِنَا‏.‏ قَالَ ‏\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي شَأْمِنَا، اللَّهُمَّ بَارِكْ لَنَا فِي يَمَنِنَا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَفِي نَجْدِنَا فَأَظُنُّهُ قَالَ فِي الثَّالِثَةَ ‏\"‏ هُنَاكَ الزَّلاَزِلُ وَالْفِتَنُ، وَبِهَا يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7094In-book reference : Book 92, Hadith 45USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 214   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7095,
    "id": 7095,
    "url": "https://sunnah.com/bukhari:7095",
    "bookNumber": 92,
    "hadithNumber": 46,
    "narrator": "Narrated Sa`id bin Jubair:",
    "english": "`Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before \nwe asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles \nduring the time of the afflictions, as Allah says:-- \n'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" \n(2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother \nbereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion \n(The pagans will either kill him or chain him as a captive). His fighting was not like your fighting \nwhich is carried on for the sake of ruling.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ بَيَانٍ، عَنْ وَبَرَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ بْنُ عُمَرَ فَرَجَوْنَا أَنْ يُحَدِّثَنَا، حَدِيثًا حَسَنًا ـ قَالَ ـ فَبَادَرَنَا إِلَيْهِ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ حَدِّثْنَا عَنِ الْقِتَالِ فِي الْفِتْنَةِ وَاللَّهُ يَقُولُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏ فَقَالَ هَلْ تَدْرِي مَا الْفِتْنَةُ ثَكِلَتْكَ أُمُّكَ، إِنَّمَا كَانَ مُحَمَّدٌ صلى الله عليه وسلم يُقَاتِلُ الْمُشْرِكِينَ، وَكَانَ الدُّخُولُ فِي دِينِهِمْ فِتْنَةً، وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7095In-book reference : Book 92, Hadith 46USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 215   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7096,
    "id": 7096,
    "url": "https://sunnah.com/bukhari:7096",
    "bookNumber": 92,
    "hadithNumber": 47,
    "narrator": "Narrated Shaqiq:",
    "english": "I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the \nstatement of the Prophet (ﷺ) about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, \nhis property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and \nenjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about \nthose afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O \nchief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door \nbe broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I \nsaid, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I \nknow that there will be night before tomorrow morning, that is because I narrated to him a true \nnarration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we \nordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، سَمِعْتُ حُذَيْفَةَ، يَقُولُ بَيْنَا نَحْنُ جُلُوسٌ عِنْدَ عُمَرَ قَالَ أَيُّكُمْ يَحْفَظُ قَوْلَ النَّبِيِّ صلى الله عليه وسلم فِي الْفِتْنَةِ‏.‏ قَالَ ‏\n\"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَوَلَدِهِ وَجَارِهِ، تُكَفِّرُهَا الصَّلاَةُ وَالصَّدَقَةُ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏‏.‏ قَالَ لَيْسَ عَنْ هَذَا أَسْأَلُكَ، وَلَكِنِ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ‏.‏ قَالَ لَيْسَ عَلَيْكَ مِنْهَا بَأْسٌ يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا‏.‏ قَالَ عُمَرُ أَيُكْسَرُ الْبَابُ أَمْ يُفْتَحُ قَالَ بَلْ يُكْسَرُ‏.‏ قَالَ عُمَرُ إِذًا لاَ يُغْلَقَ أَبَدًا‏.‏ قُلْتُ أَجَلْ‏.‏ قُلْنَا لِحُذَيْفَةَ أَكَانَ عُمَرُ يَعْلَمُ الْبَابَ قَالَ نَعَمْ كَمَا أَعْلَمُ أَنَّ دُونَ غَدٍ لَيْلَةً، وَذَلِكَ أَنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالأَغَالِيطِ‏.‏ فَهِبْنَا أَنْ نَسْأَلَهُ مَنِ الْبَابُ فَأَمَرْنَا مَسْرُوقًا فَسَأَلَهُ فَقَالَ مَنِ الْبَابُ قَالَ عُمَرُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7096In-book reference : Book 92, Hadith 47USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 216   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7097,
    "id": 7097,
    "url": "https://sunnah.com/bukhari:7097",
    "bookNumber": 92,
    "hadithNumber": 48,
    "narrator": "Narrated Abu Musa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) went out to one of the gardens of Medina for some business and I went out to follow him. \nWhen he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the \nProphet though he has not ordered me.\" The Prophet (ﷺ) went and finished his need and went to sit on the \nconstructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu \nBakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr \nwaited outside and I went to the Prophet (ﷺ) and said, \"O Allah's Prophet! Abu Bakr asks your permission \nto enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr \nentered and sat on the right side of the Prophet (ﷺ) and uncovered his legs and hung them in the well. \nThen `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet (ﷺ) said, \"Admit him \nand give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the \nProphet and uncovered his legs and hung them in the well so that one side of the well became fully \noccupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \n\"Wait till I get permission for you.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of \nentering Paradise with a calamity which will befall him.\" When he entered, he could not find any \nplace to sit with them so he went to the other edge of the well opposite them and uncovered his legs \nand hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his \ncoming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three \nare together and the grave of `Uthman is separate from theirs.\")",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى حَائِطٍ مِنْ حَوَائِطِ الْمَدِينَةِ لِحَاجَتِهِ، وَخَرَجْتُ فِي إِثْرِهِ، فَلَمَّا دَخَلَ الْحَائِطَ جَلَسْتُ عَلَى بَابِهِ وَقُلْتُ لأَكُونَنَّ الْيَوْمَ بَوَّابَ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَأْمُرْنِي فَذَهَبَ النَّبِيُّ صلى الله عليه وسلم وَقَضَى حَاجَتَهُ، وَجَلَسَ عَلَى قُفِّ الْبِئْرِ، فَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ، فَجَاءَ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَيْهِ لِيَدْخُلَ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ، فَوَقَفَ فَجِئْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ يَا نَبِيَّ اللَّهِ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَيْكَ‏.‏ قَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَدَخَلَ فَجَاءَ عَنْ يَمِينِ النَّبِيِّ صلى الله عليه وسلم فَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ، فَجَاءَ عُمَرُ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَجَاءَ عَنْ يَسَارِ النَّبِيِّ صلى الله عليه وسلم فَكَشَفَ عَنْ سَاقَيْهِ فَدَلاَّهُمَا فِي الْبِئْرِ، فَامْتَلأَ الْقُفُّ فَلَمْ يَكُنْ فِيهِ مَجْلِسٌ، ثُمَّ جَاءَ عُثْمَانُ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ، مَعَهَا بَلاَءٌ يُصِيبُهُ ‏\"‏‏.‏ فَدَخَلَ فَلَمْ يَجِدْ مَعَهُمْ مَجْلِسًا، فَتَحَوَّلَ حَتَّى جَاءَ مُقَابِلَهُمْ عَلَى شَفَةِ الْبِئْرِ، فَكَشَفَ عَنْ سَاقَيْهِ ثُمَّ دَلاَّهُمَا فِي الْبِئْرِ‏.‏ فَجَعَلْتُ أَتَمَنَّى أَخًا لِي وَأَدْعُو اللَّهَ أَنْ يَأْتِيَ‏.‏ قَالَ ابْنُ الْمُسَيَّبِ فَتَأَوَّلْتُ ذَلِكَ قُبُورَهُمُ اجْتَمَعَتْ هَا هُنَا وَانْفَرَدَ عُثْمَانُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7097In-book reference : Book 92, Hadith 48USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 217   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7098,
    "id": 7098,
    "url": "https://sunnah.com/bukhari:7098",
    "bookNumber": 92,
    "hadithNumber": 49,
    "narrator": "Narrated Abu Wail:",
    "english": "Someone said to Usama, \"Will you not talk to this (Uthman)?\" Usama said, \"I talked to him (secretly) \nwithout being the first man to open an evil door. I will never tell a ruler who rules over two men or \nmore that he is good after I heard Allah's Messenger (ﷺ) saying, 'A man will be brought and put in Hell (Fire) \nand he will circumambulate (go around and round) in Hell (Fire) like a donkey of a (flour) grinding \nmill, and all the people of Hell (Fire) will gather around him and will say to him, O so-and-so! Didn't \nyou use to order others for good and forbid them from evil?' That man will say, 'I used to order others \nto do good but I myself never used to do it, and I used to forbid others from evil while I myself used to \ndo evil.' \"",
    "arabic": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ أَبَا وَائِلٍ، قَالَ قِيلَ لأُسَامَةَ أَلاَ تُكَلِّمُ هَذَا‏.‏ قَالَ قَدْ كَلَّمْتُهُ مَا دُونَ أَنْ أَفْتَحَ بَابًا، أَكُونُ أَوَّلَ مَنْ يَفْتَحُهُ، وَمَا أَنَا بِالَّذِي أَقُولُ لِرَجُلٍ بَعْدَ أَنْ يَكُونَ أَمِيرًا عَلَى رَجُلَيْنِ أَنْتَ خَيْرٌ‏.‏ بَعْدَ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُجَاءُ بِرَجُلٍ فَيُطْرَحُ فِي النَّارِ، فَيَطْحَنُ فِيهَا كَطَحْنِ الْحِمَارِ بِرَحَاهُ، فَيُطِيفُ بِهِ أَهْلُ النَّارِ فَيَقُولُونَ أَىْ فُلاَنُ أَلَسْتَ كُنْتَ تَأْمُرُ بِالْمَعْرُوفِ، وَتَنْهَى عَنِ الْمُنْكَرِ فَيَقُولُ إِنِّي كُنْتُ آمُرُ بِالْمَعْرُوفِ وَلاَ أَفْعَلُهُ، وَأَنْهَى عَنِ الْمُنْكَرِ وَأَفْعَلُهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7098In-book reference : Book 92, Hadith 49USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 218   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7099,
    "id": 7099,
    "url": "https://sunnah.com/bukhari:7099",
    "bookNumber": 92,
    "hadithNumber": 50,
    "narrator": "Narrated Abu Bakra:",
    "english": "During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the \nProphet heard the news that the people of the Persia had made the daughter of Khosrau their Queen \n(ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ لَقَدْ نَفَعَنِي اللَّهُ بِكَلِمَةٍ أَيَّامَ الْجَمَلِ لَمَّا بَلَغَ النَّبِيَّ صلى الله عليه وسلم أَنَّ فَارِسًا مَلَّكُوا ابْنَةَ كِسْرَى قَالَ ‏\n\"‏ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7099In-book reference : Book 92, Hadith 50USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 219   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7100,
    "id": 7100,
    "url": "https://sunnah.com/bukhari:7100",
    "bookNumber": 92,
    "hadithNumber": 51,
    "narrator": "Narrated Abu Maryam `Abdullah bin Ziyad Al-Aasadi:",
    "english": "When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali \nwho came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and \n`Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو حَصِينٍ، حَدَّثَنَا أَبُو مَرْيَمَ عَبْدُ اللَّهِ بْنُ زِيَادٍ الأَسَدِيُّ، قَالَ لَمَّا سَارَ طَلْحَةُ وَالزُّبَيْرُ وَعَائِشَةُ إِلَى الْبَصْرَةِ بَعَثَ عَلِيٌّ عَمَّارَ بْنَ يَاسِرٍ وَحَسَنَ بْنَ عَلِيٍّ، فَقَدِمَا عَلَيْنَا الْكُوفَةَ فَصَعِدَا الْمِنْبَرَ، فَكَانَ الْحَسَنُ بْنُ عَلِيٍّ فَوْقَ الْمِنْبَرِ فِي أَعْلاَهُ، وَقَامَ عَمَّارٌ أَسْفَلَ مِنَ الْحَسَنِ، فَاجْتَمَعْنَا إِلَيْهِ فَسَمِعْتُ عَمَّارًا يَقُولُ إِنَّ عَائِشَةَ قَدْ سَارَتْ إِلَى الْبَصْرَةِ، وَوَاللَّهِ إِنَّهَا لَزَوْجَةُ نَبِيِّكُمْ صلى الله عليه وسلم فِي الدُّنْيَا وَالآخِرَةِ، وَلَكِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى ابْتَلاَكُمْ، لِيَعْلَمَ إِيَّاهُ تُطِيعُونَ أَمْ هِيَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7100In-book reference : Book 92, Hadith 51USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 220   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7101,
    "id": 7101,
    "url": "https://sunnah.com/bukhari:7101",
    "bookNumber": 92,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Wail:",
    "english": "`Ammar stood on the pulpit at Kufa and mentioned `Aisha and her coming (to Busra) and said, \"She is \nthe wife of your Prophet in this world and in the Hereafter, but you people are being put to test in this \nissue.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ، عَنِ الْحَكَمِ، عَنْ أَبِي وَائِلٍ، قَامَ عَمَّارٌ عَلَى مِنْبَرِ الْكُوفَةِ، فَذَكَرَ عَائِشَةَ وَذَكَرَ مَسِيرَهَا وَقَالَ إِنَّهَا زَوْجَةُ نَبِيِّكُمْ صلى الله عليه وسلم فِي الدُّنْيَا وَالآخِرَةِ، وَلَكِنَّهَا مِمَّا ابْتُلِيتُمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7101In-book reference : Book 92, Hadith 52USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 221   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7102,
    "id": 7102,
    "url": "https://sunnah.com/bukhari:7102",
    "bookNumber": 92,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Wail:",
    "english": "Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي عَمْرٌو، سَمِعْتُ أَبَا وَائِلٍ، يَقُولُ دَخَلَ أَبُو مُوسَى وَأَبُو مَسْعُودٍ عَلَى عَمَّارٍ حَيْثُ بَعَثَهُ عَلِيٌّ إِلَى أَهْلِ الْكُوفَةِ يَسْتَنْفِرُهُمْ فَقَالاَ مَا رَأَيْنَاكَ أَتَيْتَ أَمْرًا أَكْرَهَ عِنْدَنَا مِنْ إِسْرَاعِكَ فِي هَذَا الأَمْرِ مُنْذُ أَسْلَمْتَ‏.‏ فَقَالَ عَمَّارٌ مَا رَأَيْتُ مِنْكُمَا مُنْذُ أَسْلَمْتُمَا أَمْرًا أَكْرَهَ عِنْدِي مِنْ إِبْطَائِكُمَا عَنْ هَذَا الأَمْرِ‏.‏ وَكَسَاهُمَا حُلَّةً حُلَّةً، ثُمَّ رَاحُوا إِلَى الْمَسْجِدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7102, 7103, 7104In-book reference : Book 92, Hadith 53USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7103,
    "id": 7103,
    "url": "https://sunnah.com/bukhari:7103",
    "bookNumber": 92,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Wail:",
    "english": "Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي عَمْرٌو، سَمِعْتُ أَبَا وَائِلٍ، يَقُولُ دَخَلَ أَبُو مُوسَى وَأَبُو مَسْعُودٍ عَلَى عَمَّارٍ حَيْثُ بَعَثَهُ عَلِيٌّ إِلَى أَهْلِ الْكُوفَةِ يَسْتَنْفِرُهُمْ فَقَالاَ مَا رَأَيْنَاكَ أَتَيْتَ أَمْرًا أَكْرَهَ عِنْدَنَا مِنْ إِسْرَاعِكَ فِي هَذَا الأَمْرِ مُنْذُ أَسْلَمْتَ‏.‏ فَقَالَ عَمَّارٌ مَا رَأَيْتُ مِنْكُمَا مُنْذُ أَسْلَمْتُمَا أَمْرًا أَكْرَهَ عِنْدِي مِنْ إِبْطَائِكُمَا عَنْ هَذَا الأَمْرِ‏.‏ وَكَسَاهُمَا حُلَّةً حُلَّةً، ثُمَّ رَاحُوا إِلَى الْمَسْجِدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7102, 7103, 7104In-book reference : Book 92, Hadith 53USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7104,
    "id": 7104,
    "url": "https://sunnah.com/bukhari:7104",
    "bookNumber": 92,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Wail:",
    "english": "Abu Musa and Abii Mas`ud went to `Ammar when `Ali had sent him to Kufa to exhort them to fight \n(on `Ali's side). They said to him, \"Since you have become a Muslim, we have never seen you doing a \ndeed more criticizable to us than your haste in this matter.\" `Ammar said, \"Since you (both) became \nMuslims, I have never seen you doing a deed more criticizable to me than your keeping away from \nthis matter.\" Then Abu Mas`ud provided `Ammar and Abu Musa with two-piece outfits to wear, and \none of them went to the mosque (of Kufa).",
    "arabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي عَمْرٌو، سَمِعْتُ أَبَا وَائِلٍ، يَقُولُ دَخَلَ أَبُو مُوسَى وَأَبُو مَسْعُودٍ عَلَى عَمَّارٍ حَيْثُ بَعَثَهُ عَلِيٌّ إِلَى أَهْلِ الْكُوفَةِ يَسْتَنْفِرُهُمْ فَقَالاَ مَا رَأَيْنَاكَ أَتَيْتَ أَمْرًا أَكْرَهَ عِنْدَنَا مِنْ إِسْرَاعِكَ فِي هَذَا الأَمْرِ مُنْذُ أَسْلَمْتَ‏.‏ فَقَالَ عَمَّارٌ مَا رَأَيْتُ مِنْكُمَا مُنْذُ أَسْلَمْتُمَا أَمْرًا أَكْرَهَ عِنْدِي مِنْ إِبْطَائِكُمَا عَنْ هَذَا الأَمْرِ‏.‏ وَكَسَاهُمَا حُلَّةً حُلَّةً، ثُمَّ رَاحُوا إِلَى الْمَسْجِدِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7102, 7103, 7104In-book reference : Book 92, Hadith 53USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 222   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7105,
    "id": 7105,
    "url": "https://sunnah.com/bukhari:7105",
    "bookNumber": 92,
    "hadithNumber": 54,
    "narrator": "Narrated Shaqiq bin Salama:",
    "english": "I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، كُنْتُ جَالِسًا مَعَ أَبِي مَسْعُودٍ وَأَبِي مُوسَى وَعَمَّارٍ فَقَالَ أَبُو مَسْعُودٍ مَا مِنْ أَصْحَابِكَ أَحَدٌ إِلاَّ لَوْ شِئْتُ لَقُلْتُ فِيهِ غَيْرَكَ، وَمَا رَأَيْتُ مِنْكَ شَيْئًا مُنْذُ صَحِبْتَ النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنِ اسْتِسْرَاعِكَ فِي هَذَا الأَمْرِ‏.‏ قَالَ عَمَّارٌ يَا أَبَا مَسْعُودٍ وَمَا رَأَيْتُ مِنْكَ وَلاَ مِنْ صَاحِبِكَ هَذَا شَيْئًا مُنْذُ صَحِبْتُمَا النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنْ إِبْطَائِكُمَا فِي هَذَا الأَمْرِ‏.‏ فَقَالَ أَبُو مَسْعُودٍ وَكَانَ مُوسِرًا يَا غُلاَمُ هَاتِ حُلَّتَيْنِ‏.‏ فَأَعْطَى إِحْدَاهُمَا أَبَا مُوسَى وَالأُخْرَى عَمَّارًا وَقَالَ رُوحَا فِيهِ إِلَى الْجُمُعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7105, 7106, 7107In-book reference : Book 92, Hadith 54USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7106,
    "id": 7106,
    "url": "https://sunnah.com/bukhari:7106",
    "bookNumber": 92,
    "hadithNumber": 54,
    "narrator": "Narrated Shaqiq bin Salama:",
    "english": "I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، كُنْتُ جَالِسًا مَعَ أَبِي مَسْعُودٍ وَأَبِي مُوسَى وَعَمَّارٍ فَقَالَ أَبُو مَسْعُودٍ مَا مِنْ أَصْحَابِكَ أَحَدٌ إِلاَّ لَوْ شِئْتُ لَقُلْتُ فِيهِ غَيْرَكَ، وَمَا رَأَيْتُ مِنْكَ شَيْئًا مُنْذُ صَحِبْتَ النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنِ اسْتِسْرَاعِكَ فِي هَذَا الأَمْرِ‏.‏ قَالَ عَمَّارٌ يَا أَبَا مَسْعُودٍ وَمَا رَأَيْتُ مِنْكَ وَلاَ مِنْ صَاحِبِكَ هَذَا شَيْئًا مُنْذُ صَحِبْتُمَا النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنْ إِبْطَائِكُمَا فِي هَذَا الأَمْرِ‏.‏ فَقَالَ أَبُو مَسْعُودٍ وَكَانَ مُوسِرًا يَا غُلاَمُ هَاتِ حُلَّتَيْنِ‏.‏ فَأَعْطَى إِحْدَاهُمَا أَبَا مُوسَى وَالأُخْرَى عَمَّارًا وَقَالَ رُوحَا فِيهِ إِلَى الْجُمُعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7105, 7106, 7107In-book reference : Book 92, Hadith 54USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7107,
    "id": 7107,
    "url": "https://sunnah.com/bukhari:7107",
    "bookNumber": 92,
    "hadithNumber": 54,
    "narrator": "Narrated Shaqiq bin Salama:",
    "english": "I was sitting with Abu Mas`ud and Abu Musa and `Ammar. Abu Mas`ud said (to `Ammar), \"There is \nnone of your companions but, if I wish, I could find fault with him except with you. Since you joined \nthe company of the Prophet (ﷺ) I have never seen anything done by you more criticizable by me than your \nhaste in this issue.\" `Ammar said, O Abu Mas`ud ! I have never seen anything done by you or by this \ncompanion of yours (i.e., Abu Musa) more criticizable by me than your keeping away from this issue \nsince the time you both joined the company of the Prophet.\" \nThen Abu Mas`ud who was a rich man, said (to his servant), \"O boy! Bring two suits.\" Then he gave \none to Abu Musa and the other to `Ammar and said (to them), \"Put on these suits before going for the \nFriday prayer. \"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، كُنْتُ جَالِسًا مَعَ أَبِي مَسْعُودٍ وَأَبِي مُوسَى وَعَمَّارٍ فَقَالَ أَبُو مَسْعُودٍ مَا مِنْ أَصْحَابِكَ أَحَدٌ إِلاَّ لَوْ شِئْتُ لَقُلْتُ فِيهِ غَيْرَكَ، وَمَا رَأَيْتُ مِنْكَ شَيْئًا مُنْذُ صَحِبْتَ النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنِ اسْتِسْرَاعِكَ فِي هَذَا الأَمْرِ‏.‏ قَالَ عَمَّارٌ يَا أَبَا مَسْعُودٍ وَمَا رَأَيْتُ مِنْكَ وَلاَ مِنْ صَاحِبِكَ هَذَا شَيْئًا مُنْذُ صَحِبْتُمَا النَّبِيَّ صلى الله عليه وسلم أَعْيَبَ عِنْدِي مِنْ إِبْطَائِكُمَا فِي هَذَا الأَمْرِ‏.‏ فَقَالَ أَبُو مَسْعُودٍ وَكَانَ مُوسِرًا يَا غُلاَمُ هَاتِ حُلَّتَيْنِ‏.‏ فَأَعْطَى إِحْدَاهُمَا أَبَا مُوسَى وَالأُخْرَى عَمَّارًا وَقَالَ رُوحَا فِيهِ إِلَى الْجُمُعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7105, 7106, 7107In-book reference : Book 92, Hadith 54USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 223   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7108,
    "id": 7108,
    "url": "https://sunnah.com/bukhari:7108",
    "bookNumber": 92,
    "hadithNumber": 55,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"If Allah sends punishment upon a nation then it befalls upon the whole \npopulation indiscriminately and then they will be resurrected (and judged) according to their deeds. \"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَنْزَلَ اللَّهُ بِقَوْمٍ عَذَابًا، أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ، ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7108In-book reference : Book 92, Hadith 55USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 224   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7109,
    "id": 7109,
    "url": "https://sunnah.com/bukhari:7109",
    "bookNumber": 92,
    "hadithNumber": 56,
    "narrator": "Narrated Al-Hasan Al-Basri:",
    "english": "When Al-Hasan bin `Ali moved with army units against Muawiya, `Amr bin AL-As said to Muawiya, \n\"I see an army that will not retreat unless and until the opposing army retreats.\" Muawiya said, \"(If the \nMuslims are killed) who will look after their children?\" `Amr bin Al-As said: I (will look after them). \nOn that, `Abdullah bin 'Amir and `Abdur-Rahman bin Samura said, \"Let us meet Muawaiya and \nsuggest peace.\" Al-Hasan Al-Basri added: No doubt, I heard that Abu Bakra said, \"Once while the \nProphet was addressing (the people), Al-Hasan (bin `Ali) came and the Prophet (ﷺ) said, 'This son of mine \nis a chief, and Allah may make peace between two groups of Muslims through him.\"",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا إِسْرَائِيلُ أَبُو مُوسَى، وَلَقِيتُهُ، بِالْكُوفَةِ جَاءَ إِلَى ابْنِ شُبْرُمَةَ فَقَالَ أَدْخِلْنِي عَلَى عِيسَى فَأَعِظَهُ‏.‏ فَكَأَنَّ ابْنَ شُبْرُمَةَ خَافَ عَلَيْهِ فَلَمْ يَفْعَلْ‏.‏ قَالَ حَدَّثَنَا الْحَسَنُ قَالَ لَمَّا سَارَ الْحَسَنُ بْنُ عَلِيٍّ ـ رضى الله عنهما ـ إِلَى مُعَاوِيَةَ بِالْكَتَائِبِ‏.‏ قَالَ عَمْرُو بْنُ الْعَاصِ لِمُعَاوِيَةَ أَرَى كَتِيبَةً لاَ تُوَلِّي حَتَّى تُدْبِرَ أُخْرَاهَا‏.‏ قَالَ مُعَاوِيَةُ مَنْ لِذَرَارِيِّ الْمُسْلِمِينَ‏.‏ فَقَالَ أَنَا‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عَامِرٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ نَلْقَاهُ فَنَقُولُ لَهُ الصُّلْحَ‏.‏ قَالَ الْحَسَنُ وَلَقَدْ سَمِعْتُ أَبَا بَكْرَةَ قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ جَاءَ الْحَسَنُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ ابْنِي هَذَا سَيِّدٌ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7109In-book reference : Book 92, Hadith 56USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 225   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7110,
    "id": 7110,
    "url": "https://sunnah.com/bukhari:7110",
    "bookNumber": 92,
    "hadithNumber": 57,
    "narrator": "Narrated Harmala:",
    "english": "(Usama's Maula) Usama (bin Zaid) sent me to `Ali (at Kufa) and said, \"`Ali will ask you, 'What has \nprevented your companion from joining me?' You then should say to him, 'If you (`Ali) were in the \nmouth of a lion, I would like to be with you, but in this matter I won't take any part.' \" Harmala added: \n\"`Ali didn't give me anything (when I conveyed the message to him) so I went to Hasan, Hussain and \nIbn Ja`far and they loaded my camels with much (wealth).",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عَمْرٌو أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيٍّ، أَنَّ حَرْمَلَةَ، مَوْلَى أُسَامَةَ أَخْبَرَهُ قَالَ عَمْرٌو وَقَدْ رَأَيْتُ حَرْمَلَةَ قَالَ أَرْسَلَنِي أُسَامَةُ إِلَى عَلِيٍّ وَقَالَ إِنَّهُ سَيَسْأَلُكَ الآنَ فَيَقُولُ مَا خَلَّفَ صَاحِبَكَ فَقُلْ لَهُ يَقُولُ لَكَ لَوْ كُنْتَ فِي شِدْقِ الأَسَدِ لأَحْبَبْتُ أَنْ أَكُونَ مَعَكَ فِيهِ، وَلَكِنَّ هَذَا أَمْرٌ لَمْ أَرَهُ، فَلَمْ يُعْطِنِي شَيْئًا، فَذَهَبْتُ إِلَى حَسَنٍ وَحُسَيْنٍ وَابْنِ جَعْفَرٍ فَأَوْقَرُوا لِي رَاحِلَتِي‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7110In-book reference : Book 92, Hadith 57USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 226   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7111,
    "id": 7111,
    "url": "https://sunnah.com/bukhari:7111",
    "bookNumber": 92,
    "hadithNumber": 58,
    "narrator": "Narrated Nafi`:",
    "english": "When the people of Medina dethroned Yazid bin Muawiya, Ibn `Umar gathered his special friends \nand children and said, \"I heard the Prophet (ﷺ) saying, 'A flag will be fixed for every betrayer on the Day \nof Resurrection,' and we have given the oath of allegiance to this person (Yazid) in accordance with \nthe conditions enjoined by Allah and His Apostle and I do not know of anything more faithless than \nfighting a person who has been given the oath of allegiance in accordance with the conditions \nenjoined by Allah and His Apostle , and if ever I learn that any person among you has agreed to \ndethrone Yazid, by giving the oath of allegiance (to somebody else) then there will be separation \nbetween him and me.\"",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ لَمَّا خَلَعَ أَهْلُ الْمَدِينَةِ يَزِيدَ بْنَ مُعَاوِيَةَ جَمَعَ ابْنُ عُمَرَ حَشَمَهُ وَوَلَدَهُ فَقَالَ إِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُنْصَبُ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ وَإِنَّا قَدْ بَايَعْنَا هَذَا الرَّجُلَ عَلَى بَيْعِ اللَّهِ وَرَسُولِهِ، وَإِنِّي لاَ أَعْلَمُ غَدْرًا أَعْظَمَ مِنْ أَنْ يُبَايَعَ رَجُلٌ عَلَى بَيْعِ اللَّهِ وَرَسُولِهِ، ثُمَّ يُنْصَبُ لَهُ الْقِتَالُ، وَإِنِّي لاَ أَعْلَمُ أَحَدًا مِنْكُمْ خَلَعَهُ، وَلاَ بَايَعَ فِي هَذَا الأَمْرِ، إِلاَّ كَانَتِ الْفَيْصَلَ بَيْنِي وَبَيْنَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7111In-book reference : Book 92, Hadith 58USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 227   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7112,
    "id": 7112,
    "url": "https://sunnah.com/bukhari:7112",
    "bookNumber": 92,
    "hadithNumber": 59,
    "narrator": "Narrated Abu Al-Minhal:",
    "english": "When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and \nQurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we \nentered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with \nhim and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the \npeople has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of \nbeing angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in \nmisery and were few in number and misguided, and that Allah has brought you out of all that with \nIslam and with Muhammad till He brought you to this state (of prosperity and happiness) which you \nsee now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. \nThe one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: \nand those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that \none who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly \ngain.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنْ عَوْفٍ، عَنْ أَبِي الْمِنْهَالِ، قَالَ لَمَّا كَانَ ابْنُ زِيَادٍ وَمَرْوَانُ بِالشَّأْمِ، وَوَثَبَ ابْنُ الزُّبَيْرِ بِمَكَّةَ، وَوَثَبَ الْقُرَّاءُ بِالْبَصْرَةِ، فَانْطَلَقْتُ مَعَ أَبِي إِلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ حَتَّى دَخَلْنَا عَلَيْهِ فِي دَارِهِ وَهْوَ جَالِسٌ فِي ظِلِّ عُلِّيَّةٍ لَهُ مِنْ قَصَبٍ، فَجَلَسْنَا إِلَيْهِ فَأَنْشَأَ أَبِي يَسْتَطْعِمُهُ الْحَدِيثَ فَقَالَ يَا أَبَا بَرْزَةَ أَلاَ تَرَى مَا وَقَعَ فِيهِ النَّاسُ فَأَوَّلُ شَىْءٍ سَمِعْتُهُ تَكَلَّمَ بِهِ إِنِّي احْتَسَبْتُ عِنْدَ اللَّهِ أَنِّي أَصْبَحْتُ سَاخِطًا عَلَى أَحْيَاءِ قُرَيْشٍ، إِنَّكُمْ يَا مَعْشَرَ الْعَرَبِ كُنْتُمْ عَلَى الْحَالِ الَّذِي عَلِمْتُمْ مِنَ الذِّلَّةِ وَالْقِلَّةِ وَالضَّلاَلَةِ، وَإِنَّ اللَّهَ أَنْقَذَكُمْ بِالإِسْلاَمِ وَبِمُحَمَّدٍ صلى الله عليه وسلم حَتَّى بَلَغَ بِكُمْ مَا تَرَوْنَ، وَهَذِهِ الدُّنْيَا الَّتِي أَفْسَدَتْ بَيْنَكُمْ، إِنَّ ذَاكَ الَّذِي بِالشَّأْمِ وَاللَّهِ إِنْ يُقَاتِلُ إِلاَّ عَلَى الدُّنْيَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7112In-book reference : Book 92, Hadith 59USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 228   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7113,
    "id": 7113,
    "url": "https://sunnah.com/bukhari:7113",
    "bookNumber": 92,
    "hadithNumber": 60,
    "narrator": "Narrated Abi Waih:",
    "english": "Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the \nProphet, because in those days they used to do evil deeds secretly but today they do such deeds \nopenly.'",
    "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاصِلٍ الأَحْدَبِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، قَالَ إِنَّ الْمُنَافِقِينَ الْيَوْمَ شَرٌّ مِنْهُمْ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَانُوا يَوْمَئِذٍ يُسِرُّونَ وَالْيَوْمَ يَجْهَرُونَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7113In-book reference : Book 92, Hadith 60USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 229   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7114,
    "id": 7114,
    "url": "https://sunnah.com/bukhari:7114",
    "bookNumber": 92,
    "hadithNumber": 61,
    "narrator": "Narrated Abi Asha'sha:",
    "english": "Hudhaifa said, 'In fact, it was hypocrisy that existed in the lifetime of the Prophet (ﷺ) but today it is Kufr \n(disbelief) after belief.'",
    "arabic": "حَدَّثَنَا خَلاَّدٌ، حَدَّثَنَا مِسْعَرٌ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي الشَّعْثَاءِ، عَنْ حُذَيْفَةَ، قَالَ إِنَّمَا كَانَ النِّفَاقُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَأَمَّا الْيَوْمَ فَإِنَّمَا هُوَ الْكُفْرُ بَعْدَ الإِيمَانِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7114In-book reference : Book 92, Hadith 61USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 230   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7115,
    "id": 7115,
    "url": "https://sunnah.com/bukhari:7115",
    "bookNumber": 92,
    "hadithNumber": 62,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"The Hour will not be established till a man passes by a grave of somebody and \nsays, 'Would that I were in his place.' \"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7115In-book reference : Book 92, Hadith 62USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 231   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7116,
    "id": 7116,
    "url": "https://sunnah.com/bukhari:7116",
    "bookNumber": 92,
    "hadithNumber": 63,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till the buttocks of the women of the tribe of \nDaus move while going round Dhi-al-Khalasa.\" Dhi-al-Khalasa was the idol of the Daus tribe which \nthey used to worship in the Pre Islamic Period of ignorance.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَخْبَرَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَضْطَرِبَ أَلَيَاتُ نِسَاءِ دَوْسٍ عَلَى ذِي الْخَلَصَةِ ‏\"‏‏.‏ وَذُو الْخَلَصَةَ طَاغِيَةُ دَوْسٍ الَّتِي كَانُوا يَعْبُدُونَ فِي الْجَاهِلِيَّةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7116In-book reference : Book 92, Hadith 63USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 232   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7117,
    "id": 7117,
    "url": "https://sunnah.com/bukhari:7117",
    "bookNumber": 92,
    "hadithNumber": 64,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till a man from Qahtan appears, driving the \npeople with his stick.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي سُلَيْمَانُ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بِعَصَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7117In-book reference : Book 92, Hadith 64USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 233   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7118,
    "id": 7118,
    "url": "https://sunnah.com/bukhari:7118",
    "bookNumber": 92,
    "hadithNumber": 65,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till a fire will come out of the land of Hijaz, \nand it will throw light on the necks of the camels at Busra.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ، تُضِيءُ أَعْنَاقَ الإِبِلِ بِبُصْرَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7118In-book reference : Book 92, Hadith 65USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 234   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7119,
    "id": 7119,
    "url": "https://sunnah.com/bukhari:7119",
    "bookNumber": 92,
    "hadithNumber": 66,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so \nwhoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii \nHuraira that the Prophet (ﷺ) said the same but he said, \"It (Euphrates) will uncover a mountain of gold \n(under it).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَدِّهِ، حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ، فَمَنْ حَضَرَهُ فَلاَ يَأْخُذْ مِنْهُ شَيْئًا ‏\"‏‏.‏ \nقَالَ عُقْبَةُ وَحَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏\"‏ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7119In-book reference : Book 92, Hadith 66USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 235   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7120,
    "id": 7120,
    "url": "https://sunnah.com/bukhari:7120",
    "bookNumber": 92,
    "hadithNumber": 67,
    "narrator": "Narrated Haritha bin Wahb:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Give in charity because there will come a time on the people when a \nperson will go out with his alms from place to place but will not find anybody to accept it.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنَا مَعْبَدٌ، سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تَصَدَّقُوا، فَسَيَأْتِي عَلَى النَّاسِ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ، فَلاَ يَجِدُ مَنْ يَقْبَلُهَا ‏\"‏‏.‏ قَالَ مُسَدَّدٌ حَارِثَةُ أَخُو عُبَيْدِ اللَّهِ بْنِ عُمَرَ لأُمِّهِ‏ قَالَهُ أَبُو عَبْدِ اللَّهِ.",
    "reference": "Reference : Sahih al-Bukhari 7120In-book reference : Book 92, Hadith 67USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 236   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7121,
    "id": 7121,
    "url": "https://sunnah.com/bukhari:7121",
    "bookNumber": 92,
    "hadithNumber": 68,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The Hour will not be established (1) till two big groups fight each other \nwhereupon there will be a great number of casualties on both sides and they will be following one and \nthe same religious doctrine, (2) till about thirty Dajjals (liars) appear, and each one of them will claim \nthat he is Allah's Messenger (ﷺ), (3) till the religious knowledge is taken away (by the death of Religious \nscholars) (4) earthquakes will increase in number (5) time will pass quickly, (6) afflictions will \nappear, (7) Al-Harj, (i.e., killing) will increase, (8) till wealth will be in abundance ---- so abundant \nthat a wealthy person will worry lest nobody should accept his Zakat, and whenever he will present it \nto someone, that person (to whom it will be offered) will say, 'I am not in need of it, (9) till the people \ncompete with one another in constructing high buildings, (10) till a man when passing by a grave of \nsomeone will say, 'Would that I were in his place (11) and till the sun rises from the West. So when \nthe sun will rise and the people will see it (rising from the West) they will all believe (embrace Islam) \nbut that will be the time when: (As Allah said,) 'No good will it do to a soul to believe then, if it \nbelieved not before, nor earned good (by deeds of righteousness) through its Faith.' (6.158) And the \nHour will be established while two men spreading a garment in front of them but they will not be able \nto sell it, nor fold it up; and the Hour will be established when a man has milked his she-camel and has \ntaken away the milk but he will not be able to drink it; and the Hour will be established before a man \nrepairing a tank (for his livestock) is able to water (his animals) in it; and the Hour will be established \nwhen a person has raised a morsel (of food) to his mouth but will not be able to eat it.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ عَظِيمَتَانِ، يَكُونُ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ، دَعْوَتُهُمَا وَاحِدَةٌ، وَحَتَّى يُبْعَثَ دَجَّالُونَ كَذَّابُونَ، قَرِيبٌ مِنْ ثَلاَثِينَ، كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ، وَحَتَّى يُقْبَضَ الْعِلْمُ، وَتَكْثُرَ الزَّلاَزِلُ، وَيَتَقَارَبَ الزَّمَانُ، وَتَظْهَرَ الْفِتَنُ، وَيَكْثُرَ الْهَرْجُ وَهْوَ الْقَتْلُ، وَحَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضَ، حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُ صَدَقَتَهُ، وَحَتَّى يَعْرِضَهُ فَيَقُولَ الَّذِي يَعْرِضُهُ عَلَيْهِ لاَ أَرَبَ لِي بِهِ‏.‏ وَحَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ، وَحَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ‏.‏ وَحَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ ـ يَعْنِي ـ آمَنُوا أَجْمَعُونَ، فَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ، أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلاَنِ ثَوْبَهُمَا بَيْنَهُمَا، فَلاَ يَتَبَايَعَانِهِ وَلاَ يَطْوِيَانِهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلاَ يَطْعَمُهُ، وَلَتَقُومَنَّ السَّاعَةُ وَهْوَ يُلِيطُ حَوْضَهُ فَلاَ يَسْقِي فِيهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلاَ يَطْعَمُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7121In-book reference : Book 92, Hadith 68USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 237   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7122,
    "id": 7122,
    "url": "https://sunnah.com/bukhari:7122",
    "bookNumber": 92,
    "hadithNumber": 69,
    "narrator": "Narrated Al-Mughira bin Shu`ba:",
    "english": "Nobody asked the Prophet (ﷺ) as many questions as I asked regarding Ad-Dajjal. The Prophet (ﷺ) said to me, \n\"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread \nand a river of water with him (i.e. he will have abundance of food and water)\" The Prophet (ﷺ) said, \"Nay, \nhe is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they \nbelieve in Allah or in Ad-Dajjal.)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي قَيْسٌ، قَالَ قَالَ لِي الْمُغِيرَةُ بْنُ شُعْبَةَ مَا سَأَلَ أَحَدٌ النَّبِيَّ صلى الله عليه وسلم عَنِ الدَّجَّالِ مَا سَأَلْتُهُ وَإِنَّهُ قَالَ لِي ‏\"‏ مَا يَضُرُّكَ مِنْهُ ‏\"‏‏.‏ قُلْتُ لأَنَّهُمْ يَقُولُونَ إِنَّ مَعَهُ جَبَلَ خُبْزٍ وَنَهَرَ مَاءٍ‏.‏ قَالَ ‏\"‏ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7122In-book reference : Book 92, Hadith 69USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7123,
    "id": 7123,
    "url": "https://sunnah.com/bukhari:7123",
    "bookNumber": 92,
    "hadithNumber": 70,
    "narrator": "Narrated Ibn 'Umar (ra) :",
    "english": "The Prophet (ﷺ) said (about Ad-Dajjal) that he is one eyed, his right eye is as if a protruding out grape.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَعْوَرُ عَيْنِ الْيُمْنَى، كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7123In-book reference : Book 92, Hadith 70USC-MSA web (English) reference : Vol. 1, Book 88, Hadith 238   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7124,
    "id": 7124,
    "url": "https://sunnah.com/bukhari:7124",
    "bookNumber": 92,
    "hadithNumber": 71,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will \nshake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"",
    "arabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَجِيءُ الدَّجَّالُ حَتَّى يَنْزِلَ فِي نَاحِيَةِ الْمَدِينَةِ، ثُمَّ تَرْجُفُ الْمَدِينَةُ ثَلاَثَ رَجَفَاتٍ، فَيَخْرُجُ إِلَيْهِ كُلُّ كَافِرٍ وَمُنَافِقٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7124In-book reference : Book 92, Hadith 71USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 239   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7125,
    "id": 7125,
    "url": "https://sunnah.com/bukhari:7125",
    "bookNumber": 92,
    "hadithNumber": 72,
    "narrator": "Narrated Abu Bakra:",
    "english": "The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time \nMedina will have seven gates and there will be two angels at each gate (guarding them).",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ، وَلَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ، عَلَى كُلِّ باب مَلَكَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7125In-book reference : Book 92, Hadith 72USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7126,
    "id": 7126,
    "url": "https://sunnah.com/bukhari:7126",
    "bookNumber": 92,
    "hadithNumber": 73,
    "narrator": "Narrated Abu Bakra:",
    "english": "[as above]",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا سَعْدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ، لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ، عَلَى كُلِّ باب مَلَكَانِ ‏\"‏‏.‏ \nقَالَ وَقَالَ ابْنُ إِسْحَاقَ عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، قَالَ قَدِمْتُ الْبَصْرَةَ فَقَالَ لِي أَبُو بَكْرَةَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7126In-book reference : Book 92, Hadith 73USC-MSA web (English) reference : Vol. 1, Book 88, Hadith 240   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7127,
    "id": 7127,
    "url": "https://sunnah.com/bukhari:7127",
    "bookNumber": 92,
    "hadithNumber": 74,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) stood up amongst the people and then praised and glorified Allah as He deserved and \nthen he mentioned Ad-Dajjal, saying, \"I warn you of him, and there was no prophet but warned his \nfollowers of him; but I will tell you something about him which no prophet has told his followers: Ad- \nDajjal is one-eyed whereas Allah is not.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ ‏\n\"‏ إِنِّي لأُنْذِرُكُمُوهُ، وَمَا مِنْ نَبِيٍّ إِلاَّ وَقَدْ أَنْذَرَهُ قَوْمَهُ، وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ، إِنَّهُ أَعْوَرُ وَإِنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7127In-book reference : Book 92, Hadith 74USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 241   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7128,
    "id": 7128,
    "url": "https://sunnah.com/bukhari:7128",
    "bookNumber": 92,
    "hadithNumber": 75,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said. \"While I was sleeping, I saw myself (in a dream) performing Tawaf around the \nKa`ba. Behold, I saw a reddish-white man with lank hair, and water was dropping from his head. I \nasked, \"Who is this?' They replied, 'The son of Mary.' Then I turned my face to see another man with \na huge body, red complexion and curly hair and blind in one eye. His eye looked like a protruding out \ngrape. They said (to me), He is Ad-Dajjal.\" The Prophet (ﷺ) added, \"The man he resembled most is Ibn \nQatan, a man from the tribe of Khuza`a. \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَا أَنَا نَائِمٌ أَطُوفُ بِالْكَعْبَةِ، فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ يَنْطُفُ ـ أَوْ يُهَرَاقُ ـ رَأْسُهُ مَاءً قُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ‏.‏ ثُمَّ ذَهَبْتُ أَلْتَفِتُ، فَإِذَا رَجُلٌ جَسِيمٌ أَحْمَرُ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ قَالُوا هَذَا الدَّجَّالُ‏.‏ أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ ‏\"‏‏.‏ رَجُلٌ مِنْ خُزَاعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7128In-book reference : Book 92, Hadith 75USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 242   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7129,
    "id": 7129,
    "url": "https://sunnah.com/bukhari:7129",
    "bookNumber": 92,
    "hadithNumber": 76,
    "narrator": "Narrated `Aisha:",
    "english": "I heard Allah's Messenger (ﷺ) in his prayer, seeking refuge with Allah from the afflictions of Ad-Dajjal.",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَعِيذُ فِي صَلاَتِهِ مِنْ فِتْنَةِ الدَّجَّالِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7129In-book reference : Book 92, Hadith 76USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 243   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7130,
    "id": 7130,
    "url": "https://sunnah.com/bukhari:7130",
    "bookNumber": 92,
    "hadithNumber": 77,
    "narrator": "Narrated Hudhaifa:",
    "english": "The Prophet (ﷺ) said about Ad-Dajjal that he would have water and fire with him: (what would seem to \nbe) fire, would be cold water and (what would seem to be) water, would be fire.",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فِي الدَّجَّالِ ‏\n\"‏ إِنَّ مَعَهُ مَاءً وَنَارًا، فَنَارُهُ مَاءٌ بَارِدٌ، وَمَاؤُهُ نَارٌ ‏\"‏‏.‏ قَالَ أَبُو مَسْعُودٍ أَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7130In-book reference : Book 92, Hadith 77USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 244   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7131,
    "id": 7131,
    "url": "https://sunnah.com/bukhari:7131",
    "bookNumber": 92,
    "hadithNumber": 78,
    "narrator": "Narrated Anas:",
    "english": "The Prophet (ﷺ) said, \"No prophet was sent but that he warned his followers against the one-eyed liar \n(Ad-Dajjal). Beware! He is blind in one eye, and your Lord is not so, and there will be written \nbetween his (Ad-Dajjal's) eyes (the word) Kafir (i.e., disbeliever).\" (This Hadith is also quoted by Abu \nHuraira and Ibn `Abbas).",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا بُعِثَ نَبِيٌّ إِلاَّ أَنْذَرَ أُمَّتَهُ الأَعْوَرَ الْكَذَّابَ، أَلاَ إِنَّهُ أَعْوَرُ، وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ، وَإِنَّ بَيْنَ عَيْنَيْهِ مَكْتُوبٌ كَافِرٌ ‏\"‏‏.‏ فِيهِ أَبُو هُرَيْرَةَ وَابْنُ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7131In-book reference : Book 92, Hadith 78USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 245   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7132,
    "id": 7132,
    "url": "https://sunnah.com/bukhari:7132",
    "bookNumber": 92,
    "hadithNumber": 79,
    "narrator": "Narrated Abu Sa`id:",
    "english": "One day Allah's Messenger (ﷺ) narrated to us a long narration about Ad-Dajjal and among the things he \nnarrated to us, was: \"Ad-Dajjal will come, and he will be forbidden to enter the mountain passes of \nMedina. He will encamp in one of the salt areas neighboring Medina and there will appear to him a \nman who will be the best or one of the best of the people. He will say 'I testify that you are Ad-Dajjal \nwhose story Allah's Messenger (ﷺ) has told us.' Ad-Dajjal will say (to his audience), 'Look, if I kill this man \nand then give him life, will you have any doubt about my claim?' They will reply, 'No,' Then Ad- \nDajjal will kill that man and then will make him alive. The man will say, 'By Allah, now I recognize \nyou more than ever!' Ad-Dajjal will then try to kill him (again) but he will not be given the power to \ndo so.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا سَعِيدٍ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا حَدِيثًا طَوِيلاً عَنِ الدَّجَّالِ، فَكَانَ فِيمَا يُحَدِّثُنَا بِهِ أَنَّهُ قَالَ ‏\n\"‏ يَأْتِي الدَّجَّالُ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ، فَيَنْزِلُ بَعْضَ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ، فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ وَهْوَ خَيْرُ النَّاسِ أَوْ مِنْ خِيَارِ النَّاسِ، فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَهُ، فَيَقُولُ الدَّجَّالُ أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ، هَلْ تَشُكُّونَ فِي الأَمْرِ فَيَقُولُونَ لاَ‏.‏ فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ وَاللَّهِ مَا كُنْتُ فِيكَ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ‏.‏ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلاَ يُسَلَّطُ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7132In-book reference : Book 92, Hadith 79USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 246   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7133,
    "id": 7133,
    "url": "https://sunnah.com/bukhari:7133",
    "bookNumber": 92,
    "hadithNumber": 80,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"There are angels at the mountain passes of Medina (so that) neither plague nor \nAd-Dajjal can enter it.'",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ، لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7133In-book reference : Book 92, Hadith 80USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 247   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7134,
    "id": 7134,
    "url": "https://sunnah.com/bukhari:7134",
    "bookNumber": 92,
    "hadithNumber": 81,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, \nneither Ad-Dajjal, nor plague will be able to come near it.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَدِينَةُ يَأْتِيهَا الدَّجَّالُ، فَيَجِدُ الْمَلاَئِكَةَ يَحْرُسُونَهَا، فَلاَ يَقْرَبُهَا الدَّجَّالُ ـ قَالَ ـ وَلاَ الطَّاعُونُ، إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7134In-book reference : Book 92, Hadith 81USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 248   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7135,
    "id": 7135,
    "url": "https://sunnah.com/bukhari:7135",
    "bookNumber": 92,
    "hadithNumber": 82,
    "narrator": "Narrated Zainab bint Jahsh:",
    "english": "That one day Allah's Messenger (ﷺ) entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet (ﷺ) made a circle with his index \nfinger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet (ﷺ) said, \"Yes, if the (number) of evil (persons) \nincreased.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، حَدَّثَتْهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ، عَنْ زَيْنَبَ ابْنَةِ جَحْشٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَيْهَا يَوْمًا فَزِعًا يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ، فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏‏.‏ وَحَلَّقَ بِإِصْبَعَيْهِ الإِبْهَامِ وَالَّتِي تَلِيهَا‏.‏ قَالَتْ زَيْنَبُ ابْنَةُ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ ‏\"‏ نَعَمْ إِذَا كَثُرَ الْخُبْثُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7135In-book reference : Book 92, Hadith 82USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 249   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7136,
    "id": 7136,
    "url": "https://sunnah.com/bukhari:7136",
    "bookNumber": 92,
    "hadithNumber": 83,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"A hole has been opened in the dam of Gog and Magog.\" Wuhaib (the sub-narrator) \nmade the number 90 (with his index finger and thumb).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُفْتَحُ الرَّدْمُ رَدْمُ يَأْجُوجَ وَمَأْجُوجَ مِثْلَ هَذِهِ ‏\"‏‏.‏ وَعَقَدَ وُهَيْبٌ تِسْعِينَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7136In-book reference : Book 92, Hadith 83USC-MSA web (English) reference : Vol. 9, Book 88, Hadith 250   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7137,
    "id": 7137,
    "url": "https://sunnah.com/bukhari:7137",
    "bookNumber": 93,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"Whoever obeys me, obeys Allah, and whoever disobeys me, disobeys Allah, \nand whoever obeys the ruler I appoint, obeys me, and whoever disobeys him, disobeys me.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ، وَمَنْ أَطَاعَ أَمِيرِي فَقَدْ أَطَاعَنِي، وَمَنْ عَصَى أَمِيرِي فَقَدْ عَصَانِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7137In-book reference : Book 93, Hadith 1USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 251   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7138,
    "id": 7138,
    "url": "https://sunnah.com/bukhari:7138",
    "bookNumber": 93,
    "hadithNumber": 2,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"Surely! Everyone of you is a guardian and is responsible for his charges: The \nImam (ruler) of the people is a guardian and is responsible for his subjects; a man is the guardian of \nhis family (household) and is responsible for his subjects; a woman is the guardian of her husband's \nhome and of his children and is responsible for them; and the slave of a man is a guardian of his \nmaster's property and is responsible for it. Surely, everyone of you is a guardian and responsible for \nhis charges.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالإِمَامُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى أَهْلِ بَيْتِ زَوْجِهَا وَوَلَدِهِ وَهِيَ مَسْئُولَةٌ عَنْهُمْ، وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهْوَ مَسْئُولٌ عَنْهُ، أَلاَ فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7138In-book reference : Book 93, Hadith 2USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 252   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7139,
    "id": 7139,
    "url": "https://sunnah.com/bukhari:7139",
    "bookNumber": 93,
    "hadithNumber": 3,
    "narrator": "Narrated Muhammad bin Jubair bin Mut`im:",
    "english": "That while he was included in a delegation of Quraish staying with Muawiya, Muawiya heard that \n`Abdullah bin `Amr had said that there would be a king from Qahtan tribe, whereupon he became very \nangry. He stood up, and after glorifying and praising Allah as He deserved, said, \"To proceed, I have \ncome to know that some of you men are narrating things which are neither in Allah's Book, nor has \nbeen mentioned by Allah's Messenger (ﷺ) . Such people are the ignorant among you. Beware of such vain \ndesires that mislead those who have them. I have heard Allah's Messenger (ﷺ) saying, 'This matter (of the \ncaliphate) will remain with the Quraish, and none will rebel against them, but Allah will throw him \ndown on his face as long as they stick to the rules and regulations of the religion (Islam).'\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ يُحَدِّثُ أَنَّهُ بَلَغَ مُعَاوِيَةَ وَهْوَ عِنْدَهُ فِي وَفْدٍ مِنْ قُرَيْشٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو يُحَدِّثُ أَنَّهُ سَيَكُونُ مَلِكٌ مِنْ قَحْطَانَ فَغَضِبَ، فَقَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّهُ بَلَغَنِي أَنَّ رِجَالاً مِنْكُمْ يُحَدِّثُونَ أَحَادِيثَ لَيْسَتْ فِي كِتَابِ اللَّهِ، وَلاَ تُؤْثَرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُولَئِكَ جُهَّالُكُمْ، فَإِيَّاكُمْ وَالأَمَانِيَّ الَّتِي تُضِلُّ أَهْلَهَا، فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ هَذَا الأَمْرَ فِي قُرَيْشٍ، لاَ يُعَادِيهِمْ أَحَدٌ إِلاَّ كَبَّهُ اللَّهُ عَلَى وَجْهِهِ مَا أَقَامُوا الدِّينَ ‏\"‏‏.‏ تَابَعَهُ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7139In-book reference : Book 93, Hadith 3USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 253   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7140,
    "id": 7140,
    "url": "https://sunnah.com/bukhari:7140",
    "bookNumber": 93,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Allah's Messenger (ﷺ) said, \"This matter (caliphate) will remain with the Quraish even if only two of them \nwere still existing.\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، سَمِعْتُ أَبِي يَقُولُ، قَالَ ابْنُ عُمَرَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَزَالُ الأَمْرُ فِي قُرَيْشٍ مَا بَقِيَ مِنْهُمُ اثْنَانِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7140In-book reference : Book 93, Hadith 4USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 254   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7141,
    "id": 7141,
    "url": "https://sunnah.com/bukhari:7141",
    "bookNumber": 93,
    "hadithNumber": 5,
    "narrator": "Narrated `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"Do not wish to be like anyone, except in two cases: (1) A man whom Allah has \ngiven wealth and he spends it righteously. (2) A man whom Allah has given wisdom (knowledge of \nthe Qur'an and the Hadith) and he acts according to it and teaches it to others.\"",
    "arabic": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ، رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَآخَرُ آتَاهُ اللَّهُ حِكْمَةً فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7141In-book reference : Book 93, Hadith 5USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 255   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7142,
    "id": 7142,
    "url": "https://sunnah.com/bukhari:7142",
    "bookNumber": 93,
    "hadithNumber": 6,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Allah's Messenger (ﷺ) said, \"You should listen to and obey, your ruler even if he was an Ethiopian (black) \nslave whose head looks like a raisin.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اسْمَعُوا وَأَطِيعُوا وَإِنِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7142In-book reference : Book 93, Hadith 6USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 256   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7143,
    "id": 7143,
    "url": "https://sunnah.com/bukhari:7143",
    "bookNumber": 93,
    "hadithNumber": 7,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"If somebody sees his Muslim ruler doing something he disapproves of, he should \nbe patient, for whoever becomes separate from the Muslim group even for a span and then dies, he \nwill die as those who died in the Pre-lslamic period of ignorance (as rebellious sinners). (See Hadith \nNo. 176 and 177)",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنِ الْجَعْدِ، عَنْ أَبِي رَجَاءٍ، عَنِ ابْنِ عَبَّاسٍ، يَرْوِيهِ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا فَكَرِهَهُ فَلْيَصْبِرْ، فَإِنَّهُ لَيْسَ أَحَدٌ يُفَارِقُ الْجَمَاعَةَ شِبْرًا فَيَمُوتُ إِلاَّ مَاتَ مِيتَةً جَاهِلِيَّةً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7143In-book reference : Book 93, Hadith 7USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 257   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7144,
    "id": 7144,
    "url": "https://sunnah.com/bukhari:7144",
    "bookNumber": 93,
    "hadithNumber": 8,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"A Muslim has to listen to and obey (the order of his ruler) whether he likes it or \nnot, as long as his orders involve not one in disobedience (to Allah), but if an act of disobedience (to \nAllah) is imposed one should not listen to it or obey it. (See Hadith No. 203, Vol. 4)",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ، فِيمَا أَحَبَّ وَكَرِهَ، مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ، فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلاَ سَمْعَ وَلاَ طَاعَةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7144In-book reference : Book 93, Hadith 8USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 258   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7145,
    "id": 7145,
    "url": "https://sunnah.com/bukhari:7145",
    "bookNumber": 93,
    "hadithNumber": 9,
    "narrator": "Narrated `Ali:",
    "english": "The Prophet (ﷺ) sent an army unit (for some campaign) and appointed a man from the Ansar as its \ncommander and ordered them (the soldiers) to obey him. (During the campaign) he became angry \nwith them and said, \"Didn't the Prophet (ﷺ) order you to obey me?\" They said, \"Yes.\" He said, \"I order \nyou to collect wood and make a fire and then throw yourselves into it.\" So they collected wood and \nmade a fire, but when they were about to throw themselves into, it they started looking at each other, \nand some of them said, \"We followed the Prophet (ﷺ) to escape from the fire. How should we enter it \nnow?\" So while they were in that state, the fire extinguished and their commander's anger abated. The \nevent was mentioned to the Prophet (ﷺ) and he said, \"If they had entered it (the fire) they would never \nhave come out of it, for obedience is required only in what is good.\" (See Hadith No. 629. Vol. 5)",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا سَعْدُ بْنُ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً، وَأَمَّرَ عَلَيْهِمْ رَجُلاً مِنَ الأَنْصَارِ وَأَمَرَهُمْ أَنْ يُطِيعُوهُ، فَغَضِبَ عَلَيْهِمْ وَقَالَ أَلَيْسَ قَدْ أَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنَّ تُطِيعُونِي قَالُوا بَلَى‏.‏ قَالَ عَزَمْتُ عَلَيْكُمْ لَمَا جَمَعْتُمْ حَطَبًا وَأَوْقَدْتُمْ نَارًا، ثُمَّ دَخَلْتُمْ فِيهَا، فَجَمَعُوا حَطَبًا فَأَوْقَدُوا، فَلَمَّا هَمُّوا بِالدُّخُولِ فَقَامَ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ، قَالَ بَعْضُهُمْ إِنَّمَا تَبِعْنَا النَّبِيَّ صلى الله عليه وسلم فِرَارًا مِنَ النَّارِ، أَفَنَدْخُلُهَا، فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ خَمَدَتِ النَّارُ، وَسَكَنَ غَضَبُهُ، فَذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَوْ دَخَلُوهَا مَا خَرَجُوا مِنْهَا أَبَدًا، إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7145In-book reference : Book 93, Hadith 9USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 259   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7146,
    "id": 7146,
    "url": "https://sunnah.com/bukhari:7146",
    "bookNumber": 93,
    "hadithNumber": 10,
    "narrator": "Narrated `Abdur-Rahman bin Samura:",
    "english": "The Prophet (ﷺ) said, \"O `Abdur-Rahman! Do not seek to be a ruler, for if you are given authority on your \ndemand then you will be held responsible for it, but if you are given it without asking (for it), then you \nwill be helped (by Allah) in it. If you ever take an oath to do something and later on you find that \nsomething else is better, then you should expiate your oath and do what is better.\"",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا عَبْدَ الرَّحْمَنِ لاَ تَسْأَلِ الإِمَارَةَ، فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَكَفِّرْ يَمِينَكَ، وَأْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7146In-book reference : Book 93, Hadith 10USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 260   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7147,
    "id": 7147,
    "url": "https://sunnah.com/bukhari:7147",
    "bookNumber": 93,
    "hadithNumber": 11,
    "narrator": "Narrated `Abdur-Rahman bin Samura:",
    "english": "Allah's Messenger (ﷺ) said, \"O `Abdur-Rahman bin Samura! Do not seek to be a ruler, for if you are given \nauthority on your demand, you will be held responsible for it, but if you are given it without asking for \nit, then you will be helped (by Allah) in it. If you ever take an oath to do something and later on you \nfind that something else is better, then do what is better and make expiation for your oath.\"",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ، لاَ تَسْأَلِ الإِمَارَةَ، فَإِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَأْتِ الَّذِي هُوَ خَيْرٌ، وَكَفِّرْ عَنْ يَمِينِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7147In-book reference : Book 93, Hadith 11USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 261   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7148,
    "id": 7148,
    "url": "https://sunnah.com/bukhari:7148",
    "bookNumber": 93,
    "hadithNumber": 12,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"You people will be keen to have the authority of ruling which will be a thing of \nregret for you on the Day of Resurrection. What an excellent wet nurse it is, yet what a bad weaning \none it is!\"",
    "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الإِمَارَةِ، وَسَتَكُونُ نَدَامَةً يَوْمَ الْقِيَامَةِ، فَنِعْمَ الْمُرْضِعَةُ وَبِئْسَتِ الْفَاطِمَةُ ‏\"‏‏.‏ \nوَقَالَ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ، حَدَّثَنَا عَبْدُ الْحَمِيدِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُمَرَ بْنِ الْحَكَمِ، عَنْ أَبِي هُرَيْرَةَ، قَوْلَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7148In-book reference : Book 93, Hadith 12USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 262   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7149,
    "id": 7149,
    "url": "https://sunnah.com/bukhari:7149",
    "bookNumber": 93,
    "hadithNumber": 13,
    "narrator": "Narrated Abu Musa:",
    "english": "Two men from my tribe and I entered upon the Prophet. One of the two men said to the Prophet, \"O \nAllah's Messenger (ﷺ)! Appoint me as a governor,\" and so did the second. The Prophet (ﷺ) said, \"We do not \nassign the authority of ruling to those who ask for it, nor to those who are keen to have it.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم أَنَا وَرَجُلاَنِ مِنْ قَوْمِي فَقَالَ أَحَدُ الرَّجُلَيْنِ أَمِّرْنَا يَا رَسُولَ اللَّهِ‏.‏ وَقَالَ الآخَرُ مِثْلَهُ‏.‏ فَقَالَ ‏\n\"‏ إِنَّا لاَ نُوَلِّي هَذَا مَنْ سَأَلَهُ، وَلاَ مَنْ حَرَصَ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7149In-book reference : Book 93, Hadith 13USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 263   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7150,
    "id": 7150,
    "url": "https://sunnah.com/bukhari:7150",
    "bookNumber": 93,
    "hadithNumber": 14,
    "narrator": "Narrated Ma'qil:",
    "english": "I heard the Prophet (ﷺ) saying, \"Any man whom Allah has given the authority of ruling some people and \nhe does not look after them in an honest manner, will never feel even the smell of Paradise.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو الأَشْهَبِ، عَنِ الْحَسَنِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ زِيَادٍ، عَادَ مَعْقِلَ بْنَ يَسَارٍ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَقَالَ لَهُ مَعْقِلٌ إِنِّي مُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا مِنْ عَبْدٍ اسْتَرْعَاهُ اللَّهُ رَعِيَّةً، فَلَمْ يَحُطْهَا بِنَصِيحَةٍ، إِلاَّ لَمْ يَجِدْ رَائِحَةَ الْجَنَّةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7150In-book reference : Book 93, Hadith 14USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 264   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7151,
    "id": 7151,
    "url": "https://sunnah.com/bukhari:7151",
    "bookNumber": 93,
    "hadithNumber": 15,
    "narrator": "Narrated Ma'qil:",
    "english": "Allah's Messenger (ﷺ) said, \"If any ruler having the authority to rule Muslim subjects dies while he is \ndeceiving them, Allah will forbid Paradise for him.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حُسَيْنٌ الْجُعْفِيُّ، قَالَ زَائِدَةُ ذَكَرَهُ عَنْ هِشَامٍ، عَنِ الْحَسَنِ، قَالَ أَتَيْنَا مَعْقِلَ بْنَ يَسَارٍ نَعُودُهُ فَدَخَلَ عُبَيْدُ اللَّهِ فَقَالَ لَهُ مَعْقِلٌ أُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَا مِنْ وَالٍ يَلِي رَعِيَّةً مِنَ الْمُسْلِمِينَ، فَيَمُوتُ وَهْوَ غَاشٌّ لَهُمْ، إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7151In-book reference : Book 93, Hadith 15USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 265   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7152,
    "id": 7152,
    "url": "https://sunnah.com/bukhari:7152",
    "bookNumber": 93,
    "hadithNumber": 16,
    "narrator": "Narrated Tarif Abi Tamima:",
    "english": "I saw Safwan and Jundab and Safwan's companions when Jundab was advising. They said, \"Did you \nhear something from Allah's Messenger (ﷺ)?\" Jundab said, \"I heard him saying, 'Whoever does a good deed \nin order to show off, Allah will expose his intentions on the Day of Resurrection (before the people), \nand whoever puts the people into difficulties, Allah will put him into difficulties on the Day of \nResurrection.'\" The people said (to Jundab), \"Advise us.\" He said, \"The first thing of the human body \nto purify is the `Abdomen, so he who can eat nothing but good food (Halal and earned lawfully) \nshould do so, and he who does as much as he can that nothing intervene between him and Paradise by \nnot shedding even a handful of blood, (i.e. murdering) should do so.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنِ الْجُرَيْرِيِّ، عَنِ طَرِيفٍ أَبِي تَمِيمَةَ، قَالَ شَهِدْتُ صَفْوَانَ وَجُنْدَبًا وَأَصْحَابَهُ وَهْوَ يُوصِيهِمْ فَقَالُوا هَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ ‏\"‏ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ يَوْمَ الْقِيَامَةِ ـ قَالَ ـ وَمَنْ يُشَاقِقْ يَشْقُقِ اللَّهُ عَلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقَالُوا أَوْصِنَا‏.‏ فَقَالَ‏\"‏ إِنَّ أَوَّلَ مَا يُنْتِنُ مِنَ الإِنْسَانِ بَطْنُهُ، فَمَنِ اسْتَطَاعَ أَنْ لاَ يَأْكُلَ إِلاَّ طَيِّبًا فَلْيَفْعَلْ، وَمَنِ اسْتَطَاعَ أَنْ لاَ يُحَالَ بَيْنَهُ وَبَيْنَ الْجَنَّةِ بِمِلْءِ كَفِّهِ مِنْ دَمٍ أَهْرَاقَهُ فَلْيَفْعَلْ ‏\"‏‏.‏ قُلْتُ لأَبِي عَبْدِ اللَّهِ مَنْ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم جُنْدَبٌ قَالَ نَعَمْ جُنْدَبٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7152In-book reference : Book 93, Hadith 16USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 266   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7153,
    "id": 7153,
    "url": "https://sunnah.com/bukhari:7153",
    "bookNumber": 93,
    "hadithNumber": 17,
    "narrator": "Narrated Anas bin Malik:",
    "english": "While the Prophet (ﷺ) and I were coming out of the mosque, a man met us outside the gate. The man said, \n\"O Allah's Messenger (ﷺ)! When will be the Hour?\" The Prophet (ﷺ) asked him, \"What have you prepared for \nit?\" The man became afraid and ashamed and then said, \"O Allah's Messenger (ﷺ)! I haven't prepared for it \nmuch of fasts, prayers or charitable gifts but I love Allah and His Apostle.\" The Prophet (ﷺ) said, \"You \nwill be with the one whom you love.\"",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم خَارِجَانِ مِنَ الْمَسْجِدِ فَلَقِيَنَا رَجُلٌ عِنْدَ سُدَّةِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا أَعْدَدْتَ لَهَا ‏\"‏ فَكَأَنَّ الرَّجُلَ اسْتَكَانَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صِيَامٍ وَلاَ صَلاَةٍ وَلاَ صَدَقَةٍ، وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ قَالَ ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7153In-book reference : Book 93, Hadith 17USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 267   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7154,
    "id": 7154,
    "url": "https://sunnah.com/bukhari:7154",
    "bookNumber": 93,
    "hadithNumber": 18,
    "narrator": "Narrated Thabit Al-Bunani:",
    "english": "Anas bin Malik said to a woman of his family, \"Do you know such-and-such a woman?\" She replied, \n\"Yes.\" He said, \"The Prophet (ﷺ) passed by her while she was weeping over a grave, and he said to her, \n'Be afraid of Allah and be patient.' The woman said (to the Prophet). 'Go away from me, for you do \nnot know my calamity.'\" Anas added, \"The Prophet (ﷺ) left her and proceeded. A man passed by her and \nasked her, 'What has Allah's Messenger (ﷺ) said to you?' She replied, 'I did not recognize him.' The man said, \n'He was Allah's Messenger (ﷺ).\"' Anas added, \"So that woman came to the gate of the Prophet (ﷺ) and she did \nnot find a gate-keeper there, and she said, 'O Allah's Messenger (ﷺ)! By Allah. I did not recognize you!' The \nProphet said, 'No doubt, patience is at the first stroke of a calamity.'\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، يَقُولُ لاِمْرَأَةٍ مِنْ أَهْلِهِ تَعْرِفِينَ فُلاَنَةَ قَالَتْ نَعَمْ‏.‏ قَالَ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِهَا وَهْىَ تَبْكِي عِنْدَ قَبْرٍ فَقَالَ ‏\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏ فَقَالَتْ إِلَيْكَ عَنِّي، فَإِنَّكَ خِلْوٌ مِنْ مُصِيبَتِي‏.‏ قَالَ فَجَاوَزَهَا وَمَضَى فَمَرَّ بِهَا رَجُلٌ فَقَالَ مَا قَالَ لَكِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ مَا عَرَفْتُهُ قَالَ إِنَّهُ لَرَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ فَجَاءَتْ إِلَى بَابِهِ فَلَمْ تَجِدْ عَلَيْهِ بَوَّابًا فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا عَرَفْتُكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الصَّبْرَ عِنْدَ أَوَّلِ صَدْمَةٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7154In-book reference : Book 93, Hadith 18USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 268   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7155,
    "id": 7155,
    "url": "https://sunnah.com/bukhari:7155",
    "bookNumber": 93,
    "hadithNumber": 19,
    "narrator": "Narrated Anas:",
    "english": "Qais bin Sa`d was to the Prophet (ﷺ) like a chief police officer to an Amir (chief).",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ الذُّهْلِيُّ، حَدَّثَنَا الأَنْصَارِيُّ، مُحَمَّدٌ حَدَّثَنَا أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، أَنَّ قَيْسَ بْنَ سَعْدٍ، كَانَ يَكُونُ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم بِمَنْزِلَةِ صَاحِبِ الشُّرَطِ مِنَ الأَمِيرِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7155In-book reference : Book 93, Hadith 19USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 269   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7156,
    "id": 7156,
    "url": "https://sunnah.com/bukhari:7156",
    "bookNumber": 93,
    "hadithNumber": 20,
    "narrator": "Narrated Abu Musa:",
    "english": "that the Prophet (ﷺ) sent him and sent Mu`adh after him (as rulers to Yemen).",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ، حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ وَأَتْبَعَهُ بِمُعَاذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7156In-book reference : Book 93, Hadith 20USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 270   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7157,
    "id": 7157,
    "url": "https://sunnah.com/bukhari:7157",
    "bookNumber": 93,
    "hadithNumber": 21,
    "narrator": "Narrated Abu Musa:",
    "english": "A man embraced Islam and then reverted back to Judaism. Mu`adh bin Jabal came and saw the man \nwith Abu Musa. Mu`adh asked, \"What is wrong with this (man)?\" Abu Musa replied, \"He embraced \nIslam and then reverted back to Judaism.\" Mu`adh said, \"I will not sit down unless you kill him (as it \nis) the verdict of Allah and His Apostle.",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ، حَدَّثَنَا مَحْبُوبُ بْنُ الْحَسَنِ، حَدَّثَنَا خَالِدٌ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أَنَّ رَجُلاً، أَسْلَمَ ثُمَّ تَهَوَّدَ، فَأَتَى مُعَاذُ بْنُ جَبَلٍ وَهْوَ عِنْدَ أَبِي مُوسَى فَقَالَ مَا هَذَا قَالَ أَسْلَمَ ثُمَّ تَهَوَّدَ‏.‏ قَالَ لاَ أَجْلِسُ حَتَّى أَقْتُلَهُ، قَضَاءُ اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7157In-book reference : Book 93, Hadith 21USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 271   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7158,
    "id": 7158,
    "url": "https://sunnah.com/bukhari:7158",
    "bookNumber": 93,
    "hadithNumber": 22,
    "narrator": "Narrated `Abdur Rahman bin Abi Bakra:",
    "english": "Abu Bakra wrote to his son who was in Sijistan: 'Do not judge between two persons when you are \nangry, for I heard the Prophet (ﷺ) saying, \"A judge should not judge between two persons while he is in \nan angry mood.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، قَالَ كَتَبَ أَبُو بَكْرَةَ إِلَى ابْنِهِ وَكَانَ بِسِجِسْتَانَ بِأَنْ لاَ تَقْضِيَ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ، فَإِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَقْضِيَنَّ حَكَمٌ بَيْنَ اثْنَيْنِ وَهْوَ غَضْبَانُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7158In-book reference : Book 93, Hadith 22USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 272   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7159,
    "id": 7159,
    "url": "https://sunnah.com/bukhari:7159",
    "bookNumber": 93,
    "hadithNumber": 23,
    "narrator": "Narrated Abu Mas`ud Al-Ansari:",
    "english": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! By Allah, I fail to attend the morning \ncongregational prayer because so-and-so (i.e., Mu`adh bin Jabal) prolongs the prayer when he leads us \nfor it.\" I had never seen the Prophet (ﷺ) more furious in giving advice than he was on that day. He then \nsaid, \"O people! some of you make others dislike (good deeds, i.e. prayers etc). So whoever among \nyou leads the people in prayer, he should shorten it because among them there are the old, the weak \nand the busy (needy having some jobs to do). (See Hadith No. 90, Vol. 1)",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي وَاللَّهِ لأَتَأَخَّرُ عَنْ صَلاَةِ الْغَدَاةِ مِنْ أَجْلِ فُلاَنٍ، مِمَّا يُطِيلُ بِنَا فِيهَا‏.‏ قَالَ فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم قَطُّ أَشَدَّ غَضَبًا فِي مَوْعِظَةٍ مِنْهُ يَوْمَئِذٍ، ثُمَّ قَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ، إِنَّ مِنْكُمْ مُنَفِّرِينَ، فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيُوجِزْ، فَإِنَّ فِيهِمُ الْكَبِيرَ وَالضَّعِيفَ وَذَا الْحَاجَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7159In-book reference : Book 93, Hadith 23USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 273   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7160,
    "id": 7160,
    "url": "https://sunnah.com/bukhari:7160",
    "bookNumber": 93,
    "hadithNumber": 24,
    "narrator": "Narrated `Abdullah bin `Umar:",
    "english": "That he had divorced his wife during her menses. `Umar mentioned that to the Prophet. Allah's \nApostle became angry and said, \"He must take her back (his wife) and keep her with him till she \nbecomes clean from her menses and then to wait till she gets her next period and becomes clean again \nfrom it and only then, if he wants to divorce her, he may do so.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ الْكِرْمَانِيُّ، حَدَّثَنَا حَسَّانُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يُونُسُ، قَالَ مُحَمَّدٌ أَخْبَرَنِي سَالِمٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّهُ، طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَذَكَرَ عُمَرُ لِلنَّبِيِّ صلى الله عليه وسلم، فَتَغَيَّظَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\n\"‏ لِيُرَاجِعْهَا، ثُمَّ لْيُمْسِكْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ فَتَطْهُرَ، فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7160In-book reference : Book 93, Hadith 24USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 274   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7161,
    "id": 7161,
    "url": "https://sunnah.com/bukhari:7161",
    "bookNumber": 93,
    "hadithNumber": 25,
    "narrator": "Narrated `Aisha:",
    "english": "Hind bint `Utba bin Rabi`a came and said. \"O Allah's Messenger (ﷺ)! By Allah, there was no family on the \nsurface of the earth, I like to see in degradation more than I did your family, but today there is no \nfamily on the surface of the earth whom I like to see honored more than yours.\" Hind added, \"Abu \nSufyan is a miser. Is it sinful of me to feed our children from his property?\" The Prophet (ﷺ) said, \"There \nis no blame on you if you feed them (thereof) in a just and reasonable manner.",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ هِنْدٌ بِنْتُ عُتْبَةَ بْنِ رَبِيعَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ، وَاللَّهِ مَا كَانَ عَلَى ظَهْرِ الأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَىَّ أَنْ يَذِلُّوا مِنْ أَهْلِ خِبَائِكَ، وَمَا أَصْبَحَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَىَّ أَنْ يَعِزُّوا مِنْ أَهْلِ خِبَائِكَ‏.‏ ثُمَّ قَالَتْ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ مِنْ حَرَجٍ أَنْ أُطْعِمَ الَّذِي لَهُ عِيَالَنَا قَالَ لَهَا ‏\n\"‏ لاَ حَرَجَ عَلَيْكِ أَنْ تُطْعِمِيهِمْ مِنْ مَعْرُوفٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7161In-book reference : Book 93, Hadith 25USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 275   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7162,
    "id": 7162,
    "url": "https://sunnah.com/bukhari:7162",
    "bookNumber": 93,
    "hadithNumber": 26,
    "narrator": "Narrated Anas bin Malik:",
    "english": "When the Prophet (ﷺ) intended to write to the Byzantines, the people said, \"They do not read a letter \nunless it is sealed (stamped).\" Therefore the Prophet (ﷺ) took a silver ring----as if I am looking at its \nglitter now----and its engraving was: 'Muhammad, Apostle of Allah'.",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكْتُبَ إِلَى الرُّومِ قَالُوا إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ مَخْتُومًا‏.‏ فَاتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا مِنْ فِضَّةٍ، كَأَنِّي أَنْظُرُ إِلَى وَبِيصِهِ، وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7162In-book reference : Book 93, Hadith 26USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 276   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7163,
    "id": 7163,
    "url": "https://sunnah.com/bukhari:7163",
    "bookNumber": 93,
    "hadithNumber": 27,
    "narrator": "Narrated 'Abdullah bin As-Sa'di:",
    "english": "That when he went to 'Umar during his Caliphate. 'Umar said to him, \n     \"Haven't I been told that you do certain jobs for the people but when \n     you are given payment you refuse to take it?\" 'Abdullah added: I said,\n     \"Yes.\" 'Umar said, \"Why do you do so?\" I said, \"I have horses and \n     slaves and I am living in prosperity and I wish that my payment should\n     be kept as a charitable gift for the Muslims.\" 'Umar said, \"Do not do \n     so, for I intended to do the same as you do. Allah's Messenger (ﷺ)s used to \n     give me gifts and I used to say to him, 'Give it to a more needy one \n     than me.' Once he gave me some money and I said, 'Give it to a more \n     needy person than me,' whereupon the Prophet (ﷺ) said, 'Take it and keep \n     it in your possession and then give it in charity. Take what ever \n     comes to you of this money if you are not keen to have it and not \n     asking for it; otherwise (i.e., if it does not come to you) do not \n     seek to have it yourself.' \"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ ابْنُ أُخْتِ، نَمِرٍ أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ أَنَّهُ، قَدِمَ عَلَى عُمَرَ فِي خِلاَفَتِهِ فَقَالَ لَهُ عُمَرُ أَلَمْ أُحَدَّثْ أَنَّكَ تَلِي مِنْ أَعْمَالِ النَّاسِ أَعْمَالاً، فَإِذَا أُعْطِيتَ الْعُمَالَةَ كَرِهْتَهَا‏.‏ فَقُلْتُ بَلَى‏.‏ فَقَالَ عُمَرُ مَا تُرِيدُ إِلَى ذَلِكَ قُلْتُ إِنَّ لِي أَفْرَاسًا وَأَعْبُدًا، وَأَنَا بِخَيْرٍ، وَأَرِيدُ أَنْ تَكُونَ عُمَالَتِي صَدَقَةً عَلَى الْمُسْلِمِينَ‏.‏ قَالَ عُمَرُ لاَ تَفْعَلْ فَإِنِّي كُنْتُ أَرَدْتُ الَّذِي أَرَدْتَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي‏.‏ حَتَّى أَعْطَانِي مَرَّةً مَالاً فَقُلْتُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ، فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ فَخُذْهُ، وَإِلاَّ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏",
    "reference": "Reference : Sahih al-Bukhari 7163In-book reference : Book 93, Hadith 27USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7164,
    "id": 7164,
    "url": "https://sunnah.com/bukhari:7164",
    "bookNumber": 93,
    "hadithNumber": 28,
    "narrator": "Narrated 'Abdullah bin 'Umar:",
    "english": "I have heard 'Umar saying, \"The Prophet (ﷺ) \n     used to give me some money (grant) and I would say (to him), 'Give it \n     to a more needy one than me.' Once he gave me some money and I said, \n     'Give it to a more needy one than me.' The Prophet (ﷺ) said (to me), 'Take\n     it and keep it in your possession and then give it in charity. Take \n     whatever comes to you of this money while you are not keen to have it \n     and not asking for it; take it, but you should not seek to have what \n     you are not given. ' \"",
    "arabic": "وَعَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنْ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي‏.‏ حَتَّى أَعْطَانِي مَرَّةً مَالاً فَقُلْتُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ، فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ فَخُذْهُ، وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7164In-book reference : Book 93, Hadith 28USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 277   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7165,
    "id": 7165,
    "url": "https://sunnah.com/bukhari:7165",
    "bookNumber": 93,
    "hadithNumber": 29,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "I witnessed a husband and a wife who were involved in a case of Lian. Then (the judgment of) divorce \nwas passed. I was fifteen years of age, at that time.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ شَهِدْتُ الْمُتَلاَعِنَيْنِ وَأَنَا ابْنُ خَمْسَ، عَشْرَةَ فُرِّقَ بَيْنَهُمَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7165In-book reference : Book 93, Hadith 29USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 278   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7166,
    "id": 7166,
    "url": "https://sunnah.com/bukhari:7166",
    "bookNumber": 93,
    "hadithNumber": 30,
    "narrator": "Narrated Sahl:",
    "english": "(the brother of Bani Sa`ida) A man from the Ansar came to the Prophet (ﷺ) and said, \"If a man finds \nanother man sleeping with his wife, should he kill him?\" That man and his wife then did Lian in the \nmosque while I was present.",
    "arabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَهْلٍ، أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7166In-book reference : Book 93, Hadith 30USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 279   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7167,
    "id": 7167,
    "url": "https://sunnah.com/bukhari:7167",
    "bookNumber": 93,
    "hadithNumber": 31,
    "narrator": "Narrated Abu Huraira:",
    "english": "A man came to Allah's Messenger (ﷺ) while he was in the mosque, and called him, saying, \"O Allah's \nApostle! I have committed illegal sexual intercourse.\" The Prophet (ﷺ) turned his face to the other side, \nbut when the man gave four witnesses against himself, the Prophet (ﷺ) said to him, \"Are you mad?\" The \nman said, \"No.\" So the Prophet (ﷺ) said (to his companions), \"Take him away and stone him to death. \"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ فَأَعْرَضَ عَنْهُ‏.‏ فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعًا قَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ اذْهَبُوا بِهِ فَارْجُمُوهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7167In-book reference : Book 93, Hadith 31USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7168,
    "id": 7168,
    "url": "https://sunnah.com/bukhari:7168",
    "bookNumber": 93,
    "hadithNumber": 32,
    "narrator": "(continued from above)\nNarrated Jabir bin Abdullah:",
    "english": "I was one of those who stoned him at the Musalla in Al-Madina (See Hadith 5272).",
    "arabic": "قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي مَنْ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كُنْتُ فِيمَنْ رَجَمَهُ بِالْمُصَلَّى‏.‏ رَوَاهُ يُونُسُ وَمَعْمَرٌ وَابْنُ جُرَيْجٍ عَنِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرَّجْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7168In-book reference : Book 93, Hadith 32USC-MSA web (English) reference : Vol. 1, Book 89, Hadith 280   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7169,
    "id": 7169,
    "url": "https://sunnah.com/bukhari:7169",
    "bookNumber": 93,
    "hadithNumber": 33,
    "narrator": "Narrated Um Salama:",
    "english": "Allah's Messenger (ﷺ) said, \"I am only a human being, and you people (opponents) come to me with your \ncases; and it may be that one of you can present his case eloquently in a more convincing way than the \nother, and I give my verdict according to what I hear. So if ever I judge (by error) and give the right of \na brother to his other (brother) then he (the latter) should not take it, for I am giving him only a piece \nof Fire.\" (See Hadith No. 638, Vol. 3).",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِي نَحْوَ مَا أَسْمَعُ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ أَخِيهِ شَيْئًا فَلاَ يَأْخُذْهُ، فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7169In-book reference : Book 93, Hadith 33USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 281   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7170,
    "id": 7170,
    "url": "https://sunnah.com/bukhari:7170",
    "bookNumber": 93,
    "hadithNumber": 34,
    "narrator": "Narrated Abu Qatada:",
    "english": "Allah's Messenger (ﷺ) said on the Day of (the battle of) Hunain, \"Whoever has killed an infidel and has a \nproof or a witness for it, then the salb (arms and belongings of that deceased) will be for him.\" I stood \nup to seek a witness to testify that I had killed an infidel but I could not find any witness and then sat \ndown. Then I thought that I should mention the case to Allah's Messenger (ﷺ) I (and when I did so) a man \nfrom those who were sitting with him said, \"The arms of the killed person he has mentioned, are with \nme, so please satisfy him on my behalf.\" Abu Bakr said, \"No, he will not give the arms to a bird of \nQuraish and deprive one of Allah's lions of it who fights for the cause of Allah and His Apostle.\" \nAllah's Messenger (ﷺ) I stood up and gave it to me, and I bought a garden with its price, and that was my \nfirst property which I owned through the war booty. \nThe people of Hijaz said, \"A judge should not pass a judgment according to his knowledge, whether \nhe was a witness at the time he was the judge or before that\" And if a litigant gives a confession in \nfavor of his opponent in the court, in the opinion of some scholars, the judge should not pass a \njudgment against him till the latter calls two witnesses to witness his confession. And some people of \nIraq said, \"A judge can pass a judgement according to what he hears or witnesses (the litigant's \nconfession) in the court itself, but if the confession takes place outside the court, he should not pass \nthe judgment unless two witnesses witness the confession.\" Some of them said, \"A judge can pass a \njudgement depending on his knowledge of the case as he is trust-worthy, and that a witness is \nRequired just to reveal the truth. The judge's knowledge is more than the witness.\" Some said, \"A \njudge can judge according to his knowledge only in cases involving property, but in other cases he \ncannot.\" Al-Qasim said, \"A judge ought not to pass a judgment depending on his knowledge if other \npeople do not know what he knows, although his knowledge is more than the witness of somebody \nelse because he might expose himself to suspicion by the Muslims and cause the Muslims to have \nunreasonable doubt. \"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ عُمَرَ بْنِ كَثِيرٍ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ أَنَّ أَبَا قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ ‏\"‏ مَنْ لَهُ بَيِّنَةٌ عَلَى قَتِيلٍ قَتَلَهُ، فَلَهُ سَلَبُهُ ‏\"‏‏.‏ فَقُمْتُ لأَلْتَمِسَ بَيِّنَةً عَلَى قَتِيلٍ، فَلَمْ أَرَ أَحَدًا يَشْهَدُ لِي، فَجَلَسْتُ، ثُمَّ بَدَا لِي فَذَكَرْتُ أَمْرَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ مِنْ جُلَسَائِهِ سِلاَحُ هَذَا الْقَتِيلِ الَّذِي يَذْكُرُ عِنْدِي‏.‏ قَالَ فَأَرْضِهِ مِنْهُ‏.‏ فَقَالَ أَبُو بَكْرٍ كَلاَّ لاَ يُعْطِهِ أُصَيْبِغَ مِنْ قُرَيْشٍ وَيَدَعَ أَسَدًا مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ‏.‏ قَالَ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَدَّاهُ إِلَىَّ فَاشْتَرَيْتُ مِنْهُ خِرَافًا فَكَانَ أَوَّلَ مَالٍ تَأَثَّلْتُهُ‏.‏ قَالَ لِي عَبْدُ اللَّهِ عَنِ اللَّيْثِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَأَدَّاهُ إِلَىَّ‏.‏ وَقَالَ أَهْلُ الْحِجَازِ الْحَاكِمُ لاَ يَقْضِي بِعِلْمِهِ، شَهِدَ بِذَلِكَ فِي وِلاَيَتِهِ أَوْ قَبْلَهَا‏.‏ وَلَوْ أَقَرَّ خَصْمٌ عِنْدَهُ لآخَرَ بِحَقٍّ فِي مَجْلِسِ الْقَضَاءِ، فَإِنَّهُ لاَ يَقْضِي عَلَيْهِ فِي قَوْلِ بَعْضِهِمْ، حَتَّى يَدْعُوَ بِشَاهِدَيْنِ فَيُحْضِرَهُمَا إِقْرَارَهُ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِرَاقِ مَا سَمِعَ أَوْ رَآهُ فِي مَجْلِسِ الْقَضَاءِ قَضَى بِهِ، وَمَا كَانَ فِي غَيْرِهِ لَمْ يَقْضِ إِلاَّ بِشَاهِدَيْنِ‏.‏ وَقَالَ آخَرُونَ مِنْهُمْ بَلْ يَقْضِي بِهِ، لأَنَّهُ مُؤْتَمَنٌ، وَإِنَّمَا يُرَادُ مِنَ الشَّهَادَةِ مَعْرِفَةُ الْحَقِّ، فَعِلْمُهُ أَكْثَرُ مِنَ الشَّهَادَةِ‏.‏ وَقَالَ بَعْضُهُمْ يَقْضِي بِعِلْمِهِ فِي الأَمْوَالِ، وَلاَ يَقْضِي فِي غَيْرِهَا‏.‏ وَقَالَ الْقَاسِمُ لاَ يَنْبَغِي لِلْحَاكِمِ أَنْ يُمْضِيَ قَضَاءً بِعِلْمِهِ دُونَ عِلْمِ غَيْرِهِ، مَعَ أَنَّ عِلْمَهُ أَكْثَرُ مِنْ شَهَادَةِ غَيْرِهِ، وَلَكِنَّ فِيهِ تَعَرُّضًا لِتُهَمَةِ نَفْسِهِ عِنْدَ الْمُسْلِمِينَ، وَإِيقَاعًا لَهُمْ فِي الظُّنُونِ، وَقَدْ كَرِهَ النَّبِيُّ صلى الله عليه وسلم الظَّنَّ فَقَالَ ‏\"‏ إِنَّمَا هَذِهِ صَفِيَّةُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7170In-book reference : Book 93, Hadith 34USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 282   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7171,
    "id": 7171,
    "url": "https://sunnah.com/bukhari:7171",
    "bookNumber": 93,
    "hadithNumber": 35,
    "narrator": "Narrated `Ali bin Husain:",
    "english": "Safiya bint (daughter of) Huyai came to the Prophet (in the mosque), and when she returned (home), \nthe Prophet (ﷺ) accompanied her. It happened that two men from the Ansar passed by them and the \nProphet called them saying, \"She is Safiya!\" those two men said, \"Subhan Allah!\" The Prophet (ﷺ) said, \n\"Satan circulates in the human body as blood does.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَتَتْهُ صَفِيَّةُ بِنْتُ حُيَىٍّ فَلَمَّا رَجَعَتِ انْطَلَقَ مَعَهَا، فَمَرَّ بِهِ رَجُلاَنِ مِنَ الأَنْصَارِ فَدَعَاهُمَا فَقَالَ ‏\"‏ إِنَّمَا هِيَ صَفِيَّةُ ‏\"‏‏.‏ قَالاَ سُبْحَانَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنِ ابْنِ آدَمَ مَجْرَى الدَّمِ ‏\"‏‏.‏ رَوَاهُ شُعَيْبٌ وَابْنُ مُسَافِرٍ وَابْنُ أَبِي عَتِيقٍ وَإِسْحَاقُ بْنُ يَحْيَى عَنِ الزُّهْرِيِّ عَنْ عَلِيٍّ ـ يَعْنِي ابْنَ حُسَيْنٍ ـ عَنْ صَفِيَّةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7171In-book reference : Book 93, Hadith 35USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 283   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7172,
    "id": 7172,
    "url": "https://sunnah.com/bukhari:7172",
    "bookNumber": 93,
    "hadithNumber": 36,
    "narrator": "Narrated Abu Burda:",
    "english": "The Prophet (ﷺ) sent my father and Mu`adh bin Jabal to Yemen and said (to them), \"Make things easy for \nthe people and do not put hurdles in their way, and give them glad tiding, and don't let them have \naversion (i.e. to make people to hate good deeds) and you both should work in cooperation and mutual \nunderstanding\" Abu Musa said to Allah's Messenger (ﷺ), \"In our country a special alcoholic drink called Al- \nBit', is prepared (for drinking).\" The Prophet (ﷺ) said, \"Every intoxicant is prohibited. \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا الْعَقَدِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، قَالَ سَمِعْتُ أَبِي قَالَ، بَعَثَ النَّبِيُّ صلى الله عليه وسلم أَبِي وَمُعَاذَ بْنَ جَبَلٍ عَلَى الْيَمَنِ فَقَالَ ‏\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا ‏\"‏‏.‏ فَقَالَ لَهُ أَبُو مُوسَى إِنَّهُ يُصْنَعُ بِأَرْضِنَا الْبِتْعُ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ وَقَالَ النَّضْرُ وَأَبُو دَاوُدَ وَيَزِيدُ بْنُ هَارُونَ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ سَعِيدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7172In-book reference : Book 93, Hadith 36USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 284   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7173,
    "id": 7173,
    "url": "https://sunnah.com/bukhari:7173",
    "bookNumber": 93,
    "hadithNumber": 37,
    "narrator": "Narrated Abu Musa:",
    "english": "The Prophet (ﷺ) said, \"Set free the captives and accept invitations.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي مَنْصُورٌ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فُكُّوا الْعَانِيَ وَأَجِيبُوا الدَّاعِيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7173In-book reference : Book 93, Hadith 37USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 285   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7174,
    "id": 7174,
    "url": "https://sunnah.com/bukhari:7174",
    "bookNumber": 93,
    "hadithNumber": 38,
    "narrator": "Narrated Abu Humaid Al-Sa`idi:",
    "english": "The Prophet (ﷺ) appointed a man from the tribe of Bani Asad, called Ibn Al-Utabiyya to collect the Zakat. \nWhen he returned (with the money) he said (to the Prophet), \"This is for you and this has been given \nto me as a gift.\" The Prophet (ﷺ) stood up on the pulpit (Sufyan said he ascended the pulpit), and after \nglorifying and praising Allah, he said, \"What is wrong with the employee whom we send (to collect \nZakat from the public) that he returns to say, 'This is for you and that is for me?' Why didn't he stay at \nhis father's and mother's house to see whether he will be given gifts or not? By Him in Whose Hand \nmy life is, whoever takes anything illegally will bring it on the Day of Resurrection by carrying it over \nhis neck: if it is a camel, it will be grunting: if it is a cow, it will be mooing: and if it is a sheep it will \nbe bleating!\" The Prophet (ﷺ) then raised both his hands till we saw the whiteness of his armpits (and he \nsaid), \"No doubt! Haven't I conveyed Allah's Message?\" And he repeated it three times.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، أَنَّهُ سَمِعَ عُرْوَةَ، أَخْبَرَنَا أَبُو حُمَيْدٍ السَّاعِدِيُّ، قَالَ اسْتَعْمَلَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً مِنْ بَنِي أَسَدٍ يُقَالُ لَهُ ابْنُ الأُتَبِيَّةِ عَلَى صَدَقَةٍ فَلَمَّا قَدِمَ قَالَ هَذَا لَكُمْ وَهَذَا أُهْدِيَ لِي‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ ـ قَالَ سُفْيَانُ أَيْضًا فَصَعِدَ الْمِنْبَرَ ـ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ مَا بَالُ الْعَامِلِ نَبْعَثُهُ، فَيَأْتِي يَقُولُ هَذَا لَكَ وَهَذَا لِي‏.‏ فَهَلاَّ جَلَسَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرُ أَيُهْدَى لَهُ أَمْ لاَ، وَالَّذِي نَفْسِي بِيَدِهِ لاَ يَأْتِي بِشَىْءٍ إِلاَّ جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى رَقَبَتِهِ، إِنْ كَانَ بَعِيرًا لَهُ رُغَاءٌ، أَوْ بَقَرَةً لَهَا خُوَارٌ، أَوْ شَاةً تَيْعَرُ ‏\"‏‏.‏ ثُمَّ رَفَعَ يَدَيْهِ حَتَّى رَأَيْنَا عُفْرَتَىْ إِبْطَيْهِ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏ ثَلاَثًا‏.‏ قَالَ سُفْيَانُ قَصَّهُ عَلَيْنَا الزُّهْرِيُّ‏.‏ وَزَادَ هِشَامٌ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ قَالَ سَمِعَ أُذُنَاىَ وَأَبْصَرَتْهُ عَيْنِي، وَسَلُوا زَيْدَ بْنَ ثَابِتٍ فَإِنَّهُ سَمِعَهُ مَعِي‏.‏ وَلَمْ يَقُلِ الزُّهْرِيُّ سَمِعَ أُذُنِي‏.‏ ‏{‏خُوَارٌ‏}‏ صَوْتٌ، وَالْجُؤَارُ مِنْ تَجْأَرُونَ كَصَوْتِ الْبَقَرَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7174In-book reference : Book 93, Hadith 38USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 286   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7175,
    "id": 7175,
    "url": "https://sunnah.com/bukhari:7175",
    "bookNumber": 93,
    "hadithNumber": 39,
    "narrator": "Narrated Ibn `Umar:",
    "english": "Salim, the freed salve of Abu Hudhaifa used to lead in prayer the early Muhajirin (emigrants) and the \ncompanions of the Prophet (ﷺ) in the Quba mosque. Among those (who used to pray behind him) were \nAbu Bakr, `Umar, Abu Salama, and Amir bin Rabi`a.",
    "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، أَنَّ نَافِعًا، أَخْبَرَهُ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ كَانَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَؤُمُّ الْمُهَاجِرِينَ الأَوَّلِينَ وَأَصْحَابَ النَّبِيِّ صلى الله عليه وسلم فِي مَسْجِدِ قُبَاءٍ، فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ وَأَبُو سَلَمَةَ وَزَيْدٌ وَعَامِرُ بْنُ رَبِيعَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7175In-book reference : Book 93, Hadith 39USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 287   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7176,
    "id": 7176,
    "url": "https://sunnah.com/bukhari:7176",
    "bookNumber": 93,
    "hadithNumber": 40,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "Marwan bin Al-Hakam and Al-Miswar bin Makhrama told him that when the Muslims were permitted \nto set free the captives of Hawazin, Allah's Messenger (ﷺ) said, \"I do not know who amongst you has agreed \n(to it) and who has not. Go back so that your 'Urafa' may submit your decision to us.\" So the people \nreturned and their 'Urafa' talked to them and then came back to Allah's Messenger (ﷺ) and told him that the \npeople had given their consent happily and permitted (their captives to be freed).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَمِّهِ، مُوسَى بْنِ عُقْبَةَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ أَذِنَ لَهُمُ الْمُسْلِمُونَ فِي عِتْقِ سَبْىِ هَوَازِنَ ‏\n\"‏ إِنِّي لاَ أَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ، فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، فَرَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّ النَّاسَ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7176, 7177In-book reference : Book 93, Hadith 40USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7177,
    "id": 7177,
    "url": "https://sunnah.com/bukhari:7177",
    "bookNumber": 93,
    "hadithNumber": 40,
    "narrator": "Narrated `Urwa bin Az-Zubair:",
    "english": "Marwan bin Al-Hakam and Al-Miswar bin Makhrama told him that when the Muslims were permitted \nto set free the captives of Hawazin, Allah's Messenger (ﷺ) said, \"I do not know who amongst you has agreed \n(to it) and who has not. Go back so that your 'Urafa' may submit your decision to us.\" So the people \nreturned and their 'Urafa' talked to them and then came back to Allah's Messenger (ﷺ) and told him that the \npeople had given their consent happily and permitted (their captives to be freed).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَمِّهِ، مُوسَى بْنِ عُقْبَةَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ أَذِنَ لَهُمُ الْمُسْلِمُونَ فِي عِتْقِ سَبْىِ هَوَازِنَ ‏\n\"‏ إِنِّي لاَ أَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ، فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، فَرَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّ النَّاسَ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7176, 7177In-book reference : Book 93, Hadith 40USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 288   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7178,
    "id": 7178,
    "url": "https://sunnah.com/bukhari:7178",
    "bookNumber": 93,
    "hadithNumber": 41,
    "narrator": "Narrated Muhammad bin Zaid bin `Abdullah bin `Umar:",
    "english": "Some people said to Ibn `Umar, \"When we enter upon our ruler(s) we say in their praise what is \ncontrary to what we say when we leave them.\" Ibn `Umar said, \"We used to consider this as \nhypocrisy.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ أُنَاسٌ لاِبْنِ عُمَرَ إِنَّا نَدْخُلُ عَلَى سُلْطَانِنَا فَنَقُولُ لَهُمْ خِلاَفَ مَا نَتَكَلَّمُ إِذَا خَرَجْنَا مِنْ عِنْدِهِمْ قَالَ كُنَّا نَعُدُّهَا نِفَاقًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7178In-book reference : Book 93, Hadith 41USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 289   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7179,
    "id": 7179,
    "url": "https://sunnah.com/bukhari:7179",
    "bookNumber": 93,
    "hadithNumber": 42,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ)s said, \"The worst of all mankind is the double-faced one, who comes to some people \nwith one face and to others, with another face.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنْ شَرَّ النَّاسِ ذُو الْوَجْهَيْنِ، الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7179In-book reference : Book 93, Hadith 42USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 290   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7180,
    "id": 7180,
    "url": "https://sunnah.com/bukhari:7180",
    "bookNumber": 93,
    "hadithNumber": 43,
    "narrator": "Narrated `Aisha:",
    "english": "Hind (bint `Utba) said to the Prophet (ﷺ) \"Abu Sufyan is a miserly man and I need to take some money of \nhis wealth.\" The Prophet (ﷺ) said, \"Take reasonably what is sufficient for you and your children \"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ هِنْدَ، قَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، فَأَحْتَاجُ أَنْ آخُذَ مِنْ مَالِهِ‏.‏ قَالَ ‏\n\"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7180In-book reference : Book 93, Hadith 43USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 291   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7181,
    "id": 7181,
    "url": "https://sunnah.com/bukhari:7181",
    "bookNumber": 93,
    "hadithNumber": 44,
    "narrator": "Narrated Um Salama:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling, so \nhe went out to them and said, \"I am only a human being, and litigants with cases of dispute come to \nme, and someone of you may happen to be more eloquent (in presenting his case) than the other, \nwhereby I may consider that he is truthful and pass a judgment in his favor. If ever I pass a judgment \nin favor of somebody whereby he takes a Muslim's right unjustly, then whatever he takes is nothing \nbut a piece of Fire, and it is up to him to take or leave.\"",
    "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَمِعَ خُصُومَةً بِبَابِ حُجْرَتِهِ فَخَرَجَ إِلَيْهِمْ فَقَالَ ‏\n\"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، فَأَحْسِبُ أَنَّهُ صَادِقٌ فَأَقْضِي لَهُ بِذَلِكَ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ، فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَأْخُذْهَا أَوْ لِيَتْرُكْهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7181In-book reference : Book 93, Hadith 44USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 292   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7182,
    "id": 7182,
    "url": "https://sunnah.com/bukhari:7182",
    "bookNumber": 93,
    "hadithNumber": 45,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) `Utba bin Abi Waqqas said to his brother Sa`d bin Abi Waqqas, \"The son of \nthe slave girl of Zam`a is from me, so take him into your custody.\" So in the year of Conquest of \nMecca, Sa`d took him and said. (This is) my brother's son whom my brother has asked me to take into \nmy custody.\" `Abd bin Zam`a got up before him and said, (He is) my brother and the son of the slave \ngirl of my father, and was born on my father's bed.\" So they both submitted their case before Allah's \nApostle. Sa`d said, \"O Allah's Messenger (ﷺ)! This boy is the son of my brother and he entrusted him to me.\" \n`Abd bin Zam`a said, \"This boy is my brother and the son of the slave girl of my father, and was born \non the bed of my father.\" Allah's Messenger (ﷺ) said, \"The boy is for you, O `Abd bin Zam`a!\" Then Allah's \nApostle further said, \"The child is for the owner of the bed, and the stone is for the adulterer,\" He then \nsaid to Sauda bint Zam`a, \"Veil (screen) yourself before him,\" when he saw the child's resemblance to \n`Utba. The boy did not see her again till he met Allah.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي، قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ، فَقَامَ إِلَيْهِ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي، كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏، لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ تَعَالَى‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7182In-book reference : Book 93, Hadith 45USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 293   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 7183,
    "id": 7183,
    "url": "https://sunnah.com/bukhari:7183",
    "bookNumber": 93,
    "hadithNumber": 46,
    "narrator": "Narrated `Abdullah:",
    "english": "The Prophet (ﷺ) said, \"If somebody on the demand of a judge takes an oath to grab (a Muslim's) property \nand he is liar in it, he will meet Allah Who will be angry with him\". So Allah revealed,:-- \n'Verily! those who purchase a small gain at the cost of Allah's Covenant and their oaths..' (3.77) 'Al- \nAshath came while `Abdullah was narrating (this) to the people. Al-Ashath said, \"This verse was \nrevealed regarding me and another man with whom I had a quarrel about a well. The Prophet (ﷺ) said (to \nme), \"Do you have any evidence?' I replied, 'No.' He said, 'Let your opponent take an oath.' I said: I \nam sure he would take a (false) oath.\" Thereupon it was revealed: 'Verily! those who purchase a small \ngain at the cost of Allah's Covenant....' (3.77) (See Hadith No. 72, Vol 6).",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَحْلِفُ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ مَالاً وَهْوَ فِيهَا فَاجِرٌ، إِلاَّ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏ الآيَةَ‏.‏ \nفَجَاءَ الأَشْعَثُ وَعَبْدُ اللَّهِ يُحَدِّثُهُمْ فَقَالَ فِيَّ نَزَلَتْ وَفِي رَجُلٍ خَاصَمْتُهُ فِي بِئْرٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَلْيَحْلِفْ ‏\"‏‏.‏ قُلْتُ إِذًا يَحْلِفُ‏.‏ فَنَزَلَتْ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏ الآيَةَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 7183, 7184In-book reference : Book 93, Hadith 46USC-MSA web (English) reference : Vol. 9, Book 89, Hadith 294   (deprecated numbering scheme)"
  }
]