[
  {
    "hadithGlobalNumber": 5601,
    "id": 5601,
    "url": "https://sunnah.com/bukhari:5601",
    "bookNumber": 74,
    "hadithNumber": 27,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and \nfresh ripe dates.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ جَابِرًا ـ رضى الله عنه ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الزَّبِيبِ وَالتَّمْرِ وَالْبُسْرِ وَالرُّطَبِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5601In-book reference : Book 74, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 506   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5602,
    "id": 5602,
    "url": "https://sunnah.com/bukhari:5602",
    "bookNumber": 74,
    "hadithNumber": 28,
    "narrator": "Narrated Abu Qatada:",
    "english": "The Prophet (ﷺ) forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for \npreparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have \nsuch drinks as long as it is fresh )",
    "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُجْمَعَ بَيْنَ التَّمْرِ وَالزَّهْوِ، وَالتَّمْرِ وَالزَّبِيبِ، وَلْيُنْبَذْ كُلُّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5602In-book reference : Book 74, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 507   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5603,
    "id": 5603,
    "url": "https://sunnah.com/bukhari:5603",
    "bookNumber": 74,
    "hadithNumber": 29,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) was presented a bowl of milk and a bowl of wine on the night he was taken on a \njourney (Al-Mi'raj).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ بِقَدَحِ لَبَنٍ وَقَدَحِ خَمْرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5603In-book reference : Book 74, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 508   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5604,
    "id": 5604,
    "url": "https://sunnah.com/bukhari:5604",
    "bookNumber": 74,
    "hadithNumber": 30,
    "narrator": "Narrated Um Al-Fadl:",
    "english": "The people doubted whether Allah's Messenger (ﷺ) was fasting or the Day of `Arafat or not. So I sent a cup \ncontaining milk to him and he drank it.",
    "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، سَمِعَ سُفْيَانَ، أَخْبَرَنَا سَالِمٌ أَبُو النَّضْرِ، أَنَّهُ سَمِعَ عُمَيْرًا، مَوْلَى أُمِّ الْفَضْلِ يُحَدِّثُ عَنْ أُمِّ الْفَضْلِ، قَالَتْ شَكَّ النَّاسُ فِي صِيَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ عَرَفَةَ، فَأَرْسَلْتُ إِلَيْهِ بِإِنَاءٍ فِيهِ لَبَنٌ فَشَرِبَ‏.‏ فَكَانَ سُفْيَانُ رُبَّمَا قَالَ شَكَّ النَّاسُ فِي صِيَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ عَرَفَةَ فَأَرْسَلَتْ إِلَيْهِ أُمُّ الْفَضْلِ‏.‏ فَإِذَا وُقِفَ عَلَيْهِ قَالَ هُوَ عَنْ أُمِّ الْفَضْلِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5604In-book reference : Book 74, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 509   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5605,
    "id": 5605,
    "url": "https://sunnah.com/bukhari:5605",
    "bookNumber": 74,
    "hadithNumber": 31,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Messenger (ﷺ) said to him, \"Will you \nnot cover it, even by placing a stick across its\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، وَأَبِي، سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْداللَّهِ، قَالَ جَاءَ أَبُو حُمَيْدٍ بِقَدَحٍ مِنْ لَبَنٍ مِنَ النَّقِيعِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَّ خَمَّرْتَهُ وَلَوْ أَنْ تَعْرُضَ عَلَيْهِ عُودًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5605In-book reference : Book 74, Hadith 31USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 510   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5606,
    "id": 5606,
    "url": "https://sunnah.com/bukhari:5606",
    "bookNumber": 74,
    "hadithNumber": 32,
    "narrator": "Narrated Jabir:",
    "english": "Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet (ﷺ) \nsaid, \"Will you not cover it even by placing a stick across it?\"",
    "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، يَذْكُرُ ـ أُرَاهُ ـ عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ جَاءَ أَبُو حُمَيْدٍ ـ رَجُلٌ مِنَ الأَنْصَارِ ـ مِنَ النَّقِيعِ بِإِنَاءٍ مِنْ لَبَنٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَلاَّ خَمَّرْتَهُ، وَلَوْ أَنْ تَعْرُضَ عَلَيْهِ عُودًا ‏\"‏‏.‏ وَحَدَّثَنِي أَبُو سُفْيَانَ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5606In-book reference : Book 74, Hadith 32USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 511   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5607,
    "id": 5607,
    "url": "https://sunnah.com/bukhari:5607",
    "bookNumber": 74,
    "hadithNumber": 33,
    "narrator": "Narrated Al-Bara:",
    "english": "The Prophet (ﷺ) came from Mecca with Abu Bakr. Abu Bakr said \"We passed by a shepherd and at that \ntime Allah's Messenger (ﷺ) was thirsty. I milked a little milk in a bowl and Allah's Messenger (ﷺ) drank till I was \npleased. Suraqa bin Ju'shum came to us riding a horse (chasing us). The Prophet (ﷺ) invoked evil upon \nhim, whereupon Suraqa requested him not to invoke evil upon him, in which case he would go back. \nThe Prophet (ﷺ) agreed.",
    "arabic": "حَدَّثَنِي مَحْمُودٌ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مِنْ مَكَّةَ وَأَبُو بَكْرٍ مَعَهُ قَالَ أَبُو بَكْرٍ مَرَرْنَا بِرَاعٍ وَقَدْ عَطِشَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَحَلَبْتُ كُثْبَةً مِنْ لَبَنٍ فِي قَدَحٍ، فَشَرِبَ حَتَّى رَضِيتُ، وَأَتَانَا سُرَاقَةُ بْنُ جُعْشُمٍ عَلَى فَرَسٍ فَدَعَا عَلَيْهِ، فَطَلَبَ إِلَيْهِ سُرَاقَةُ أَنْ لاَ يَدْعُوَ عَلَيْهِ، وَأَنْ يَرْجِعَ فَفَعَلَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5607In-book reference : Book 74, Hadith 33USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 512   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5608,
    "id": 5608,
    "url": "https://sunnah.com/bukhari:5608",
    "bookNumber": 74,
    "hadithNumber": 34,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The best object of charity is a she-camel which has (newly) given birth and \ngives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its \nmilk by milking one bowl in the morning and one in the evening.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ نِعْمَ الصَّدَقَةُ اللِّقْحَةُ الصَّفِيُّ مِنْحَةً، وَالشَّاةُ الصَّفِيُّ مِنْحَةً، تَغْدُو بِإِنَاءٍ، وَتَرُوحُ بِآخَرَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5608In-book reference : Book 74, Hadith 34USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 513   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5609,
    "id": 5609,
    "url": "https://sunnah.com/bukhari:5609",
    "bookNumber": 74,
    "hadithNumber": 35,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) drank milk and then rinsed his mouth and said, \"It contains fat.\"",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ الأَوْزَاعِيِّ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شَرِبَ لَبَنًا فَمَضْمَضَ وَقَالَ ‏\n\"‏ إِنَّ لَهُ دَسَمًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5609In-book reference : Book 74, Hadith 35USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 514   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5610,
    "id": 5610,
    "url": "https://sunnah.com/bukhari:5610",
    "bookNumber": 74,
    "hadithNumber": 36,
    "narrator": "The Prophet (ﷺ) added:",
    "english": "I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. \nThose which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).\"",
    "arabic": "وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رُفِعْتُ إِلَى السِّدْرَةِ فَإِذَا أَرْبَعَةُ أَنْهَارٍ، نَهَرَانِ ظَاهِرَانِ، وَنَهَرَانِ بَاطِنَانِ، فَأَمَّا الظَّاهِرَانِ النِّيلُ وَالْفُرَاتُ، وَأَمَّا الْبَاطِنَانِ فَنَهَرَانِ فِي الْجَنَّةِ فَأُتِيتُ بِثَلاَثَةِ أَقْدَاحٍ، قَدَحٌ فِيهِ لَبَنٌ، وَقَدَحٌ فِيهِ عَسَلٌ، وَقَدَحٌ فِيهِ خَمْرٌ، فَأَخَذْتُ الَّذِي فِيهِ اللَّبَنُ فَشَرِبْتُ فَقِيلَ لِي أَصَبْتَ الْفِطْرَةَ أَنْتَ وَأُمَّتُكَ ‏\"‏‏.‏ قَالَ هِشَامٌ وَسَعِيدٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ مَالِكِ بْنِ صَعْصَعَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الأَنْهَارِ نَحْوَهُ، وَلَمْ يَذْكُرُوا ثَلاَثَةَ أَقْدَاحٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5610In-book reference : Book 74, Hadith 36USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 514   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5611,
    "id": 5611,
    "url": "https://sunnah.com/bukhari:5611",
    "bookNumber": 74,
    "hadithNumber": 37,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of \nhis property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Messenger (ﷺ) \nused to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu \nTalha got up and said, \"O Allah's Messenger (ﷺ)! Allah says: By no means shall you attain righteousness \nunless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden \nand I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can \nspend it, O Allah's Messenger (ﷺ), where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a \nperishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have \nheard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu \nTalha said, \"I will do so, O Allah's Messenger (ﷺ)!\" Abu Talha distributed that garden among his kith and kin \nand cousins.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالاً مِنْ نَخْلٍ، وَكَانَ أَحَبُّ مَالِهِ إِلَيْهِ بَيْرَحَاءَ، وَكَانَتْ مُسْتَقْبِلَ الْمَسْجِدِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ‏.‏ قَالَ أَنَسٌ فَلَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ يَقُولُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ مَالِي إِلَىَّ بَيْرُحَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخٍ ذَلِكَ مَالٌ رَابِحٌ ـ أَوْ رَايِحٌ شَكَّ عَبْدُ اللَّهِ ـ وَقَدْ سَمِعْتُ مَا قُلْتَ وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ، فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَفِي بَنِي عَمِّهِ‏.‏ وَقَالَ إِسْمَاعِيلُ وَيَحْيَى بْنُ يَحْيَى رَايِحٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5611In-book reference : Book 74, Hadith 37USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 515   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5612,
    "id": 5612,
    "url": "https://sunnah.com/bukhari:5612",
    "bookNumber": 74,
    "hadithNumber": 38,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I saw Allah's Messenger (ﷺ) drinking milk. He came to my house and I milked a sheep and then mixed the \nmilk with water from the well for Allah's Messenger (ﷺ). He took the bowl and drank while on his left there \nwas sitting Abu Bakr, and on his right there was a bedouin. He then gave the remaining milk to the \nbedouin and said, \"The right! The right (first).",
    "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم شَرِبَ لَبَنًا، وَأَتَى دَارَهُ فَحَلَبْتُ شَاةً فَشُبْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْبِئْرِ، فَتَنَاوَلَ الْقَدَحَ فَشَرِبَ، وَعَنْ يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ، فَأَعْطَى الأَعْرَابِيَّ فَضْلَهُ، ثُمَّ قَالَ ‏\n\"‏ الأَيْمَنَ فَالأَيْمَنَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5612In-book reference : Book 74, Hadith 38USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 516   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5613,
    "id": 5613,
    "url": "https://sunnah.com/bukhari:5613",
    "bookNumber": 74,
    "hadithNumber": 39,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) and one of his companions entered upon an Ansari man and the Prophet (ﷺ) said to him, \n\"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting \nour mouth in it.\" The man was watering his garden then. He said, \"O Allah's Messenger (ﷺ)! I have water \nkept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and \nmilked a domestic goat of his in it. Allah's Messenger (ﷺ) drank, and then the man who had come along with \nhim, drank.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَمَعَهُ صَاحِبٌ لَهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ عِنْدَكَ مَاءٌ بَاتَ هَذِهِ اللَّيْلَةَ فِي شَنَّةٍ، وَإِلاَّ كَرَعْنَا ‏\"‏‏.‏ قَالَ وَالرَّجُلُ يُحَوِّلُ الْمَاءَ فِي حَائِطِهِ ـ قَالَ ـ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ عِنْدِي مَاءٌ بَائِتٌ فَانْطَلِقْ إِلَى الْعَرِيشِ ـ قَالَ ـ فَانْطَلَقَ بِهِمَا، فَسَكَبَ فِي قَدَحٍ، ثُمَّ حَلَبَ عَلَيْهِ مِنْ دَاجِنٍ لَهُ ـ قَالَ ـ فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ شَرِبَ الرَّجُلُ الَّذِي جَاءَ مَعَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5613In-book reference : Book 74, Hadith 39USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 517   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5614,
    "id": 5614,
    "url": "https://sunnah.com/bukhari:5614",
    "bookNumber": 74,
    "hadithNumber": 40,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ الْحَلْوَاءُ وَالْعَسَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5614In-book reference : Book 74, Hadith 40USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 518   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5615,
    "id": 5615,
    "url": "https://sunnah.com/bukhari:5615",
    "bookNumber": 74,
    "hadithNumber": 41,
    "narrator": "Narrated An-Nazzal:",
    "english": "Ali came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and \nsaid, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as \nyou have seen me doing now.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنِ النَّزَّالِ، قَالَ أَتَى عَلِيٌّ ـ رضى الله عنه ـ عَلَى باب الرَّحَبَةِ، فَشَرِبَ قَائِمًا فَقَالَ إِنَّ نَاسًا يَكْرَهُ أَحَدُهُمْ أَنْ يَشْرَبَ وَهْوَ قَائِمٌ، وَإِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فَعَلَ كَمَا رَأَيْتُمُونِي فَعَلْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5615In-book reference : Book 74, Hadith 41USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 519   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5616,
    "id": 5616,
    "url": "https://sunnah.com/bukhari:5616",
    "bookNumber": 74,
    "hadithNumber": 42,
    "narrator": "Narrated An-Nazzal bin Sabra:",
    "english": "`Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order \nto deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him \nand he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining \nwater while he was standing. and said, \"Some people dislike to drink water while standing thought the \nProphet did as I have just done.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ، سَمِعْتُ النَّزَّالَ بْنَ سَبْرَةَ، يُحَدِّثُ عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّهُ صَلَّى الظُّهْرَ ثُمَّ قَعَدَ فِي حَوَائِجِ النَّاسِ فِي رَحَبَةِ الْكُوفَةِ حَتَّى حَضَرَتْ صَلاَةُ الْعَصْرِ، ثُمَّ أُتِيَ بِمَاءٍ فَشَرِبَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَذَكَرَ رَأْسَهُ وَرِجْلَيْهِ، ثُمَّ قَامَ فَشَرِبَ فَضْلَهُ وَهْوَ قَائِمٌ ثُمَّ قَالَ إِنَّ نَاسًا يَكْرَهُونَ الشُّرْبَ قَائِمًا وَإِنَّ النَّبِيَّ صلى الله عليه وسلم صَنَعَ مِثْلَ مَا صَنَعْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5616In-book reference : Book 74, Hadith 42USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 520   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5617,
    "id": 5617,
    "url": "https://sunnah.com/bukhari:5617",
    "bookNumber": 74,
    "hadithNumber": 43,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) drank Zamzam (water) while standing.",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَرِبَ النَّبِيُّ صلى الله عليه وسلم قَائِمًا مِنْ زَمْزَمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5617In-book reference : Book 74, Hadith 43USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 521   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5618,
    "id": 5618,
    "url": "https://sunnah.com/bukhari:5618",
    "bookNumber": 74,
    "hadithNumber": 44,
    "narrator": "Narrated Um Al-Fadl:",
    "english": "(daughter of Al-Harith) that she sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) \nin the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The \nProphet was on the back of his camel.",
    "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، أَخْبَرَنَا أَبُو النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّهَا أَرْسَلَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم بِقَدَحِ لَبَنٍ، وَهُوَ وَاقِفٌ عَشِيَّةَ عَرَفَةَ، فَأَخَذَ بِيَدِهِ فَشَرِبَهُ‏.‏ زَادَ مَالِكٌ عَنْ أَبِي النَّضْرِ عَلَى بَعِيرِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5618In-book reference : Book 74, Hadith 44USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 522   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5619,
    "id": 5619,
    "url": "https://sunnah.com/bukhari:5619",
    "bookNumber": 74,
    "hadithNumber": 45,
    "narrator": "Narrated Anas bin Malik:",
    "english": "Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr \nwas on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right \n(first).",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ، وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ شِمَالِهِ أَبُو بَكْرٍ، فَشَرِبَ، ثُمَّ أَعْطَى الأَعْرَابِيَّ، وَقَالَ ‏\n\"‏ الأَيْمَنَ الأَيْمَنَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5619In-book reference : Book 74, Hadith 45USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 523   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5620,
    "id": 5620,
    "url": "https://sunnah.com/bukhari:5620",
    "bookNumber": 74,
    "hadithNumber": 46,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his \nleft were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy \nsaid, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that \nAllah's Messenger (ﷺ) placed the cup in the hand of that boy.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ فَشَرِبَ مِنْهُ، وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ‏.‏ فَقَالَ لِلْغُلاَمِ ‏\n\"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ الْغُلاَمُ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5620In-book reference : Book 74, Hadith 46USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 524   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5621,
    "id": 5621,
    "url": "https://sunnah.com/bukhari:5621",
    "bookNumber": 74,
    "hadithNumber": 47,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion \ngreeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! \nIt is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight \nin a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was \nwatering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He \nwent to the shade and poured some water into a bowl and milked some milk from a domestic goat in \nit. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَمَعَهُ صَاحِبٌ لَهُ، فَسَلَّمَ النَّبِيُّ صلى الله عليه وسلم وَصَاحِبُهُ، فَرَدَّ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي‏.‏ وَهْىَ سَاعَةٌ حَارَّةٌ، وَهْوَ يُحَوِّلُ فِي حَائِطٍ لَهُ ـ يَعْنِي الْمَاءَ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ عِنْدَكَ مَاءٌ بَاتَ فِي شَنَّةٍ وَإِلاَّ كَرَعْنَا ‏\"‏‏.‏ وَالرَّجُلُ يُحَوِّلُ الْمَاءَ فِي حَائِطٍ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ عِنْدِي مَاءٌ بَاتَ فِي شَنَّةٍ‏.‏ فَانْطَلَقَ إِلَى الْعَرِيشِ فَسَكَبَ فِي قَدَحٍ مَاءً، ثُمَّ حَلَبَ عَلَيْهِ مِنْ دَاجِنٍ لَهُ، فَشَرِبَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ أَعَادَ، فَشَرِبَ الرَّجُلُ الَّذِي جَاءَ مَعَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5621In-book reference : Book 74, Hadith 47USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 525   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5622,
    "id": 5622,
    "url": "https://sunnah.com/bukhari:5622",
    "bookNumber": 74,
    "hadithNumber": 48,
    "narrator": "Narrated Anas:",
    "english": "I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the \nyoungest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to \nme), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was \n(made from), He replied, \"(From) ripe dates and unripe dates.\"",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ قَالَ كُنْتُ قَائِمًا عَلَى الْحَىِّ أَسْقِيهِمْ ـ عُمُومَتِي وَأَنَا أَصْغَرُهُمُ ـ الْفَضِيخَ، فَقِيلَ حُرِّمَتِ الْخَمْرُ‏.‏ فَقَالَ أَكْفِئْهَا‏.‏ فَكَفَأْنَا‏.‏ قُلْتُ لأَنَسٍ مَا شَرَابُهُمْ قَالَ رُطَبٌ وَبُسْرٌ‏.‏ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ وَكَانَتْ خَمْرَهُمْ‏.‏ فَلَمْ يُنْكِرْ أَنَسٌ‏.‏ وَحَدَّثَنِي بَعْضُ أَصْحَابِي أَنَّهُ سَمِعَ أَنَسًا يَقُولُ كَانَتْ خَمْرَهُمْ يَوْمَئِذٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5622In-book reference : Book 74, Hadith 48USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 526   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5623,
    "id": 5623,
    "url": "https://sunnah.com/bukhari:5623",
    "bookNumber": 74,
    "hadithNumber": 49,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for \nthe devils spread out at that time. But when an hour of the night has passed, release them and close the \ndoors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin \nand mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover \nthem even by placing something across it, and extinguish your lamps. \"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ جُنْحُ اللَّيْلِ ـ أَوْ أَمْسَيْتُمْ ـ فَكُفُّوا صِبْيَانَكُمْ، فَإِنَّ الشَّيَاطِينَ تَنْتَشِرُ حِينَئِذٍ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَحُلُّوهُمْ، فَأَغْلِقُوا الأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا مُغْلَقًا، وَأَوْكُوا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ، وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ، وَلَوْ أَنْ تَعْرُضُوا عَلَيْهَا شَيْئًا وَأَطْفِئُوا، مَصَابِيحَكُمْ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5623In-book reference : Book 74, Hadith 49USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 527   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5624,
    "id": 5624,
    "url": "https://sunnah.com/bukhari:5624",
    "bookNumber": 74,
    "hadithNumber": 50,
    "narrator": "Narrated Jabir:",
    "english": "Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of \nyour water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place \nacross the container.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَطْفِئُوا الْمَصَابِيحَ إِذَا رَقَدْتُمْ، وَغَلِّقُوا الأَبْوَابَ، وَأَوْكُوا الأَسْقِيَةَ، وَخَمِّرُوا الطَّعَامَ وَالشَّرَابَ ـ وَأَحْسِبُهُ قَالَ ـ وَلَوْ بِعُودٍ تَعْرُضُهُ عَلَيْهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5624In-book reference : Book 74, Hadith 50USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 528   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5625,
    "id": 5625,
    "url": "https://sunnah.com/bukhari:5625",
    "bookNumber": 74,
    "hadithNumber": 51,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ اخْتِنَاثِ الأَسْقِيَةِ‏.‏ يَعْنِي أَنْ تُكْسَرَ أَفْوَاهُهَا فَيُشْرَبَ مِنْهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5625In-book reference : Book 74, Hadith 51USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 529   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5626,
    "id": 5626,
    "url": "https://sunnah.com/bukhari:5626",
    "bookNumber": 74,
    "hadithNumber": 52,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., \ndrinking from the mouths directly.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ اخْتِنَاثِ الأَسْقِيَةِ‏.‏ قَالَ عَبْدُ اللَّهِ قَالَ مَعْمَرٌ أَوْ غَيْرُهُ هُوَ الشُّرْبُ مِنْ أَفْوَاهِهَا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5626In-book reference : Book 74, Hadith 52USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 530   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5627,
    "id": 5627,
    "url": "https://sunnah.com/bukhari:5627",
    "bookNumber": 74,
    "hadithNumber": 53,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. \nand forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ، قَالَ لَنَا عِكْرِمَةُ أَلاَ أُخْبِرُكُمْ بِأَشْيَاءَ، قِصَارٍ حَدَّثَنَا بِهَا أَبُو هُرَيْرَةَ، نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشُّرْبِ مِنْ فَمِ الْقِرْبَةِ أَوِ السِّقَاءِ، وَأَنْ يَمْنَعَ جَارَهُ أَنْ يَغْرِزَ خَشَبَهُ فِي دَارِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5627In-book reference : Book 74, Hadith 53USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 531   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5628,
    "id": 5628,
    "url": "https://sunnah.com/bukhari:5628",
    "bookNumber": 74,
    "hadithNumber": 54,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5628In-book reference : Book 74, Hadith 54USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 532   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5629,
    "id": 5629,
    "url": "https://sunnah.com/bukhari:5629",
    "bookNumber": 74,
    "hadithNumber": 55,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الشُّرْبِ مِنْ فِي السِّقَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5629In-book reference : Book 74, Hadith 55USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 533   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5630,
    "id": 5630,
    "url": "https://sunnah.com/bukhari:5630",
    "bookNumber": 74,
    "hadithNumber": 56,
    "narrator": "Narrated Abu Qatada:",
    "english": "Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do \nnot touch your penis with your right hand. And when you cleanse yourself after defecation, do not use \nyour right hand.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا شَرِبَ أَحَدُكُمْ فَلاَ يَتَنَفَّسْ فِي الإِنَاءِ، وَإِذَا بَالَ أَحَدُكُمْ فَلاَ يَمْسَحْ ذَكَرَهُ بِيَمِينِهِ، وَإِذَا تَمَسَّحَ أَحَدُكُمْ فَلاَ يَتَمَسَّحْ بِيَمِينِهِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5630In-book reference : Book 74, Hadith 56USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 534   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5631,
    "id": 5631,
    "url": "https://sunnah.com/bukhari:5631",
    "bookNumber": 74,
    "hadithNumber": 57,
    "narrator": "Narrated Thumama bin `Abdullah:",
    "english": "Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; \nused to take three breaths while drinking.",
    "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، وَأَبُو نُعَيْمٍ قَالاَ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، قَالَ كَانَ أَنَسٌ يَتَنَفَّسُ فِي الإِنَاءِ مَرَّتَيْنِ أَوْ ثَلاَثًا، وَزَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَنَفَّسُ ثَلاَثًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5631In-book reference : Book 74, Hadith 57USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 535   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5632,
    "id": 5632,
    "url": "https://sunnah.com/bukhari:5632",
    "bookNumber": 74,
    "hadithNumber": 58,
    "narrator": "Narrated Ibn Abi Laila:",
    "english": "While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver \nvessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he \nhas not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold \nor silver utensils, and said, 'These things are for them (unbelievers) in this world and for you \n(Muslims) in the Hereafter.' \"",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَايِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِقَدَحِ فِضَّةٍ، فَرَمَاهُ بِهِ فَقَالَ إِنِّي لَمْ أَرْمِهِ إِلاَّ أَنِّي نَهَيْتُهُ فَلَمْ يَنْتَهِ، وَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا عَنِ الْحَرِيرِ وَالدِّيبَاجِ وَالشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَقَالَ ‏\n\"‏ هُنَّ لَهُمْ فِي الدُّنْيَا وَهْىَ لَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5632In-book reference : Book 74, Hadith 58USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 536   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5633,
    "id": 5633,
    "url": "https://sunnah.com/bukhari:5633",
    "bookNumber": 74,
    "hadithNumber": 59,
    "narrator": "Narrated Hudhaifa:",
    "english": "The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for \nthese things are for them (unbelievers) in this world and for you in the Hereafter.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ خَرَجْنَا مَعَ حُذَيْفَةَ وَذَكَرَ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَلْبَسُوا الْحَرِيرَ وَالدِّيبَاجَ، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5633In-book reference : Book 74, Hadith 59USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 537   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5634,
    "id": 5634,
    "url": "https://sunnah.com/bukhari:5634",
    "bookNumber": 74,
    "hadithNumber": 60,
    "narrator": "Narrated Um Salama:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his \n`Abdomen with Hell Fire.\"",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي يَشْرَبُ فِي إِنَاءِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5634In-book reference : Book 74, Hadith 60USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 538   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5635,
    "id": 5635,
    "url": "https://sunnah.com/bukhari:5635",
    "bookNumber": 74,
    "hadithNumber": 61,
    "narrator": "Narrated Al-Bara' bin `Azib:",
    "english": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the \nsick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he \nsays, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help \nothers to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use \nMayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, \nDibaj or Istabraq (two kinds of silk).",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجِنَازَةِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِجَابَةِ الدَّاعِي، وَإِفْشَاءِ السَّلاَمِ، وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْمُقْسِمِ، وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ، وَعَنِ الشُّرْبِ فِي الْفِضَّةِ ـ أَوْ قَالَ آنِيَةِ الْفِضَّةِ ـ وَعَنِ الْمَيَاثِرِ وَالْقَسِّيِّ، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَالإِسْتَبْرَقِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5635In-book reference : Book 74, Hadith 61USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 539   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5636,
    "id": 5636,
    "url": "https://sunnah.com/bukhari:5636",
    "bookNumber": 74,
    "hadithNumber": 62,
    "narrator": "Narrated Um Al-Fadl:",
    "english": "that the people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a \n(wooden) drinking vessel full of milk was sent to him, and he drank it.",
    "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى أُمِّ الْفَضْلِ عَنْ أُمِّ الْفَضْلِ، أَنَّهُمْ شَكُّوا فِي صَوْمِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ عَرَفَةَ، فَبُعِثَ إِلَيْهِ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5636In-book reference : Book 74, Hadith 62USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 540   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5637,
    "id": 5637,
    "url": "https://sunnah.com/bukhari:5637",
    "bookNumber": 74,
    "hadithNumber": 63,
    "narrator": "Narrated Sahl bin Sa`d:",
    "english": "An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: \nSahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ ذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم امْرَأَةٌ مِنَ الْعَرَبِ، فَأَمَرَ أَبَا أُسَيْدٍ السَّاعِدِيَّ أَنْ يُرْسِلَ إِلَيْهَا فَأَرْسَلَ إِلَيْهَا، فَقَدِمَتْ فَنَزَلَتْ فِي أُجُمِ بَنِي سَاعِدَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم حَتَّى جَاءَهَا فَدَخَلَ عَلَيْهَا فَإِذَا امْرَأَةٌ مُنَكِّسَةٌ رَأْسَهَا، فَلَمَّا كَلَّمَهَا النَّبِيُّ صلى الله عليه وسلم قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَقَالَ ‏\"‏ قَدْ أَعَذْتُكِ مِنِّي ‏\"‏‏.‏ فَقَالُوا لَهَا أَتَدْرِينَ مَنْ هَذَا قَالَتْ لاَ‏.‏ قَالُوا هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَ لِيَخْطُبَكِ‏.‏ قَالَتْ كُنْتُ أَنَا أَشْقَى مِنْ ذَلِكَ‏.‏ فَأَقْبَلَ النَّبِيُّ صلى الله عليه وسلم يَوْمَئِذٍ حَتَّى جَلَسَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ هُوَ وَأَصْحَابُهُ، ثُمَّ قَالَ ‏\"‏ اسْقِنَا يَا سَهْلُ ‏\"‏‏.‏ فَخَرَجْتُ لَهُمْ بِهَذَا الْقَدَحِ فَأَسْقَيْتُهُمْ فِيهِ، فَأَخْرَجَ لَنَا سَهْلٌ ذَلِكَ الْقَدَحَ فَشَرِبْنَا مِنْهُ‏.‏ قَالَ ثُمَّ اسْتَوْهَبَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ بَعْدَ ذَلِكَ فَوَهَبَهُ لَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5637In-book reference : Book 74, Hadith 63USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 541   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5638,
    "id": 5638,
    "url": "https://sunnah.com/bukhari:5638",
    "bookNumber": 74,
    "hadithNumber": 64,
    "narrator": "Narrated `Asim al-Ahwal:",
    "english": "I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik, and it had been broken, and he had \nmended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \n\"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: \nAround that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but \nAbu Talha said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it \nwas.",
    "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُدْرِكٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، قَالَ رَأَيْتُ قَدَحَ النَّبِيِّ صلى الله عليه وسلم عِنْدَ أَنَسِ بْنِ مَالِكٍ، وَكَانَ قَدِ انْصَدَعَ فَسَلْسَلَهُ بِفِضَّةٍ قَالَ وَهْوَ قَدَحٌ جَيِّدٌ عَرِيضٌ مِنْ نُضَارٍ‏.‏ قَالَ قَالَ أَنَسٌ لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي هَذَا الْقَدَحِ أَكْثَرَ مِنْ كَذَا وَكَذَا‏.‏ قَالَ وَقَالَ ابْنُ سِيرِينَ إِنَّهُ كَانَ فِيهِ حَلْقَةٌ مِنْ حَدِيدٍ فَأَرَادَ أَنَسٌ أَنْ يَجْعَلَ مَكَانَهَا حَلْقَةً مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَقَالَ لَهُ أَبُو طَلْحَةَ لاَ تُغَيِّرَنَّ شَيْئًا صَنَعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَرَكَهُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5638In-book reference : Book 74, Hadith 64USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 542   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5639,
    "id": 5639,
    "url": "https://sunnah.com/bukhari:5639",
    "bookNumber": 74,
    "hadithNumber": 65,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I was with the Prophet (ﷺ) and the time for the `Asr prayer became due. We had no water with us except a \nlittle which was put in a vessel and was brought to the Prophet (ﷺ) . He put his hand into it and spread out \nhis fingers and then said, \"Come along! Hurry up! All those who want to perform ablution. The \nblessing is from Allah.'' I saw the water gushing out from his fingers. So the people performed the \nablution and drank, and I tried to drink more of that water (beyond my thirst and capacity), for I knew \nthat it was a blessing. The sub-narrator said: I asked Jabir, \"How many persons were you then?\" He \nreplied, \"We were one-thousand four hundred men.\" Salim said: Jabir said, 1500.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنِي سَالِمُ بْنُ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ هَذَا الْحَدِيثَ قَالَ قَدْ رَأَيْتُنِي مَعَ النَّبِيِّ صلى الله عليه وسلم وَقَدْ حَضَرَتِ الْعَصْرُ وَلَيْسَ مَعَنَا مَاءٌ غَيْرَ فَضْلَةٍ فَجُعِلَ فِي إِنَاءٍ، فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِهِ فَأَدْخَلَ يَدَهُ فِيهِ وَفَرَّجَ أَصَابِعَهُ ثُمَّ قَالَ ‏\n\"‏ حَىَّ عَلَى أَهْلِ الْوُضُوءِ، الْبَرَكَةُ مِنَ اللَّهِ ‏\"‏‏.‏ فَلَقَدْ رَأَيْتُ الْمَاءَ يَتَفَجَّرُ مِنْ بَيْنِ أَصَابِعِهِ، فَتَوَضَّأَ النَّاسُ وَشَرِبُوا، فَجَعَلْتُ لاَ آلُو مَا جَعَلْتُ فِي بَطْنِي مِنْهُ، فَعَلِمْتُ أَنَّهُ بَرَكَةٌ‏.‏ قُلْتُ لِجَابِرٍ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ أَلْفًا وَأَرْبَعَمِائَةٍ‏.‏ تَابَعَهُ عَمْرٌو عَنْ جَابِرٍ‏.‏ وَقَالَ حُصَيْنٌ وَعَمْرُو بْنُ مُرَّةَ عَنْ سَالِمٍ عَنْ جَابِرٍ خَمْسَ عَشْرَةَ مِائَةً‏.‏ وَتَابَعَهُ سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ جَابِرٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5639In-book reference : Book 74, Hadith 65USC-MSA web (English) reference : Vol. 7, Book 69, Hadith 543   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5640,
    "id": 5640,
    "url": "https://sunnah.com/bukhari:5640",
    "bookNumber": 75,
    "hadithNumber": 1,
    "narrator": "Narrated `Aisha:",
    "english": "(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates \nsome of his sins because of it, even though it were the prick he receives from a thorn.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مُصِيبَةٍ تُصِيبُ الْمُسْلِمَ إِلاَّ كَفَّرَ اللَّهُ بِهَا عَنْهُ، حَتَّى الشَّوْكَةِ يُشَاكُهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5640In-book reference : Book 75, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 544   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5641,
    "id": 5641,
    "url": "https://sunnah.com/bukhari:5641",
    "bookNumber": 75,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Sa`id Al-Khudri and Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ وَلاَ أَذًى وَلاَ غَمٍّ حَتَّى الشَّوْكَةِ يُشَاكُهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5641, 5642In-book reference : Book 75, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 545   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5642,
    "id": 5642,
    "url": "https://sunnah.com/bukhari:5642",
    "bookNumber": 75,
    "hadithNumber": 2,
    "narrator": "Narrated Abu Sa`id Al-Khudri and Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"",
    "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ وَلاَ أَذًى وَلاَ غَمٍّ حَتَّى الشَّوْكَةِ يُشَاكُهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5641, 5642In-book reference : Book 75, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 545   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5643,
    "id": 5643,
    "url": "https://sunnah.com/bukhari:5643",
    "bookNumber": 75,
    "hadithNumber": 3,
    "narrator": "Narrated Ka`b:",
    "english": "The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt \nsometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine \ntree which keeps straight till once it is uprooted suddenly.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سَعْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَالْخَامَةِ مِنَ الزَّرْعِ تُفَيِّئُهَا الرِّيحُ مَرَّةً، وَتَعْدِلُهَا مَرَّةً، وَمَثَلُ الْمُنَافِقِ كَالأَرْزَةِ لاَ تَزَالُ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏‏.‏ وَقَالَ زَكَرِيَّاءُ حَدَّثَنِي سَعْدٌ، حَدَّثَنَا ابْنُ كَعْبٍ، عَنْ أَبِيهِ، كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5643In-book reference : Book 75, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 546   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5644,
    "id": 5644,
    "url": "https://sunnah.com/bukhari:5644",
    "bookNumber": 75,
    "hadithNumber": 4,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh tender plant; from whatever \ndirection the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. \nSimilarly, a believer is afflicted with calamities (but he remains patient till Allah removes his \ndifficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah \ncuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ مِنْ حَيْثُ أَتَتْهَا الرِّيحُ كَفَأَتْهَا، فَإِذَا اعْتَدَلَتْ تَكَفَّأُ بِالْبَلاَءِ، وَالْفَاجِرُ كَالأَرْزَةِ صَمَّاءَ مُعْتَدِلَةً حَتَّى يَقْصِمَهَا اللَّهُ إِذَا شَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5644In-book reference : Book 75, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 547   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5645,
    "id": 5645,
    "url": "https://sunnah.com/bukhari:5645",
    "bookNumber": 75,
    "hadithNumber": 5,
    "narrator": "Narrated Abu Huraira:",
    "english": "Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ يَسَارٍ أَبَا الْحُبَابِ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5645In-book reference : Book 75, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 548   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5646,
    "id": 5646,
    "url": "https://sunnah.com/bukhari:5646",
    "bookNumber": 75,
    "hadithNumber": 6,
    "narrator": "Narrated Aisha:",
    "english": "I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ).",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ،‏.‏ حَدَّثَنِي بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ أَحَدًا أَشَدَّ عَلَيْهِ الْوَجَعُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5646In-book reference : Book 75, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 549   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5647,
    "id": 5647,
    "url": "https://sunnah.com/bukhari:5647",
    "bookNumber": 75,
    "hadithNumber": 7,
    "narrator": "Narrated `Abdullah:",
    "english": "I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a \nhigh fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is \nafflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَرَضِهِ وَهْوَ يُوعَكُ وَعْكًا شَدِيدًا، وَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا‏.‏ قُلْتُ إِنَّ ذَاكَ بِأَنَّ لَكَ أَجْرَيْنِ‏.‏ قَالَ ‏\n\"‏ أَجَلْ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى، إِلاَّ حَاتَّ اللَّهُ عَنْهُ خَطَايَاهُ، كَمَا تَحَاتُّ وَرَقُ الشَّجَرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5647In-book reference : Book 75, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 550   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5648,
    "id": 5648,
    "url": "https://sunnah.com/bukhari:5648",
    "bookNumber": 75,
    "hadithNumber": 8,
    "narrator": "Narrated `Abdullah:",
    "english": "I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You \nhave a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you \nwill have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it \nwere the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"",
    "arabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوعَكُ وَعْكًا شَدِيدًا‏.‏ قَالَ ‏\"‏ أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ قُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ قَالَ ‏\"‏ أَجَلْ ذَلِكَ كَذَلِكَ، مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى شَوْكَةٌ فَمَا فَوْقَهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا سَيِّئَاتِهِ، كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5648In-book reference : Book 75, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 551   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5649,
    "id": 5649,
    "url": "https://sunnah.com/bukhari:5649",
    "bookNumber": 75,
    "hadithNumber": 9,
    "narrator": "Narrated Abu Muisa Al-Ash`ari:",
    "english": "The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَطْعِمُوا الْجَائِعَ، وَعُودُوا الْمَرِيضَ، وَفُكُّوا الْعَانِيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5649In-book reference : Book 75, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 552   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5650,
    "id": 5650,
    "url": "https://sunnah.com/bukhari:5650",
    "bookNumber": 75,
    "hadithNumber": 10,
    "narrator": "Narrated Al-Bara bin Azib:",
    "english": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us \nto wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral \nprocessions, visit the sick and greet everybody. (See Hadith No. 104)",
    "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَشْعَثُ بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، نَهَانَا عَنْ خَاتَمِ الذَّهَبِ، وَلُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالإِسْتَبْرَقِ، وَعَنِ الْقَسِّيِّ، وَالْمِيثَرَةِ، وَأَمَرَنَا أَنْ نَتْبَعَ الْجَنَائِزَ، وَنَعُودَ الْمَرِيضَ، وَنُفْشِيَ السَّلاَمَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5650In-book reference : Book 75, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 553   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5651,
    "id": 5651,
    "url": "https://sunnah.com/bukhari:5651",
    "bookNumber": 75,
    "hadithNumber": 11,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. \nThe Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses \nto see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose \nof (distribute) my property?\" He did not reply till the Verse of inheritance was revealed.",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ مَرَضًا، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَوَجَدَانِي أُغْمِيَ عَلَىَّ، فَتَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَبَّ وَضُوءَهُ عَلَىَّ، فَأَفَقْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5651In-book reference : Book 75, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 554   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5652,
    "id": 5652,
    "url": "https://sunnah.com/bukhari:5652",
    "bookNumber": 75,
    "hadithNumber": 12,
    "narrator": "Narrated 'Ata bin Abi Rabah:",
    "english": "Ibn `Abbas said to me, \"Shall I show you a woman of the people of Paradise?\" I said, \"Yes.\" He said, \n\"This black lady came to the Prophet (ﷺ) and said, 'I get attacks of epilepsy and my body becomes \nuncovered; please invoke Allah for me.' The Prophet (ﷺ) said (to her), 'If you wish, be patient and you will \nhave (enter) Paradise; and if you wish, I will invoke Allah to cure you.' She said, 'I will remain \npatient,' and added, 'but I become uncovered, so please invoke Allah for me that I may not become \nuncovered.' So he invoked Allah for her.\"\n\n\nNarrated 'Ata:\n\nThat he had seen Um Zafar, the tall black lady, at (holding) the curtain of the Ka`ba.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عِمْرَانَ أَبِي بَكْرٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ أَلاَ أُرِيكَ امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ قُلْتُ بَلَى‏.‏ قَالَ هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ إِنِّي أُصْرَعُ، وَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ لِي‏.‏ قَالَ ‏\n\"‏ إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ وَإِنْ شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ ‏\"‏‏.‏ فَقَالَتْ أَصْبِرُ‏.‏ فَقَالَتْ إِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ أَنْ لاَ أَتَكَشَّفَ، فَدَعَا لَهَا‏.‏ \nحَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّهُ رَأَى أُمَّ زُفَرَ تِلْكَ، امْرَأَةٌ طَوِيلَةٌ سَوْدَاءُ عَلَى سِتْرِ الْكَعْبَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5652In-book reference : Book 75, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 555   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5653,
    "id": 5653,
    "url": "https://sunnah.com/bukhari:5653",
    "bookNumber": 75,
    "hadithNumber": 13,
    "narrator": "Narrated Anas bin Malik:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his \neyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ قَالَ إِذَا ابْتَلَيْتُ عَبْدِي بِحَبِيبَتَيْهِ فَصَبَرَ عَوَّضْتُهُ مِنْهُمَا الْجَنَّةَ ‏\"‏‏.‏ يُرِيدُ عَيْنَيْهِ‏.‏ تَابَعَهُ أَشْعَثُ بْنُ جَابِرٍ وَأَبُو ظِلاَلٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5653In-book reference : Book 75, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 557   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5654,
    "id": 5654,
    "url": "https://sunnah.com/bukhari:5654",
    "bookNumber": 75,
    "hadithNumber": 14,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal got a fever. I entered upon them and \nasked, \"O my father! How are you? O Bilal! How are you?\" Whenever fever attacked Abu Bakr, he \nwould recite the following poetic verses: 'Everybody is staying alive among his people, yet death is \nnearer to him than his shoe laces.\" And whenever the fever deserted Bilal, he would recite (two poetic \nlines): 'Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and \nJalil (two kinds of good smelling grass). Would that one day I would drink of the water of Majinna \nand would that Shama and Tafil (two mountains at Mecca) would appear to me.' Then I came and \ninformed Allah's Messenger (ﷺ) about that, whereupon he said, \"O Allah! Make us love Medina as much or \nmore than we love Mecca. O Allah! Make it healthy and bless its Mudd and Sa for us, and take away \nits fever and put it in Al Juhfa.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ ـ رضى الله عنهما ـ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا قُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أَقْلَعَتْ عَنْهُ يَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بَوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ وَهَلْ تَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَتْ عَائِشَةُ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، اللَّهُمَّ وَصَحِّحْهَا، وَبَارِكْ لَنَا فِي مُدِّهَا وَصَاعِهَا، وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5654In-book reference : Book 75, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 558   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5655,
    "id": 5655,
    "url": "https://sunnah.com/bukhari:5655",
    "bookNumber": 75,
    "hadithNumber": 15,
    "narrator": "Narrated Abu `Uthman:",
    "english": "Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet (ﷺ) a daughter of the \nProphet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet (ﷺ) sent \nher his greetings and added \"It is for Allah what He takes, and what He gives; and everything before \nHis sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again \nsent a message, beseeching him by Allah, to come. So the Prophet (ﷺ) got up. and so did we (and went \nthere). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of \nthe Prophet. Sa`d said to him, \"What is this, O Allah's Messenger (ﷺ)?\" He said. \"This Is Mercy which Allah \nhas embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His \nMercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)",
    "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَاصِمٌ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ ابْنَةً لِلنَّبِيِّ، صلى الله عليه وسلم أَرْسَلَتْ إِلَيْهِ وَهْوَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَسَعْدٍ وَأُبَىٍّ نَحْسِبُ أَنَّ ابْنَتِي قَدْ حُضِرَتْ فَاشْهَدْنَا فَأَرْسَلَ إِلَيْهَا السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَمَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ مُسَمًّى فَلْتَحْتَسِبْ وَلْتَصْبِرْ ‏\"‏‏.‏ فَأَرْسَلَتْ تُقْسِمُ عَلَيْهِ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم وَقُمْنَا، فَرُفِعَ الصَّبِيُّ فِي حَجْرِ النَّبِيِّ صلى الله عليه وسلم وَنَفْسُهُ تَقَعْقَعُ فَفَاضَتْ عَيْنَا النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذِهِ رَحْمَةٌ وَضَعَهَا اللَّهُ فِي قُلُوبِ مَنْ شَاءَ مِنْ عِبَادِهِ، وَلاَ يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ إِلاَّ الرُّحَمَاءَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5655In-book reference : Book 75, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 559   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5656,
    "id": 5656,
    "url": "https://sunnah.com/bukhari:5656",
    "bookNumber": 75,
    "hadithNumber": 16,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to \nhim, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say \nexpiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave \nwithout his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so.\"",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ ـ قَالَ ـ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ عَلَى مَرِيضٍ يَعُودُهُ فَقَالَ لَهُ ‏\"‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ قُلْتَ طَهُورٌ، كَلاَّ بَلْ هِيَ حُمَّى تَفُورُ ـ أَوْ تَثُورُ ـ عَلَى شَيْخٍ كَبِيرٍ، تُزِيرُهُ الْقُبُورَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5656In-book reference : Book 75, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 560   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5657,
    "id": 5657,
    "url": "https://sunnah.com/bukhari:5657",
    "bookNumber": 75,
    "hadithNumber": 17,
    "narrator": "Narrated Anas:",
    "english": "A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said \nto him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his \ndeathbed, the Prophet (ﷺ) visited him.",
    "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ غُلاَمًا، لِيَهُودَ كَانَ يَخْدُمُ النَّبِيَّ صلى الله عليه وسلم فَمَرِضَ‏.‏ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ فَقَالَ ‏\n\"‏ أَسْلِمْ ‏\"‏‏.‏ فَأَسْلَمَ‏.‏ وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِيهِ، لَمَّا حُضِرَ أَبُو طَالِبٍ جَاءَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5657In-book reference : Book 75, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 561   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5658,
    "id": 5658,
    "url": "https://sunnah.com/bukhari:5658",
    "bookNumber": 75,
    "hadithNumber": 18,
    "narrator": "Narrated `Aisha:",
    "english": "During the ailment of the Prophet (ﷺ) some people came to visits him. He led them in prayer while sitting. \nbut they prayed standing, so he waved to them to sit down. When he had finished the prayer, he said, \n\"An Imam is to be followed, so when he bows, you should bow. and when he raises his head, you \nshould raise yours, and if he prays sitting. you should pray sitting.\" Abu `Abdullah said Al-Humaidi \nsaid, (The order of ) \"This narration has been abrogated by the last action of the Prophet (ﷺ) as he led the \nprayer sitting, while the people prayed standing behind him.'",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهِ نَاسٌ يَعُودُونَهُ فِي مَرَضِهِ فَصَلَّى بِهِمْ جَالِسًا فَجَعَلُوا يُصَلُّونَ قِيَامًا، فَأَشَارَ إِلَيْهِمِ اجْلِسُوا، فَلَمَّا فَرَغَ قَالَ ‏\n\"‏ إِنَّ الإِمَامَ لَيُؤْتَمُّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا، وَإِنْ صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ الْحُمَيْدِيُّ هَذَا الْحَدِيثُ مَنْسُوخٌ لأَنَّ النَّبِيَّ صلى الله عليه وسلم آخِرَ مَا صَلَّى صَلَّى قَاعِدًا وَالنَّاسُ خَلْفَهُ قِيَامٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5658In-book reference : Book 75, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 562   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5659,
    "id": 5659,
    "url": "https://sunnah.com/bukhari:5659",
    "bookNumber": 75,
    "hadithNumber": 19,
    "narrator": "Narrated Sa`d:",
    "english": "I became seriously ill at Mecca and the Prophet (ﷺ) came to visit me. I said, \"O Allah's Messenger (ﷺ)! I shall \nleave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my \nproperty to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I \nbequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" \nHe said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his \nforehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his \nemigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since.",
    "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْجُعَيْدُ، عَنْ عَائِشَةَ بِنْتِ سَعْدٍ، أَنَّ أَبَاهَا، قَالَ تَشَكَّيْتُ بِمَكَّةَ شَكْوًا شَدِيدًا، فَجَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي، فَقُلْتُ يَا نَبِيَّ اللَّهِ إِنِّي أَتْرُكُ مَالاً وَإِنِّي لَمْ أَتْرُكْ إِلاَّ ابْنَةً وَاحِدَةً، فَأُوصِي بِثُلُثَىْ مَالِي وَأَتْرُكُ الثُّلُثَ فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَأُوصِي بِالنِّصْفِ وَأَتْرُكُ النِّصْفَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَأُوصِي بِالثُّلُثِ وَأَتْرُكُ لَهَا الثُّلُثَيْنِ قَالَ ‏\"‏ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ ‏\"‏‏.‏ ثُمَّ وَضَعَ يَدَهُ عَلَى جَبْهَتِهِ، ثُمَّ مَسَحَ يَدَهُ عَلَى وَجْهِي وَبَطْنِي ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اشْفِ سَعْدًا وَأَتْمِمْ لَهُ هِجْرَتَهُ ‏\"‏‏.‏ فَمَا زِلْتُ أَجِدُ بَرْدَهُ عَلَى كَبِدِي فِيمَا يُخَالُ إِلَىَّ حَتَّى السَّاعَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5659In-book reference : Book 75, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 563   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5660,
    "id": 5660,
    "url": "https://sunnah.com/bukhari:5660",
    "bookNumber": 75,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah bin Mas`ud:",
    "english": "I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and \nsaid, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as \ntwo men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, \nno Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will \nremove his sins for him as a tree sheds its leaves.\"",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَمَسِسْتُهُ بِيَدِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوعَكُ وَعْكًا شَدِيدًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ فَقُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مَرَضٌ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ لَهُ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5660In-book reference : Book 75, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 564   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5661,
    "id": 5661,
    "url": "https://sunnah.com/bukhari:5661",
    "bookNumber": 75,
    "hadithNumber": 21,
    "narrator": "Narrated `Abdullah:",
    "english": "I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \n\"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is \nafflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَرَضِهِ فَمَسِسْتُهُ وَهْوَ يُوعَكُ وَعْكًا شَدِيدًا فَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا، وَذَلِكَ أَنَّ لَكَ أَجْرَيْنِ‏.‏ قَالَ ‏\n\"‏ أَجَلْ، وَمَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى إِلاَّ حَاتَّتْ عَنْهُ خَطَايَاهُ كَمَا تَحَاتُّ وَرَقُ الشَّجَرِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5661In-book reference : Book 75, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 565   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5662,
    "id": 5662,
    "url": "https://sunnah.com/bukhari:5662",
    "bookNumber": 75,
    "hadithNumber": 22,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, \n(your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling \nwithin an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so.\"",
    "arabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى رَجُلٍ يَعُودُهُ فَقَالَ ‏\"‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَقَالَ كَلاَّ بَلْ حُمَّى تَفُورُ عَلَى شَيْخٍ كَبِيرٍ كَيْمَا تُزِيرَهُ الْقُبُورَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5662In-book reference : Book 75, Hadith 22USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 566   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5663,
    "id": 5663,
    "url": "https://sunnah.com/bukhari:5663",
    "bookNumber": 75,
    "hadithNumber": 23,
    "narrator": "Narrated Usama bin Zaid:",
    "english": "The Prophet (ﷺ) rode a donkey having a saddle with a Fadakiyya velvet covering. He mounted me behind \nhim and went to visit Sa`d bin 'Ubada, and that had been before the battle of Badr. The Prophet (ﷺ) \nproceeded till he passed by a gathering in which `Abdullah bin Ubai bin Salul was present, and that \nhad been before `Abdullah embraced Islam. The gathering comprised of Muslims, polytheists, i.e., \nisolators and Jews. `Abdullah bin Rawaha was also present in that gathering. When dust raised by the \ndonkey covered the gathering, `Abdullah bin Ubai covered his nose with his upper garment and said, \n\"Do not trouble us with dust.\" The Prophet (ﷺ) greeted them, stopped and dismounted. Then he invited \nthem to Allah (i.e., to embrace Islam) and recited to them some verses of the Holy Qur'an. On that, \n`Abdullah bin Ubai said, \"O man ! There is nothing better than what you say if it is true. Do not \ntrouble us with it in our gathering, but return to your house, and if somebody comes to you, teach him \nthere.\" On that `Abdullah bin Rawaha said, Yes, O Allah's Messenger (ﷺ)! Bring your teachings to our \ngathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing each other till \nthey were about to fight. The Prophet (ﷺ) kept on quietening them till they became calm. Thereupon the \nProphet mounted his animal and proceeded till he entered upon Sa`d bin Ubada. He said to him \"O \nSa`d! Have you not heard what Abu Hubab (i.e., `Abdullah bin Ubai) said?\" Sa`d said, 'O Allah's \nApostle! Excuse and forgive him, for Allah has given you what He has given you. The people of this \ntown (Medina decided unanimously to crown him and make him their chief by placing a turban on his \nhead, but when that was prevented by the Truth which Allah had given you he (`Abdullah bin Ubai) \nwas grieved out of jealously, and that was the reason which caused him to behave in the way you have \nseen.\"",
    "arabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ عَلَى إِكَافٍ عَلَى قَطِيفَةٍ فَدَكِيَّةٍ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ يَعُودُ سَعْدَ بْنَ عُبَادَةَ قَبْلَ وَقْعَةِ بَدْرٍ فَسَارَ حَتَّى مَرَّ بِمَجْلِسٍ فِيهِ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللَّهِ، وَفِي الْمَجْلِسِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ عَبَدَةِ الأَوْثَانِ وَالْيَهُودِ، وَفِي الْمَجْلِسِ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ، فَلَمَّا غَشِيَتِ الْمَجْلِسَ عَجَاجَةُ الدَّابَّةِ خَمَّرَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَنْفَهُ بِرِدَائِهِ، قَالَ لاَ تُغَيِّرُوا عَلَيْنَا فَسَلَّمَ النَّبِيُّ صلى الله عليه وسلم وَوَقَفَ وَنَزَلَ فَدَعَاهُمْ إِلَى اللَّهِ فَقَرَأَ عَلَيْهِمُ الْقُرْآنَ، فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ أُبَىٍّ يَا أَيُّهَا الْمَرْءُ إِنَّهُ لاَ أَحْسَنَ مِمَّا تَقُولُ إِنْ كَانَ حَقًّا، فَلاَ تُؤْذِنَا بِهِ فِي مَجْلِسِنَا، وَارْجِعْ إِلَى رَحْلِكَ فَمَنْ جَاءَكَ فَاقْصُصْ عَلَيْهِ‏.‏ قَالَ ابْنُ رَوَاحَةَ بَلَى يَا رَسُولَ اللَّهِ فَاغْشَنَا بِهِ فِي مَجَالِسِنَا فَإِنَّا نُحِبُّ ذَلِكَ فَاسْتَبَّ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْيَهُودُ حَتَّى كَادُوا يَتَثَاوَرُونَ فَلَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم حَتَّى سَكَتُوا فَرَكِبَ النَّبِيُّ صلى الله عليه وسلم دَابَّتَهُ حَتَّى دَخَلَ عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ ‏\n\"‏ أَىْ سَعْدُ أَلَمْ تَسْمَعْ مَا قَالَ أَبُو حُبَابٍ ‏\"‏‏.‏ يُرِيدُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ‏.‏ قَالَ سَعْدٌ يَا رَسُولَ اللَّهِ اعْفُ عَنْهُ وَاصْفَحْ فَلَقَدْ أَعْطَاكَ اللَّهُ مَا أَعْطَاكَ وَلَقَدِ اجْتَمَعَ أَهْلُ هَذِهِ الْبَحْرَةِ أَنْ يُتَوِّجُوهُ فَيُعَصِّبُوهُ فَلَمَّا رَدَّ ذَلِكَ بِالْحَقِّ الَّذِي أَعْطَاكَ شَرِقَ بِذَلِكَ، فَذَلِكَ الَّذِي فَعَلَ بِهِ مَا رَأَيْتَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5663In-book reference : Book 75, Hadith 23USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 567   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5664,
    "id": 5664,
    "url": "https://sunnah.com/bukhari:5664",
    "bookNumber": 75,
    "hadithNumber": 24,
    "narrator": "Narrated Jabir:",
    "english": "The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse.",
    "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ الْمُنْكَدِرِ ـ عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ جَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي لَيْسَ بِرَاكِبِ بَغْلٍ وَلاَ بِرْذَوْنٍ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5664In-book reference : Book 75, Hadith 24USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 568   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5665,
    "id": 5665,
    "url": "https://sunnah.com/bukhari:5665",
    "bookNumber": 75,
    "hadithNumber": 25,
    "narrator": "Narrated Ka`b bin 'Ujara:",
    "english": "The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of \nyour head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make \nexpiation for that.\"",
    "arabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، وَأَيُّوبَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه‏.‏ مَرَّ بِيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أُوقِدُ تَحْتَ الْقِدْرِ فَقَالَ ‏\n\"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَا الْحَلاَّقَ فَحَلَقَهُ ثُمَّ أَمَرَنِي بِالْفِدَاءِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5665In-book reference : Book 75, Hadith 25USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 569   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5666,
    "id": 5666,
    "url": "https://sunnah.com/bukhari:5666",
    "bookNumber": 75,
    "hadithNumber": 26,
    "narrator": "Narrated Al-Qasim bin Muhammad:",
    "english": "`Aisha, (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had \nhappened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah \nfor you.\" Aisha said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, \nyou would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I \nshould say, 'Oh my head!' I felt like sending for Abu Bakr and his son, and appoint him as my \nsuccessor lest some people claimed something or some others wished something, but then I said (to \nmyself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise\".",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَبُو زَكَرِيَّاءَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، قَالَ قَالَتْ عَائِشَةُ وَارَأْسَاهْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَاكِ لَوْ كَانَ وَأَنَا حَىٌّ، فَأَسْتَغْفِرُ لَكِ وَأَدْعُو لَكِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ وَاثُكْلِيَاهْ، وَاللَّهِ إِنِّي لأَظُنُّكَ تُحِبُّ مَوْتِي، وَلَوْ كَانَ ذَاكَ لَظَلِلْتَ آخِرَ يَوْمِكَ مُعَرِّسًا بِبَعْضِ أَزْوَاجِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَلْ أَنَا وَارَأْسَاهْ لَقَدْ هَمَمْتُ أَوْ أَرَدْتُ أَنْ أُرْسِلَ إِلَى أَبِي بَكْرٍ وَابْنِهِ، وَأَعْهَدَ أَنْ يَقُولَ الْقَائِلُونَ أَوْ يَتَمَنَّى الْمُتَمَنُّونَ، ثُمَّ قُلْتُ يَأْبَى اللَّهُ وَيَدْفَعُ الْمُؤْمِنُونَ، أَوْ يَدْفَعُ اللَّهُ وَيَأْبَى الْمُؤْمِنُونَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5666In-book reference : Book 75, Hadith 26USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 570   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5667,
    "id": 5667,
    "url": "https://sunnah.com/bukhari:5667",
    "bookNumber": 75,
    "hadithNumber": 27,
    "narrator": "Narrated Ibn Mas`ud:",
    "english": "I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high \nfever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double \nreward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other \ninconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"",
    "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا سُلَيْمَانُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَمَسِسْتُهُ فَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا‏.‏ قَالَ ‏\"‏ أَجَلْ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ قَالَ لَكَ أَجْرَانِ قَالَ ‏\"‏ نَعَمْ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مَرَضٌ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5667In-book reference : Book 75, Hadith 27USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 571   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5668,
    "id": 5668,
    "url": "https://sunnah.com/bukhari:5668",
    "bookNumber": 75,
    "hadithNumber": 28,
    "narrator": "Narrated Sa`d:",
    "english": "Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- \nWada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only \ndaughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He \nsaid, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better \nthan to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall \nget a reward for it, even for what you put in the mouth of your wife.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ جَاءَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي مِنْ وَجَعٍ اشْتَدَّ بِي زَمَنَ حَجَّةِ الْوَدَاعِ فَقُلْتُ بَلَغَ بِي مَا تَرَى وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ بِالشَّطْرِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَثِيرٌ، أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَلَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ عَلَيْهَا حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5668In-book reference : Book 75, Hadith 28USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 572   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5669,
    "id": 5669,
    "url": "https://sunnah.com/bukhari:5669",
    "bookNumber": 75,
    "hadithNumber": 29,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom \nwas `Umar bin Al-Khattab, the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you \nwill not go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of \nAllah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near \nso that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others \nsaid as `Umar said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go \naway!\" Narrated 'Ubaidullah: Ibn `Abbas used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) \nwas prevented from writing that statement for them because of their disagreement and noise.\"",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامٌ، عَنْ مَعْمَرٍ، وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ فَقَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، حَسْبُنَا كِتَابُ اللَّهِ فَاخْتَلَفَ أَهْلُ الْبَيْتِ فَاخْتَصَمُوا، مِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمُ النَّبِيُّ صلى الله عليه وسلم كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ، وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5669In-book reference : Book 75, Hadith 29USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 573   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5670,
    "id": 5670,
    "url": "https://sunnah.com/bukhari:5670",
    "bookNumber": 75,
    "hadithNumber": 30,
    "narrator": "Narrated As-Sa'ib:",
    "english": "My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) \ntouched my head with his hand and invoked Allah to bless me. He then performed ablution and I \ndrank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- \nNubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
    "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا حَاتِمٌ ـ هُوَ ابْنُ إِسْمَاعِيلَ ـ عَنِ الْجُعَيْدِ، قَالَ سَمِعْتُ السَّائِبَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ وَقُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5670In-book reference : Book 75, Hadith 30USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 574   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5671,
    "id": 5671,
    "url": "https://sunnah.com/bukhari:5671",
    "bookNumber": 75,
    "hadithNumber": 31,
    "narrator": "Narrated Anas bin Malik:",
    "english": "The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he \nhas to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let \nme die if death is better for me.' \"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ، فَإِنْ كَانَ لاَ بُدَّ فَاعِلاً فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5671In-book reference : Book 75, Hadith 31USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 575   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5672,
    "id": 5672,
    "url": "https://sunnah.com/bukhari:5672",
    "bookNumber": 75,
    "hadithNumber": 32,
    "narrator": "Narrated Qais bin Abi Hazim:",
    "english": "We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven \nplaces in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this \nworld) without having their rewards reduced through enjoying the pleasures of this life, but we have \ngot (so much) wealth that we find no way to spend It except on the construction of buildings Had the \nProphet not forbidden us to wish for death, I would have wished for it.' We visited him for the second \ntime while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he \nspends except for something that he spends on building.\"",
    "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ دَخَلْنَا عَلَى خَبَّابٍ نَعُودُهُ وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ فَقَالَ إِنَّ أَصْحَابَنَا الَّذِينَ سَلَفُوا مَضَوْا وَلَمْ تَنْقُصْهُمُ الدُّنْيَا وَإِنَّا أَصَبْنَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ وَلَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ، ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى وَهْوَ يَبْنِي حَائِطًا لَهُ فَقَالَ إِنَّ الْمُسْلِمَ لَيُوجَرُ فِي كُلِّ شَىْءٍ يُنْفِقُهُ إِلاَّ فِي شَىْءٍ يَجْعَلُهُ فِي هَذَا التُّرَابِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5672In-book reference : Book 75, Hadith 32USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 576   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5673,
    "id": 5673,
    "url": "https://sunnah.com/bukhari:5673",
    "bookNumber": 75,
    "hadithNumber": 33,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" \n(i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not \neven you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy \non me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none \nof you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an \nevil doer, he may repent to Allah.\"",
    "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَنْ يُدْخِلَ أَحَدًا عَمَلُهُ الْجَنَّةَ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِفَضْلٍ وَرَحْمَةٍ فَسَدِّدُوا وَقَارِبُوا وَلاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا، وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5673In-book reference : Book 75, Hadith 33USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 577   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5674,
    "id": 5674,
    "url": "https://sunnah.com/bukhari:5674",
    "bookNumber": 75,
    "hadithNumber": 34,
    "narrator": "Narrated `Aisha:",
    "english": "I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your \nMercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُسْتَنِدٌ إِلَىَّ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5674In-book reference : Book 75, Hadith 34USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 578   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5675,
    "id": 5675,
    "url": "https://sunnah.com/bukhari:5675",
    "bookNumber": 75,
    "hadithNumber": 35,
    "narrator": "Narrated `Aisha:",
    "english": "Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke \nAllah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who \ncures. There is no cure but Yours, a cure that leaves no disease.\"",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَتَى مَرِيضًا ـ أَوْ أُتِيَ بِهِ ـ قَالَ ‏\n\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، اشْفِ وَأَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏ قَالَ عَمْرُو بْنُ أَبِي قَيْسٍ وَإِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَأَبِي الضُّحَى إِذَا أُتِيَ بِالْمَرِيضِ، وَقَالَ جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى وَحْدَهُ، وَقَالَ إِذَا أَتَى مَرِيضًا‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5675In-book reference : Book 75, Hadith 35USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 579   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5676,
    "id": 5676,
    "url": "https://sunnah.com/bukhari:5676",
    "bookNumber": 75,
    "hadithNumber": 36,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me \n(or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or \nfather to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ فَتَوَضَّأَ فَصَبَّ عَلَىَّ أَوْ قَالَ صُبُّوا عَلَيْهِ فَعَقَلْتُ فَقُلْتُ لاَ يَرِثُنِي إِلاَّ كَلاَلَةٌ، فَكَيْفَ الْمِيرَاثُ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5676In-book reference : Book 75, Hadith 36USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 580   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5677,
    "id": 5677,
    "url": "https://sunnah.com/bukhari:5677",
    "bookNumber": 75,
    "hadithNumber": 37,
    "narrator": "Narrated `Aisha:",
    "english": "When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal had a fever. I entered upon them and \nsaid, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr got the fever he used \nto say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" \nAnd when fever deserted Bilal, he would recite (two poetic verses): \"Would that I could stay \novernight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling \ngrass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil \n(two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about \nthat. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it \nhealthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No \n558) .",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ وَهَلْ تَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5677In-book reference : Book 75, Hadith 37USC-MSA web (English) reference : Vol. 7, Book 70, Hadith 581   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5678,
    "id": 5678,
    "url": "https://sunnah.com/bukhari:5678",
    "bookNumber": 76,
    "hadithNumber": 1,
    "narrator": "Narrated Abu Huraira:",
    "english": "The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its \ntreatment.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5678In-book reference : Book 76, Hadith 1USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 582   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5679,
    "id": 5679,
    "url": "https://sunnah.com/bukhari:5679",
    "bookNumber": 76,
    "hadithNumber": 2,
    "narrator": "Narrated Rubai bint Mu`adh bin Afra:",
    "english": "We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, \nserve them and bring the dead and the wounded back to Medina.",
    "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدِ بْنِ ذَكْوَانَ، عَنْ رُبَيِّعَ بِنْتِ مُعَوِّذٍ ابْنِ عَفْرَاءَ، قَالَتْ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَسْقِي الْقَوْمَ، وَنَخْدُمُهُمْ، وَنَرُدُّ الْقَتْلَى وَالْجَرْحَى إِلَى الْمَدِينَةِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5679In-book reference : Book 76, Hadith 2USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 583   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5680,
    "id": 5680,
    "url": "https://sunnah.com/bukhari:5680",
    "bookNumber": 76,
    "hadithNumber": 3,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire \n(cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"",
    "arabic": "حَدَّثَنِي الْحُسَيْنُ، حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، حَدَّثَنَا سَالِمٌ الأَفْطَسُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏\n\"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْبَةِ عَسَلٍ، وَشَرْطَةِ مِحْجَمٍ، وَكَيَّةِ نَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏ رَفَعَ الْحَدِيثَ وَرَوَاهُ الْقُمِّيُّ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْعَسَلِ وَالْحَجْمِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5680In-book reference : Book 76, Hadith 3USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 584   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5681,
    "id": 5681,
    "url": "https://sunnah.com/bukhari:5681",
    "bookNumber": 76,
    "hadithNumber": 4,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding \nwith fire) but I forbid my followers to use cauterization (branding with fire).",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا سُرَيْجُ بْنُ يُونُسَ أَبُو الْحَارِثِ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، عَنْ سَالِمٍ الأَفْطَسِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ كَيَّةٍ بِنَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5681In-book reference : Book 76, Hadith 4USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 585   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5682,
    "id": 5682,
    "url": "https://sunnah.com/bukhari:5682",
    "bookNumber": 76,
    "hadithNumber": 5,
    "narrator": "Narrated `Aisha:",
    "english": "The Prophet (ﷺ) used to like sweet edible things and honey.",
    "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ الْحَلْوَاءُ وَالْعَسَلُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5682In-book reference : Book 76, Hadith 5USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 586   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5683,
    "id": 5683,
    "url": "https://sunnah.com/bukhari:5683",
    "bookNumber": 76,
    "hadithNumber": 6,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of \nhoney or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) \nbranded with fire.\"",
    "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ أَوْ يَكُونُ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ خَيْرٌ فَفِي شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ لَذْعَةٍ بِنَارٍ تُوَافِقُ الدَّاءَ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5683In-book reference : Book 76, Hadith 6USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 587   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5684,
    "id": 5684,
    "url": "https://sunnah.com/bukhari:5684",
    "bookNumber": 76,
    "hadithNumber": 7,
    "narrator": "Narrated Abu Sa`id Al-Khudri:",
    "english": "A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to \nhim \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him \ndrink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned \nagain and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's \n`Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.",
    "arabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَخِي يَشْتَكِي بَطْنَهُ‏.‏ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَى الثَّانِيَةَ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَاهُ فَقَالَ فَعَلْتُ‏.‏ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ، وَكَذَبَ بَطْنُ أَخِيكَ، اسْقِهِ عَسَلاً ‏\"‏‏.‏ فَسَقَاهُ فَبَرَأَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5684In-book reference : Book 76, Hadith 7USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 588   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5685,
    "id": 5685,
    "url": "https://sunnah.com/bukhari:5685",
    "bookNumber": 76,
    "hadithNumber": 8,
    "narrator": "Narrated Anas:",
    "english": "Some people were sick and they said, \"O Allah's Messenger (ﷺ)! Give us shelter and food. So when they \nbecame healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra \nwith some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they \nkilled the shepherd of the Prophet (ﷺ) and drove away his camels. The Prophet (ﷺ) sent some people in their \npursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I \nsaw one of them licking the earth with his tongue till he died.",
    "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَلاَّمُ بْنُ مِسْكِينٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، كَانَ بِهِمْ سَقَمٌ قَالُوا يَا رَسُولَ اللَّهِ آوِنَا وَأَطْعِمْنَا فَلَمَّا صَحُّوا قَالُوا إِنَّ الْمَدِينَةَ وَخِمَةٌ‏.‏ فَأَنْزَلَهُمُ الْحَرَّةَ فِي ذَوْدٍ لَهُ فَقَالَ ‏\n\"‏ اشْرَبُوا أَلْبَانَهَا ‏\"‏‏.‏ فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم وَاسْتَاقُوا ذَوْدَهُ، فَبَعَثَ فِي آثَارِهِمْ، فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ، فَرَأَيْتُ الرَّجُلَ مِنْهُمْ يَكْدُمُ الأَرْضَ بِلِسَانِهِ حَتَّى يَمُوتَ‏.‏ قَالَ سَلاَّمٌ فَبَلَغَنِي أَنَّ الْحَجَّاجَ قَالَ لأَنَسٍ حَدِّثْنِي بِأَشَدِّ عُقُوبَةٍ عَاقَبَهُ النَّبِيُّ صلى الله عليه وسلم فَحَدَّثَهُ بِهَذَا‏.‏ فَبَلَغَ الْحَسَنَ فَقَالَ وَدِدْتُ أَنَّهُ لَمْ يُحَدِّثْهُ‏ بِهَذَا",
    "reference": "Reference : Sahih al-Bukhari 5685In-book reference : Book 76, Hadith 8USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 589   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5686,
    "id": 5686,
    "url": "https://sunnah.com/bukhari:5686",
    "bookNumber": 76,
    "hadithNumber": 9,
    "narrator": "Narrated Anas:",
    "english": "The climate of Medina did not suit some people, so the Prophet (ﷺ) ordered them to follow his shepherd, \ni.e. his camels, and drink their milk and urine (as a medicine). So they followed the shepherd that is \nthe camels and drank their milk and urine till their bodies became healthy. Then they killed the \nshepherd and drove away the camels. When the news reached the Prophet (ﷺ) he sent some people in their \npursuit. When they were brought, he cut their hands and feet and their eyes were branded with heated \npieces of iron.",
    "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ نَاسًا، اجْتَوَوْا فِي الْمَدِينَةِ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْحَقُوا بِرَاعِيهِ ـ يَعْنِي الإِبِلَ ـ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَلَحِقُوا بِرَاعِيهِ فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، حَتَّى صَلَحَتْ أَبْدَانُهُمْ فَقَتَلُوا الرَّاعِيَ وَسَاقُوا الإِبِلَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ فِي طَلَبِهِمْ، فَجِيءَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ‏.‏ قَالَ قَتَادَةُ فَحَدَّثَنِي مُحَمَّدُ بْنُ سِيرِينَ أَنَّ ذَلِكَ كَانَ قَبْلَ أَنْ تَنْزِلَ الْحُدُودُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5686In-book reference : Book 76, Hadith 9USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 590   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5687,
    "id": 5687,
    "url": "https://sunnah.com/bukhari:5687",
    "bookNumber": 76,
    "hadithNumber": 10,
    "narrator": "Narrated Khalid bin Sa`d:",
    "english": "We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived \nat Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black \ncumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting \nmixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet (ﷺ) saying, 'This black \ncumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"",
    "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، قَالَ خَرَجْنَا وَمَعَنَا غَالِبُ بْنُ أَبْجَرَ فَمَرِضَ فِي الطَّرِيقِ، فَقَدِمْنَا الْمَدِينَةَ وَهْوَ مَرِيضٌ، فَعَادَهُ ابْنُ أَبِي عَتِيقٍ فَقَالَ لَنَا عَلَيْكُمْ بِهَذِهِ الْحُبَيْبَةِ السَّوْدَاءِ، فَخُذُوا مِنْهَا خَمْسًا أَوْ سَبْعًا فَاسْحَقُوهَا، ثُمَّ اقْطُرُوهَا فِي أَنْفِهِ بِقَطَرَاتِ زَيْتٍ فِي هَذَا الْجَانِبِ وَفِي هَذَا الْجَانِبِ، فَإِنَّ عَائِشَةَ حَدَّثَتْنِي أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ هَذِهِ الْحَبَّةَ السَّوْدَاءَ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ مِنَ السَّامِ ‏\"‏‏.‏ قُلْتُ وَمَا السَّامُ قَالَ الْمَوْتُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5687In-book reference : Book 76, Hadith 10USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 591   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5688,
    "id": 5688,
    "url": "https://sunnah.com/bukhari:5688",
    "bookNumber": 76,
    "hadithNumber": 11,
    "narrator": "Narrated Abu Huraira:",
    "english": "I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\"",
    "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ وَالسَّامُ الْمَوْتُ، وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5688In-book reference : Book 76, Hadith 11USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 592   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5689,
    "id": 5689,
    "url": "https://sunnah.com/bukhari:5689",
    "bookNumber": 76,
    "hadithNumber": 12,
    "narrator": "Narrated 'Urwa:",
    "english": "Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. \nShe used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and \nmakes it active and relieves some of his sorrow and grief.'\"",
    "arabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تَأْمُرُ بِالتَّلْبِينِ لِلْمَرِيضِ وَلِلْمَحْزُونِ عَلَى الْهَالِكِ، وَكَانَتْ تَقُولُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ التَّلْبِينَةَ تُجِمُّ فُؤَادَ الْمَرِيضِ، وَتَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5689In-book reference : Book 76, Hadith 12USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 593   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5690,
    "id": 5690,
    "url": "https://sunnah.com/bukhari:5690",
    "bookNumber": 76,
    "hadithNumber": 13,
    "narrator": "Narrated Hisham's father:",
    "english": "`Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is \nbeneficial.''",
    "arabic": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَأْمُرُ بِالتَّلْبِينَةِ وَتَقُولُ هُوَ الْبَغِيضُ النَّافِعُ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5690In-book reference : Book 76, Hadith 13USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 594   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5691,
    "id": 5691,
    "url": "https://sunnah.com/bukhari:5691",
    "bookNumber": 76,
    "hadithNumber": 14,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was cupped and he paid the wages to the one who had cupped him and then took Su'ut \n(Medicine sniffed by nose).",
    "arabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5691In-book reference : Book 76, Hadith 14USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 595   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5692,
    "id": 5692,
    "url": "https://sunnah.com/bukhari:5692",
    "bookNumber": 76,
    "hadithNumber": 15,
    "narrator": "Narrated Um Qais bint Mihsan:",
    "english": "I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ‏.‏ يُسْتَعَطُ بِهِ مِنَ الْعُذْرَةِ، وَيُلَدُّ بِهِ مِنْ ذَاتِ الْجَنْبِ ‏\"‏‏.‏   وَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِابْنٍ لِي لَمْ يَأْكُلِ الطَّعَامَ فَبَالَ عَلَيْهِ، فَدَعَا بِمَاءٍ فَرَشَّ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5692, 5693In-book reference : Book 76, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5693,
    "id": 5693,
    "url": "https://sunnah.com/bukhari:5693",
    "bookNumber": 76,
    "hadithNumber": 15,
    "narrator": "Narrated Um Qais bint Mihsan:",
    "english": "I heard the Prophet (ﷺ) saying, \"Treat with the Indian incense, for it has healing for seven diseases; it is to \nbe sniffed by one having throat trouble, and to be put into one side of the mouth of one suffering from \npleurisy.\" Once I went to Allah's Messenger (ﷺ) with a son of mine who would not eat any food, and the boy \npassed urine on him whereupon he asked for some water and sprinkled it over the place of urine.",
    "arabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ‏.‏ يُسْتَعَطُ بِهِ مِنَ الْعُذْرَةِ، وَيُلَدُّ بِهِ مِنْ ذَاتِ الْجَنْبِ ‏\"‏‏.‏   وَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِابْنٍ لِي لَمْ يَأْكُلِ الطَّعَامَ فَبَالَ عَلَيْهِ، فَدَعَا بِمَاءٍ فَرَشَّ عَلَيْهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5692, 5693In-book reference : Book 76, Hadith 15USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 596   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5694,
    "id": 5694,
    "url": "https://sunnah.com/bukhari:5694",
    "bookNumber": 76,
    "hadithNumber": 16,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was cupped while he was fasting.",
    "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ صَائِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5694In-book reference : Book 76, Hadith 16USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 597   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5695,
    "id": 5695,
    "url": "https://sunnah.com/bukhari:5695",
    "bookNumber": 76,
    "hadithNumber": 17,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was cupped while he was in a state of Ihram.",
    "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، وَعَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5695In-book reference : Book 76, Hadith 17USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 598   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5696,
    "id": 5696,
    "url": "https://sunnah.com/bukhari:5696",
    "bookNumber": 76,
    "hadithNumber": 18,
    "narrator": "Narrated Anas:",
    "english": "that he was asked about the wages of the one who cups others. He said, 'Allah's Messenger (ﷺ) was cupped \nby `Abd Taiba, to whom he gave two Sa of food and interceded for him with his masters who \nconsequently reduced what they used to charge him daily. Then the Prophet (ﷺ) s said, \"The best \nmedicines you may treat yourselves with are cupping and sea incense.' He added, \"You should not \ntorture your children by treating tonsillitis by pressing the tonsils or the palate with the finger, but use \nincense.\"",
    "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّهُ سُئِلَ عَنْ أَجْرِ الْحَجَّامِ، فَقَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ، وَأَعْطَاهُ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفُوا عَنْهُ، وَقَالَ ‏\"‏ إِنَّ أَمْثَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ وَالْقُسْطُ الْبَحْرِيُّ ‏\"‏‏.‏ وَقَالَ ‏\"‏ لاَ تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ مِنَ الْعُذْرَةِ، وَعَلَيْكُمْ بِالْقُسْطِ ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5696In-book reference : Book 76, Hadith 18USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 599   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5697,
    "id": 5697,
    "url": "https://sunnah.com/bukhari:5697",
    "bookNumber": 76,
    "hadithNumber": 19,
    "narrator": "Narrated Jabir bin `Abdullah:",
    "english": "that he paid Al-Muqanna a visit during his illness and said, \"I will not leave till he gets cupped, for I \nheard Allah's Messenger (ﷺ) saying, \"There is healing in cupping.\"",
    "arabic": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، وَغَيْرُهُ، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ عَادَ الْمُقَنَّعَ ثُمَّ قَالَ لاَ أَبْرَحُ حَتَّى تَحْتَجِمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ فِيهِ شِفَاءً ‏\"‏‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5697In-book reference : Book 76, Hadith 19USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 600   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5698,
    "id": 5698,
    "url": "https://sunnah.com/bukhari:5698",
    "bookNumber": 76,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah bin Buhaina:",
    "english": "Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَلْقَمَةَ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ بِلَحْىِ جَمَلٍ مِنْ طَرِيقِ مَكَّةَ، وَهْوَ مُحْرِمٌ، فِي وَسَطِ رَأْسِهِ‏.‏   وَقَالَ الأَنْصَارِيُّ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ فِي رَأْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5698, 5699In-book reference : Book 76, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 601   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5699,
    "id": 5699,
    "url": "https://sunnah.com/bukhari:5699",
    "bookNumber": 76,
    "hadithNumber": 20,
    "narrator": "Narrated `Abdullah bin Buhaina:",
    "english": "Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.",
    "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَلْقَمَةَ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ بِلَحْىِ جَمَلٍ مِنْ طَرِيقِ مَكَّةَ، وَهْوَ مُحْرِمٌ، فِي وَسَطِ رَأْسِهِ‏.‏   وَقَالَ الأَنْصَارِيُّ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ فِي رَأْسِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5698, 5699In-book reference : Book 76, Hadith 20USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 601   (deprecated numbering scheme)"
  },
  {
    "hadithGlobalNumber": 5700,
    "id": 5700,
    "url": "https://sunnah.com/bukhari:5700",
    "bookNumber": 76,
    "hadithNumber": 21,
    "narrator": "Narrated Ibn `Abbas:",
    "english": "The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .",
    "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم فِي رَأْسِهِ وَهْوَ مُحْرِمٌ مِنْ وَجَعٍ كَانَ بِهِ بِمَاءٍ يُقَالُ لَهُ لَحْىُ جَمَلٍ‏.‏   وَقَالَ مُحَمَّدُ بْنُ سَوَاءٍ أَخْبَرَنَا هِشَامٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهْوَ مُحْرِمٌ فِي رَأْسِهِ مِنْ شَقِيقَةٍ كَانَتْ بِهِ‏.‏",
    "reference": "Reference : Sahih al-Bukhari 5700, 5701In-book reference : Book 76, Hadith 21USC-MSA web (English) reference : Vol. 7, Book 71, Hadith 602   (deprecated numbering scheme)"
  }
]